{"tweets": "@ButteSheriff hi! any pupdates on trooper? @andrea1079 @TakuroSpirit @asdfghjill no no this is twitter @papscun 😍😍😍 @TakuroSpirit @asdfghjill i’m sorry but “dogs can’t stick their heads out car windows anymore” would actually be the cherry on top of 2020 RT @mazikcen: the way i thought this was winnie the pooh @prashamparikh @asdfghjill same 😔 @RissRiss24 @asdfghjill it hit him at 40mph it’s already in his tummy This is Beau. A bug just flew in his mouth. Not gonna let it ruin his car ride though. 12/10 objects in mirror are even cuter than they appear https://t.co/c8VWfBTSOw @TheGoldenRatio4 we only rate dogs @c_aromano rest easy friend ❤️ @JessMcFall ❤️ @cgdisney3 congrats and thank you ❤️ @asianagrande1 he’s still so happy and strong and i love him https://t.co/TzxtmU5BdI This is Jindol. He was found abandoned in the street with his back paws cut off. He’s been rescued, but still in need of medical care. Every day without prosthetics is a battle against sores and infection. You can help Jindol get new feet below. 13/10\n\nhttps://t.co/fEJ5DnsSZF https://t.co/HQSosolXSL @I_Miss_Obama @sxrreaI you promise? This is Apollo. He was wondering if this selfie makes his nose look big. 13/10 https://t.co/Ok5T0fqh1W @Ninja tell Cloud we said hi RT @dog_feelings: the human wiped away my eye booger. only to pet it back onto me. i have never experienced such betrayal @JebediahJSilva lol etsy doesn’t care about trademarks @BrandaceJordan omg hi colt @BrandaceJordan same he’s just so 🥺 This is Darren. He’s snuggly and he knows it. Would appreciate a bedtime story if that’s not too much trouble. 14/10 (IG: the_blueboys) https://t.co/riMvzVIDpz @xoxandiiii i’m sorry! they’ll be back better than ever in 2 weeks! @scribler feel free to cancel and wait! sales@weratedogs.com 🤗 @evoli omg Thank you for all the support and feedback with these! We just sold out but they’ll be back soon in more sizes 🤗 https://t.co/A5BrXOW9Us @bubblesutonium yep! @Wilm_ these were big on us so i’m sure you’ll be fine 🤗 @mladan yep! @AndreaG_23_ if there’s enough demand we may offer it. here’s my buddy Myles (who has a slightly bigger face) wearing it for comparison https://t.co/dxY06ErI9C @rileymorswoman they're pretty standard we have small faces @AIng841 thank you 😌 We finally did it. We made the mask.\n\nAvailable now. Limited Quantities.\nhttps://t.co/543VwOdCdM https://t.co/3LVBgL9MVp @_RenitaDsouza this is beautiful @sevenseasofshy @honeydewthedach margaret i will deactivate our account You’re joking. We only rate dogs. We do not rate koalas. I don’t know why it is so hard to understand. Dogs only please. Thank you... 12/10 https://t.co/AXYlk6CfYK RT @tay03100: Took these pictures after picking him up from a spa day and this fool sitting there w a big smile and winked at me 😂😂😂 https:… This is Boomer. He was attacked by some bubbles today. They got him right on the noggin. I’m told he has no plans to retaliate. 13/10 #SeniorPupSaturday https://t.co/lkbvexSNmE @Stringbean1994 ❤️ @warriormari hi zoey 🥺 @Laura_Columbia 🥺❤️ @aksh_lcfc elite comment right here This is Pistol. He was just diagnosed with bone cancer in his front right leg. He’s in a lot of pain and amputation gives him the best chance to beat it. He’s a lovable mush who just wants to sit in your lap, and you can help save him below. 13/10\n\nhttps://t.co/0yTu3kWOlq https://t.co/wJ4YItDRl7 @tlp1981 @thetwoagoutis 😳 This is Archie and his bodyguards, Everest and Olympus. They make sure nobody pets Archie without permission. 14/10 for all https://t.co/7lcEHeaJtE @maevegibs @esteinberg24 oh it's a classic. always impresses This is Watson. At first we thought he was just a chonky bumblebee, but turns out he’s been incorgnito the whole time. 14/10 https://t.co/OflTorp9Uw @scump tough one @ZackRock @eddiechihuahuaa dying at this @finch960 she's not available then but could you push to 4:30? This is Maggie. You said you could play as soon as you finish work, so she’s helping. 14/10 you’re welcome human https://t.co/Yx7VR8Zd3G @HappieSun @RealElzi 😳 finley @darth @RealElzi HER NAME IS NEMO @dev_dull @RealElzi oh no This is Yoroko. She’s a rainbowbender.  Borks to activate one and then steers it with her tongue. 14/10 magical as h*ck https://t.co/2D5mvECePe @GMA let me know when you want my full list of the top 112,000 dogs to follow @crumbsandcorks ₍. ̯ .₎ @seanmiller358 it’s true @annsteinerphoto ❤️❤️❤️ @KarenDoyleScit @annsteinerphoto omg @sevenseasofshy @annsteinerphoto your phone is supposed to be on airplane mode margaret how are you replying This is Ollie. He is puppared for takeoff. Asks that you fasten your seatbelt and place your table tray in its pupright position. 13/10 thank you for flying Ollie Airlines https://t.co/WANjUoRs8k @Huntsmen @scump @FormaL @Arcitys @DylanEnvoy @Prestinni @Sender_FN @JordonGeneral @x2Pac_ThuGLorD @BoZe @Gunless 💚💚💚 @SeaOfThieves oh let’s h*ckin gooooooo @ally_mander that is so awesome Islay thank you for sharing 🥺 This is Swag. He was diagnosed with bladder cancer back in July. He suffered severe side effects from the chemo and was in ICU on oxygen for nearly a week. Against all odds he recently began improving. You can help Swag continue to get better below. 13/10\n\nhttps://t.co/wvItuzDoYr https://t.co/f00Kk2BKod @SpencerWheelock now wait a minute @pnwrunnerlass she says thanks https://t.co/6kpBgZwEGP @DiehardDolphan @koolaid please This is Ruthie. She’s still figuring out doors. This is her solution for now. 12/10 very powerful we respect it https://t.co/Qqa0kSH9lL @Nehv_ omg @talaugoon he rolls like BB-8 @chocolate_cait exactly @dullsalmon @cptramenqueen yea he rolls around like BB-8 @miclcm73 @cptramenqueen haha nice This is Obi. His mother was a corgi but his father was a soccer ball. Very rare mix. 14/10 would definitely still pet https://t.co/uwEs0UDgm0 @SamJamesMorgan @vestager idk i’d say 13/10 @grumpykerbear good luck and try to stay safe ❤️ @agoldennamedkev how did i miss this kevin you look great @SparkyBlitz the dogs are too pawerful @LynneKelly *checks notes* uhh yes looks like it @AlisonSelje official reply count is around 73,000, but if we consider multiple dogs per reply and replies to those replies, i like to think we did it ☺️ Thank you to everyone who participated in this today. I hope it provided a tiny break from the world. If you haven’t yet, go reply with your dog. We’ll be looking through them for a very, very long time https://t.co/GLVscPivQc @SchittsCreek @DustinWMilligan OMG I MISSED THIS EARLIER @AwkwardPanda25 wow wow wow @exploreorg ummm YES @UTKnoxville welcome Smokey @followdaround noted gibson happy we can rely on you @theofficetv https://t.co/q1RcaSdHss @LuminousLitwick yes hello that was us @Quickshot bork in space 😳 @AnneWheaton hi marlowe very fancy paw placement @infiniteobjects @jmsaavedra i am on my way astrid you stay right there @MologneShari is she willing to trade lives with me? @beamiller wow nice to meet you two 🤗 @netflixfamily blessed with his presence @mattsimantov BRISKET OMG @Whataburger more like Whatagooddog (i’m sorry) @PupperNelson omfg @warriors @KlayThompson can he dunk on me @NXOnNetflix @Stranger_Things @strangerwriters not gonna lie Netflix i am a little skeptical @CapsPup CAPTAINNN @CMAquarium @agoldennamedkev ...omg @Hernandez_Nickk that’s a great scarf nikka @reddit thank you for sharing reddit it means a lot @IvePetThatDog HI GIDEON HI COOKIE @SimoneGiertz Scraps i’m gonna be honest you did this to yourself @coconutricebear we’ll allow it @TheGoldenRatio4 oh strap in everybody @abelanger41 same annie, same @finch960 ❤️❤️❤️ @itsdougthepug WELCOME TO THE PARTY DOUG 🥳 @miclcm73 hehe whoops @sarahbeckr no no this is fine we accept @betsy_klein to be fair it is very confusing @blickjohn NOT TOO MUCH TROUBLE AT ALL ZIGGY @LynneKelly COUSIN JELLYBEAN OMG To celebrate #InternationalDogDay, we want to make a thread of 100,000 dogs. We have all trained for this. Please reply with your dog pics ❤️ @sarahcpr hi stella @atlasobscura elite opening line https://t.co/unCiyzcilY @Lushovah lmao @tha_linds too real This is Ziggy. He’s practicing saying hi to the other dogs in the neighborhood. Just moved here and would love to make a good first impression. 14/10 https://t.co/C2ZGWM3It9 @lachance_lucas 🥺❤️ @thedextrosity @graciehobson_ that's a very real possibility This is Cowboy and his little brother Buck. Buck’s gotten bigger over the last four months but only Cowboy has seemed to notice. 13/10 for both https://t.co/QeeQO7Q87q @Scott_Novak @sora_lyee lmao @sora_lyee exactly This is Kerith. She’s a fire department therapy dog. With more than two dozen major fires burning in California, she’s unfortunately been very busy. She meets her firefighters at the staging area and gives each of them a hug before they head out. 14/10 for everybody https://t.co/iaPgDE0Evc @alevine014 EXACTLY ALAN @alevine014 omg no worries alan! that is barney’s rating. he received 13 points out of a possible 10 points @suitablegirl @JU8JU8 JUB JUB 🥺 This is Barney. He was once a bouncy energetic adventure dog, and then he slipped a disc in his spine. He’s currently taking meds to control the pain, but will need surgery to regain full mobility. You can help Barney go on more adventures below. 13/10\n\nhttps://t.co/0FV0IkBPY7 https://t.co/tfQJQSoP6J @darth I CAN BARELY CONTROL THE INFLATION ON THIS ACCOUNT DARTH @IvePetThatDog i’ve pet that hippo 😳 @metrichead of course yes We only rate dogs. Unfortunately this is a tiny house hippo. Please send dogs. Thank you... 13/10 https://t.co/CpuKqdnHxi @loreana_g ❤️❤️❤️ @_gaby292 i’m so sorry ❤️ @meh__gen @sophiamp13 OMFG SHELDON This is Hildy. She had a lovely day by the pool. Her doggles were a little big but they matched her suit so it’s fine. 12/10 https://t.co/aFLbK4uc7v @DumbMysty do it i dare you @LilianMaxfield lolll @amrith 🥰 @nirushika @infiniteobjects good catch lol @TheBrazenYouth @infiniteobjects ❤️🌳🌧 @_brii95 *bows* @Darrelthedoge @tonyhawk you’re a legend darrel @maqmutua29 right??? @infiniteobjects oh you guys don’t know what you’re in for @gonzabamelon @infiniteobjects EVEN THAT BABY PEGGY VIDEO @KMKTweetsNow @infiniteobjects that’s our friends! @TheBrazenYouth This is @infiniteobjects. They can take any video and print it, including all those dog videos trapped in your camera roll. Use code “15/10” for 10% off through the link below #ad\n\nhttps://t.co/btz3QzaYhF https://t.co/B3fp4y0YHt @TheGoldenRatio4 rest in paradise swiz 💛 @dog_fakes i agree he sits all silly @steak_umm @mangelesrichesx @oneunderscore__ @BrandyZadrozny *nods* @CuratedbyPamela pamela i’m gonna be honest idk what you’re talking about @AnthonyNelson25 she said 😤 @Rada_Radda the best 🥺 RT @Rada_Radda: The lil exhale at the end&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt; 🥺🥺🥺🥺🥺🥺🥺🥺🥺🥺🥺🥺🥺🥺🥺🥺🥺 This is Mira. That’s her workout for the year. Happy you recorded it so she can improve her form next time. 14/10 https://t.co/5v4ajp42mC @SarahThoughts @shandanley amazing! we’ll send him a message ¨̮ @crackedscience i am so sorry @SarahThoughts hellooo! what’s the name of your sofa digging daschund baby? @maryann_jamison yes i doubled checked also there’s 3 OF THEM\nhttps://t.co/COv07Makcu https://t.co/uetKKx6YoQ This is Björn. He behaved during his photoshoot so he got to eat a sunflower. That was the deal. 13/10 good boy Björn https://t.co/C0oh1Zzeen @darth DARTH LOOK AT THESE\nhttps://t.co/Gh1AS0vhDx https://t.co/VBNBbScoSc @VolledigG i don’t think so This is Kokoro. She thought she was the roundest pup in all the land until she met this other dog today. Shocked and confused. Still 14/10 https://t.co/r9eGRsWh8x @keatxngrant @darth ugh thank you @keatxngrant @darth WHAT WHO ARE THEY I NEED MORE @PGATOUR big fan of everything going on here @montclairlocal hello! are there any more pics of brady? asking for a friend ☺️ @aimdogg thank you @xbackstagetweet he's a mix i believe. they rescued him a few months ago @abbierenn @dog_feelings thank you george This is Buddy. He has a deformity of the growth plate in both his wrists, making his legs bow and causing pain whenever he tries to play. He’s already had one surgery, but needs your help below to get the other. 13/10 would sign his tractor cast\n\nhttps://t.co/32kxk2wfdd https://t.co/yKyMNMxUvo @gonzabamelon looks like they have that one handled This is Marla. She lives on an island. Seems to be aware her life is superior to yours, but is kind enough not to mention it. 13/10 https://t.co/w333BiOyR3 @gayandmediocre this might be the best thing i’ve ever seen @melpat24 same @BigSnugALot ugh love that post @thereal_jassel i was really hoping this would turn into a thread of swinging dogs and it has not disappointed This is Chelsea. She passed the playground on her walk today and couldn’t help herself. 13/10 would push https://t.co/DCeGusJoFX @bummedartist i’ll see what i can do @theatregirl1994 DM is preferred lol @alexxxxclifton @dogfather best boy ❤️ RT @alexxxxclifton: Kodak is very excited to have his moment today🤩🥺 https://t.co/1ioiIk1DxO RT @dog_feelings: i made you a calendar for next year. it has one new thought every day. because that is all i’m capable of at the moment.… @MarkAtkins mark we can look into it @jens2763 neither do i jen neither do i This is Harris. His human was given an old baby swing, but he’s the only baby here. 14/10 wouldn’t want it to go to waste https://t.co/gDeRTnWvAt @kayleidoscope incredible @kayleidoscope ...no way @kathyjames89 🥰 @JMartinezNYC @THECITYNY omg @chuckmcatee you can never be too careful, chuck. we had to confirm our professional research team has uncovered media that further indicates he DID in fact enjoy the puppuccino https://t.co/zyh4QtrDzo @pimentosncoke i think he's interested in this offer @PAVGOD @SarahGareau1 @bunsenbernerbmd i was very confused at first but there’s like 50 bunsen berners on IG @Angel_DeIight @SarahGareau1 i think across all establishments they’re just whipped cream @MarcelNasal @SarahGareau1 @bunsenbernerbmd has inspired so many This is Bunsen. He just had his first puppuccino. I think he liked it not sure though. 12/10 https://t.co/F1Kz13Ow98 @portugi_bruja he doesn’t need to be this powerful but he is and i respect it @nchan give me 9 months @aleknotalec omg 🥺 @Hychus232 happens to the best of us stanley This is Nala. Last week she suffered Mesenteric Torsion, which means her stomach muscles twisted inside out. Most dogs don’t survive the surgery to correct it, but Nala fought through. She’s still recovering, and you can help her get better below. 13/10\n\nhttps://t.co/Z4PTuGZ82l https://t.co/GWIHpRa59l @infiniteobjects @IAMLILBUB LIL BUBS BIG FUND 🥺 @Tgrau620 @kaitieozzy we also considered this 14/10 https://t.co/z5qXmNh9Cl RT @dog_feelings: i made a list. of all the things i do. when you’re not home\n\n1. wait for you to get back @rileyyjenks nothing wrong with this This is Murphy. He worked really hard to get that dirty and you’re just going to wash it off? Rude as h*ck tbh. 13/10 https://t.co/6FW1burVWN @UToledo good ones @Ubisoft omfg @itsdougthepug CONGRATS DOUG This is Macy. She’s teething and was wondering if, once she’s done with the table, she could nibble you for a bit. 12/10 would allow it https://t.co/dU4PbvY7RO @jfkantrowitz katie deserves it for sure @AnthonyShackels hi nachos @Rosie3593 🤣 @sydney_sweeney not enough people talking about how good Tank is being @PickledPlatypuz lolll This is Piper. She was having a lovely day playing in the pool until it all went horribly, horribly wrong. Still 13/10 https://t.co/izRaoLOnLq @SNFonNBC @Patriots @NFL same This is Moby. As a puppy, he was diagnosed with cerebellar hypoplasia, which just means he wobbles. But recently he’s been declining, indicating this diagnosis was wrong. You can help Moby get his new testing and the care he needs by clicking below. 14/10\n\nhttps://t.co/8j1SU4ORyd https://t.co/BQb49ULyPc @websparx i hope it’s the best day @websparx HAPPY BIRTHDAY SUGAR ❤️ @BoundingWthBeth @dogfather ❤️ @Indians you just haven’t decoded it yet @notetosarah facts This is Buddy. He found a phone in the park and decided to leave a selfie on it. 12/10 https://t.co/PgWejKeghu @journeysa @AndrewsMcMeel a power move indeed @FOXSportsSouth @FOXSportsBraves @ozzie incredible @GraceGriffaton @dog_feelings Roan you will be better in no time my friend ❤️ @Twitter how much for a custom dog like @IvePetThatDog of course gideon ❤️ @OatieMeal ahaha sneaky screenshot @TheGoldenRatio4 💛 @SheRatesDogs @AndrewsMcMeel i'd tell you to also make a calendar but i'd just get angry at it every day @amanda_beatrizj we agree 😌 @Shut_up_jasmine @AndrewsMcMeel ❤️❤️ @journeysa @AndrewsMcMeel last year the popular choice was WRD for work and ToD for home @NerdPyle already posted ned c'mon Our 2021 calendars are here! We went ahead and made them just in case 2020 ever ends. Available below ❤️\n\nhttps://t.co/0CEH3hzEzJ https://t.co/FZ61z3XcUO @tylerthomsen96 same @captainvirtue it’s just so 🥺🥺🥺 This is Blue. She likes to sleep on the couch and every night she politely requests to be tucked in. 14/10 sweet dreams cutie https://t.co/iopSdzm1tT @lebacylrac oh no! @TylerGiek “i see you’ve been eating 3 meals a day, while i, a growing puppo, only get 2” This is Baloo. He is very serious. Not sure why you’re laughing. His seriousness is not a laughing matter. 14/10 https://t.co/9PJItT9KEO @AJBalite @NickyRouleau they are that’s his new little sister This is Chase and his new little sister, Skittles. He was skeptical at first but then she started flying and that’s a nice change of pace for him. Both 13/10 https://t.co/gI2cyv5iwy @salemredsox oh very good yes @SchultzFDN @gberns @CarolinaPyrs @nationalpyr @kilmeade @GPRAtlanta GOOD JOB LUCY @Braves i have many ideas braves you let me know when we’re doing this @Braves maybe every third pitch is a tennis ball braves just think about it @Braves braves just hear me out... let real dogs sit in the stands... and don’t supervise them @Braves 😦 @mcgoddess2 yes everyone please meet me at 1234 Weiner Dog Central to pet Moose @InquiShado YOU CAN CARPOOL WITH HIM NO WORRIES This is Moose. He turned 16 this week so he got his driver’s license. Had a little trouble parallel barking but passed the test regardless. 14/10 #SeniorPupSaturday https://t.co/YWMPrkeYgu @PBSNature YES @MLBONFOX @Mets oh this is marvelous @Rockies oh h*ck yes @jhfc_ charlotte 🥺 @bellewitch66 yep! already fully funded ❤️ @thesupremetroll ❤️❤️❤️ @josefghosn i agree strongly This is Pepper. Last week she was diagnosed with lymphoma. If left untreated she only has a couple months. It hasn’t spread to her organs yet, making successful chemo a real possibility. She is ready to beat this and you can help her do it below. 13/10\n\nhttps://t.co/48iqw5AmCd https://t.co/2uvWdXVgEB RT @fifsof: marcelo quiere presumir su pulserita nueva https://t.co/18hmfBSxUU @SUEtheTrex i can see how this is conflicting for you @OhNoahBeats lmao @cstampeen carolyn i appreciate that. i'm doing okay and i hope you are too @captainvirtue @NASA sorry i forgot to tag you @NASA can you put your best people on this thank you We only rate dogs. This is a meteorite that has fallen from a clearly superior part of the galaxy. Please only send dogs. Thank you... 14/10 https://t.co/vSNrzKRwDT @CapsPup ugh best boi miss u buddy RT @dog_feelings: in case you forgot. i love you @GatorsDaily one day https://t.co/5Wis0RIIMG @jakeman517 @liza_harris_ nice sticker teddy ☺️ @lambilyxangel @liza_harris_ he does! This is Frisco. He’s the valet. If you wouldn’t mind putting it in bark and leaving the keys inside he’ll take care of everything. 13/10 would tip well https://t.co/u5pPoCqzdi @OMGitsAliA @progducto omg it’s ali-a @MorrahaDesigns happy birth ¨̮ @clarejc fact check: true @captainvirtue lol i guess so! @dpe28 wait really??? @Clap_box oh he does This is Milo. He’s the butterfly king. Has ruled benevolently in this garden for many years. 14/10 (IG: milo_the_toller) https://t.co/wM8v5YcIsW @BatdogRookie love u rookie @TrentonThunder @BatdogRookie 14 😌 @Itzalizabeth soon soon @hotgrlmeg ❤️❤️❤️ @lavishandsadish i’m so sorry Leah ❤️ @lgrault same @azulonn @jasemonkey done ❤️ the way she starts hopping around wow i can’t handle it 🥺 14/10 https://t.co/3dZwk5HIyH @Dolby @MichelleHardee we are so down. email in bio 🤝 @braveryhs_lt so sorry ❤️ Arnold appreciates it This is Arnold. He was born with PRAA, a disease originating from his heart, causing compression of his esophagus. His growth has been stunted because he can’t keep food down. He’ll need surgery to correct it and you can help him get it below. 13/10\n\nhttps://t.co/cmCheLoZih https://t.co/KUatNoiUsN @Dolby @MichelleHardee dolby we will make you the best commercial ever @yungblud top notch content @kpow508 VERY DARK GREY @bradswalker lmao @aksh_lcfc nice This is Hazel. She sneezed and her ears went inside out. 12/10 requesting immediate assistance https://t.co/P664l4FCXo @EstherThePig as he should be 😌 This is Jack and Stella. They’re working on their duo snoozle. Jack thinks it’s pretty comfy but Stella would probably disagree. 13/10 for both https://t.co/bzWVnUtAcr @amalsethi @decustecu 🥺❤️ @jessamack_ anytime 🤗 @s_campbell7817 oh this is genius @snards33 @tannnerbarton BRODY NOOOOO @HamiltonMusical omg hi i can confirm that rating and also do you like my hat https://t.co/XsufGRP0Kb This is Finn. He tried to kiss a bee today. Knew it was a little early in the relationship but took a chance anyway. 12/10 gonna take a while to rebuild his confidence https://t.co/rBVkOV9UGu @tim4hire wowww @ablondehuman please give attention @AJBalite @cbossa https://t.co/t4HNjfryE5 This is Ozzy. He’s a piano pawdigy. Can play whatever you want but really excels with the works of Woofgang Mozarf and Frédéric Chompin. 14/10 https://t.co/194pnm3jYO @imtadpole same This is Rodney. He’s just a good boy enjoying his Sunday swim in paradise. 14/10 https://t.co/XorNxhKCRj @mnwild @mnwildpup @chdogrescue @PetSmart @Soldiers6MN yes yes good @AnthonyNelson25 exactly This is Brixton. On Saturday night he started throwing up and by morning he could barely walk. It’s a neurological issue, but tests so far haven’t yielded any answers. He’s doing his best to get better but could use your help through the link below. 13/10\n\nhttps://t.co/3Q7LnJaXKi https://t.co/BpaVyv5hsw @BleuTrudy talent @percival_jesse saint bunnard @muhricsi thank you @PAVGOD saint bunnard @CaponeKnows oh no @ARealCupcake please don’t bully him @ProbablyAlexx_ we only rate dogs This is Moose. He’s just having his smoothie. Metal straw because he’s an environmentalist king. 14/10 good boy would pet https://t.co/i3YSYGjoBE @dcbigjohn @darth omg can we send you our 2021 calendar?! it’s essentially a print out of our twitter every day @Jeremy_Yates @soria_sancho @gameplayAnim 😳 @MiserableLie jack you are doing so well @medullah big same @HannahJayne_B but he will 🥺 @PickledPlatypuz wait here’s a pic!\nhttps://t.co/fhg7kRKL9E https://t.co/YnDqp6GAQB This is Barley. He just had surgery to remove a cancerous tumor. His best friend Fluffy was also given a cone to show their support. 14/10 for both https://t.co/ekYsOJsAgz @SimoneGiertz omg hello @hannah_b99752 @mochapom_ omg we abandoned that because all the dogs were above 10/10 😅 @hannah_b99752 @mochapom_ always been just in the caption 🤗 This is Mocha. If you were ever curious what a certified floof looks like from below, I offer you these. 13/10 https://t.co/12RdWdw5rh @dog_feelings thank you for your service @daleblasingame lucy that is so kind i will relay this to thor first thing in the morning @almannarino i’m hearing that his name is Webster @deacon451 probably @Cnic__ same @wugirly why would you bring that back up 🥺 @PAWSChicago thank you patches @smk73 nice This is Thor. He just wanted cuddles with his duck friend. Didn’t deserve this. 14/10 gravity is cancelled https://t.co/7TbkoBgAwi @djrhetorik do 😷 not 😷 make 😷 rupert 😷 sad @Rick_Devens ❤️ @michaelwhitney innocent @RocketClassic GOLF DOG GOLF DOG GOLF DOG This is Sloan. He’s had unexplained vomiting and diarrhea for a while. He weighs the same now as he did when he was 6 months old. He needs exploratory tummy surgery and ongoing tests to figure out what’s wrong. You can help Sloan by clicking below. 13/10\n\nhttps://t.co/ci1syq1ZWl https://t.co/ioibCfZ64Z @Lin_Manuel i’m all set #Hamilfilm https://t.co/oCNUzJwlCo @jonronson as she should 😌 @miclcm73 boooooooo @ChristyRaska oh what’s up? https://t.co/W9bGyfwVnn This is Macaroni. She has a question. Wondering if because she had an early breakfast she could maybe also have an early dinner. 12/10 seems reasonable https://t.co/mNmEomGS6F @RaisingCain20 CAIN HAPPY BIRTHDAY @overwhelmedgurl here for u https://t.co/I0SRDdUL4C @jentolgyesy omg i’m so glad @lottiee_mallen uhhh THANK YOU for taking it! @juniper_bears @zgryphon @ItsJakeYouTube growth 🌱 @zgryphon @ItsJakeYouTube yes, i'm so sorry this isn't actually \"Stubert\" 😭 \nhttps://t.co/5u2j1FnCUn @ItsJakeYouTube they don't know his name and we no longer make them up for ~reasons~ lol Here’s a friendly boy who says hi back to anyone who passes by his yard. 14/10 would definitely pet https://t.co/Wr0tgnpzlQ @meg_seekings ugh love that! @darth @xtraslky @dojishark HOLD ON I HAVE ANOTHER https://t.co/xpXaFyf94d @FirstMateTreats @dojishark 🌈🌈 @InquiShado @dojishark such a good smile This is Haku. His Pride bandana just arrived. Was a little nervous during his photoshoot until another rainbow appeared to keep him company. 13/10 #PrideMonthPuppo https://t.co/BEV81vkGZu @5Mumsie I met Loubie! I’m sure we’ll feature her one day ☺️ https://t.co/QGGrwdmzJV @PGATOUR good boy https://t.co/ZG7CymGXOt @thisguy42358 hi penny ☺️ @thisguy42358 they are the goodest of the good We’ve pupdated our list of 15/10s to include yesterday’s post of August. You can see them all by clicking below ❤️\nhttps://t.co/0NlOdeMwMq @iamarandomgirl_ omg @Nivo0o0 OMFG @sushiroosh i'm down if you’d like to read more about August and get some tips on giving your pup a long happy life, here’s this 🥰\nhttps://t.co/5rkE6iASF7 @AyamaNoswad more than ok, just signed @MsMarialba they had a 100-person pawty planned but couldn't go through with it bc of covid RT @txtechsean: ITS A 15 EVERYBODY GRAB YOUR HATS AND PUT ON YOUR FANCY PANTS This is August. She was born on April 24, 2000. That’s right, she just turned 20, making her the oldest known golden retriever in the world. She’s received so many good girl noggin pats over the years her color has been rubbed off. We’re giving Augie the incredibly rare... 15/10 https://t.co/6QMNNn3aqA @adamayr $10,000 in 15 minutes is definitely a record @toridoki i've never seen so many solidarity beagles i'm gonna cry @abbierenn @dog_feelings Snoopy says thank you! https://t.co/QP6sO2UfeH This is Snoopy. 6 months ago he suffered a herniated disc and has been paralyzed ever since. He wiggled his toes during his last therapy session, but his humans can’t afford more until the initial back surgery is paid off. You can help Snoopy below. 13/10\n\nhttps://t.co/Jfd3myk5UA https://t.co/nhqVmFh9hk @TheVFoundation i can confidently say every pup pictured is at least a 12/10 @karensantiag0 same 😔 This is Milo and Oakley. Sometimes Milo requires a booty pillow, and Oakley is always there for him. 14/10 for both https://t.co/3x3tOSuSqT @Jenna_Marbles ❤️ @OOUCH_charlie she is 🥺🥺🥺 @thisguy42358 sleep tight bb This is Zuri. She was reading you a bedtime story but accidentally fell asleep herself. Didn’t even make it a full page. 13/10 sleep tight bb https://t.co/i4V1s4jo95 @kylerjo this is lovely thank you for sharing RT @dog_feelings: i don’t know what the future holds. but i will be there with you. my 2021 planner is available now\n\nhttps://t.co/WPXVkQhg… @aalioop lmao @JanaBananaSays @ajshapi1 that’s her rating! she received 14 points out of a possible 10 points @wibbylard omg @Kitsunenokuro her best is way better than mine tbh This is Ruth. She was spotted at a rally doing her best. Supportive and clumsy is still supportive. 14/10 #PrideMonthPuppo https://t.co/IxclBsjLvK @MicahR_ politely requesting 4 extra pics of Ash https://t.co/PJmIqXxME8 @MicahR_ ugh the best boy @wiki_wildwild @dogfather lol @laurDIY @dodo i’d like to be adopted by this family @LakshmiRangana9 he’s not dry often 😂\nhttps://t.co/OARJoRcgd3 https://t.co/33AobIty2o @darth THANK YOU DARTH @mehManParth they said 🙄 @darth WHERE’S THE GIF OF ME DOING MATH DARTH @TheBiggestBruh_ a n g e r y This is Narcos. He is very angry with you. The addition of his duck friend only makes him 10% less angry. 13/10 release him immediately https://t.co/T5zJY8CUXP @PatrickKenneyMD omg i’d say 13/10 but i’d hate to replace that 100/100 @AdrianAnnMiller ❤️ @rdemetzensky so do i This is Nyna. She was recently diagnosed with spleen cancer. It’s so enlarged she can’t go on walks, which are her favorite thing in the world. She needs surgery to remove it followed by treatment to get better. You can help Nyna by clicking below. 13/10\n\nhttps://t.co/7qZQxr2Sdb https://t.co/KW1a7hj9l4 @heyadiana can't believe someone sent a sink seal smh @ss_storyteller @DolphinResearch it's literally a nonprofit @VictorEBulldog @bravesrowe victor that’s so nice 🥺 @ElectricSirenKJ @bravesrowe EVEN HIS FOOTERS @Oldhippiegal1 @bravesrowe he said \"dis one\" @darth @bravesrowe DO YOU SEE HIS ABS DARTH https://t.co/HALHcQ24SK This is Oakley. He’s on his way home for the first time. Hoping to grow into his wrinkles but no pawmises. 12/10 https://t.co/MYllMgB3T4 @EA https://t.co/fEtjbaDcwy @JujuBrant @DolphinResearch slippery one @AriLamstein i had to We have received information confirming the validity of the photo below. This is Gunner and his water buddy, Delta. Delta lives at a seaside sanctuary in the Florida Keys and has been best friends with Gunner ever since he was a puppy. 13/10 for both https://t.co/doLa57OnxI https://t.co/2YfnYS2Xa8 @epace16 @_woollyback NO WAY WHAT @austinpetsalive HI DYLAN! @SuchAGeekBlog @PupperNelson i'm sure this can be arranged @ga_r1997 @PupperNelson i really need to catch up on walter lore @PupperNelson we love you @Vazkii @PupperNelson walter Not all superheroes wear capes, but this one does. Say hello to Nelson, the proudest little ally. 14/10 #PrideMonthPuppo https://t.co/qBsWAk8Iue @IvePetThatDog i’m on it @Luciana_F_Lopez @annacroweVO seal* but yes @twinsthings @Elizabe07697638 we are the virus @Elizabe07697638 rare but not unheard of @juniper_bears oh this is good to know thank you @annacroweVO wait... https://t.co/lhCKSMfpfK @friendlyrmndr we consulted canadians before posting but it's always nice to see comments verifying our posts I know it’s been a while but we still only rate dogs. This is clearly a Canadian Sink Seal. Please send dogs. Thank you... 13/10 https://t.co/LkOqSZLuBs @Harry_Styles this is Sophie and she told me to let you know she’s a big fan https://t.co/EkTfofUSu2 @AlexDiLalla LET’S GOOO ❤️ @ChrisTweetsLLC to be fair the bar is on the ground @gbaroth doggles greg... doggles @USPS yes @AlexDiLalla 🤗🤗🤗 @katiearoman omg @MakoTachiWife @hellobodie we will wait patiently and while you’re here, we’d also like to show you this page that lets you easily allocate or split any donation between a bunch of wonderful Black Trans groups\nhttps://t.co/ldEiW9jrnW We’re already halfway through #PrideMonth! If your pup is wearing rainbow or simply loves more than anything else, send us a pic using #PrideMonthPuppo for a chance to be featured! 🌈🐕 https://t.co/CsINKE4Win @madeline_lovern omg 😂 @joshscampbell wow @IvePetThatDog this is fair @IvePetThatDog where does the line start to hold his paw @MNFreedomFund @reclaimtheblock please relay many virtual noggin pats to Monkey for us ❤️ @kittievante pawsed* 😌 @ktlynnowns ¯\\_(ツ)_/¯ @kmp72479 @MNFreedomFund @reclaimtheblock alright guys if you’re struggling to decide which one from the list to help, here you go ⬆️🤗 @1flym @MNFreedomFund @reclaimtheblock no it’s ok you may pet @darth @MNFreedomFund @reclaimtheblock HE DOES INDEED DARTH This is Monk. His human founded the Minnesota Freedom Fund, which has received so much support recently they’ve pawsed donations. Monk says thank you and would like to redirect your attention to other orgs below keeping targeted communities safe. 13/10\n\nhttps://t.co/3tkDj5KUwo https://t.co/xkjKXuv9T7 @sjjphd ❤️❤️❤️ @PlayStation @Sony ok i saw the cat with the backpack, but something to consider... a dog with a backpack @JanelleCShane @dog_fakes can you make one that generates perfect tweets so i can take a vacation @JanelleCShane @dog_fakes janelle... why @korybing incredible @TheOnion oh no RT @brittdabarbb: my dog is a weirdo bro. https://t.co/eFh9beco2p @TotalToughScene i mean 12/10 h*ckin good boi right there @TotalToughScene L @Arcitys gm simba @Ali_IngNews he is FED PUP @Penny_Lane_Pup @dogfather gorgeous penny! @shopivoryella @rickriordan happy birthday sir @_zr_zk_ single file line might work @itsdougthepug ❤️❤️❤️ @staciemichelle 😂😂😂 @emstams26 @sfeitler honestly smh @sushantmaybe https://t.co/UsXK6enHmh @sfeitler ONE AT A TIME GUUYS C'MON PLEASE continue this thread by linking and sharing black-owned dog businesses. If you can’t think of any, you have to buy from one of the above. That’s the rule ❤️ (thank you @BoogiethePug for inspiring this) Ava’s Pet Palace - founded by 12-year-old Ava Dorsey. With a mission to educate owners about treats that promote health and taste-bud satisfaction, she is on track to take over the dog world. You can find her 100% organic, non-GMO treats below. 15/10\nhttps://t.co/vt9ckLHkuR https://t.co/1EIoQsQmQg Pet Parent Allies - founded by Curtis Kelley. Curtis and his trainers focus on positive reinforcement methods to effectively train dogs no matter their age or experience. They’re based in Philly, but offer virtual lessons you can schedule right now. 15/10\nhttps://t.co/3wEhz6uS8x https://t.co/KZcbWY7yib House Dogge - founded by Angela Medlin. This former Nike design director, with the help of her pup Wubbi, created a modern eco-friendly dog accessory brand that combines comfort and sustainability. Their beautiful studio is based in Portland, Oregon. 15/10\nhttps://t.co/nFL3gHyDpv https://t.co/XP7WHOdp8h Pet Plate - founded by Renaldo Webb. After seeing firsthand the lapses in mass-market dog food, Renaldo went to work creating a healthy solution for his own dog Winston. Today, @PetPlate delivers all-natural, ready to eat meals right to your door. 15/10\nhttps://t.co/AHUngx8S35 https://t.co/FHPt9nEEBi Beaux and Paws - founded by 13-year-old Sir Darius Brown. He handmakes bow ties and donates them to shelters around the country to help dogs look extra spiffy in their adoption pics. 15/10 @SirDariusBrown\nhttps://t.co/k1eMjJ5hCY https://t.co/feraBMC72j h*ck it, thread of black-owned dog businesses that deserve a fat slice of that $100 billion we’re estimated to spend on our pets this year...\nhttps://t.co/wUAg85c0fr @vaIenteana SO WOBBLY @latelateshow appreciate the mention 🥰 @MarnieTheDog queen. marnie would be so proud @Davkas2005 the directions are so simple smh @yaboynailedit 😤 @byMikeDavis @AsburyParkPress 3 MONTHS IN A ROW OMG STELLA @dailydot thanks for having me 🥰 @MatthewACherry @RespectableLaw a legend truly @Karen27312 @Christina_Roof there’s no way your name is actually karen lmaooo @Christina_Roof @kittytweedy1 very excited for the police in your family to speak out against the bad apples @rachel_beeman h*ck yea yogi @Christina_Roof @kittytweedy1 they’re not good just because you’re related to them @BaristaBitchin_ we're trying &lt;3 @msheffi972 @kittytweedy1 find another account then @kittytweedy1 yea the cops definitely aren’t friendly or rational 14/10 https://t.co/nKIAjovVDU @barbschauer @MNFreedomFund good @backpackahri https://t.co/PrfxRodFNU @amberly_m @MNFreedomFund thank you chloe 🥰 @aussiedog1 @MNFreedomFund https://t.co/VEOd3vBbXH @jeditigger @MNFreedomFund ear freckles 🥺 Our account usually acts as a retreat from the bad in the world, but being able to retreat from the bad is a privilege itself. For this week’s fundraiser, we’re strongly encouraging donations to help protestors through the link below ❤️ @MNFreedomFund\n\nhttps://t.co/Z3HDG7fvwk @BrettWillison @dog_feelings 🥰 @SheRatesDogs thank you here’s a puppy pic bc i’m sure you need it https://t.co/WCHxGXyP6L @SheRatesDogs i believe this is yours https://t.co/UnXKczdodM @squoctobird I JUST NOTICED THEM OMG @tperzyk incredible @TheGoldenRatio4 @budweiserusa very much looking forward to this series thank you jen @tperzyk everything i love in 1 pic @zapatta he is a good storyteller, we’ll allow it @leahflame that’s what we’re here for they’re listening SO WELL are you kidding me??? 14/10 for all https://t.co/mokSJBZ0ba @merrillmatter this energy &gt; @hateyourliver i am glad ¨̮ @cmcgove23 i don't even know anymore colleen @xoMinnieJo 🥺❤️ @madcabs that’s ice cream For the last time, we only rate dogs. Whoever dropped a scoop of oreo ice cream on the floor please come pick it up. Thank you... 13/10 https://t.co/kP2Y7aRUHl @PAVGOD very kind of him to point out what someone else clearly did to our hoodie @WillMacNeil_VFX so sorry ❤️ @HamillHimself hi mark i hope you’re having a good day @alectabora23 strong agree @RATGod18 kevin is deaf! so that helps i think @PadawanRaynor no mow. only throw @metrichead pawlitics c’mon it was right there @ohjasminee frankly so do i @eshark67 another brilliant strategy This is Kevin. He puts his frisbee in the way so his human is forced to throw it for him. 14/10 downright genius tactics https://t.co/NrBg6wNHGX @IvePetThatDog @quirkbooks might be the cutest cover of all time tbh @IvePetThatDog @quirkbooks GIDEON WHAT OMG RT @IvePetThatDog: I'm so happy to share with you the cover of my book, PET THAT DOG! A HANDBOOK FOR MAKING FOUR-LEGGED FRIENDS, coming out… @karlafraancesca just overwhelmingly good @LolaminaDesigns @Thesherbertime https://t.co/FWeNzrsiop This is Sammy. He drives around just to remind the neighbors that this is his world and they should feel honored to live in it. 12/10 https://t.co/Wud6qXclCi @itbwhatitb76 i do yes @denisersalmeida omfg @IvePetThatDog @shruthi__sakthi @MichaelPhelps u seeing this? @Huntsmen 😤 @czarbucks nothing to be ashamed of here @mxmtoon 14 @PoppyPineapple @hbrdogs @shopivoryella graystone! @Jenna_Marbles @juliensolomita i was simply taken aback by her elegance @Jenna_Marbles @juliensolomita jenna... @RenFriedman @shopivoryella yay! glad you like it 🥰 the pups thank you @RockinTheZubaz @hbrdogs @shopivoryella they have a ton of pre-approved adopters interested in him 🥰 @ScarletShoes79 @hbrdogs @shopivoryella ❤️❤️❤️ @Penny_Lane_Pup @hbrdogs @shopivoryella no, but that seems like an egregious oversight on our part @InquiShado @hbrdogs @shopivoryella thank you for zooming we would hate for anyone to miss them @juniper_bears @hbrdogs @shopivoryella lol i'm told he personally likes the blue one @PickledPlatypuz @hbrdogs @shopivoryella OMG @AndrewRobertLow @hbrdogs @shopivoryella he appreciates this This is Andrew. He has a broken leg from suspected cruelty and will need surgery to fix it up. Because so many of you bought our shirt to support the rescue who saved him, his care is paid for. You can continue to help them by getting a shirt below. 13/10\n\nhttps://t.co/jlbROuIn0P https://t.co/8zrBME98pn @shanwitchey @shopivoryella amazing! 🥰 @JoshButlerTv we are big fans of everything happening here @shopivoryella look at the puppies! 😍 @guillermindale awww hope you feel better Figo ❤️ @jazzzyymin @tamarajayew omg @ElliottcMorgan such a rollercoaster tbh @daily_sausage @tamarajayew @dog_feelings happy you’re here ☺️ @melizzle71 @tamarajayew i hope so @juliagoolia889 exactly @metrichead @tamarajayew do it! do it! This is Kosi. If he really concentrates, he can shoot rainbows out of his head. 13/10 magical as h*ck https://t.co/Pemo8kaaml @luvcrispymashed dm us we'll send another ¨̮ @Capitals @dog_feelings @dogfather thanks for having me! tell Captain i hope we see each other again soon 🏒❤️ @Capitals @dogfather @CapsPup @tbray @JoeBpXp WOOHOO @JenPilarski this is quite the predicament @universityofga @TerryCollege wow yes i agree @ImAwkwardAly it's so great i love him so much @justalurkr \"you want me to do what\" This is Brody. He’ll be the first to tell you his first attempt at getting in the kayak wasn’t great, but he never gave pup. 14/10 https://t.co/vFbYexUoA9 @SWatercolour @lecorgi i want to live in a piece of your art @lecorgi go incorgnito and sneak bark in @pragyachandraa nice This is Marcel. He was once a member of the Royal Guard. Didn’t last long because he couldn’t stop smiling. 14/10 https://t.co/LqKM5UcfIc @CanYouPetTheDog *nods* @sydneylapin yes we do @perria19 @shopivoryella the pups appreciate u 🥰 @QuartCourt @kylemooney kyle i’m gonna be honest... i see it @ambivalent i'd contribute @harleefoolsday omg no now it's all i see too @TeejCarlson same @blakemurphy7 omg This is Dennis. He has sideburns. Debuted them at the park today and received great feedback. 14/10 https://t.co/eVz1wXw7Pf @Missyoober @shopivoryella restocking + more colors by tonight! @SantaFe_69 @dog_feelings @shopivoryella a wonderful non-profit that rescues shelter dogs and finds them forever homes! here’s their IG: https://t.co/nH2MsiBaLX @no_baingan today's was pretty good lol @Namemaker2 @shopivoryella excellent choices @Namemaker2 @shopivoryella what did ya get??? @SallySparks44 @shopivoryella thank you for your patience! @kbaxterk @shopivoryella hahaha you might need to ask Ivory Ella for that one @AndrewRobertLow @shopivoryella YES THEY ARE @shopivoryella WOOHOO 🐘🥰 We made a new shirt in partnership with @shopivoryella! 100% of net proceeds will go to Hearts &amp; Bones Rescue 💕🐘🐶\n\nAvailable Now\nhttps://t.co/jlbROuIn0P https://t.co/llljHpovtB RT @dog_feelings: surround yourself. with those who would flip your ear back for you. if it ever went inside out @NotLameAsChris @Twitter @TwitterSupport please look into this we’ve been begging you for so long to stop granting suspensions initiated by this guy @shopivoryella 🐶🐘  👀 @CollegeDemsIL that dog @Gwenelope @dog_feelings thoughts of dog has a planner &lt;3 @velourcherry starting a petition to give him the world @vegaslamb @LMD_LiLi_LMD wow This is Little Bear. He tolerates baths because he knows how phenomenal his floof will appear afterwards. 13/10 #SeniorPupSaturday https://t.co/7qnnufiB5Z @NexNexie04 @brit_ritchey 😂😂😂 @brit_ritchey ahaha i had fun with that one RT @brit_ritchey: Might be my favorite @dog_rates so far this year. https://t.co/QbIMgSFUB6 @charliepick the excuses to come to australia are piling pup @RealXenSlayer @miss_melisxjg https://t.co/2Cxu947rcX @smoochumm he has ☺️ they’re the ones who reached out to get him the care he needs This is Cooper. He has entropion, a condition in which the eyelid folds inward, causing discomfort. He was recently abandoned and both his eyes have gotten so bad he’s forced to keep them closed. You can help Cooper get the surgery he needs below. 13/10\n\nhttps://t.co/mST41KQ8ml https://t.co/1jjVXaDfp9 @TeresaA123 he is simply hugging with his teef @BargeChi this is beautiful @adedamola_op do you really want this this is a power move by Comet and i respect him for it. 14/10 https://t.co/Uie6McI4tu @StarTrek who can i talk to regarding Number One’s abysmal valuation? @johncwingfield @Milliethegolden confirmed @SWatercolour @bstrain_ thank u for this 🥺 @aguatemalanward @bstrain_ haha nice This is Ellie. She made a friend at the pool today. Was wondering if they could have a sleepover. The little one’s parents already said it’d be fine. Both 13/10 https://t.co/lt6tgjPX2O @foxfeather oh my goodness may we feature him? @foxfeather i would like to learn more about comet @charlidamelio doggo intellectuo @darth @lyndonbjocelyn “READ THAT PART ABOUT WALKS AGAIN HUMAN” @strgto 🥰🥰🥰 @benjaminpawson lmao @Coolish_Breeze @lyndonbjocelyn he's my hero @elizbusby same tbh @molly_knight @lyndonbjocelyn yes, walks and more like maybe hikes or otherworldly odysseys molly who knows @mauraMK @lyndonbjocelyn not totally convinced he didn't write it himself @FreeBandzSaucy what time of day works best for you? This is Arthur. He received a letter today from his 10-year-old neighbor, Troy. I’m told he is incredibly flattered and hopes to schedule a play date soon. 14/10 for both https://t.co/UZuXtRFaZw @ManpreetMuskaan @daang12 ah you got me @Jasmariiabia lol This is Honey. She wants you to spot the difference between these two pics. It’s very subtle so please take your time. 13/10 https://t.co/PvC2oGSJcQ @dog_feelings love you too @CapsPup @NHL @Capitals @AmericasVetDogs good luck captain 🥰 @PupperNelson @stephaniejeanm_ omg this pic is a part of culture i had no idea it was you! @anya_schoenfeld YES EXACTLY @laurDIY moose says yes @egroom21 same emma @AnthonyNelson25 @stephaniejeanm_ shhh he was feeling cute let him have this This is Moose. He accidentally opened the front facing camera. Decided to make the most of it. 12/10 https://t.co/Jh0qqr5yiz @jattmohnson gets better each time @lileana_pearson you have an adorable monster @Melissa_Officia not dramatic very appropriate @_dayshiamonaye_ we better be informed immediately if you do @lileana_pearson &lt;3 @Naxiilol the confident wiggle after is what did it for us This is Archie. He may be a smol boy, but he’s got legendary hops. 14/10 elevator didn’t stand a chance https://t.co/F5UYTWargj @TheSeanODonnell hi willie @abbierenn @clare_chiar absolutely we can This is Cali. She took her new wagon out for a test walk today. Says little legs only get you so far at 15 years old. 13/10 would pull her anywhere #SeniorPupSaturday https://t.co/UZuetUZpSE @DannaNL @kriscarnevale it would be an honor to send some to the netherlands \nhttps://t.co/VKXPef9lMC @kriscarnevale omg her bandana looks so good! @dmpalmer10 i think he made some great points @mollienotmolly appreciate it, but we can’t afford to go to court with Target @juniper_bears i'm sure he does @Merfkin ❤️❤️❤️ This is Cas. Last year he was found with a gunshot wound to his face and had to have his left eye removed. He needs another surgery soon to get rid of residual debris causing him pain. He loves his new family so much and you can help them all below. 13/10\n\nhttps://t.co/VVEnM2Q1eJ https://t.co/6sBHqSJkPs @__Arthur_Dent__ @bradighieri oh this is wonderful @sevenseasofshy @bradighieri we are sick of it https://t.co/h0gX1bHCaJ @tilliehellman ??? we only rate dogs Unbelievable. Why would someone send us a photo without a dog in it? We work way too hard to be this disrespected. Please send dogs. Thank you... 12/10 https://t.co/FsmS10fkjD @cero_lu22 happy birthday, otto ¨̮ @captainvirtue @advelanch thoughts? @lindsaylohan @KristerR so beautiful @InquiShado @advelanch i don’t know This is Mandy and Avalanche. They were separated at birth. Today, all these years later, they’ve been reunited. The bond between siblings is so strong. 14/10 for both https://t.co/89qkIrccy7 @jordantaco7 omg you sent that on the day we made our account @FallonTonight GARY IS DOING HER BEST JIMMY @BermudaDrew ❤️ @adedamola_op @agoldennamedkev you can’t he already put the hat on @captainvirtue @agoldennamedkev oh no did we make another mistake This is Kevin. He was wondering if he could visit the ducks today. You can’t say no because he already put the hat on. 14/10 https://t.co/dpGA1xzvhv @vinoconmonster 🥺❤️ This is Lady. She’s finished every show on every streaming service. Even the ones that came out today. 13/10 not sure what to do next https://t.co/D5JUjwdEWn @Popehat @TimCushing lot to think about @giantcat9 @MorrisAnimal @loz_ty63 i’m gonna be really honest here i am not ready to argue with giant military cats @Kafkaesque_Blog exactly @itbwhatitb76 thank you @Luckyoo6 haha nice This is Fred. It’s his first day working in customer service. Very sorry to hear your order hasn’t arrived but he already issued a refund. 13/10 really no need to take that tone with him https://t.co/j129lq1wJc RT @shortyawards: Woof Woof! Congrats to the Best Meme/Parody Account, @dog_feelings #shortyawards https://t.co/jtQaA4GMWb RT @rebugmp4: Important!! https://t.co/kwlmCXd0vO @TexasVolleyball 15/10s are rare but i’ll say this is ~at least~ a 14 @KeithOlbermann 21 minutes* :) @gabeincharlotte fortunate to have an audience consisting of the world's best people @roses7184 ❤️ This is Remy. He has a lump on his leg that was recently determined to be cancerous. Surgery to remove it followed by treatment is his best option. He would really love more time to lick the wind and sniff the flowers. You can give him that below. 13/10 \n\nhttps://t.co/cJyFPsC4wc https://t.co/XXPdjgEOef @ShepherdCenter ❤️ @prof_mirya hahaha incredible @peenaloap omg chaplin u are SO handsome @NCAACWS @WVUBaseball can definitely confirm this rating @PaulFox13 Brody you are quite the meteorpawlogist @TipaOdiosa the best @barbaramassaris ohhhhhhh yes ok this is a fair argument @tfoolexperience ...you follow us @barbaramassaris that’s the dog’s score out of 10 @WulfLinkStan isn’t that the best cloudy with a chance of good boy. 13/10 https://t.co/APIZrlnttS @thecassieburr ❤️ @juniper_bears yes her name is Shortcake and she’s known for that smile\nhttps://t.co/ejPhBChfWf https://t.co/92pMaMVBXr Oh c’mon. We only rate dogs. This is just a little froggo enjoying their walk in the rain. Sorry to bother you sweetie... still 14/10 https://t.co/VStd6wtdcm @mhennessey81 just when i thought i was going to make it the whole day without crying @Seahawks this is delightful @Snomer @jackie_not_chan not anymore lol @_AttorneyAtPaw @jackie_not_chan WE WOULD NEVER SUGGEST OTHERWISE @Golden_Xvaril @jackie_not_chan 😳 This is Bowser. He insists on picking a pawdcast but immediately falls asleep every time. Still 13/10 please do not disturb him https://t.co/94RJ1J5l9S @CBCAlerts 🥺❤️ @Mateocito1 HAPPY BIRTHDAY STELLA BLUEEE @cheddar all very very good @darth @dhildahl SHE’S SHOWING THEM OFF DARTH @risenivy no... no it's not This is Daisy. She was very brave while getting her nails trimmed today. Would like to thank everyone for believing in her. 12/10 https://t.co/cH3j0ZYYi9 @FieldMuseum “turtle friend acquired” 13/10 for sure @ashley_schoon she's a superstar @illiteratelion no doubt @malloryyy_xo smart @aguatemalanward @ashley_schoon look we're doing our best ok @zalesjoyner @ashley_schoon i definitely didn't @Luckyoo6 @ashley_schoon ...oh This is Muffin. Today she received a belly rub from a butterfly. 13/10 absolutely magical https://t.co/er9tu4Srzk @Olly_Oakes ❤️ @mbuenog @darth domi i’ve met u she’s right @LeahZeiger lmaooo @TheGoldenRatio4 i expected nothing less from venk @bigchobani facts @InYourDreamsBro 😂😂😂 @ilimpaftersex big same @darth HIS MANNERS DARTH IMPECCABLE This is Otis. He’s a corn dog. Master of the polite crunch. 14/10 volume pup https://t.co/YB20QHEmqh @NASCAR @AlexBowman88 omg yes 13/10 let them race next week @NASCAR @AlexBowman88 i’m sorry HE WON??? @PhilippineStar her SMILE @jenvr @dogfather 😳 oh my goodness @BriannaNHolt “our small space” 😂 @cashley10 i’m so sorry ❤️ @espn can’t believe i’m late to this @Tauva101 omg this is amazing @loders75 @GPRAtlanta YAY CHARLIE CONGRATS @AlexRaeSeydel belly freckles ¨̮ @seanfbrown @GPRAtlanta buddy just click the link This is Kevin. He’s already had a few surgeries to correct leg problems. Sadly, he now needs one more to fix a ruptured ACL. His family fosters for a Great Pyrenees rescue, so he currently has many friends cheering him on. You can help Kevin below. 13/10\n\nhttps://t.co/IwCmIIL0If https://t.co/Y7U6rcf8Ku @GovTimWalz idk i may go with a 12 tbh Tim @baylortisbee glad u like them 🥰 @craymusic he squint bc he thinking @hollykatherine8 ₍. ̯ .₎ @SammyMxFluff omg the cloud is inside @jacarlvs may we speak with his management? @TheGoldenRatio4 @kjrocks821 he would like that thank you jen @aguatemalanward thank you Maria he says this helped @darth ALL I COULD THINK OF DARTH This is Chalooby. His puppy school graduation was cancelled. Learned to sit for nothing. 13/10 somebody hold him https://t.co/hAVK4kCwI9 @DrMicroChem @shecannutbread good one liz @shecannutbread crying RT @shecannutbread: NOOOOOO https://t.co/I0e2f5l4k1 @Pornhub he’s at least a 12/10 pornhub 🙄 @perquinx i’m down @CindyMarieSha we zoom :) @Maisie_Williams i can’t stop thinking about him maisie @Coeurli it's what he deserves @arthoe_net yes weratedogs is notoriously \"edgy\" lmao @RaeElle hang in there big poppa ❤️ i will find a cure myself if it means seeing Big Poppa smile again. 14/10 https://t.co/YVarud5bNr @tlp1981 give him another @AbbsMcKay @Jaates same @LTrent721 needs to be edited with 12s This is Hank. He did his first sit today. Hopes you're proud of him. 12/10 thank you Hank we needed this https://t.co/P5wHKAGfDp @ForRover i’m so sorry ❤️ @HEELZiggler @Flavinh49829781 exactly @captainvirtue @Flavinh49829781 oh h*ck yes @SusannaLHarris there are no rules right now susanna @LupoZach @adedamola_op @Flavinh49829781 well hey now she might share a sip we don’t know This is Lola. She was going to share the milkshake with you, but after tasting it, she’s just gonna drink it all. 12/10 heard it brings good boys to her yard https://t.co/4CX4PkFTEj @TXSTCE ❤️ @TheGoldenRatio4 @thehenrystudio @JCuocoNews JEN I’M SO SORRY BUT LOOK THEY’LL SEE U IN SEPTEMBER https://t.co/BqyT4HnDal This is Spencer and Penny. For the last five years, they’ve cheered on runners of the Boston Marathon. Today, even with the race postponed, they visited their usual spot along the route. And told everyone to stay strong and they’d see you soon. 14/10 for both https://t.co/qjkvM7MelC @Lydia_Deanna IS IT OLIVER??? @beckyalbert @dogfather you both did great 🥰 @Bermes_Python say it louder @RedCross omg hello Aslan and Digory @Zedd oh. my god @GregoryJevyak @dogfather 🥰 @BadeWoggsBaby @SheRatesDogs we got you. 13/10 @ThyGoddess @IlonaSkyte he says you should be it’s comfy in there https://t.co/D5VzAoxRAh This is Dory. He got tired walking up the hill but that’s okay because he brought his wagon. Then he ate a dandelion. 14/10 overall a lovely evening #SeniorPupSaturday https://t.co/hy8dkl3fNN @IamSwitters happy birthday bb 🎈 @mamabeechey she’s doing great @dulwich_boy i’m sure they appreciated this 🥺 @melissaemilyyyy it looks so good! @miller_anne ❤️ @NetflixFilm @LizKellyZook JELLY BEAN WOULD NEVER @NetflixFilm @emilyedominguez oh c’mon netflix that was a laypup @samkahrs @NetflixFilm chief that is a lovely hat @NetflixFilm @RobinDybevik same tbh don’t tell anyone @NetflixFilm @TheGoldenRatio4 ok that’s a good one jen it’s got that sunflower song 💛 @NetflixFilm @PoGoX7 @s0phisaurus_rex THE LITTLE ROBES I CANNOT @katygard @NetflixFilm happy to hear that nugget. carry on @NetflixFilm @ahoyserena but can she parallel bark??? @NetflixFilm @AlexKP76850525 ohhh here they come. the happy little trees @NetflixFilm @sam_kaczaral doggo intellectuo is the species i think @Ruska_Muikkunen @NetflixFilm 😂 @BeckyDukuDubz i mean i’m the same way pippa @TheGoldenRatio4 @NetflixFilm i would like to watch whatever movie they recommend with him if that alright @NetflixFilm @jilllianaire_ omg he does (also i really want to watch Bolt now) @NetflixFilm @s0phisaurus_rex ok yea this is good @Kitsunenokuro i’d be like you should watch Air Bud (1997) or Air Bud: Golden Receiver or maybe Air Bud: World Pup perhaps Air Bud: Seventh Inning Fetch or what about Air Bud: Spikes Back ummm Air Buddies, Space buddies, Santa Buddies??? @NetflixFilm @mkurlandsky i call next dance with toby no skips @themontanahayes omg reply to their thread with this cutie 🤗 @tpwkcalm bro @MiselMostar @NetflixFilm Apollo you are as handsome as ever my friend @becclar15 @laurenpughhh @NetflixFilm @dog_feelings 😂😂😂 @s0phisaurus_rex @NetflixFilm the duo snoozle in pic 2 has made my day @NetflixFilm @charlesjorlando @dog_feelings omg @NetflixFilm @steveschale honestly impressed you were so patient in recommending this one netflix @mrs_dublin @NetflixFilm hi mochi 🥺 @NetflixFilm @mrs_dublin THE LITTLE ONE OMG @katygard @NetflixFilm hello nugget how are u today? @rinfeet @NetflixFilm oh my goodness @NetflixFilm @A_Elove is there peanut butter in that movie the dog wants to know if there’s peanut butter in that movie @NetflixFilm @PAVGOD https://t.co/fajhr9HtaG @uninthereseting @NetflixFilm i like perry @Tami_nator @NetflixFilm @dog_feelings omg already puppared for movie cuddles @NetflixFilm @wj5kw3r35 @dog_feelings look at those fancy paws netflix 🥺 @LynneKelly @NetflixFilm @dog_feelings pupcorn* @bunsenbernerbmd @NetflixFilm hi bunsen 🥰 RT @NetflixFilm: Time for Friday film recs! Reply with:\n\n-a pic of your pet \n\n-what country you live in\n\nand we'll give you a movie to watc… @outsideadog yes! we’ve been working on it ¨̮ @KeithOlbermann ❤️❤️❤️ @sammysweetnessS Ollie and his brother Oscar, who also works in delivery, thank you https://t.co/2CNdpNUno7 We don’t usually rate mailmen, but this one needs our help. This is Ollie. Shortly after having surgery to repair a ligament in his right knee, he tore the same one in his left knee. All he wants to do is play again. You can help him do that below. 13/10\n\nhttps://t.co/A1A9LkE1JD https://t.co/uac9mmS2ci @GoCamels @campbelledu @Campbell_SGA @GoCamelsSAAC @CUCAB can confirm @DavidDobrik dis mad cute @OOUCH_charlie yup @Limansious i'm a vegetarian @bondjamesbond81 @shaunazurowski higher than what you’re delivering This is Jax. He’s glad you finally woke up. Thinks it’s time to have a little chat. If you’re going to be home all the time he expects some help around the house. 13/10 https://t.co/sqARzmQoXa RT @alanna: i heard a light knock on my door and went to answer it and it was my landlords’ dog bringing me a stick 😭😭😭 https://t.co/mXwcOs… @mmollieclaire awww :) @Denoflobos @CatInfantolino no! you have failed the socy distance challenge @_A_n_y_e_ 😂😂😂 @Denoflobos @CatInfantolino well maybe just one This is Ringo. He appreciates your urge to pet him, but respectfully asks you to keep your distance until this is all over. 12/10 I will do my best sir https://t.co/qTBY4pNMJU @libbyaff_ same @WillCarpenter28 ❤️ huge thanks to @KayleeConsolo and @JacobEarnest for sharing Paulo with us https://t.co/FFf4vXFDjt This is Paulo. Sometimes he forgets he doesn’t have his leg anymore, but his human is always there to assist with the scratches. 14/10 for both https://t.co/AF0TuGRQVt @TheGoldenRatio4 @dogfather @TheBrazenYouth 🥺❤️ @CBH999 @humorandanimals WE DON’T RATE HELICOPTERS @humorandanimals we had this scheduled as a we don’t rate helicopters post but you beat us to it smh 😔 @juniper_bears @natecampi oh wow yea she can share we're all set Hudson @juniper_bears @natecampi oh wow they did well This is Hudson. He just found out Easter was yesterday. Thought it was today. 13/10 please hide some eggs for him anyway https://t.co/aEOi1ad1qL @CarleyMackey for anybody who'd also like one ¨̮ \nhttps://t.co/VKXPef9lMC RT @CarleyMackey: I can't go anywhere but I still love it. @dog_rates https://t.co/2XXRB7fXNW @Vall__Bee excellent point @dvineabsrdities 🥺❤️ https://t.co/BrM0oaq1bR @elizabeth091291 he says thanks @Allene02853488 he appreciates the kind words This is Alvin. He forgot to pack enough carrots for all the other dogs at the park, so not everyone got one. Can’t believe he was so foolish. Today of all days. Still 12/10 https://t.co/vMqUjmIUM7 @GretaThunberg omg hello puppy @DylanEnvoy keep it pup 😤 @ryankeszeg @DylanEnvoy i’m hype as hell i couldn’t help it @DylanEnvoy are u kidding me RT @ThisIsHunterN: My pupper Cheyenne was a bit worried when she saw my new @dog_rates hoodie, but then she felt a sense of relief when she… @FieldYates I CAN CONFIRM THAT RATING FIELD OH MY GOODNESS @cayayine that's what i'm sayin @DeniseGrdnr right!? precious @PixieWings76 OMG CAN I ALSO COME This is Benny. He’s not great at going down stairs yet, so his human carries him. Yesterday he wiggled out of their arms and fractured his paw. For now he’s on meds and limited to his crate. Surgery to repair it is expensive, but you can help below. 13/10\n\nhttps://t.co/e1JIaastux https://t.co/4BWgBRnKYA @LamboKody hero @IAmAlanWalker welcome alan @MrAndrewCotter that is wonderful to hear andrew keep it up @TommieCinco lmao @MrAndrewCotter the final comment cost you the retweet but this is still the highest tier of content i’ve ever seen @MCsqurrd omg @darth DARTH HE WANTED TO SHOW YOU HIS DUCK FRIEND https://t.co/8L3BeAoKna This is Stevie. He was born with cerebellar hypoplasia. There’s no pain associated. He’s just at a higher risk of dancing in puddles. 14/10 https://t.co/L8Oshvx4kr @evleaks omg they are definitely waiting for a bedtime story @milenadelfim @TheGoldenRatio4 @dogfather @dog_feelings yes! just expensive :/ @LejlaMcCready goth corgi @Lin_Manuel Tobiii @TheGoldenRatio4 @dogfather @dog_feelings oh. my. goodness. @aksh_lcfc @BaiMitch06 oh ok ok 😌 @aksh_lcfc @BaiMitch06 wasn’t for u anyway then 😡 This is Sushi. She knows it’s been a long day. Offering to split her pancake with you. 14/10 thank you Sushi that’s very kind https://t.co/cbGrCUTWYo This is Pepper. She thinks the world is a little scary. Plans to stay in her bag for a bit. 12/10 would ask if there’s room in there for one more https://t.co/cue9oKoYyl @ChronicleBooks @BuzzFeed 🤗 @drakkye truly @Twitter 🐾🐾🐾🐾🐾 @Manjunath_Raja @NaniWrites wild horses* @cstampeen no twitter unfortunately https://t.co/04PtV0FFoQ @TylerGiek exactly We only rate dogs. These are perfectly synchronized wild horses. Please learn the difference. Thank you... both 13/10 https://t.co/hfsisQohet @SaraThurber 🥰 @darth NEW HEADER @darth DARTH CAN I JOIN YOU @MoonPie thank you moon pie your restraint is heroic @NASA pup, pup, and away my friends https://t.co/MXpj7WFoFW @tfoolexperience no that's the moon This is Nellie. She’s an astronaut. Please don’t interrupt her spacewalk. 13/10 https://t.co/h2An2AKuSW @Nivo0o0 @dogfather @unwise 🥰🥰🥰 @lebacylrac @dogfather ❤️ @LoganRegis he do be floatin doe @EddisonKirkland @cherylswims my bad my bad @IvePetThatDog YAY I’M GLAD YOU LIKE IT 💙 This is Castro. He’s been through a lot in his 14 years. Despite all of it, he decided he’s ready to learn how to swim. 14/10 we believe in you buddy #SeniorPupSaturday https://t.co/Z6iJyqEMBr @MsPoboGHS oh no! well now yours is unique ¨̮ @heyitsbrynne woohoo ☺️ @MaggieMaeWhitt @dogfather 🔥🔥🔥 @BethSelene we've been posting the pages on our instagram story &lt;3 @lloydrang it's on his butt he's only a little embarrassed about it being shaved This is Buddy. He’s been diagnosed with spindle cell sarcoma. He’s having surgery right now to remove the mass, and will need chemo treatments afterwards. His human is a respiratory therapist battling this pandemic, and you can help them both below. 13/10\n\nhttps://t.co/pxB5kn51EB https://t.co/UHhrkVEu75 @ByKellyCohen omg @DavidDobrik i’d like to learn more about the puppy @melissa_will16 which one?? @farrahsafiakhan 🥺❤️ @htranbui ❤️ @meatballsandwi4 @maditran I CANNOT HANDLE @xCausinChaosx @KameoCA @bondjamesbond81 @maditran good work guys @seanstinstan i love that his name is Hulk This is Hulk and Stitch. Stitch was not a fan of acquiring a little brother. Now they won’t stop cuddling. Both 13/10 https://t.co/se1GbMg8EB @katl03 omg @NBCSports @JenksNBCS we love josie @bmkibler sir 🥺 @CsitkovicsPetra HAPPY BIRTHDAY BB @discoballseller @Melvin2319 ☺️\nhttps://t.co/ndd6IxJp4O @TN_sweetheart1 hehe ¨̮ RT @Melvin2319: Had me pretty friccin worried there for a hot second @dog_rates https://t.co/VrJTTtrkAd @Melvin2319 my bad my bad @bartonwillage pls forgive @BostonBeernuts 2 days continental US 😳 @kurganic yes that’s Atlas ☺️ @_Gneisha innocent @darth @IvePetThatDog great dog tbh @EvanLang the yellow is so underrated imo @newyorkperi thank you. the 5 minutes in between were very stressful @Alphaglitchgirl 🥰 ...some are good girls\n\nAvailable Now: https://t.co/ndd6IxJp4O https://t.co/MAwX3Lq0qq Not all dogs are good boys @IvePetThatDog wow confirmation from the king himself @LadyAnnaD yes it is! @newyorkperi lmao This is Ruby. She likes to pet the other dogs at daycare. 14/10 extremely relatable https://t.co/5KgOnL5kwW @cute_chop @rkenyon3 he is looking for pawtners @5kl @rkenyon3 very good but then he has to pee. a vicious circle This is Duke. He recently started his own lawn care company. Relies on rufferals so please share. 12/10 accepts pats as payment https://t.co/74q7cq8v5f @Dictionarycom @IvePetThatDog thank u gideon @nicolesam05_ they are heroes This is Wolfgang. When he was rescued, he weighed 89 pounds. He couldn’t fit through the dog door and could barely walk to the mailbox. Today, less than a year later, he’s down to 52 pounds. He still has a ways to go, but wanted to thank everyone for never giving up on him. 14/10 https://t.co/g9YIIFwSyI @cat_apult omg @AdenaAnn 😍 @torahferbs it happens @bobablueheeler @dogfather ❤️❤️❤️ @MrAndrewCotter riveting stuff RT @MrAndrewCotter: I was bored. https://t.co/bVoC0hyNzC @ketippey she looks so sweet 🥰 @AshiCruz @Hozier wouldn't miss it @scwhitley @dog_feelings alright well 🥺 @Kate07327295 ❤️❤️❤️ This is Jax. He’s been diagnosed with lymphoma at just 3 years old. Without treatment, he only has a few months. Jax is participating in a clinical trial to help future dogs fight cancer. You can give him his own chance to beat it by clicking below. 13/10\n\nhttps://t.co/JM1NUlegws https://t.co/QATeqnH5vJ @benjami68158754 legends, both of u oh to be a puppy exploring an aquarium with your best friend while it’s closed to the public https://t.co/RdIaRIqacE @tmthomasdc yes This is Peach. She doesn’t even need a haircut. Just likes that the chair spins in circles. 13/10 please spin her https://t.co/oST62K7L3E @CouRageJD @Nadeshot @Symfuhny https://t.co/WaMS39OOag @MaddisonF1 omg @katiebug1144 ¨̮ @262RUNR you're very welcome cindy This is Mac. Sometimes he misplaces his ears. Always finds them though. 13/10 https://t.co/SVEQmtCYLr @Krud @girlonetrack try turning on our notifications! we still may not show up in your feed, but you won’t miss anything 🥰 @CBCOlympics thank you canada @TeamUSA ❤️ This is Bogey. He was pupset about the Olympics being postponed until he realized that's just more time to perfect his routine. 14/10 https://t.co/uAcw789Z1z @Congleenlol he really do be This is Finn. He just went through a break-pup. Decided to get bangs. Now more confident than ever. 13/10 she doesn't deserve you king https://t.co/nwC3VTfqhN @Queen_Alicia15 @ThatsJaee you got this chichi ❤️ @JohnRush32 CONGRATS 🥰 @jmunson1024 he wants you to read it TO him @GraceGriffaton today it does @ermonacelli GRIFFEYYYYYY @c_woodside omg you took him 🥺 If anybody needs to look at some dogs for a bit, there are tens of thousands in this thread. Feel free to add your own if you haven’t already https://t.co/JFkxolE6GY @GHawe finny you are precious @kennnmorgannn https://t.co/O9nri6abnT @TheSims so spiffy @lindsalexandra @DeityAnimalResQ we love Deity @jamesrhine he launch @emilyjoypoetry oh. my. goodness. @scoob you’re gonna make me cry scoob https://t.co/AVeqMJkEVA @Xbox we’re droppin Boneyard @DellMatchPlay wow @Kate07327295 fancy paws 🐾❤️ @Ethoril i’ve been looking at this pic for 20 minutes @coconutricebear omg @katgraceg7 hello puppy theo @Schwarzenegger would definitely pet @Schwarzenegger YES OF COURSE @brinnie_bb she want pancake @4ocean that’s a dolphin @StephSanchez09 welcome bark @EugeneLeeYang Eugene 🥺❤️ @UGAAthletics b e e f y b o y @blondesocks_ everyone say bless you right now @StLouisBlues i can’t. i just can’t @RamieIsTweeting i believe u @sarahjanedigby @dogfather MURPH MAAAN hello sir @aussiesdointhgs aussie aussie aussie aussie @PethDerek this is devastating derek i might have to go private @marcussamduncan yessir @atlutdpup @ATLUTD @AmericasVetDogs Spike! thank you for joining us @taniadelrio HI BOBA @ButlerBlue3 @butleru your presence is a gift as always, Trip @reddit hi poppy how are u @eharty26 ...that's a lion @Cardanski0 hello little wise corgi friend @brihahna &lt;3 @adamlevitan i know a racecar bed when i see one @KAZurcher @dog_feelings @BlairBraverman omg the heart @haleyafair TWO DOGS WOW BLESSED @KristinInsull HAPPY BIRTHDAYY JULES In honor of #NationalPuppyDay, please reply with a pic of your puppy (all dogs are puppies). Let’s make the greatest thread of all time ❤️ @XD_Sockmonkey brilliant @allthingsorca will do @hadlee1999 @dogfather @dog_feelings very good wv dog @WinterSSB @xoROYALYTYox i heard it was full of bricks @DrMicroChem exactly, Liz, thank you @EDP445 @Chris_Geno_51 @NFL draft him cowards @ElaineHarry1 i didn’t like the way it was looking at him he is so powerful i love him. 13/10 https://t.co/8hMYrz9Km6 @hasanthehun i’m so sorry ❤️ RT @OkayJoJay: my new wfh coworker is so needy, I can’t get anything done 🙄 https://t.co/FyIeLY45GO This is Zada. She’s having a little bath before bedtime. 12/10 would protect with my life https://t.co/gptN5vAlkT @mhking but not walk pups 😌 @CALM_Taylor thank you for dogumenting the moment @Calybium @CALM_Taylor @dogatthedrivethru: “chickn nuggies”\n\n                                     4.6M 🔁 1.2B ❤️ he has every right to be there. 13/10 https://t.co/F6NM3sdLui @CapsPup good job captain @himansupation good work bailey @SypherPK that was adorable @KellieMK2 same tbh This is Sarge. He helps save injured and orphaned wildlife in his area. I’m told he loves all animals, but gets the most attached to fawns. 14/10 good boy Sarge https://t.co/Zlv65hDxxE @IvePetThatDog @karinbrulliard i do. thank you gideon @IvePetThatDog @karinbrulliard my bad https://t.co/RL0PlDJXqg @lisa_lukecart who ordered a lil blep @captainvirtue @racboog the absolute worst social distancers This is Andi and Olli. They fell asleep arguing over who gets to cuddle the chicken toy. 13/10 for both https://t.co/FzhD5cINOd This is Meeko. He's supposed to be a guard dog. Incredibly bad at it. Hasn’t scared a single person away. 13/10 would noggin pat through the fence https://t.co/GsukncAqfq @IvePetThatDog good work gideon @michaelcheque ahaha nice @Cyaski he knows but it helps to hear it from u This is Lance. He burst through the fence back there to show you his new bow tie. 13/10 please tell him he’s handsome https://t.co/8T0uRu4KUX @annielynnshea same ¨̮ This is Dilsey. She got to wear doggles during her laser therapy today. Not planning on giving them back. She looks too good. 14/10 #SeniorPupSaturday https://t.co/uagqTx9g65 @i_am_333 Diego ❤️ @JillOnSTAR omg it does This is Moe. In late January, his hind legs became paralyzed overnight due to a bulging disc on his spinal cord. Meds and physical therapy are working well, but they are expensive options. He’s doing his best to get better, and you can help below. 13/10\n\nhttps://t.co/Y7QH3s4bF6 https://t.co/r46HDFwUKr RT @IvePetThatDog: https://t.co/5nMXkkRsDN @CeceliaDunn_ 🥺❤️ @_dweebler 🥰 This is Gracie. People think it’s easy being a puppy but it’s actually exhausting. 12/10 sweet dreams baby https://t.co/PCalgn745q @IvePetThatDog gideon this is delightful news @IvePetThatDog hi pixel @cottoncandaddy he will never be a heartbroken hippo again @cottoncandaddy omfg RT @dog_feelings: the human has been working from home the last couple days. and every so often. they let me participate in the video calls… @cosmicaited they're good rolls @JillianZiemba it's true @BiologyLost those are actually his abs https://t.co/FV8ZlJkKp7 @darth THIS IS A GOOD EDIT THANK U DARTH @crissycri85 same tbh @__Arthur_Dent__ you’re not ready for this https://t.co/qSlHF2VPDt This is Tonka. It’s his first time at the park and he’s a little shy. Was wondering if you’d be his friend. 12/10 I’ve never wanted anything so bad https://t.co/t1RkfxCEfd @ayyyrad lmaoo @firesafetydogs @goosherton HI MOLLY @TheJSpence @dogfather 😌 @darth @goosherton NED THINKS THIS IS A GOOD IDEA DARTH @TrashPandaFTW @goosherton no no just give him a little chin scratch on the way out @bsbrock @goosherton Dogtor Ned This is Ned. He’ll be conducting your check-pup today. Please don’t giggle when you see him. He’s $232,000 in debt from medical school and would appreciate some respect. 13/10 https://t.co/8Hd9N3v5hm @nicolesam05_ that’s what we’re here for ☺️ @joshlrd he’s doing his best and that’s all that matters @meowmays NO WAY @jessicachunat our hearts yes This is Kratu. Every year he has the most fun ever on the agility course. This was his farewell performance, before he retires to life as a therapy dog. 14/10 please enjoy https://t.co/cCTTyd4fO3 @kasiamertuszka 😂 RT @kasiamertuszka: my boyfriend has refused to change his @dog_rates calendar for over a month now because Ellie is just THAT good of a gi… @KatieFinch5 🥰 RT @KatieFinch5: I finally put my @dog_rates sticker on and I'm so happy with it! https://t.co/E3NJia9jm1 @RebeccaWalts this is good news This is Guinness. He was found all alone with a broken front right leg and fractured humerus. It’s assumed he was hit by a car. He needs surgery to correct it before hopefully finding his forever home. You can help Guinness by clicking below. 13/10\n\nhttps://t.co/oitLOm4oGy https://t.co/zXMl8jqxhw @MichelleMylett that’s what i said @FarrellGabriell LEAVE HIM ALONE HE DESERVES IT @MarthaKelly3 good things martha @juniper_bears @tanjabrandt2 Poldi is the smol one @PeterCooper @tanjabrandt2 aha no we only rate dogs This is Ingo and Poldi. They’ve been best buds since they met. Now they do everything together. 13/10 for both pups https://t.co/AYk5zmhKHg @aksh_lcfc that could be arranged This is Skipper. He's been shipwrecked. Was wondering if you could help him get his boat back to sea so he may resume his voyage. 14/10 https://t.co/1bhjvXekRr @hayley_war copy @AlabamaVBall omg @Tabbulous @savvybride 🥺❤️ @JennyTee good @Kitsunenokuro bravo sir This is Lux. He thinks your gingerbread house has been on display far too long. If you just move it a tad he can take care of that for you. 13/10 https://t.co/GwmALKaEs5 @upulie boooooo @ballerina_maddy @TheSims that's me! @PAVGOD this is a good one @rightfromPOLAND same This is Tucker. He decided to call it an early night. Had a very busy day. Already dreaming about being on a rollercoaster. 13/10 would snuggle forever https://t.co/7pcgYeJDGO @godfatherr that’s what i was gonna say @MolsonIsMyDog @emma_raeann that is one pawsitive from the situation @darth @emma_raeann we'll be sure to keep everyone pupdated as more information comes out @mgganimal @emma_raeann we’re simply reporting what happened This is Cooper and his son, Walter. Cooper got called down to puppy school because Walter wrote “heck” on the whiteboard. That language will not be tolerated and it’s safe to say Cooper is appalled. Still 12/10 for both https://t.co/kai9NEYbzD @BatdogRookie omg @frenchnbookish they're just so good @KP5ive 13 @dangitmegan “human i lost another one do you mind?” @nochillciera he had arguably the best dog life ever ❤️ His name was Fidèle. He napped peacefully on that windowsill for over a decade. He became one of the most photographed dogs in the world, and I’m very thankful some of those photos are being shared. 14/10 https://t.co/OClsDCLqp5 RT @dog_feelings: it is really cool. that this year. i was given a whole extra day to love you @darth adopted by the rescue! https://t.co/ZHhitbblwe @darth SO MANY DARTH @JoseUbaya &lt;3 @tessa_daniellee omg hi jack @tree__sea omg toby says thank you ellie @pattonoswalt it’s what he deserves This is Toby. He’s been diagnosed with IVDD, a fast acting disease that hardened his spinal discs and left him paralyzed. He underwent a 2 hour surgery to correct it, and is going to do his best to regain complete mobility. You can help Toby below. 13/10\n\nhttps://t.co/kBS1JI7tJd https://t.co/t23Lk9HO53 @bcgoldie18 ok ok alright 🔥 @espn @warriors damn @leah44_1D yes very much This is Batman. He wasn’t happy about shower time, but then you called him the best smelling squeaky clean good boy in all the land. 13/10 https://t.co/t64bBlzaXy @oskrNYC omg @HowIBuiltThis @bllisa i’m down @devynnn9402 yes ¨̮ This is Hercules. He would like to discuss a job opportunity with you. The job is gently scratching behind his ears. It comes with many benefits and you can start immediately. 14/10 https://t.co/IDfy39VGRw @katgraceg7 🥰 @AppalachianEco @ryanmoroso @JennMacLure WHAT DID I JUST SAY @ryanmoroso @JennMacLure do not honk at the traffic cone We only rate dogs. Please don’t send in traffic cones. They’re there for a reason. Just drive around it. Thank you... 13/10 https://t.co/fTomgF6u9A This is Miller. He didn’t pass his drivers test this time but they said he can come back and try again whenever he wants. 12/10 struggled with the parallel barking https://t.co/TGM0C3Iem5 @DeVore winnie wanted me to relay that you’re very handsome @DeVore joshua take a step back so winnie can see all of you This is Winnie. She needs to tell you a secret really quick. It’s that she hopes you have a good day. 13/10 that didn’t need to be a secret but i still appreciate it very much https://t.co/Afyr1Pyv7c @ort_caroline not enough imho THIS WAS THE DOG WHO FOUND THEM LOOK AT HIS SMILE he knows he’s a hero. 14/10 https://t.co/kvAjQtgdSW @Kreesan_ i’m so sorry ❤️ @artallen8 ours too @mai49ersgirl she received 13 points out of a possible 10 points This is Skye. She was thrown from a moving vehicle and abandoned as a puppy. She ended up losing her front right leg and her front left leg never healed properly. Surgery would give her a chance at walking on her own one day. You can help her below. 13/10\n\nhttps://t.co/SPkjmfwC7O https://t.co/0FeXuUKSYa @aferociouspixie &lt;3 Our list of 15/10s has been pupdated to include Rusty. I suggest waiting until you’re alone to look through the others\nhttps://t.co/0NlOdeMwMq @_jessica_kay that’s what i do This was Rusty. For 10 years he comforted patients and staff at St. Boniface Hospital in Winnipeg. Yesterday, one day after his eighteenth birthday, Rusty passed away. Flowers and a pair of his trademark glasses were left on his favorite chair. He is our fifteenth 15/10 ❤️ https://t.co/LylNq0tCSu @qitaana exactly @unbury i also like this school is hard and she’s trying her best. 13/10 https://t.co/GYNYJXMDER @alicialbailey @kaylakoch58 https://t.co/6aKAcx8m3P @kaylakoch58 you’re very welcome! 🥰 RT @kaylakoch58: Thank you @dog_rates for the new stickerssss 👀 https://t.co/QSSMdhxEKt @ScottNations @shortlyamused yes it is @JussayEti thank u @SmithUpComedy @shortlyamused he’s doing his best This is Kicker. Nobody told him the ice would be so slippery. As soon as he got pupright he slipped again. 12/10 someone help him https://t.co/A4bL3Bv8pf @jwatsonfisher 🥰 @reallysamreed i believe u @tisme_brittany 🥰 @thenamessteph lol @CLCmusic @_Let_it_Byrne good one This is Buddy. He’s going to hold your hand. Knows you’ve got a lot going on, so just take a few breaths, and let him hold your hand. 14/10 thank you Buddy https://t.co/DMr34MU8OG @MaxFlugrath i’m so sorry ❤️ @TheGoldenRatio4 @ericalovesee “dazzling tender corg” is how my mind read DTC @ARRLittman @ericalovesee brilliant allison just brilliant @MinnesotaChills @ericalovesee 😂😂😂 @zsteelie @ericalovesee more than fair Here’s a drive thru corgi. There were only 9 chicken nuggies in her 10-piece meal so she pulled around again. Please hand over the final nuggie this instant. 12/10 https://t.co/WC7SKVjoep @cmclymer @InactionNever 😳 @JohansonReagan @JacobSMcQueen hello dogs @JohansonReagan @JacobSMcQueen aw yay glad you like it &lt;3 RT @JohansonReagan: My fiancé won Valentine’s Day this year… @dog_rates ❤️🐕👏🏼 Thank you, sweetie! https://t.co/TU3DuHHYY6 @caracantdrive drip too strong @MamyKabamy @wallytherescue a little tail wag This is Wally. He has no teeth so his tongue always sticks out. Tried his best to keep it in for the second pic, but that made his ear go up. 13/10 #SeniorPupSaturday https://t.co/eA7tRddi5G @ianrborthwick 🎫 🐕 @KSchnorrbusch omg @Jenniphr_Leigh &lt;3 @HayleyStallings thank you other thor ❤️ @The_Flame_God dude same This is Thor. The first pic is of the moment his current owner knew he was the one. Today, Thor is fighting an autoimmune reaction causing severe swelling in his leg. He needs surgery to clean it out and diagnose the issue. You can help him below. 13/10\n\nhttps://t.co/Pn1SMgizmu https://t.co/i7z7NDMUub RT @dog_feelings: i’m not sure. if you have a valentine yet. but if you don’t. my application is below https://t.co/U7dqOO0puF This is Remy and The Sheps. The Sheps look out for Remy so if you have a pawblem with Remy I suggest keeping it to yourself. 13/10 for all https://t.co/zpfDYGRmeh @notyourdearabby 💕 @NASA hi nasa @Stotab_ 😂😂😂 @newyorkperi \"MOM DID YOU MEET ANY SPACE DOGS\" @jlove1982 one of our favorite pics of all time an astronaut reuniting with her dog is all i needed to see today. 14/10 for both https://t.co/JI3D0EwTiY @AcousticTrench when’s her album dropping @ellen_bloem yes it’s just expensive 😔 @hannahcabana15 &lt;3 @SilvaAna_C lol good to hear @AwanthiVardaraj no you don't @kyrasofar we agree @SilasSchulze it's back. just please form a single file line @Very_NESSAsary yes! https://t.co/f9eyy1GVjt @notyourdearabby one at a time people Hello! We made a pink version of your favorite sticker and it’s beautiful. Limited quantities available\n\n💕 https://t.co/VKXPeeRKo2 https://t.co/2t2gyIfNJ7 @thatoneleafgirl welcome 🥰 @OCConservo who hurt u This is Theo. He hasn’t asked his crush to be his valentine yet. Would appreciate if you lowered your voice about it. He still has an entire day. 13/10 https://t.co/HSmgSJIQev @BillyFellin HAPPY BIRTHDAY JETER 🐾🎈 @torontolibrary @SJA_Canada ❤️❤️❤️ @mellyifluous @camphalfblood omg Rick look! @beautifullynerd oh i would never @nicolesam05_ &lt;3 this happens EVERY DAY and we’re just now hearing about it??? https://t.co/N298XnrIyC @camphalfblood omg @GmorningToMe @torontolibrary they're his favorite part @JortSports lmao This is Percy. He helps kids build their confidence by letting them read to him. He also loves the stories so it’s a win-win. 14/10 https://t.co/7xqrJpaLvK @TheGoldenRatio4 rest easy big cheese 💛 @DavidDobrik that was a good dog in the video @ErinOnTV as a member of the itty bitty pupper committee he also specializes in laundry @KleinschmidtJD that’s what i said This is Woods. He’s here to help with the dishes. Specifically the pre-rinse, where he licks every item he can. 12/10 https://t.co/LqjSlkMKK7 @ottoilgolden awww @JayCeeEm whoops @_brandiee_ ☺️ @samaier licked position* @jakebergstrom31 nice Here’s a good girl on her flight home. Wondering how the h*ck you got two bags of plane pretzels. Fell asleep before you could answer. 14/10 best flight ever https://t.co/8k8vg2ef17 @KatherineCTV biggins will always be my hero RT @KatherineCTV: Early frontrunner for dog rate of the year @dog_rates https://t.co/0kPrEAqqjA @mariarosee17 ❤️ @Browns i’m so sorry 🧡 @MikeeKhoury wait @sooky_tsujimoto hi percy This is Shiloh. He was found severely emaciated and deformed. The rescue that saved him knows he needs lots of love, but sadly he also needs surgery to repair a liver shunt. Shiloh deserves only the best going forward, and you can help him below. 13/10\n\nhttps://t.co/6IPgB0I0RL https://t.co/lT86sDpwV0 @madi_bue @maggiecheyenne @Graybirches tell her i said so too @SkylarAbernathy @maggiecheyenne stop being mean to Pebbles This is Pebbles. He got a carrot because he looked so h*ckin handsome in his new bow tie. 13/10 super good boy https://t.co/9NqBOOVSQj @CarlGeneMusic yes @petersagal @hankstuever @AmyArgetsinger i’m not sorry about it @brewski_o thanks for sharing it with us! ❤️ @michaelcheque too soon @_Slick__Nick_ 😂😂😂 @PatrickASchmidt same honestly This is Brewski. He was born missing a paw. Still conquered his very first jump. 14/10 cheers to Brewski https://t.co/rqJhHVS0rZ @harleebrianna omfg @andrewpfister i don't think so @miclcm73 @Alixistixis she even added \"as per her last request\" sooo @BargeChi @Alixistixis PLEASE BE PATIENT WITH HER This is Jura. It’s her first day at work. Resent her paid snoozle request in case you missed it and if someone could make sure she remains tucked in at all times that would be lovely. 12/10 https://t.co/WXMwlK8b5g @bamabulldog21 @ohheyohhihello RIGHT??? @Larrs9325 @ohheyohhihello as they should This is Pancake. She was admiring how cute you are when she had to sneeze. 13/10 say “bless you” or you’re blocked https://t.co/IbchR3iPtR @NCAAsoftball @CSUBucsSoftball thank you merle you are the best boy @ckayrun &lt;3 @Lin_Manuel LET’S GOOOOO LIN @TEDTalks hi freya ☺️ @Google @dogfather [dog tag jingles] @Arentson05 oh yes that's definitely the page he was referring to @ericaaneff thank you for sharing ❤️❤️❤️ a 5th grader wrote about our book for an assignment 🥺 https://t.co/P4BmSWVPoW @VancityReynolds @xtop nice @juniper_bears i know that part broke me @Schmiddysaurus now you know @willmollenkamp ¨̮ @jrovner ❤️ This is Millie. Two nights ago, she fell off her human’s bed during a mid-snoozle stretch and landed awkwardly, breaking the growth plate in her leg. She made it through surgery, but has a long, expensive road to recovery. You can help Millie below. 13/10\n\nhttps://t.co/JXl4hWX2Bw https://t.co/l0qxnP34vd @reddit wow if i witnessed this i’d be losing my mind i’m so proud of them 14/10 for both https://t.co/xI3jBOeXlx @AndreaAmrein7 facts @Pablezy ¨̮ This is Libby and the chronicles of falling asleep at the vet. Was even given a blanket to enhance her snoozle. 12/10 best check-pup ever https://t.co/NWbwkYxpgD You think this is funny? We only rate dogs. This is a walrus. Please be more careful. Thank you... 13/10 https://t.co/7r842Y9vZ1 @WeatherTech ❤️❤️❤️ @AandreaLleigh @dogfather i like how he specifies each is a good dog @AliceLoweecey @Twitter @hotgirlhails lmao @micropolitans he has the face for it @ItsJaaake just read him your comment https://t.co/KCC8fm0nLl This is Woody. He misplaced his neck several years ago. Life hasn’t been the same since. 14/10 please give him a ring if you find it https://t.co/agBdcE7yF8 @Nickjaggerrrr ❤️ @mydearloislane ❤️❤️❤️ @Marquessa8 @LeonVanSam welcome bark @OgExcell 🥰 @EmmaNookiebee i'm so sorry &lt;3 This is Leon. He wouldn’t play unless he was the king. Still learning all the rules but pretty sure his opponent is completely h*cked. 13/10 https://t.co/X6yFKbbEbX @THEBethDunford i’ve been talking with them since it happened. they’re the sweetest. it’s such a difficult situation This is Pooch. During a car ride, he managed to wiggle out the window and fell to the pavement below. The resulting nerve damage left his front right leg immobile. Amputation is his best option from here and you can help him get that surgery below. 13/10\n\nhttps://t.co/hjclUisamD https://t.co/GdXQ9YxwDW @PremierLacrosse @PLLWaterdogs @PardonMyTake he is the cutest meatball @penguins very well done @hollyallan__ on levels never before seen @23taylor19 fair @jtemple 😂😂😂 @SmithUpComedy same This is Teddy and Rusty. They have a symbiotic relationship in which all parties benefit, including anyone who happens to see them together. 14/10 for both https://t.co/IQjnr8kTZQ @ATLUTD @espn i’ll be printing your reply on a homemade all access to spike snuggles press pass @TheButlerBlue THAT STANCE. THE PAW ROLLS. I CANNOT @espn @ATLUTD ok well now you have to let me come confirm that. maybe with some snuggles @MLS @ATLUTD @AmericasVetDogs @atlutdpup LET’S GOOOOOO (good job soccer) @donttrythis after some internal discussion we have determined that Spot counts and we would pet (with caution) @Goose gofundme to get you a hi-hat @jyryntheactor we only rate dogs @AthenaOfNarnia talented one 13/10 https://t.co/tVBoloL2dw @CmBarbaccia @Twitter nice bandana 😌 @Twitter is this a challenge to heart every single dog pic we receive RT @dog_feelings: i just learned. i’ve been nominated for an award. this is incredibly flattering. word must’ve gotten out that i caught my… @SheRatesDogs @dogfather you're welcome @nicolelovar big fan @amandalubold NO NEED AMANDA HE IS BEST BOY @janedoe_42 everyone will understand if you show them the video Here’s a good boy getting very excited about finally catching his ball. 14/10 please say you’re proud of him https://t.co/9NXTLoX5AS @NHL @Honda @NHLonNBCSports https://t.co/8H0CzsoGPX @Dictionarycom @TheGoldenRatio4 oh we agree\nhttps://t.co/rCBYhrQrbX @SpiderMan @Xylem thank you https://t.co/ROC871R2Ip @kaileysibley can’t think of anything tbh @cormac_mcgee thank you @MaineMillennial lmao @azianperc @Xylem \"say something about the shirt i dare you\" This is Apollo and his stepdaughter Juno. They went shopping for something to keep Juno warm in the snow and this is all they could find. 13/10 for both https://t.co/ZGTosiphqu @cmclymer oh stop ☺️ @TheGoldenRatio4 the flower was too much my followers would’ve exploded This is Queso. After many years of intense research, she discovered the ideal sunbathing position. Today, her findings have been made puplic. 14/10 #SeniorPupSaturday https://t.co/RzWyENVoQ2 @alesyiaa ...really. you really thought dog rates was talking about OJ Simpson... OJ’s family has created a GoFundMe to start the rebuilding process. It’s a long journey ahead but OJ and his favorite toy are looking forward to a home again soon. You can help them by clicking the link below. Still 14/10\n\nhttps://t.co/W23Hq1Elgr https://t.co/r3tcFzVuRc https://t.co/re15NSwKux @SenSchumer damn right chuck @mariadishappy I KNOW 🥺 @Cloen_Kevin same This is Lego. He had a big day. Probably did very important puppy things. 12/10 would snuggle immediately and forever https://t.co/ZfHMMfNNMK @DogsForWillNE it's ok to cry over a good boy @StacyStrazis @LouisaCheatley @7NewsMelbourne i'm sure the first thing they did when they returned to wherever they're staying is wash it @bakakarat @LouisaCheatley @7NewsMelbourne not that has been made public @HarrySloggett orange juice harry, orange juice This is OJ. After safely evacuating, him and his family returned to their home in Wairewa, Australia yesterday to find it entirely destroyed by the fires. But amongst the rubble, OJ found his favorite toy had survived. 14/10 never letting it go again https://t.co/gx3d0P5349 @bmkibler sir that fit is fresh as hell @ruettigerr he do be making points tho @vtrpldn exactly @scotty8692 slippery slope @sason_jall jason i'm glad We still only rate dogs. Please don’t send in seals that get a little talkative when you stop scratching them. Thank you... 14/10 https://t.co/3BLE8hLJyl @LouisaCheatley @7NewsMelbourne do you happen to have more pics of OJ? 🥺 @hayeslady ❤️ @tfmadden17 @lauraaatobey at least the size of his paw This is Huck. He saw a spider. Refusing to buckle pup until it is removed from the vehicle. 12/10 perfectly reasonable https://t.co/EMWPMn7RPD @NSWRFS @CFA_Updates good girl @BruceHalperin anchoring him to the ground as we speak This is Dewi. His official weather report is that it’s a little breezy. If you can handle that, it’s a delightful day for a stroll. 13/10 thank you Dewi https://t.co/KZgLzU0mzi @IvePetThatDog @CedarBendHS CONGRATULATIONS GIDEON AND COOKIE @packers well you have to win now @BrettWillison @dogfather @dog_feelings 😂😂😂 @pipcomiccom1 @dog_feelings that she’s really good This is Chalupa. Last weekend she developed a serious uterine infection and had to have emergency surgery. She’s doing better now and claims the cone only helps her borks carry further. You can help Chalupa and her family recover by clicking below. 13/10\n\nhttps://t.co/hvqjK3jlpI https://t.co/fTPw8rISc6 @andallthatjaz1d @MichaelaOkla yes it is thank you! @therealkranz @dog_feelings &lt;3 @MichaelaOkla ¨̮ @JonH611 yessir coming pup This is Oatie. He’s just making sure you’re doing alright. There’s a lot going on right now so if you’d like a hug or maybe a snuggle he’s available. 12/10 https://t.co/FejIpFbQIN @MapleLeafs @Travis_Dermott @tysonbarrie @ZachHyman @mush__27 @AM34 how did we miss this @MapleLeafs @ZachHyman omg @emrata very stylish colombo @kimmycaaakes @jovanydavid ❤️ @XaviahAndrews omg RT @dog_feelings: the human came home today. with a new stuffed fren for me. they called it a koala. and as they knelt down to hand it over… @TomCampbell OMG RT @TomCampbell: FACT: Cats are crap at @dog_rates The Game. https://t.co/UjsRpxyQTC @LynneKelly oh no @mschanandlers well so did Vega @CoachsWifeASU the briefest of distractions for ya @JimJamesWoofs omg jimjames coming in hot @Dina_mo watch out @MichaelPhelps This is Vega. She knows the best swims start with a good dive. Hoping you got her time because that was speedy as h*ck. 14/10 https://t.co/3tBeo3qbgU @TheMERL @kcarmichael2011 @britishmuseum good duck @chrissyteigen HI PETEY @ChrissyCostanza SAMMI BB HAPPY BIRTHDAYYY @bondjamesbond81 technically it’s chonk shaming @skarletzombie you got this Noodle @kribblets omg he does This is Noodle. He tore the CCL in his left knee while playing in his yard. A simple operation can fix it, but to limit further strain he also needs to lose some weight. You can help Noodle get his surgery and encourage him to be less chonky below. 13/10\n\nhttps://t.co/1mxHBMEaJP https://t.co/CEypTH1zzc @forthegwen @childrenshealth named that because kids at the hospital always say they'd like some Company This is Lincoln and Company. Lincoln is one of the many therapy dogs who visits kids currently under the care of @childrenshealth. He helps ease their anxiety and build their confidence. Company is training to one day do the same. 14/10 for both https://t.co/zyiFuQc8Ll @s8n thank you @s8n language The song is by @ElijahMidjord and was written specifically for our video!\nhttps://t.co/BmipyJ1HNn @RoyalCanin @dogfather @IvePetThatDog they’re doing their best @Paige2psu @AnimalPlanet @RoyalCanin ...omg @EddisonKirkland @AnimalPlanet @RoyalCanin done These are the #RoyalCaninPuppies! Watch the Dog Show on @AnimalPlanet this afternoon to see who YOU chose as puppy best in show! @RoyalCanin #partner https://t.co/Scjxlz1iha @SheRatesDogs thank u 🥺 RT @dog_feelings: the best thing i did. this entire decade. was love you @brittmartin712 ¨̮ @john_nucci ❤️ no more pebbles @neveragainnope &lt;3 @xokenziemorgan aw thank youuu The Dogs of 2019 https://t.co/WzZ06yjNlH @budwife 🥺❤️ @NHLGIFs @Capitals @CapsPup @AmericasVetDogs omggg @NBCSCapitals 😳 @Puckywuckums @Capitals @CapsPup @AmericasVetDogs gotta save some stuff for IG 😉 This is Captain, the hockey pup for the @Capitals. When he’s done on the ice he’ll be a service dog for a veteran or first responder. 14/10 an honor to pet https://t.co/09XwXlsnO7 @SamanthaJPell @CapsPup @dogfather 👀 @katienolan @heroux_sam you’re on fire with these lately @heroux_sam he is the CUTEST @Claiis @heroux_sam they were just jealous, still very good @mayaashleyyy @heroux_sam omg the booties would match This is Chip. Some other dogs made fun of his booties at the park but jokes on them because his paws were toasty warm the whole time. 13/10 https://t.co/3IIp0OHwWy @TheGoldenRatio4 @CapsPup @Capitals @AmericasVetDogs 🤐 @CapsPup @Capitals @AmericasVetDogs sounds good see you then 🥰 @CapsPup @Capitals @AmericasVetDogs for a proper assessment i think i need to give you a hug @PAVGOD one of your best pav @ElaineHarry1 it’s a permanent snowflake This is Léon. He got some new sweaters for Christmas. Would ask you what you think of them but he already knows he’s absolutely serving. 12/10 https://t.co/7stRVSpLNh @merrylieb omg 🥺 @tanner825 .............no @ottoilgolden 🥰 @ssquaredmtl @cassytrussell @derptheslurp ❤️ @ChrisEvans so handsome @DKW787 ❤️ @harryarnett ❤️❤️❤️ @antoinette_325 @dogfather omg @dog_feelings i love how they make sure sebastian also has music to read RT @dog_feelings: my stuffed fren sebastian and i. have decided to go caroling. we know this involves singing well. and spreading joy. we a… @onetailatatime omfg @CapsPup captain i like your santa hat and your bow tie very much @introvertedpnw @WOWK13News i’d be a hazard on the road trying to drive through the tears @APACCONSULT @dog_feelings @WOWK13News heroes all of u\n\nthis was facilitated by Many Paws Volunteer Transport Team ❤️ @craignewman @WOWK13News 😂😂😂 This is Zeus. He was stolen from his home in Montana a few months ago. Last week he was found over 2,000 miles away in West Virginia. Since many airlines ban pitbulls, a relay team of 30 volunteers drove him all the way home in time for Christmas. 15/10 for everyone involved https://t.co/SiPVftrmL3 @SommerRay 😳 This is Dustin. He thought you looked like you needed a kiss. Thankfully he was here to provide it. 14/10 thank you, Dustin #RoyalCaninPuppies https://t.co/BLg2twSK8Q @IvePetThatDog @cmacmarie so precious @ermonacelli @dogfather @dog_feelings language @beanums9171 @RoyalCanin smooth fox terrier @IvePetThatDog @TheRealElvira @RoyalCanin that SMILE This is Elvira. She’s never been on camera before. Really enjoying all the pawblicity. 13/10 #RoyalCaninPuppies https://t.co/bZElktfhh1 @SuperiorDanW @jenalyson @ThatChristinaG i have no clue what i’m doing @SimplySeze @DrLupo @StJude h*ck cancer hi Miko @DrLupo ❤️❤️❤️ @pflynnhockey this is incredible. we’ll send you the 2020 one so you don’t miss anything ❤️ @emilyscotchtape lmao @leo_p_miller @RoyalCanin @IvePetThatDog last two tomorrow ¨̮ @_eringraham_ @RoyalCanin so is she This is Nala. She would like your attention because she has an announcement. The announcement is that she’d like your attention. 13/10 #RoyalCaninPuppies https://t.co/d9uDv8O4DW @NatashaBertrand can confirm @hitRECordJoe Joseph you have put me in a difficult position This is King. He heard a rumor about a good boy in the area. Thought he’d mosey on over in case you maybe... wanted to confirm. 14/10 #RoyalCaninPuppies https://t.co/ruB1ehImHy @disneyplus DISNEY! THE INFLATION ISN’T SUSTAINABLE @Frankee_JP @disneyplus omg the dog from the movie is in your house @olafurw @disneyplus will do Pupdate: Togo is now streaming on @DisneyPlus! Here’s some puppy Togo to celebrate 🤗 #DisneyPartner https://t.co/1V3BS64BUO @IvePetThatDog @siroccosky @taylorswift13 @RoyalCanin brb going back to Florida @siroccosky @IvePetThatDog @taylorswift13 @RoyalCanin omg i misgendered hedwig @DinaSpumoni @RoyalCanin THE WRINKLES This is Hedwig. He was excited to show his new ball what outside is all about, but it’s raining. Unsure of next steps. 14/10 we will fight the rain #RoyalCaninPuppies https://t.co/V13Tcr0XVT @melbikes @RoyalCanin @ACDogSquad :0 @emwng @RoyalCanin thank you for sharing @kmganon @RoyalCanin that’s a frog. we only rate dogs @PAVGOD @RoyalCanin pav my goodness This is Anita-Bone. I’m not kidding. She overheard you say she doesn’t have the greatest sploot in the nation. 13/10 had to prove you wrong #RoyalCaninPuppies https://t.co/rRozcJSfxF @sancheet glowing @Kafkaesque_Blog @RoyalCanin omg This is Monique. She’s not a fan of escalators. Stairs that don’t move are hard enough. 14/10 would carry any day #RoyalCaninPuppies https://t.co/EfruEvdV2v @SheRatesDogs omg congrats when are we doing the video where we swap @TeaAndPen nooo nootsy you’re perfect @CheddarNews @RoyalCanin omg she was asleep the WHOLE TIME @FlyingPhotog paul you have my permission to vote for all of them @ArtHouse @RoyalCanin 🤗❤️ @RoyalCanin @IvePetThatDog they all did so well @undrscoremaddie *whispers* same @PAVGOD ᶦⁿᵈᵉᵉᵈ @francisco_NeGo1 we encourage it If you missed it live, here’s the replay of our Royal Canin Puppy Pre-Show. Use #RoyalCaninPuppies to vote for your favorite!\nhttps://t.co/eGA2eCJUyS @xtinapittman ¨̮ @beingmich @LynneKelly @IvePetThatDog @RoyalCanin i mean how could we not @unwise @IvePetThatDog @RoyalCanin omg @IvePetThatDog @RoyalCanin i didn’t notice she was licking your shoe until now 😂 I got to hang out with @IvePetThatDog and 7 very good puppies today. We’ll be hosting the first ever Royal Canin Puppy Pre-Show tomorrow. You won’t want to miss it! #RoyalCaninPuppies #partner https://t.co/zV5VWZ66xD @diegomancusi precious beans @belarks ❤️ @robelliott6 that it makes me cry every time sometimes you all will send us a pic of your dog and the only thing you write along with it is “i wanted to show you my best friend” 🥺 @JJFromTheBronx give Suzy an extra hug from us pls ❤️ @pint_pound_pate lmao This is Benji. He was told he couldn’t bring anything from the backyard inside. Hopes you’ll reconsider when you see this h*ckin leaf. 12/10 please let him in https://t.co/hisEMXDUYD @espn @E60 the shot at the end with his awards omg @WoodChukChuk OMG @allieypop 🥰 @modestmolerat brilliant @modestmolerat of course This is Petson and his clip clop friend. They’re late for the park and Petson is a little frustrated with the lack of urgency. Still 13/10 for both https://t.co/7MvpKYERUu @_CakeBawse 🥺❤️ @LBrenneman_TD mabel you silly girl @Jack_McCrossan “🐾 The Boys” 🥺 RT @Jack_McCrossan: Been saying we’d love a dog about the house but our landlord doesn’t allow pets, so my housemate posted a letter to our… @ChildrensColo 🥺❤️ This is Eeyore. His ears haven’t stopped growing, but unfortunately, a bone in his leg has, causing others around it to curve. It’s a little painful, so he takes walks in his wagon now, but surgery can fix it. You can help Eeyore by clicking below. 13/10\n\nhttps://t.co/YfJ5eEOiC8 https://t.co/ZaJzIpztb0 @iamjaykutz @zachkiggins omfg @bryanbrosgolf we don’t rate horses @marije2410 @zachkiggins very on brand This is Louie. He stubbed his toe at the dog park and had to get a cast. Decided to cover it with a different sock each day. 14/10 a fashion icon https://t.co/zwrDc6a1pe @ArtDecider i really appreciate that @Lana i know This is Asher. He’s on his way home for the very first time. Can’t believe he has a human of his own. 12/10 never letting go https://t.co/9I0xX5uiWe @a_kimberlynn don’t you dare @jennaayy_Z i’ll take a snack @flowersinskylar i'm giving tags away to every dog i see @JuliaDemanett we're all rooting for you Koda @sharonkennett @dog_feelings oh this is tricky @danniK80 we struggled last year making them fit all dogs. this helps a lot! @giiannanicolle @British_Phantom adopts* 😉 This is Penny and June. They helped model our new bandanas and dog tags. You know your dog is the goodest, and now everyone else will too. 13/10 for both\n\nAvailable Now: https://t.co/57XWwOBFJF https://t.co/VChQ1kmCiT @TwitterMktg anytime bb @scoob HI SCOOB @RouletteReality happy to hear it &lt;3 @i_no_know_ omg &lt;3 @katsncovfefe @dog_feelings omg @scrch they are so perfect i’m losing my mind This is Augustus. His favorite song just came on. Wondering if you could turn it pup. 13/10 absolutely my friend https://t.co/grlZVQF1Bb @alisonking02 omg they are precious RT @dog_rates: This is Benny. He’s still working on crate training. A little self-conscious because other dogs his age already have the han… @hannah_k_1164 ok @caroline_szwed wow @CBBonFOX HIS BOOTIES @_nonabitoalmare just wanted to meet a whale nothing wrong with that @grahambradley91 hi lily This is Amber. Recently she became very lethargic and stopped eating. She was initially treated for anemia, but now she’s most likely fighting a bone marrow disease. She always has a toy to comfort her during tests, and you can help her below. 13/10\n\nhttps://t.co/trmWbdBwcl https://t.co/S8e2e3pdDK @IvePetThatDog only if it has dogs on it @IvePetThatDog i got my tuxedo did you get your tuxedo? @InsideEdition WOOHOO RT @InsideEdition: @dog_rates Good news, everyone! Narwhal's rescuer adopted him! https://t.co/7OwMTpCh0t @crisscrossjess FBI confiscated. too cute full story courtesy @4029news\nhttps://t.co/DIOXSC7jF3 Meet the three pups rescued from a snowy mountaintop in Utah. They were huddled together, wet and shivering, when a couple on a snowmobile stumbled upon them. There are crews still searching for their mom, but these little fellas are going to be alright. 14/10 for all involved https://t.co/suE3tlvklm @MelissaGraul omg hi bean @TheTodayShow he said https://t.co/LX4DGwC1A9 @Alex_Conroy @silas_thecorgi 🥺🥺🥺 @ArtDecider @silas_thecorgi thank you this means a lot @PrestoVision @silas_thecorgi doesn’t matter he will win This is Silas. He wanted to show you his new raincoat and announce he’s challenging the next storm he sees. 12/10 would be his backpup https://t.co/oJ1xAsdgA6 @ehartel same @l_priest20 &lt;3 @MichaelaOkla @disneyplus THAMK @_samsmith17 i believe in you @spartacat @disneyplus chills during that part @katgraceg7 @disneyplus i will not try to change your mind @JuliaDemanett @dog_feelings @disneyplus omg they should have their own sledding team @Frankee_JP @disneyplus your son is very handsome @catielimm @disneyplus i'll put in a good word @kiwikatherine_1 that's the spirit @SarahRZion same @erri_potter language @heatherfaye__ @disneyplus anytime heather @TheGoldenRatio4 @BlairBraverman @disneyplus need you to be aware of this @EmLew92 lolll @Sike1216 @disneyplus always ok to cry over good dogs @JayieTheBadger @disneyplus omg @cellarpoetree i got u @JayieTheBadger @disneyplus sleeping all day is just as courageous @TylerGambrill 🤔 good point @ktrutuncensored @crazyJakejc @disneyplus @dogfather exactly! maybe a pupgrade when it's not tied to a partnership @emilyteresa_ smh no more Togo erasure This is Togo, the mischievous pup turned sled dog legend. His heroic journey across Alaska will never again be forgotten. He's 14/10 and his story will finally be told December 20th on @DisneyPlus #DisneyPartner https://t.co/HNhy0cfZmy @JackieKingston1 @theutahfox she is now my hero too @KimandaJ @theutahfox i agree strongly @HannahLilNessen this is good This is Jackson. She runs outside every time she hears a coconut fall off the tree. They’re her favorite thing in the world. 13/10 https://t.co/COJjJ7kbog @TriBeagles TRIXIE OMG YOUR EARS @TootsieRoll @caitlynsayshii omg @jakeman517 omg @fanofthecakes hat made good @Hyundai @McAwsm we also love the dogs in your commercial just fyi @katienolan hi katie @Rebecca_Smile omg @newyorkperi that is Tayto 😌 https://t.co/SkGqiwNRph @vegaslamb damn it jerry This is Dustin. His legs work fine. He just prefers to scoot. 13/10 please clear the runway. He has places to be https://t.co/SdswhOeiZL @dankim ¯\\_(ツ)_/¯ @kayakingsmith @ansleybree_ my heart 🥺 @HoustonTexans @AmericasVetDogs @JJWatt hi sully hi JJ RT @ansleybree_: I have this on the back of my car and I get great joy out of seeing people behind me in traffic laugh and take pictures of… @notmydoggo omg @mandystlpd hey! if that happened and you followed the directions it was a faulty sticker. happy to send another if you email sales@weratedogs.com 🤗 @celiquesada of course ¨̮ All of our stickers are buy 2 get 1 free for the rest of the day! Here are some dogs hoping you’ll tell your dog they said hi 🐾\n\nshop: https://t.co/CUhV8WDpPN https://t.co/6Oev6V2Cax @Roxy_RemiTv omg @Ava_berry6 good babies thank you @Ava_berry6 i’m gonna need pics of the dogs he misses @whitedogs6 that's some good stuff right there &lt;3 @jamilkax31 @DavidDobrik YES take that David @s8n satan is the most wholesome lad i know This is Daisy. She is queen chonk of this hilltop. Been visiting it for the last 12 years. Likes to smile in every direction before she leaves. 14/10 #SeniorPupSaturday https://t.co/UGPvbr27jf RT @cmacmarie: Leave the room with my computer open for two minutes and he’s figured out how to get to ⁦@dog_rates⁩ website. Can’t wait to… @cmacmarie omg @boboosen click the video! @just1carrie @dog_feelings gonna be honest not sure how i feel about this @KatieKMcKenzie dog not included (yet) Everything on our site is 20% off starting now through Monday night. Stickers, hats, hoodies, all of it! Have fun 🐕 @bluesonder0 we figured it was more appropriate on thanksgiving rather than tomorrow 🤗 This is Apollo. At just four years old, he’s fighting stage 3 large-grade lymphoma. He needs multiple cycles of chemotherapy to have a shot at beating this. His floppy grin lights up every room he walks in, and you can help him and his family below. 13/10\n\nhttps://t.co/d3bN11lgxu https://t.co/0JcWgl6TKK @DrWesleyHsu “fifteen ten” that’s how we rate them now tom hanks has spoken @IAmVioletSkies legend @annenmaymarie she is a big girl now and the couch has nothing on her https://t.co/fKvm9vUxxQ @ElliottcMorgan exactly elliott thank you This is Toffi. She tried her best and that’s all we can ask for. 12/10 and the couch is cancelled https://t.co/dRfHhclbZL @mayia_goose confirmed https://t.co/wUdJY8vfsX @molly0003 it started out with a kiss how did it end pup like this This is Tokyo and Rio. Rio used Kiss. It was not very effective, but then Tokyo used Large Kiss. It was a critical hit. 13/10 for both https://t.co/Lr6Y0SroRD @MissLilyDoodle anytime ☺️ @IvePetThatDog thank you thank you @IvePetThatDog GIDEON THEY LOOK SO GOOD @madidavick we love him @allyhope19 🥰 @UGAAthletics what a collab @moosebitesau this is the best picture i've ever seen @vegaslamb just finding a good spot to lay down 14/10 https://t.co/3OLb1nyvld @ofekthepokeman cancer doesn’t know what’s comin This is Ranger. He was recently diagnosed with osteosarcoma. His front right zoomer has already been amputated to eliminate pain, and he’ll be undergoing chemo and a new vaccine to fight this. You can help Ranger get back to his adventures below. 13/10\n\nhttps://t.co/XrcOf67eQc https://t.co/3S4vCu86WP @NASCARonNBC @JimmieJohnson @TeamHendrick @NASCAR good choice @LesterHoltNBC @kristendahlgren @NBCNightlyNews lester omg @MomtoRox @bunsenbernerbmd @ifawAU in this case the dog actually has obsessive-compulsive disorder @KylieRWang @ifawAU take it back he’s beautiful @cazsundberg @ifawAU what else would i be referring to? This is Bear. He was abandoned as a puppy due to his OCD, but quickly found a new life as a koala detection dog. As wildfires devastate Australia’s east coast, Bear is doing his best to locate any injured or misplaced koalas. He’s their unexpected savior, and our thirteenth 15/10 https://t.co/dWe8tWbEJo @jrubinATX omg @USCDetectionDog @ifawAU hi! this may be a long shot but i was wondering if there are any pics of Bear with a koala? @rockfreakngreen lmaooo @prideflagharrie you better act surprised @CouRageJD he give u kiss https://t.co/VJs1UOfzsp @sugar____rice passed every vibe check This is Dave. He goes to hydrotherapy every week to strengthen his legs. Usually just floats around. Maybe a quick nap too. 14/10 you’re doing great Dave https://t.co/UC4QrD7O6L @Hozier sir i 🥺 @TheJRLuna yoshi hangry @Keeping_Secrets solid effort but there actually would still be boops for second place @Keeping_Secrets what would you suggest? This is Yoshi. It’s his first time at the drive thru and the car in front has been ordering for like ten minutes. If they take all the nuggets we’re gonna have a pawblem. 12/10 https://t.co/IkfCEBLyfk @Orioles @wbaltv11 hello little sir @GUESS ¨̮ This is Pixel. She was photographed before and after being told she’s the best girl in the whole wide world. 13/10 suspicions confirmed https://t.co/IYOAnJnsuH @lauriekay21 the best @jordanlucero22 oh no @jordanlucero22 what's the last part she remembers we'll rewind Thank you so much for watching #LadyAndTheTramp with us! Please remember, when you give a dog a home, you're giving them the world. This entire cast found their forever homes by the last day of filming ❤️ here’s a BTS pic of the puppies in the hats you’re very welcome https://t.co/4tlDvydK41 @funkeybaby @disneyplus she's like \"no way are you serious\" @LouiePBO @disneyplus it's ok i understand &lt;3 BULL AND PEG GOT ADOPTED TOGETHER I’M SO HAPPY FOR THEM https://t.co/Z0TUIwasLB @tine__christine @disneyplus omg yea these two chefs are my absolute favorite #BellaNotte https://t.co/zTkPYybBVm ohhh they're fallin in LOVE love https://t.co/WOvoBYita3 @KenzPend i'm very proud of him tbh @mgelpi4 he did his best after you deliver a baby you must pet the dog on the way out. everybody knows this @katiewinner @disneyplus same That is The Tramp. He’s played by Monte, a stray from New Mexico who was adopted by the end of filming. He’s mischievous but way too cute to ever be mad at. 14/10 https://t.co/EJ2LOELIPl wow Disney got really lucky every dog they cast could talk That is Lady. She’s played by Rose, who came from a rescue home in Utah. She got all her lines right the very first time, and by the end of filming was pawmoted to honorary director. 14/10 https://t.co/6J3lvHq459 We hope you and your dogs are puppared! Our live tweet party of #LadyAndTheTramp starts now. Watch along on @DisneyPlus! #DisneyPartner https://t.co/JDYsgVYIeR @Luscious0x are u kidding me 😍 @mike_moroski ah yes of course 😂 @brandacedawn simba you were supposed to wait for us 🥺 @newyorkperi @disneyplus @DisneyStudios i choose to believe they’re in love in real life too @disneyplus @DisneyStudios ...omg RT @disneyplus: Weekend Mood: A Progression. 😆➡️😴\n\nCozy up on the couch later this afternoon and live tweet with @dog_rates using #LadyAndT… @swegiebanana oh real quick. does he enjoy any specific human food? like his fav non dog treat snack? @swegiebanana it does. so much. thank you! @swegiebanana hello we’re going to be rating monte later and i was wondering if you could tell me about his favorite things to do when he’s not on set ☺️ @RicardReports correct @ForRover @PetHelpers hello other timmy @rahrahbruno same This is Timmy. He had pancakes this morning. I’m told it wasn’t a special occasion, Tim’s just a good boy who deserves pancakes. 13/10 #SeniorPupSaturday https://t.co/qYR1prweyZ @MadisontheDoggo @disneyplus @priscnieto incredible @gabbie_helm @disneyplus precious @Mmarlow_3001 we still love him @MoguelSW &lt;3 @hannahbeery 🥺❤️ @PebbleFruitty00 free trial ¨̮ @catiewils0n @disneyplus OMGGG @GeekCommentary twas me @KatelynLS_ @disneyplus cheese is a reasonable request @SpellRiver this one isn't ¨̮ @dyleoliviazella i don’t see why not @TheActualSilver 7 day free trial ;) @elvirancerise @disneyplus like the tweet! @RamazingRachel hahahaha @GlennF Glenn i wouldn’t steer you wrong @goblinbabby you’ve put me in quite the predicament goblin queen @straightchIrine anytime @linalina811 @disneyplus omg @DestinyRain12 🥺💜 @cheja SIMPLY THE BEST @kellleygreene &lt;3 @mindywhite @disneyplus it’s so good @DisneyWitch22 like the tweet and find out 🤗 @Shruti_Pathania omg albus @nnklavdianos this one isn’t ❤️ @abbierenn @disneyplus it looks like absolutely they can ❤️ this tweet to be invited to our virtual watch party of #LadyAndTheTramp this Sunday on @disneyplus. We’re going to live tweet all the magic right here! #DisneyPartner https://t.co/pdeyOKthUh @hipingsters can you please give alf a hug from us? @stopthistrain28 😂😂😂 This is Bailey. She’s already had two surgeries to remove cancerous tumors, but a third lump was discovered on her noggin last weekend. She’s the center of her human’s universe, and they’re not done fighting. You can help Bailey by clicking below. 13/10\n\nhttps://t.co/l90317x3UI https://t.co/kx01bvHykD @thisisriss16 🥰 @IvePetThatDog @MaxPGoldberg this pleases Journee @LoganCGrossman oh no This is Journee. She heard you needed a hug. Trotted over as fast as she could. 12/10 will stay as long as you need https://t.co/sVDHnOUIvo @GBMcGee @Browns fake fan\nhttps://t.co/HNhQEpNWqo @Browns he’s just so good @HamillHimself omg hi mark @barkbox this is good barkbox @obedmanuel another 🥺 https://t.co/Oau02xRBqo @obedmanuel yes, this is Papa Smurf https://t.co/6AuL4P693M @zerokiller32 yes of course @OurOcean i will relay their message 💙 @awhalefact look at him go, whalefact https://t.co/N7G2uWMsym @zachbraff ZACH HE’S WORKING ON IT Narwhal was found roaming the streets in the cold along with another older dog. The rescue that took him in is called Mac’s Mission, and you can learn more about them here: https://t.co/7bi7xlrkVW This is Narwhal. He was born with an extra tail on his forehead. It hasn’t wagged yet but he’s working on it. 14/10 always read the instructions before assembling your puppy https://t.co/ge8B0KlLa3 @LoganCGrossman IT'S THE BEST This is Bennie. He was hit by a car as a puppy and lost both his back legs. Today, his owner added skis to his assistive cart, and he couldn't be happier. 14/10 https://t.co/c45n5q1VEN @EstherThePig absolutely wasn’t him @dianamcgrawwv YAY WINSTON @MiselMostar the name’s James... Peanutbutter James https://t.co/OCl0ZcUDHk This is James. He was asked to leave the store after knocking over an aquarium to free the fish. 13/10 punished for being a hero smh https://t.co/1rnAbGb2NI @itsdougthepug @peopleschoice @DavidDobrik @bretmanrock CONGRATS DOUG RT @Lisa_Bizzle: I have watched this approximately 9,345,678 times so far today https://t.co/6ND1H1qAMF @Browns LET’S GOOO @Disney @Disneyland @disneyplus incredible @life_of_marie omg really? @BruceHalperin shaving mine in solidarity This is Kalli. She was diagnosed with hip dysplasia at just a year old. Complications have delayed her surgery, but also gave her time to perfect the shaved butt look. Her family has been trying to raise money for 10 months. You can help them below. 13/10\n\nhttps://t.co/s9B7EbbpMM https://t.co/qgm1IVVVTO @Alphaglitchgirl link pls @erinabraham08 @dog_feelings 🥰 @timopont right here bb 🥰\nhttps://t.co/XLK1SpbiGw @cherryoaktree socks coming soon 😘 @LCquieresushi 🥺❤️ @USWNT @4PawsForAbility i expect an invite to the next one @MPericonious coming very soon 🤗 (5 new designs) @beeful1 we won’t stop them @juniper_bears we would never @JinnRPh you can still tell other dogs hi ¨̮ We’ve spent the last six months perfecting everything about your favorite merch. Now the only thing softer is maybe your dog.\n\nLaunching Now: https://t.co/f9eyy1GVjt https://t.co/7Aua9TlDbQ hello we have an announcement in 10 minutes please stare at your phone until then thank you https://t.co/xtxdkgt5SX @mollllypocket legend @USWNT @4PawsForAbility omg @UT_Dallas can confirm @withahook this is a good point This is Juno. She’s new to fetch but is trying her best and that’s all we can really ask for tbh. 13/10 https://t.co/OQGFPLIbIm @CierraMarieG yep i’ll take care of it @YouTube we’re working on it @T__Rhodes @whatwouldDOOdo best pats tbh @whatwouldDOOdo oh hell yea This is Toshi. He just graduated puppy elementary. Worked so hard for this. 14/10 nobody tell him how much debt he’s in https://t.co/59aTOkjK9o @KIEM_Eric 🤗 This is Jax. His costume got lost in the mail. Didn’t arrive until today. Was wondering if everyone would be ok with celebrating again. 13/10 https://t.co/rYEzoz7eBX RT @dodo: Shelter dog can't stop jumping for joy ❤️ https://t.co/y1lqeaNd8T @edgytatar thank u @MamyKabamy this is almost the only reason we posted him @JimJamesWoofs thank you jimjames This is Riggs. Every morning he sits on the poolside with his frisbee, but today he dropped it. Wondering if you could grab it since you look closer. 13/10 https://t.co/BCPZviF8N3 @petecollard HI FRANCIS I LIKE YOUR SHIRT @NicholeDelaney5 @deafdogsrock my heart @samsam_nic Chocolate you are so beautiful @McQuackleton personally my favorite part is the comments from other dogs who donated https://t.co/GOB1dqdoi5 @fanofthecakes he drink smoothie https://t.co/dY9FovRA7h @koterlel we take retweets as well ¨̮ @curgii please confirm @Pixar This is Sid. He suffered a severe jaw injury early in life that was never addressed. It’s since healed but fused his jaw shut in the process. Now, in the hands of a loving new family, it’s time for the surgery to correct it. You can help Sid below. 13/10\n\nhttps://t.co/odjgXViwIx https://t.co/adT7wbpXNB @raisa_crespo same it's on sight @MightyCuinn97 yes This is Penny. She has degenerative myelopathy, but that didn’t stop her from dressing pup. 14/10 would jump in front of bananas for https://t.co/V11Q8VVkUe @TheHazelHayes it’s unbelievable @SaidTheSky @dogfather can i text u @vivianaaaa10 @LizziK2512 it’s a panda viv I know it’s Halloween, but we still only rate dogs. Please don’t send in any more pandas. They get sad when we can’t feature them. Thank you... 13/10 https://t.co/qDTFGMvNu3 @Anina_Hundekeks i'd say most dogs aren't happy in the cone of shame @ericandre very happy you saw this @bondjamesbond81 oh we’re just getting started @miclcm73 omfg ok you run the account now This is Benjamin. He is Froot Loops. 14/10 https://t.co/E0IRKM62MA @IvePetThatDog better now that you asked Gideon @kate_mckean ...is it not @markiplier congratulations Chica @Deadspin love this one @JMUSports @JMUFootball oh i like this @m_sieder @bondjamesbond81 more for sebastian @ThyGoddess he says it’s worth it. also their instagram is *chef’s kiss* (georgeandsebbie) https://t.co/FKaXw6DJ4Y This is Sebastian. He knows sky water tastes the best. Not sure why he’s the only one taking advantage of this. 14/10 hydrated as h*ck https://t.co/9arYMDjtuW @ParkerMolloy i’m so sorry parker ❤️ @Capitals @CapsPup @AmericasVetDogs @TheIncredibles he’s so incredibles @SeanKDLA @JimMFelton i like this we’re gonna go with this @CityOfEnyels 😂😂😂 @JimMFelton we have never been so conflicted suddenly i am injured https://t.co/KOulgbeLlr @brianna_mccrae ¨̮ @GameStop hope he’s not afraid of vacuums https://t.co/DFL0yre8nw @Physicsguru @jaketapper just to me i won’t tell anyone @jaketapper #ReleaseTheDogsName @BellaMarieCt1 @bripank nice @mackemode @bripank 🧐 We only rate dogs. Not sure why you’d bother sending in pics without a dog in them. That’s a pretty good leaf pile though... 13/10 https://t.co/yvQcFftjdK RT @dog_feelings: occasionally during our walks. someone will pass us. and completely ignore my human. but whisper hello to me. i really en… @Simmsy27 🥰 @nana_kd honestly 😂 Thank you for another incredible Corgi Beach Day! Our footage has been puploaded to our Instagram story (weratedogs). We hope you enjoy it 🤗 https://t.co/Vr9f4f0nsg @jencoleslaw damn jen you went off today This is Chance. He was rescued two years ago already missing a leg and covered in scars. He recently tore the ACL in his remaining back leg, and while he enjoys being carried everywhere, he agrees it’s time to fix it. You can help Chance below. 13/10\n\nhttps://t.co/Jzm6OXPEUW https://t.co/9fsZRJSt6M @Nationals it’s true @DDyerCareers this is a great point @bacramer8 OMG CONGRATS HELLO BB @Dee_sguise i’d say this is photoshopped but it says it’s not so idk how to explain it @kingdomtopaz good one @upulie oh damn you might be right This is Buckley. It’s his gotcha day. Claims he didn’t have any cake yet and I believe him. No evidence to the contrary. 12/10 someone get him a piece please https://t.co/crI3K0Co8P @MarnieTheDog HAPPY BIRTHDAY MARNIEEE 🎈 @MsFitztastic love this so much @Longley_59 @disneylionking top tier puns only @hann_anderson12 that’s a good thing @disneylionking IT WAS SPECTACULAR @bureaudeshame wow RT @dog_rates: This is Paddington. He lay down at the park and another pup came over and fell asleep on his tail. Please don’t excite him f… @kraftmacncheese @FamousSession omg yes @LindaofWindyOak @caitlynsayshii there’s actually a deal with the university you can pay in noggin pats This is Peach. She was going to surprise her h*ckonomics class with crayons, but nobody showed up. Still 14/10 would add her course immediately https://t.co/qA5DIaqZ0t @renee ❤️❤️❤️ @IvePetThatDog @CedarBendHS i can’t get over the hoodie @jessie_mariee96 &lt;3 @CorgiWillo WELCOME TO TWITTER WILLO WE LOVE U ❤️ @ThePianoManNick lmaooo This is Willo. She likes to awoo while she eats. Tonight’s meal was worthy of a gentler, but perhaps more meaningful, second awoo. 13/10 https://t.co/I6vWGvwEsd @CimarronDrive to be fair who wouldn't be happy as a butterfly princess @juniper_bears ...wait you’re right @MarnieTheDog @subaru_usa this is beautiful marnie @chefjoseandres OMG RUBBLE RT @heylillie: My dad sent me this video of his dogs and I cannot stop laughing https://t.co/J2HY88dedY @PatrickLenton +1 @ESPNCFB @UW_Football *nods* @pensfoundation so good @Just_Shannonnn same tbh @molly_knight @WboolPenguins RIGHT??? @murmurgolo yes we do @e_c_cheesehead @WboolPenguins we tagged the organization 🤗 @_eringraham_ @WboolPenguins this is the most appropriate reaction pic i’ve ever seen @Nateyonce https://t.co/5Gl4MfX2cY This is Tula. She’s been protecting the penguins of Middle Island in southwest Victoria for the last 8 years. Increasing their population from less than 10, to over 100. This week she retired, but not before helping train a new class of penguin protectors. 15/10 thank you, Tula https://t.co/jShGrHbzkD @nlayman12 omg This is Carolina, Dawson, Claudia, and Cecilia. They are just 4 of a litter of 9 puppies who contracted parvovirus before being rescued. Sadly, 2 have already passed, but you can help the rest of them live long happy lives by clicking below. 13/10 for all\n\nhttps://t.co/YG7y5Hbaww https://t.co/77kqltIGxd @TheGoldenRatio4 @dogfather IT YOU!!! This is Beau. He figured out how to rock back and forth all by himself. No human required. 14/10 a self-sufficient king https://t.co/lkFxdA4myk @biz hi buddy @sully_PGA 🥰 @JengyBowserMD honestly This is Kobe. He tippy tapped too hard. Got his paw stuck in his collar. Third time this week. 13/10 someone help him https://t.co/NXDozXOC3k @MSU_SA it is true @petecollard HI FRANCIS @_eringraham_ ok i’m supposed to be the expert but i need clarification. are those... This is Nami. Her tug-of-war strategy consists solely of distracting you with her four baby teeth. 12/10 it’s definitely working https://t.co/Fni1iPjwup @IvePetThatDog gideon this might be my favorite post of yours... for so many reasons @orzelc 🥰 @VictorEBulldog @therealjpiff @Fresno_State omg i am SO down RT @JournoKateH: Today I was sitting on my porch, enjoying the sunshine and the rest of my day off after returning from the memorial servic… @disneylionking very important pups @laurDIY omg these pics are magical @abbeymanning_ @msstate @BullyXXI UM I HOPE SO WHO WOULD STOP THAT FACE Attention @msstate students... I am coming to your school to talk about good dogs and hang out with @BullyXXI ☺️ https://t.co/4X28i8GIki @NASCARonNBC @Blaney i’d even say 13/10 👀 @Drift0r @JWoDesigns oh yes very good @Sergio2Drums ☺️ @DoilySpider 😂😂😂 @_AttorneyAtPaw he would like to meet Rudolph https://t.co/GAjmjFtwRv @awhalefact he says this is an honor https://t.co/6ECRfBfG9M This is Moby. He has Cerebellar Hypoplasia, which just means he wobbles. His wheels help him get where he wants to go and nothing will stop him from enjoying his first snow day. 14/10 https://t.co/mhDOEe4vbZ @FOXSports @Browns he was actually 143 this morning please correct @reddit my heart 🥺 @Ninja yessir @jonnymangs they want to show you something silly @lasmitty33 i’m so sorry ❤️ This is Francis. Earlier this year after a walk, he suffered acute heart failure and almost died. A lifesaving operation is available to repair the heart valve that ruptured, but his insurance is maxed out. You can help Francis by clicking below. 13/10\n\nhttps://t.co/63SnWX3xCR https://t.co/ZGKSHtB7mD This is Nelly. She had her first bath and her first big walk today. Would like you to know she did very well with both. 13/10 https://t.co/xvUEqQ5CqU @DXRacer you should make chairs for all the gamer dogs out there @DanielWGXA dm us more kiwi! RT @dog_feelings: today. is my stuffed fren sebastian’s second birthday. and to celebrate. we would like to see. all of your favorite stuff… @tonyhawk @Nivo0o0 @dogfather this means a lot tony thank you @radiokianna wait This is Po. She sets aside a few minutes every day to chase her tail. Regretfully, I must report that today it got away again. 13/10 https://t.co/xhKPZyeNfe @Nyree_JA 🤗❤️ This is Melly. She tried to eat a wasp. Thought it was a jalapeño sky raisin. 13/10 would boop with an ice pack https://t.co/XizHEsQOX2 @VishrutSolanki @CarmenTsoi22 don’t you dare This is Tokyo. She likes to leave her pizza in the sunlight so it’s perfectly toasty come her midday snoozle. 12/10 downright genius tactics https://t.co/PylPovRoZJ @JeffreeStar so sorry ❤️❤️❤️ @CapsPup @Capitals hi captain @ChrisEvans chris this is delightful @sarahmarie907 so considerate This is Eli. He was playing outside when he was shot from a passing car. Luckily, the bullet just missed his heart. He came home from the hospital last week in good spirits, but his family is struggling to pay the bills. You can help them out below. 13/10\n\nhttps://t.co/fRezBwGsux https://t.co/mERXpglStX @Airbnb https://t.co/Fe4XmYA6dN This is Darwin. He just heard about climate change. Super disappointed, but puppared nonetheless. Really hopes we get our shit together soon. 14/10 https://t.co/Jrc9sTpEAq @EstherThePig @GretaThunberg OMG ESTHER YOU LEGENDS @JBLaudio you bet 🤗 (also your speakers are undefeated) @starwars oh very well i’m happy to confirm that 14/10 @starwars hey star wars @R_Claw the front paw extension. absolutely breathtaking @GoJays1 thank u This is Happy. She’s here to promote her new book: Cloudy with a Chance of Tippy Taps. First 50 sold come with a pawtograph. 13/10 already preordered https://t.co/VlCOhkFoAM #NewProfilePic https://t.co/mBIfM2EKrs @MrTeddyTedster happy birthday teddy @NinjaMama617 wiggle sold separately @StephenAtHome welcome This is Kevin. Sometimes his tongue gets stuck on wiggle mode. Everything’s fine he just has to wait it out. 13/10 https://t.co/Yl5ZIZAO5Q @AaronSherwood71 @TheGoldenRatio4 i would, yes @Marvel she wants a movie @TomH7259 anytime :) @simonquinlan0 lmao @BraveButBookish omg @s8n wait a minute @fakestuffedtigr the dogs are getting better it is not our fault This is Stella. She’s a superhero. You can tell because of the cape. Main power is a cute sneeze. 14/10 definitely saved me https://t.co/F1IlGm1Cft @whereIsTheSpai @LadyLovesTaft nothing wrong with that @ashleytittle @dogfather ok Ollie it's a deal RT @ashleytittle: Devlin is delighted to be in the 2020 We Rate Dogs calendar! Ollie is happy for his success but kindly requests to be in… @cvm_msstate @BullyXXI that would be fantastic! @BullyXXI we're so glad. i'm speaking at your school next month! i hope we can meet :) @BullyXXI @SECNetwork @espn thank god @msstate is Bully ok? 🥺 @CBP @netflix the dog hates this @kathlyncterry @Hey_Noemii yes he is a responsible shopupper @beth_os4 @Hey_Noemii respect the drip karen This is Pyles. He got a new fit for his ski trips this winter. Absolutely serving. Puppared for any chilly happenings. 14/10 #SeniorPupSaturday https://t.co/vg2l8jsdL7 @andyklngnbrgr @Petplan no, they couldn’t. almost every campaign we post is because the owner’s insurance didn’t cover it for whatever reason @bunsenbernerbmd @sciencepawdcast @dog_feelings @dogfather thank you bunsen it was a pleasure @I_Dictate_Death @Twitter you're so sweet wtf @ivymorris @Twitter 😤😤😤 @jencoleslaw oh this is a good one @rochelletheriau maya that is so sweet This is Blue. Last week he started pacing back and forth struggling to catch his breath. He was rushed to the vet where they found he had a collapsed lung caused by bullous disease. He’s going to do his best to get better and you can help him below. 13/10\n\nhttps://t.co/4yuugwLhIE https://t.co/hZwT66rbdK This is Sally. She doesn’t mind complying with the “dogs must be enclosed in a container on the subway” rule because it’s truly quite fashionable. 14/10 https://t.co/Me0FPVZmyl @dan1ellenotdani nice This is Presleigh. She sneezed and both her ears went inside out. Wondering if you could please flip them back for her. 13/10 of course bb https://t.co/tX2cfcwPZc @hunterwalk my goodness @jkgadsby omg 🥺 @BruceSharkNemo 😂😂😂 This is Duke. He had a long day at the skatepark. Struggled at first but eventually persevered like the legend he is. 14/10 https://t.co/fuINrnim6R @Randomguy1017 @the_frugal_jew by a lot @foubellecherie &lt;3 @davistomm Florida Man Redemption Arc in full swing GOOD NEWS!\nNot only was Dunken adopted, but he was adopted with his friend Raisin from the same shelter. Thank you everyone for sharing ❤️ https://t.co/0oinwrwrHv @jay_pab ❤️ @debclague @jordyn__smith yea text CHOMP GRASS to 1-800-GOOD-BOY @bondjamesbond81 @jordyn__smith we’re trying to pick pup the pace. there are a lot of good dogs to get to This is Bodhi. He noticed you missed a spot with the lawn mower but have no fear he’s handling it. 12/10 https://t.co/2BNQ1boepY @darth THE DIRECTIONS ARE IN OUR NAME DARTH HOW DO PEOPLE KEEP GETTING CONFUSED @darth hi darth @tyllyn DAMN IT Listen, I know it’s the first day of fall, and that’s very exciting, but we still only rate dogs. Please don’t send in pupkin patches. Thank you... 13/10 https://t.co/mNnyzvSIcC @Browns cute dog @LizLemongrab i'm going to assume the shelter is doing the best it can with the resources it has Someone adopt Dunken so I can stop crying \n\nhttps://t.co/ZGUMJhbDXF https://t.co/4yDlzEPSzA @StephenKing yes @WIBWTyler @WVUfootball omg @ohmadjoy @HamillHimself HI VIXEN @CollegeGameDay it’s ok my invite must’ve gotten lost @gtfokaya what's your 40 time? This is Lola. She’s had three major knee surgeries in her life and unfortunately, despite being a superstar in rehab, she needs one more. She figures the universe must be very afraid of her full zoom potential. You can help her by clicking below. 13/10\n\nhttps://t.co/2GuJMV0Obz https://t.co/ainV45ojYt @KizuRai @ToddDukart @dog_feelings 😂😂😂 @GavinRamblesOn @ToddDukart @dog_feelings definitely something to consider @Katie_Erickson1 @ToddDukart @dog_feelings puplifting 🙄 RT @ToddDukart: The great debate... I bought the @dog_rates and @dog_feelings 2020 calendars, and I don't know which one to take to work (k… @ToddDukart @dog_feelings the obvious third option is to get two of each @Mrzigglez good class @iLinsterr 🤗 @macybartels ☺️ @daleblasingame she’s a star @Mazzeo the yawn 🥺 @darth @melainelagresta @_ashleyporter THE GOOD BOY LIMIT DOES NOT EXIST DARTH @I_Sheldon_31 @_ashleyporter omg finnegan @melainelagresta @_ashleyporter @darth i need that gif of me looking confused with a bunch of math on a chalkboard in the background This is Toby. He only needed to be held once during his first swim lesson today. Had nothing to do with his capabilities, he just wanted to be held. 13/10 https://t.co/oGJsk1Ktwi @ChaseHorn our only goal is to limit pawductivity @Joey_Taylor21 @buonbrisco we're here for you, Joey @pertypenny @buonbrisco omg This is Elsa and Luna. Elsa did not expect a little sister to come with so many face nibbles, noggin slaps, and food thievery, but she wouldn’t have it any other way. Both 14/10 https://t.co/WZ8KJcxFye @dog_feelings that’s what frens are for @PAVGOD @dannaleemata maybeee https://t.co/ov9PerGcfc This is Apollo. He likes to point at those with beautiful smiles who are going to have a great day today. 13/10 https://t.co/oCdx6Rn3PQ @m2jr my goodness @Pac12Network @DubsUW @UW_Football hello dubs @fanofthecakes @HounddogZenith hold on you haven’t even seen the demonstration https://t.co/LGwgQV58on This is Zenith. He is debuting his newest invention, the pupcorn hoodie. A never before seen combination of comfort and proximity to your snack. 14/10 already has it tradebarked #SeniorPupSaturday https://t.co/vZM0YMOvBA @IvePetThatDog @CedarBendHS gideon i believe u @IvePetThatDog @CedarBendHS hi miles 🥺 @UCFKnights @UCF_Football nice @overwatchleague @MLGPuckett @OverTake_OWL @SFShock 12/10 for sure @emiIygm we all get jealous @Sorrelish @bechillcomedian wtf @MightyCuinn97 his nurse, cosmo This is Teddy. He has a hereditary condition that caused his legs to grow bowed. After surgery to straighten them, his growth plates prematurely closed. Now he needs more surgery to lengthen his front legs. You can help Teddy with all of this below. 13/10\n\nhttps://t.co/hcp9OjlzKR https://t.co/bG0Zz5UZPp @haley_joyce he is very normal haley @Twitter hi twitter thanks for the career @Ellmalt ❤️ say hi to Max for me @brant please tell him i think he looks very handsome @brant he seems a tad pupset about his summer haircut 😂 @JasonmkNHL now we both are 🤗 It’s been 3 years since the interaction that started it all. So much has changed, but not the dogs. The dogs are still good https://t.co/ld7WNp0DAF @Letita_Aaron @StJudeResearch @IvePetThatDog we would love nothing more @HoarseWisperer yes that would be ours. by law you have to tell your dog they said hi @1222e506f5d748d @mytliu13 POPPY'S UNITE @DaveLeeBBC @mytliu13 how can she not be worried dave her tug of war traction has decreased This is Poppy. She lost her first tooth today. Heard if she puts it under her pillow it’ll be replaced with snacks. 14/10 hopes you’re proud https://t.co/fz2PtpHHec @CanYouPetTheDog pupdate RT @ClaysandBirds: Every year as we move away from the events of 9/11, I find the images of the towers falling don’t impact the way they us… @InqHeart ❤️❤️❤️ @Twitter YESSS @IMS @NormanPagenaud we've been waiting for this @Apple lmk if u need help promoting that pet portrait mode 👀 @jamienatkinson no way i could hold onto these for 8 months i would explode This is Luna and her daughter, Indy. Indy likes hugs and her mom is there to make sure people give them to her. 13/10 for both https://t.co/jZ9FL0eA6c RT @dog_feelings: i may have gotten bigger. but my desire to be held. has remained constant @chrissyteigen hi paul @GilletteStadium we’d love to come and confirm that 🤔 @louisepm2000 LET HER @JohnMayer i would like someone to look at me the way you look at Moose https://t.co/yeR1ZOE2gO @CatMaster13 THEY’RE BIG NOW This is Bassie. She was told to blink once if she accepts her role as flower queen, ultimate goddess of yard happenings. 14/10 #SeniorPupSaturday https://t.co/AJ2HMVhgGX @Carlainsask 🤗 @itsdougthepug thank you Doug ❤️ @darth \"THE TUMOR IS WHERE???\" @bondjamesbond81 Oscar thanks u This is Oscar. During a routine check-pup, the vet found a tumor on his butt. He needs immediate surgery followed by chemotherapy to remove it. He’s a little scared, but will try his very best to get better. You can help Oscar by clicking below. 13/10\n\nhttps://t.co/FhL4wn1W3k https://t.co/ehEgEhIPYE @vegaslamb well for starters there’s no proof he was ever even in the flower bed @minusbaby omfg This is Harry. He was caught playing in the flower bed with his bow tie on. Had a very good explanation but decided you probably aren’t interested in hearing it. 12/10 https://t.co/JrwPDfMdIc @JessicaBlevins @Ninja wake up this instant @coozie23 @dog_feelings @paigesmith009 omg This is Zeke. Whenever he’s super good he gets a watermelon snack. So excited he forgot to blink. 14/10 https://t.co/GzjUgON2P6 @s8n yea i’m gonna need to pet @s8n mayyybe @s8n nice @CUEngineering wow @adw1095 third for sure @mads_stxn @ashthompsonn1 😂😂😂 This is Indie. She had her first swim today. It could’ve gone better. 13/10 someone please get her a towel https://t.co/gvYj74ZRDr @CouRageJD you have a great day yourself sir RT @dog_feelings: beginning next year. not a day will go by. without a thought from yours truly. my calendar is available now\n\nhttps://t.co… @ArtDecider @ItsRayina flirting is hard This is Ouyu and Miyu. Sometimes Ouyu gets really excited about how much she likes Miyu and bites his head. 14/10 for both https://t.co/LFQHw0eJWw @beckygill__ yay :) @s8n 👀 @DJSant0 have a very happy birthday Leonardo 🎈 @wvuwomenssoccer can confirm @TammyCromhout omg hi timi This is Luna. Her heart has an extra tube because it didn’t close when it was supposed to. Now it’s working too hard for her little body to handle. Without surgery to correct it, she won’t see her first birthday. You can help fix Luna’s heart below. 13/10\n\nhttps://t.co/AGGhDMpyrk https://t.co/EptFL28fXT @ThatGuyS1eepy we’ve yet to define this specific tongue movement This is Nessa. She was wondering if maybe you could help her pick a flower. Any of the grey ones will do. 13/10 here you are sweetie https://t.co/bAcrAfOYXV @sophie_hawley_ @WAHFoundation_ the foundation is tagged &lt;3 @Cookhm81 @WAHFoundation_ she says she loves you too https://t.co/MkvsN8tMJ4 This is Maggie. She was shot 17 times and had her ear cut off before being rescued. Her new life consists of cuddling with her sister Mishka and showing others how to see with their heart. Last month she passed her therapy dog test, solidifying her spot among the best ever. 15/10 https://t.co/0237VHdsds @SheRatesDogs this is not the crossover we wanted michaela @NewYorker this is delightful \n@originalspinstr @clhubes @mrbillding @kaylamcmorrow he deflated @toby_gentleman calendar ᵘˢᵘᵃˡˡʸ does not come with dog @JKoljonen @kaylamcmorrow hey nice vest https://t.co/1MJi0UAds2 @Bentzburgh yes he is @heatherkh @kaylamcmorrow yes This is Duke. It’s his turn to drive the boat. Suggests you hold on. He’s about to speed pup. 13/10 punch it, Duke https://t.co/FZAl2BSAiu @danielletbd i also went to this @lilschwartzie 😂😂😂 This is Moose. He was attempting a mid-snoozle stretch. Incredibly risky while elevated. 14/10 nailed the dismount https://t.co/g9UoQPioXP @Panthers wow 😮 @IvePetThatDog gideon you should pet all 50,000 dogs in our replies\nhttps://t.co/fyMdf9KeQu @Airbnb BOOKING A TRIP IMMEDIATELY @RivingtonThe3rd omfg @DanLamothe 😭😂😭 @PGATOUR omg @luxuryxo @EverythingAtlas hello my son @TMJ4Steve OLIVE YAY ❤️ @Starbucks @curlygurl218 I SEE THAT STARBUCKS WOW @TheSims omg is he okay i’d like to hold him 🥺 @Borderlands that was a delightful rollover @mopub MoPup wow @geoff_ink wow a verified panda @AdamChudy let me introduce you to @BTS_twt @LAYS omg he is so proud of his chips @newley omg @CrankGameplays SPENCER AMONG THE FLERS @BoredNord1 any boss would understand @tomhargan do... do they have two heads @SchreiberEvan BUNNY... wait @Ubisoft IS THIS REAL @donttrythis looks like you just passed the park exit Adam @reddit that’s a googirl reddit @thechrisbarron chris how could u @reddit that’s a gooboi reddit @KatherineCTV how much for the orange ball @darth ONLY 2,500 IN 5 MINUTES DARTH WE NEED TO PICK PUP THE PACE It’s finally #InternationalDogDay! To celebrate, please reply with a pic of your dog and help me create the greatest thread of all time ❤️ @hesitantbullet i was really goin through it @Kmsmolk @southern_speech OMG 😭 @mallorydotcom @southern_speech 😏 @southern_speech good boy identifying is hard work @TimLindsey34 HI OTIS @disneyplus thank you @nouisyorkk @dog_feelings alaska you are so generous @Kiki_libra @PhilosophyDoggo hi Sadie @CitizenShipper she has a very very loving family This is Maya. She was clumsier than most puppies. It was later discovered she simply had horrible hips. She strengthened them with hydrotherapy, but after a dislocation last week, it’s clear she’ll need new ones. You can help her get them below. 13/10\n\nhttps://t.co/74sIzkOAGM https://t.co/N35j9vxRxQ @espn ok yea this is going to be delightful @roselavelle HAPPY BIRTHDAY WILMA @pinkjackieb @JohnandWinston 😂😂😂 This is Winston. It’s his birthday. Doesn’t mind if you forgot, that’s what the hat is for. Kindly requests a birthday belly rub from everyone. 13/10 please form a line https://t.co/brMuck41R4 @C_Kowalski727 😂😂😂 @Chewy @tiffanylynk i’ll have his people call your people @NonaWMackenzie SLAMMIN ON HIS GUITAR @bubblylex6 @AvrilLavigne i can’t stop laughing This is Chewy. He is a skater boy. She said see you later boy. He was way too good for her. All of her friends, stuck pup their nose. They had a pawblem with his doggy clothes. 12/10 https://t.co/jxi5YE5Pnt @ksimonetti thank you 🥰 @darth @schtherapydogs @Sotonchildhosp THE BEST WORK DARTH This is Jessie. She works at a children’s hospital teaching patients not to be afraid of certain procedures. For an echocardiogram, just lie on your back and hold your mom’s hand. 14/10 https://t.co/1VtAE74M0O @TheRealVB THANK YOU @bunsenbernerbmd @KeatonIttReal nice tag 😏 @kimberly_saltz @KeatonIttReal god damn it kimberly You cannot be serious. We only rate dogs. Please don’t send bananas. It makes our job so much more difficult. Thank you... 13/10 https://t.co/A6VccWxQPN @IvePetThatDog these are the things i like to see @helloyorick i know 🥺 This is Ace. He is a dalmatian/pitbull mix with a few words for you. These took forever without thumbs so he hopes you like them. 14/10 https://t.co/1Ba1d9aEis @RidiculousDak his name is clyde please show literally any respect https://t.co/0JotBsnAvt @caroline_szwed wow @bondjamesbond81 @Sethrogen i mean....,.,... it’s called good boys @Sethrogen how is this not about dogs seth @erinentrada 🥰🥰🥰 @bryannahrose omg Laio found her forever home this week. Thank you to everyone who shared her story and to her caretakers at the shelter for never losing hope. #ClearTheShelters ❤️ https://t.co/Oph296AEjn @JontyBaker @GeauxGrizz i only know dogs @GeauxGrizz she takes her stegosaurus everywhere 🥺 @British_Phantom just as valuable (so is a rt) @avi_edwards i support this This is Molly. She was rescued two months ago. Her first check-pup revealed pellets in her legs. Likely the result of being shot at some point. Despite her trauma she loves like crazy, and you can help her get the surgery to remove the metal below. 13/10\n\nhttps://t.co/RmNwOJiha0 https://t.co/rVYaAcwvDQ @poconoraceway @NormanPagenaud @simonpagenaud @Team_Penske @IndyCar we were honored to witness such a beautiful moment @darth DARTH HE IS SUCH A POTATO ARE YOU SEEING THIS @delaneytarr he loves you too @troyesivan catching pup @finch960 please... please elaborate This is Gnocchi. He put on his best banana button-down for the beach today. It gives him confidence. 13/10 https://t.co/6LXQI8etNl @herdingdata 🥰 @AndrewsMcMeel just so many andrews mcmeel so many @lo63012 @dog_feelings https://t.co/Owff73daOB I’m thrilled to announce we have another year of really good dogs for you. Our 2020 calendars are available everywhere now!\n\nhttps://t.co/FzopYpypmg https://t.co/udrCLM2LXa This is Remy. He stubbed his paw during his walk. Was hoping you could kiss it and make it better. 13/10 I am on my way https://t.co/QugXms7Jx3 @jeffmarcelfie omg 😂 RT @dog_rates: This is Ruby and Max. They pick up a piece of litter on every walk. Sometimes their ears get tangled, but the planet is wort… @bibliosue happy birthday! @darth @gmeanwell @stratfest EXCUSE ME YOU’RE THERE DARTH??? @samanthamc21 ¨̮ RT @dog_feelings: i’m not sure if you noticed. but i love you @gmeanwell @stratfest I'M SORRY WHAT IS THIS NOW? @anna_mcgoveran @maddisenmills hello little gus 🥺 @youarebymyside @maddisenmills dogs... can't actually use straws This is Malibu. She can’t start her day without a few sips of coffee. Maximizes her zoom levels and increases overall pawductivity. 12/10 https://t.co/WpLRbLONCZ @mollypriddy @brownislandgirl i wanna kiss her forehead This is Maya. She can’t walk like she used to, but her humans make sure she never gets left behind. 13/10 would pull anywhere #SeniorPupSaturday https://t.co/ReA4R5vqM5 @Sadokist @itskellykline pretty straightforward kelly @kcastellanos_ happy birthday ben @BriaandChrissy @ChrissyChambers ❤️❤️❤️ @CrispyToast99 honestly............. same @Arsenal3088 eh We only rate dogs. This is clearly Jesus. Please send in dogs. It really isn’t complicated. Thank you... 13/10 https://t.co/xw55QmPCoO @IMSA @roadamerica @TheArtOfRacing good boi confirmed @antibob brilliant tbh This is Jack. He discovered a new way to get downstairs. 14/10 very innovative good job Jack https://t.co/Qt0hGJkift @HALSEYAUTUMN i’m so sorry ❤️ @juliaaprag i would've cried too this is beautiful @schaefferlilly @dog_feelings everything is political @TheArtOfRacing omg @ArtDecider thank you i was a little worried @polarbearinger lolll This is Watson. He wanted a nice pic with the skyline but the wind got under his ears and he almost blew away. 13/10 please hold his paw to keep him grounded https://t.co/SjbJTtMOV3 @IvePetThatDog omg @katieebug26 omg you're so welcome! @DirtyDeRock incredible @HeyMoe018 😂😂😂 @weezyl WHAT THIS IS AMAZING @jakeman517 omg This is EXACTLY the outcome we hoped for when we made these stickers. 14/10 for all involved. Get yours below \n\nhttps://t.co/VKXPef9lMC https://t.co/YHp7lVec5W @bondjamesbond81 @tikatheiggy \"simple, elegant, yet bold. you will die\" This is Tika. She is very smol and skinny and retains almost no body heat. Decided to try a few stylish solutions. 13/10 they are all delightful, Tika https://t.co/BNzj62N6tv @Iva_T @darth @jessicaivey23 no, no he can't. my bad darth @darth @jessicaivey23 did your caps lock break? This is Vinnie. He had his first nightmare last night. Catching pup on those missed snoozles. 12/10 much more comfy now https://t.co/RCixD3HGrl @WyndhamChamp hi ethan love u RT @dog_feelings: i know there’s bad in the world. and it would be silly. to pretend it isn’t there. but for now here’s my leash. and a few… This is Milly. Every weekend she takes a trip in her sidecar to the river. People always point and smile which works great because she loves the attention. 14/10 #SeniorPupSaturday https://t.co/cVDlESmyNz @theneedledrop i mean https://t.co/g4fTIrIFl6 @MeltdownCore omg ellison you’re doing so well thank you for sharing @JackNeumeyer1 his voice carries now This is Kai. He tore his right ACL a while ago when he tried to see how fast he could go down the stairs. While that leg was healing, he tore his other ACL. Basically, his stumpy zoomers have been through a lot and you can help him recover below. 13/10\n\nhttps://t.co/Ir2eqRih8S https://t.co/9Rmtp1qlRw @SquidClaude @Angelagorash radiating confidence tbh @mgooty @Angelagorash i’ll make sure they count that one too 🥺 This is Archie. It’s his first time at the vet. Heard a rumor they count all your spots. Really hopes he has enough. 13/10 you’ll do great my friend https://t.co/5lZZGUaHXQ @GrowlyGrego ❤️❤️❤️ @_maddykj_ yep! @MatandoYT 😂😂😂 @NoemiFishman omg @UnderBri_ lmao @TheGoldenRatio4 @Brookeaporter the movie does it justice jen i will hold the box of tissues if you want @MarianaFloresM she's like \"if you want ketchpup you gotta tell me now\" @Julia_Byers OMG SO JEALOUS @molly0003 that's the sequel actually @Quasi_Political ok wow spoiler alert 🙄 @rachelgersten RACHEL IT'S SO GOOD It’s an honor to partner with “The Art of Racing in the Rain,” a movie that perfectly embodies everything we try to make you feel with this account. Please enjoy, and hug your dog when it’s done https://t.co/LwtMHq9vWC @TwitterVideo 👋🏼👋🏼👋🏼 @LoriBroach ❤️❤️❤️ @RobertSwartwood the shelter implied there was a pile of applications to sort through :) @StopOtteringMe fun fact - go fuck yourself I happened to be in NYC last weekend, and I couldn’t come home without taking a trip up Long Island to see Laio. We went for a walk, I gave her a peanut butter pupsicle, and I told her how close she is to finding a forever home. https://t.co/SfosI1NyaL @CassBabilya oh he found them @pourmecoffee 👀 @GreenieRachelle .....omg @feistybunnygirl it’s also just how he sits all the time https://t.co/0q2WXELLR7 This is Magnus. He likes to go to the park, have a seat, and point at birds. It makes him happy and he has every right to do it. 13/10 https://t.co/H5fNdam2go @gohomeben ben i like this energy This is Milo. He has initiated a pounce. Please brace for impact. 12/10 I am so ready https://t.co/hlzjzUuqHw @TheGoldenRatio4 i think twitter reassembled the thread, so we may hear from him soon @andileeq welcome @naileditnba @hbrdogs Salvador Dolly Here is a puppy who was born with a mustache. That is all. 14/10 please appreciate her https://t.co/tLeM40VjcO @Kevin_VOLone thank you kevin This is Charlie. He overheard you say he couldn’t hold eleven socks at once. Which is true, he can hold twelve. 13/10 don’t test a good boy https://t.co/oZsSTtbUrQ @livingstonlies wow i love it @bugha i like your profile pic This is Marley. She was born with a heart murmur that developed into Patent Ductus Arteriosus, which i choose to believe means she loved so much her heart couldn’t contain it. Surgery will give her a long happy life, and u can help her get it below. 13/10\n\nhttps://t.co/tzwjTB9LjI https://t.co/JUNoDBD7LZ @simonpagenaud @MenardsRacing @IndyCar @Mid_Ohio @Team_Penske omg hi cooper This is Laio. Today is her 450th day without a home. She just turned 12 and would really like to spend her golden years with you. She’s pup for adoption on Long Island, NY, and you can ask about her below. 14/10\n\nhttps://t.co/w1Ciptut4e https://t.co/X6d98k9NkR @jackflanagan_75 😂 @Wise_6 scott 🥺 @LetKatieDoIt @amazinggraceg3 do you want go to war right now @RealADC @amazinggraceg3 RIGHT?! SMUDGE! COME HERE SMUDGE. OMG This is Smudge. She likes to sing but missed a note and got embarrassed. Hopes the tongue slip makes pup for it. 13/10 it does indeed https://t.co/fruNJ2i5yA @jillybean0123 anytime 🤗 @coeysauraus @TitosVodka Atticus should give him swim lessons but only when he's ready @TitosVodka in the third pic he’s like “but did i surf well” and the next one is when everyone told him he did amazing @kirrwin bold statement but i respect it RT @PrestoVision: okay i gotta see his gopro footage https://t.co/UPvRUkaI79 @Donnarie2 @TitosVodka #releasethefootage This is Atticus. He attended the Ohana Surf Dog Competition with @TitosVodka last weekend. Would like to know how you think he did. 14/10 you were fabulous buddy #ad #vodkafordogpeople https://t.co/XewUpgAQNH @susanorlean 🥰 This is Milton. He took a break from playing with his pals because you looked like you could use a hug. 13/10 thank you Milton https://t.co/zzzscNtEYt @FieldYates we can make some of this happen @IvePetThatDog take care gideon. love you buddy ❤️ RT @IvePetThatDog: Goodbye Walter. You were my best friend. You were the best dog. I love you and will miss you. https://t.co/vosfhPHlmO @Marge101010 they often attacc in paccs @SoJhuag how did you escape????? This is Parker. He's very dangerous. Will nibble you limb from limb. Still 13/10 would pet with caution https://t.co/x7SgcKH2Zv @kennik13 omg RT @chouetterin: this animal shelter is doing a “storm the shelter” event and dressed their dogs up like aliens and it’s too cute!!! https:… @bmkibler he is so perfect for anyone wondering @IvePetThatDog hi ripley have a good day ripley @BossLofton 13 at least please cuddle them 🥺 @toddgunter still good. no more debate needed @bmkibler TIME AND PLACE BRIAN @GiveUpTheFonck ❤️❤️❤️ keep us pupdated @bondjamesbond81 retweets are free and just as much help 🤗 This is Willie. In his short life he’s already survived parvo and pneumonia. Now with a compromised immune system, he’s battling a neurological infection paralyzing his hind legs. He’s a strong little floof, and you can help him keep fighting below. 13/10\n\nhttps://t.co/eQppdR9XeA https://t.co/oZxeZkSDO0 @Anna_Rothschild “weratedogs” is ours! just made it 🤗 @Hostile_Dodo @kaisizzle “ah yes, flers” This is Bella. She really enjoys the flowers, but is often too short to see them all. Easy solution. 12/10 enjoy the view sweetie https://t.co/YeKnsLZtp5 @SaxyGiiirl ❤️❤️❤️ @ChronicleBooks @Comic_Con 🤗🤗🤗 @Braves we were waiting for you to see them 🤗 @ambergoesviolin smoltzandmaddux on Instagram :) @LaughJack15 they earned 14 points out of a possible 10 points @JenniLHoo 🤫 https://t.co/pW8hRC102z This is Smoltz and Maddux. They often match their smiles, and on special occasions they even match their shirts. Both 14/10 would protect at all costs https://t.co/gWzAe5yys1 @Mets https://t.co/9C36z7b54t @karataylorr @WrightWayRescue donated @americancanines look i am on your side @Dinglederper @dogfather omg @sahilmuthoo retweet it all This is Sasha. She used to be in charge of looking out this window. Decided to confront her replacement. 13/10 just wants to talk https://t.co/7f4vZmp1e7 @BatdogRookie omg rookie have so much fun @ericgeller @laurenngourley did you like her pun eric This is Harley. She brought you this gift because she thinks you’re one in a melon. 13/10 that’s very clever Harley thank you https://t.co/XKQrkhxkZ4 @scootmagapril 🤗🐶 @juniper_bears @ChronicleBooks this would be ideal, yes @MisterWorry @ChronicleBooks ❤️❤️❤️ @JorgeC_Cervera @ChronicleBooks @AndreaBarranco i don’t think so! see you soon! @rev_chas @ChronicleBooks AA17 as of right now 🤗 I’ll be at Comic-Con this weekend signing card games and listening to you tell me all about your own good dogs. Come say hi! #SDCC\n\nJuly 20th @ 2:30pm AA17\nJuly 21st @ 10am AA17 https://t.co/ltfqxKkKBs @themrshouse @IvePetThatDog YAY 🥰 @StLouisBlues oh this is marvelous @Shannon_Finney you can just drop in she’s free right now actually https://t.co/5qnyQhGxnj @URMascot thank you This is Harper. She found out she could stand in the lake behind her house. Now she teaches a water aerobics class every Monday morning. 14/10 https://t.co/uVXdLdcDJU @alexisnotathome same i can’t stop smiling dreams really do come true Pupdate: they do come in Mochi’s size https://t.co/Mi6hgsyL2N @katesowles wholesome @Jenna_Marbles he is so beautiful jenna @Jenna_Marbles jenna @KeithOlbermann i got you keith This is Charlie. He just turned 19 years old. Can’t believe they didn’t let him vote last year. Heading back to bed until his rights are restored. 13/10 #SeniorPupSaturday https://t.co/u6LNk23ZAT @avi_edwards i support this This is Ruca. She has Transitional Cell Carcinoma originating from a tumor in her bladder. A treatment plan to stop the tumor from growing is her best option. Her younger sister Pepper really wants her to feel better. You can help with that below. 13/10\n\nhttps://t.co/0UbwVLTMmD https://t.co/Eaa8jz6DPD @MorganPage01 he deserves to be in your thoughts all day @RedPawRelief had to bring it back RT @dog_rates: This is Penny. She would like to take a moment and teach you about determination. A stick calculating queen. 14/10 never giv… do yourself a favor and support the dog petting king https://t.co/TiKOlRNn5D @IvePetThatDog the black hoodie goes so hard gideon i’m proud of you ❤️ @IvePetThatDog yessir! launch it 🐶🚀 @darrenwatts27 have fun 🤗 @juniper_bears @4PawsForAbility i’d pay to see that tho tbh This is Kinder. Her baby teeth fell out and these new grown-pup ones came in. 13/10 can’t stop showing them off https://t.co/3LIUTDfLDH @ArianaGrande @voguemagazine congratulations Toulouse This is Shaye. She’s quite confused by all the questions. No idea what you’re ruffering to. 14/10 never seen a t-shirt in her life https://t.co/r3m6PwVhvV @ErinCald 😂 @UT_Dallas right 🤗 RT @dog_feelings: outside is larger than you think. which is why i always have my leash. so the human doesn’t get lost @MadiFenton my heart 🥺 @yashar she is flattered @ShannenLDN please give her good pats from us @ServiceDogPr @ShannenLDN omg her back feets off the ground i cannot @Equivo_Kate @ShannenLDN arguably more impressive than the sit itself! This is Heidi. She’s having a very big day. Wanted to show you her latest accomplishment. 14/10 please tell her you’re proud https://t.co/i2rJerq9dh @arrow_awsome @Pokemon i will act as if only yamper exists @Pokemon hello yamper how are you doing @abby_geniusz @STRAWBERRYWlNE he'll check his schedule @STRAWBERRYWlNE booked through next fall unfortunately This is Ludo. He’s a professional carpet snoozability tester. It’s a very difficult job but someone has to do it. 12/10 will repawt back in six hours https://t.co/TTMEOWOk4s @roselavelle i hope you do too @jedent @mom2five1 @ABC7 good dog @samglasf yes @KSJIZE @Twitter i love u too This is Fry. He’s been diagnosed with osteosarcoma, a very aggressive cancer, in his front left leg. Amputation will give him a happy, pain-free final few years and he thinks he’ll do wonderfully on three legs. You can help him by clicking below. 13/10\n\nhttps://t.co/2D2OAJWx8i https://t.co/hOCvrwvuLc @theshashthing 🥰 RT @PhilippineStar: LOOK: This cute doggo attempts to high five himself out of trouble after a guard caught him running around without a le… @PhilippineStar did it work @dearlybruhloved 😂😂😂 @WinstonTapper hello clementine @Key_Yah this is why you haven't made it as a chef @KimerieG he jumped in... https://t.co/wrFMKZIrFL @MichaelAuberry thank you Michael good luck This is Ralph. He heard a firework. Not sure if the world is ending but if it is he wanted to be with you. 14/10 i love you Ralph https://t.co/srSYedUCBI @karadefrias ok i love it but that’s a bootleg @penguins we can confirm that 13/10 @mschneider @USWNT THAT SMILE @darth @cookiethecocker WE NEED A SINGLE FILE LINE DARTH This is Cookie. His flower keeps falling off his ear, so he’s recruiting people to hold it in place for the rest of the day. 12/10 I call next https://t.co/ExaadlT58Q @AnneWheaton @ChronicleBooks don’t let Wil secretly stack the deck either @katiedidwhat @AnneWheaton @ChronicleBooks someone created a two player version where you split the deck evenly and then roll the dice. whoever’s top card has the highest rating in that category keeps both dogs. basically War but with puppies @AnneWheaton @ChronicleBooks OMG YES please also remember that a tie means all the dogs win because they’re all very good This is Mochi. He found a garden friend. Would like to know where they got those wings and if maybe they come in his size. 13/10 https://t.co/wfbk4M623w @TheGoldenRatio4 that would probably take you a while, Jen This is Marley and Max. They’re a little pupset #PrideMonth is coming to an end, but they need you to know they’ll never stop supporting you. Both 14/10 #PrideMonthPuppo https://t.co/vQpHJbQdGC RT @beccamals: My dog and I are both deaf so I try to teach her tricks in sign. I sign “nice to meet you” and then we shake paws https://t.… @IvePetThatDog @RoyalCanin he needs regular vet trips or he could get sicko mode (i’m so sorry) @Kitsunenokuro you always know where the good boy has been This is Barnaby. He visits the beach often, but had never gone for a swim until today. Hopes you’re proud of him. 13/10 bye for now Barnaby #SeniorPupSaturday https://t.co/oiq4kC5Ecb @tattooedOllie @IvePetThatDog @RoyalCanin yes of course https://t.co/voaDXIjncv @IvePetThatDog we both agree there aren’t enough dogs at #CatCon https://t.co/BPpegrtnEm @IvePetThatDog i’m omw see you soon 🐶 @darth N I C H O L A S @lmcguane it is a thing, but more expensive and in my experience, rarely covers all potential health issues (not an excuse not to get it). unfortunately, it isn't just humans we can't provide for over here @RealADC not for too long please he needs air This is Nicholas. In February, he began sneezing nonstop. A nose tumor was discovered blocking his right nasal passage, preventing him from breathing well and sleeping comfortably. He is a precious little marshmallow boy and you can help him below. 13/10 \n\nhttps://t.co/j4SscQifxp https://t.co/LE1qaIjSPN @LilNasX collab with him @lieslforbes thank you. like seriously thank you lol @DifferentHull im dead @RobertSwartwood brilliant @Zakkai rude This is Napa. Her favorite park is closed for renovations today. All the other parks just aren’t the same. 14/10 https://t.co/2NMqdhvmh8 @erinamanning omggg @Sneegsnag holy shit @Sneegsnag i like him @URMascot @sara_batres i see she was also attacked @Dee_sguise @sara_batres a jury would never convict This is Duffy. If you look closely, you can see exactly where the mud attacked him. Fortunately for the mud, there were no witnesses. 12/10 let’s get you cleaned pup https://t.co/0PgL7pdFMl @YOamanda YASSS @Molo_Lolo @chrissyteigen what’s up chrissy https://t.co/AspGqbYwCU @Dartmouth_MIH @dartmouth hi annie @lizzo i’m a little biased but i agree great thread @Dani_Marie_15 omg but same This is Valentine. He’s on his first big road trip. Trying to taste the wind in every state. 12/10 please roll down his window https://t.co/jH7HQSxX4e @builtsides thank you @Holsepticeye omg hello louie @Jack_Septic_Eye hey you hit it not sure if you’re aware This is Frida. She became Mexico’s symbol for hope after the 2017 earthquakes. It’s reported she’s located over 50 people in her long rescue career. Today, her protective gear was removed and replaced with a toy to signify her retirement and a new beginning. 15/10 #GraciasFrida https://t.co/y7VDFhlPuE @FacesPics hey thanks @RichendaSteele that is a perfect lil smudge storm welcome to the club @creilly___ WHAT OMG This is Lucy. She was born with a portrait of herself on her ear. Always has a little friend wherever she goes. 13/10 for both \n(IG: selfie_pup) https://t.co/TzPQ5hIm4Q @cedilhar omg ❤️ @Cassidy_Troy @geekologie omg we’d love to feature her again This is Annie. She doesn’t mind hydrotherapy as long as “Walking On Sunshine” plays on repeat. 14/10 #SeniorPupSaturday https://t.co/hmpqCuUo4D @Bachtiar424 omg @CrisisTextLine oh our IG story is *chef’s kiss* @TheEllenShow don’t worry i got it\nphoto creds: @AlexDiLalla @VSTMMJJ purple heart worthy @ManvilleKaren omg @Ramwoc87 seems obvious you were gone for 30 whole seconds what was he supposed to do? https://t.co/4D35hZgar4 @AlexDiLalla @Luckyoo6 @TrevorProject AMAZING This is Ron. He reserved the fountain for his pool party this evening but nobody showed up. Still hoping they’re on their way. 13/10 sit tight Ron i’m coming https://t.co/B91qAYXi10 @justawildthing happy birthday zaéda 🎈 @briansdoyle AYYY ❤️ @KPMGWomensPGA @Hazeltine he takes his duties very seriously it appears @AlexDiLalla @BuzzFeed @BuzzFeedAnimals send him a check buzzfeed @darth @AlexDiLalla HE'S BEEN PRACTICING FOR WEEKS DARTH... WEEKS This is Bodie. He’s thrilled you finally asked about his Pride pose. Been working on it for weeks. 14/10 it’s delightful Bodie #PrideMonthPuppo https://t.co/POrFmEiGWd This is Honey. He will support your online shopping habits as long as he gets to hold the box when something arrives. 13/10 a superb deal https://t.co/Trp9BP2nWX @MsJamilah__ good one This is Frank. He sneezed during his new bow tie photo shoot. Still handsome as h*ck. 12/10 bless you sir https://t.co/T7bT4eWNcx @mandydoucet @OfficialPuppers we tried 😔 @catintheschatz 🥺❤️ my heart @TheOtherTracy 🤗🤗🤗 @rmccarthy11 nice meeting you too! 💞 @golfweek can confirm @beckalina it’s hard not to just scream @ChrissyCostanza she likes the flowers chrissy everyone just wants to make sure she gets to smell them again @soIoucity @StLouisBlues what tony said @SarahSalcedo ❤️ keep us pupdated and yes, she’s had several Stitch toys throughout the years 💙 https://t.co/7p84CnWtEW This is Lilo. She has a rare form of immune cancer that developed after her recent TPLO surgery. Without treatment she only has a few weeks left. She’s been through so much with her family and all they want is to be there for her. 13/10 you can help below\n\nhttps://t.co/GXCzUgVUNy https://t.co/WCphBmCOcO @KassieRBakker 💞 @chuzx9 https://t.co/A40sHg5Pfm @iGhqsti pan* This is Bokky. He got his tail colored for the parade this weekend. Wanted to let everyone know he loves you regardless of who you love. 14/10 #PrideMonthPuppo https://t.co/cGA3AoyvX4 @MakaylaMalee @dog_feelings omg @StLouisBlues @NHL he does @TwitterMovies @mindykaling @Oprah @ReeseW omg mindy we are so honored @StLouisBlues can you tell barclay i said congrats @IvePetThatDog @TaraLymanstall they’re still so good gideon @ddgokee @TaraLymanstall you must be mistaken. we only rate dogs @josh_aslinger @TaraLymanstall goth corgi @banditXprince @TaraLymanstall take it back This is Ollie. He likes to eat bananas and climb trees, specifically in that order. Looks like a burglar but only stole my heart. 12/10 lovely pup https://t.co/D4zjdcnemN @CNN LET’S GOOO @j_t_crawford i'm so sorry &lt;3 @ChilledChaos @jessbubger “anthony why does that dog get a pupsicle and i get this egg” https://t.co/La3kx2OXxr @Veej_1 ok that's really sweet i appreciate you sir @Veej_1 this is a way better caption vijay do you want the password to the account This is Wolfie. He’s fully puppared for the toasty weather. Made sure to pack a pupsicle. 12/10 very good thinking Wolfie https://t.co/AvxQF7PBIb @Vaskeezyy @mcjelly5 awwwww This is Astrid. She had a very long day at work training to be a guide dog and was wondering if maybe you could hold her for a bit. 13/10 https://t.co/eMKdBPfgOs @KN1F3Y_McST4B easy mistake to make tbh @NintendoAmerica is Yamper a corgi be honest @thereeldavid innocent @biotech_counsel @dog_feelings omg that’s amazing @Twitch 😡 @5kl booooooooo This is Moose. He has one frozen carrot snack every day while he watches his show. Keeps him a happy healthy boy. 13/10 https://t.co/lA59FztagJ This is Parsnip. He’s the official sheriff of Pride. Forgot his badge at home. Hopes his hat is proof enough. 14/10 #PrideMonthPuppo https://t.co/YJ6Q8qIMdm @ferrie_lynn @kodikadaver 🤗\nhttps://t.co/6aKAcxpXsp @kodikadaver THEY LOOK SO GOOD @justinsimoni @jasonadamyoung comes in everything form 🤗\nhttps://t.co/jPzDDK67b4 @AUTISMDOG1 @brindaaspencerr oh you’re DUMB dumb RT @brindaaspencerr: Thread of how my day went yesterday; I saw this cute puppy running around a parking lot, he looked hot and tired so I… @IvePetThatDog nice @notnotmae @jasonadamyoung i got you bb\nhttps://t.co/3T1OqbF516 @ChrissyCostanza 13/10 for the big milk boi @jasonadamyoung thank you for the support ❤️ @athleticone01 @jasonadamyoung so fancy my goodness @reider10 omg it was so nice to meet you! RT @jasonadamyoung: In almost 30 years of car/truck ownership - I have *never* had any desire to put a sticker of any kind on my ride...\n\nU… @three_is_enuf hi Mabel @annelisejr HI BOBBIE @ambuchik 🤗 @nikkikettle3 I'M SURE HE TRIED TO NICOLE This is Jake. He decided to eat some pebbles at a baseball game last weekend. They looked delicious, so this isn’t his fault. He underwent emergency surgery to remove them, and will need medication for the rest of his life. You can help him below. 13/10\n\nhttps://t.co/0zQh8Fb64K https://t.co/sUZYEWGNW0 @shelter_jimmy ❤️❤️❤️ @CoopersChewToy they needed more pics to arrive at his true 13/10 rating ;) @CampbellGazz I KNOW (but it was their first time) @scooby_scoobert some serious redemption there, yes We asked the cast of #TheSecretLifeOfPets2 to rate some of your pets! Other than when they gave a cat a 15/10, they did a pretty good job. #partner \n\nGet your tickets now: https://t.co/GlBIOC7x20 https://t.co/vxMxstpyDn @swedoem just the hat rn 😊\nhttps://t.co/fdnyr2VRvj @marktcamp @NateMetcalf i'm gonna cry @Esyle90 @NateMetcalf sorry i couldn't help it This is Norman. He was just rescued. Heading home for the very first time. Going to do his best to rescue you now. 12/10 wonderful start https://t.co/6cp1nXyvcH @Tizmoa 😂😂😂 @LeeandLie omg jesse it is ok do not worry @NHL see but i think there can be @Jabberw77712220 take it back he's spooky This is Dallas. He’s practicing being scary. Narrowed it down to these three borks to use when protecting the household. 13/10 absolutely terrifying https://t.co/w0O6LKnxOq @ConfusedSobbing @MalloreeOrr best seller since we launched it 😂\nhttps://t.co/KoFmySuLNx @MalloreeOrr the dinosaurs on the shirt really complete the fit tbh RT @MalloreeOrr: Why does my nephew look better wearing my @dog_rates hat then I ever could? https://t.co/M44FYOvihn @happyinspirit omg i want to hug her @love_eccentrix @dog_feelings 🥺❤️ i do too @Princeton @GeosciencesPU may i come talk about good dogs at your school? @notacroc HAPPY BIRTHDAY OKO @darth @slwein SHE IS WORKING IT DARTH This is Lacey. She wouldn’t finish crossing until you got all her best angles. Her single eyebrow is on point and the people need to know. 14/10 #PrideMonthPuppo https://t.co/8ZF6JUWIW2 @c_shenanigans omg look at this haul @ErikaJGlover omg that is magical @1233Coj 😂😂😂 @WeathaMan1234 ☺️☺️☺️ @RachelLRandall just... could you tell him we all say it back @feministlinds i will relay the message @naileditnba snoopy (i’m serious) @RachelLRandall Happy #PrideMonth everyone! If your pup is sporting rainbow or simply loves more than anything else, use #PrideMonthPuppo for a chance to be featured over the next few weeks 🐶🏳️‍🌈 https://t.co/TY5WJOTjDJ @kkmac28 omfg @kiperoni omg hello @kgpennylane @darth i'm so sorry, Kim &lt;3 @ssigafoos ᶦ ʷᵒⁿ’ᵗ ⁿᵒ ʷᵒʳʳᶦᵉˢ @AnthonyDeVito yea it seems to be contagious 🥺 This is Hugo. He eats pupright because his heart is too big and it puts pressure on his esophagus. On top of that, he now needs double knee surgery to correct ruptured ligaments caused by a genetic condition. You can help Hugo with all of it below. 13/10\n\nhttps://t.co/7DTZ5MJatt https://t.co/3cuZ5Bipr5 @Buffalo_Books @dog_feelings WOOHOO 🤗 @chrismkayser @mulaney @birbigs i would support this so hard @sassyschrader so magical https://t.co/2rk5Vvfdqy This is Boris and Doug. They’ve been best friends since the day they met. Boris likes to count Doug’s spots but always loses track. That’s ok Boris. Both 14/10 https://t.co/eEFTyqrkPM @EliiiiiiiOng nope @codydawson47 @ChronicleBooks nothing is technically stopping them from playing @juniper_bears @ChronicleBooks well yea @teaandrobots @ChronicleBooks https://t.co/MCB1cTocFz Here’s another sneak peek at 4 of the 50 dogs you can “adopt” and play with in our new Card Game!\n\nBuy it Here:  https://t.co/Cy1hGWBqgz https://t.co/AYclYhnDUL @jaketapper what a throwbark @sportsluv2941 @jeffersonfenner how well do you pat a noggin? @awhalefact @jeffersonfenner she puppreciates that This is Maggie. Today she visited the ocean for the first time. A wave splashed her but she waved back to indicate no hard feelings. 12/10 https://t.co/iCaaPSOXnx @VickiLodato i’m so sorry Vicki ❤️ @LilNasX SIR @HRHighTech @gayandmediocre personally, yes We only rate dogs. Please don’t send in Bulbasaur. We’re not sure what to do with them. Thank you... 13/10 https://t.co/ZkOVEdZumd @easymac88 @NHLonNBCSports @NHL they are just so straight and shiny it’s absurd i love it The Stanley Pup is in pawsition. Enjoy the game everybody! 🏒🐶 #partner\n\nWatch Game 1 of The Stanley Cup Final Here ⇨ https://t.co/XJxbrAWHZa https://t.co/jt1nWQyaF4 https://t.co/LZfgMlb1z3 @MikeMakesRight @StLouisBlues @NHLBruins @NHLonNBCSports @GuideDogFdn language @adamgiardino wow good catch! I’m sure Doc is proud @NHLonNBCSports @TanMohammedMD @StLouisBlues @NHLBruins @NHLonNBCSports @GuideDogFdn THE BOUNCES OMGGG RT @ARS002: I am now rooting for Sunny in the Stanley Cup. That is all. https://t.co/cVioSUQo1X @nelsonwendella @StLouisBlues @NHLBruins @NHLonNBCSports @GuideDogFdn oh no we didn't think of that This is Sunny. He’s back as our Stanley Pup Correspondent. After studying the game all year, he just really hopes both teams have fun. 14/10 #partner\n\n@StLouisBlues vs. @NHLBruins \nTonight at 8pm ET on NBC https://t.co/i8bEfIqSD2 @McKellePierce omg dm us more pics! @RealAlexD they’ve been repawted to the authorities @m_soodan Bean you are doing wonderfully This is Yoshi. He took his time figuring out what to wish for. Decided he has everything he wants, so he’s wishing for all your wishes to come true. 13/10 #SeniorPupSaturday https://t.co/XaPmcxnRpj @Falconproud629 @TODAYshow @GuideDogFdn @NHLonNBCSports @NHL oh we’ll get to that 😉 @belapei @TODAYshow @GuideDogFdn @NHLonNBCSports @NHL ❤️❤️❤️ @keysmeys @TODAYshow @GuideDogFdn @NHLonNBCSports @NHL that's what he was training for This is Sunny, the @TODAYshow’s puppy with a purpose. He’s spent the last 15 months growing into his harness and training to become a guide dog for the visually impaired. You can help him complete his journey and support similar working pups below. 14/10\n\nhttps://t.co/giYI94K3aj https://t.co/jHLMK7o2z3 @PADI wow @MelserWBAL @dogfather @UMBC THE BOOTIES I CANNOT CHIEF OH MY This is Pluto. He’s strengthening his wag. Increasing his wiggle. Pupparing for maximum excitement. 14/10 please do not distract him https://t.co/5UOekvSdnh @gin_baxter @zilkerbark ❤️❤️❤️ @whenjontweets @Madison3arle other dogs rn: https://t.co/n8lQt0q22A This is Ivy. She wanted to show you the flowers she found on her walk. Hopes they’re your favorite color. 12/10 thank you so much for sharing https://t.co/f6eMTlRTVj @InHerOwnWords @_Jarachi omfg @Doodle9786 @toby_gentleman omg @smlaser @toby_gentleman Asher you are so handsome @TabithaLipkin @toby_gentleman tabitha we’re randomly selecting a few orders to get higher ratings but that’s a secret @LouiePBO @toby_gentleman get him a tag RIGHT NOW 😡 This is Toby. He shows his tongue and his new dog tag to everyone he drives by. Wants them to know he’s a certified 12/10\n\nOn sale now: https://t.co/rlg87ItYz1 https://t.co/FjSORTGHJm @filosofella @zachkiggins omfg he is wearing white slacks @AdorkableWriter @zachkiggins how dare you even suggest that 😏 This is Louie. He was told this was a black tie event. Must’ve been a prank. He’s the only one dressed pup. 13/10 jokes on them he looks fabulous https://t.co/k3fGl75Phs @IvePetThatDog (the dog) 😂 @brokeymcpoverty 😂😂😂 This is Moosey. He did his best, but it wasn’t enough. Hopes you’re still proud of him. 14/10 please give him a boost https://t.co/EEx792d6Lj @Sethrogen work it zelda @Hellcatinthe9th @Welkerbear you have pleased crook with your comment @TheOfficialWai1 @Welkerbear likely story This is Crook and her son Cashew. Cashew told her you made fun of his height. Crook wants to know why you’d make him sad like that? Both 12/10 please explain yourself https://t.co/F3xvSoikYO @MerriamWebster can't forget them @doggoneluvable sysco was definitely pointing at toffee This is Sysco. He‘s 13 years young and floofier than ever. Likes to point when he finds a new best friend. 13/10 looks like that’s you #SeniorPupSaturday https://t.co/zTL2vi3Ym6 @JackFromTally want me to read the whole campaign to you? @darth THAT'S WHAT I SAID DARTH This is Moose. He chased another animal out of his yard and got lost. He was found 6 days later stuck up to his chest in mud with a fractured pelvis. He’s happy to be home and promises never to do that again. 13/10 you can help him with his recovery below\n\nhttps://t.co/6YId7L9VXW https://t.co/0qmoNy6Lnl @mlewisPR 🤗🤗🤗 @RealGrumpyCat i’m so sorry ❤️ @ericstonestreet hi roscoe 🤗 @AlexAMackay 🤗 @NikkiWRadio i'm proud of him @kpagekirby same tbh @MelanieBree awwwww @woahbrett 6.5 actually you just reduce This is Flapjack. He will drive you wherever you want to go as long as you press the pedals. Thank you Flapjack. 13/10 better buckle pup https://t.co/grDkcyYWo5 @NerdPyle i believe her @NellieLawDog omg @lindsaybertrand @dog_feelings omg @PetsMovie @kristenkuruugaa happens to the best of us @nickasuun hello greg @LPetruny a dog would never @ruthemilyg pointy pup @misspoison0 hopefully it’s a sanctuary from the madness @tspin15 they want you to send back a pic of you with the other half of the treat like a best friend's bracelet... obviously @jennarendell1 looks like he figured out he's not actually moving when he runs @TylerDoesntKnow correct answer @rachelbkiss looks innocent To celebrate #TheSecretLifeofPets2 coming to theaters June 7th, please reply with a pic of your pet and tell us what you think they do when you’re not around. #partner @DurhamBulls omg @tlp1981 ❤️❤️❤️ This is Luna. She sticks her feet straight pup when she snoozles. Crosses them when she’s feeling fancy. 12/10 would snug softly https://t.co/XNYhzMG0KR @IvePetThatDog omg hi walter @AndrewKocher lmaooo @CallawayGolf but still noggin pats for pars @darth @USGA dogey @darth @USGA beagle* @CallawayGolf at least one snack per shot @ErinEllen1 gray jacket @Hostile_Dodo read the break perfectly This is Dale. He’s an excellent golfer. Still hasn’t figured out where the ball goes, but that’s okay. 14/10 would caddie for anytime https://t.co/qVzNXOJk88 @golfweek @McIlroyRory golfweek wait until you see the video we’re posting today 👀 @ChrisEvans wow @awessen honesty is our pawlicy @_closest_star i'm doing my best This is Paddington. He lay down at the park and another pup came over and fell asleep on his tail. Please don’t excite him for he’s trying his best not to wag. Both 14/10 https://t.co/vY5sgPz8xv @__sarahnade_ omg hi rylee @ayreies much better @ayreies don't even think about it This is Abby. She asked you to guard her blueberry while she naps. She’s saving it for later. 12/10 would protect them both with my life https://t.co/K5luhhfGu0 @lauren_lanier @karenolanier my heart @Garthokk @lostdogrescue @amazon this is a dog account @orimental so go help them :) @resanigi @lostdogrescue @amazon the pups deserve big pup bellies Two days ago, @lostdogrescue posted a pic of a nearly empty kibble cupboard. Since then you all have sent them 6 vanloads of dog food and other items from their @amazon wishlist. They will most likely be shared with other shelters in the area. You guys are incredible ❤️ https://t.co/FSWFcd8dS8 @MrHammAkins @RobertIrwin @BrotherNature @BindiIrwin @dog_feelings oh wow there are so many. i’d suggest looking up your local rescue and see what supplies they need 🤗 This is Norton. On his fourteenth birthday his hydrotherapy session received a pupgrade. 14/10 arthritis doesn’t stand a chance #SeniorPupSaturday https://t.co/U8Fd5z6n8f @starfocus @dogfather @lostdogrescue ❤️ they’re the best @vanvanthesal 😂😂😂 @amenotames SHE WOBBLES SO WELL @SarahDi44179231 she's doing her best to get better &lt;3 This is Canela. She’s been diagnosed with wobbler syndrome, which is way less fun than it sounds. A slipped spinal disc is paralyzing her back legs, but with a full neuro assessment she could begin her recovery journey. 13/10 you can help her below\n\nhttps://t.co/McqIPA2gDZ https://t.co/497FrTgvkP @MichaelaOkla he so wrinkly 🥺 @the1975 wow 🥺 @strangelove1976 YES YOU ARE MOE @daniellefishel @lostdogrescue we would never ❤️ @raileyky i don't even want the context for this This is Stella. She hates to interpupt your nap but it’s well past dinner time. Hoping you could take care of that. 13/10 yes ma’am right away https://t.co/zk4QU9ehVe @megrumham @lostdogrescue thank you Louie! @Lisertan @lostdogrescue oh no! well if that doesn’t work here is the general donation page ❤️\nhttps://t.co/d74hJepSX9 @Lisertan @lostdogrescue you should be able to select them as the delivery address during checkout https://t.co/yruyPcEGiK @chrislambden @lostdogrescue NOODLES YOU H*CKIN HERO @ahappiermurder @lostdogrescue ❤️❤️❤️ @BHWalpole @lostdogrescue omfg @Newfmamma1 @lostdogrescue thank you John and Otis @qitaana omg hey let’s stock that pantry for another 6 months! Faith, currently under their care and looking for a forever home, would really appreciate it https://t.co/oyKooE91z0 https://t.co/llodTktMas @troyesivan yo same @hitRECordJoe hello again joseph @sculiosis 😂😂😂 @primandona @chrispaul10 ❤️❤️❤️ @jakebergstrom31 @chrispaul10 incredible @darth @chrispaul10 *BOWS* @darth @chrispaul10 ZOOMA PUP LAUDE OMFG DARTH This is Pake. His parents just graduated and he was feeling a little left out. Not anymore. 14/10 barkalaureate inbound https://t.co/2BSKY8SKbQ @reddit hi melvin you are excellent @netw3rk smh @touplitil omg adorable @looneylovesyou wow @darth @BabyyGuwop LET’S GET HIM A BELL DARTH https://t.co/jR3c1mh16n @darth @BabyyGuwop HE IS PUPPARED DARTH This is Draco. He won’t stop winking at neighbors and loudly commenting on how much room there is in his pool.  13/10 would wink back https://t.co/uvGsVd19MT @Ginaius omg This is Dobby. He doesn’t mind bath time because he knows how handsome he’ll be afterwards. 12/10 for the squeaky clean king https://t.co/D2K8QuhGS1 @immi_cookie YAY 🤗 @Benjan THAT'S THE GAME WE DONE, BEN @UofOklahoma i’m omw @Veronica amazing @ZackBozBosley she was strategizing This is Remy. She’s a jenga legend. Not sure why anybody doubted her. It’s a simple game when you’re good. 14/10 https://t.co/hNc98y8mRn @epchihuahuas @MiLB ...omg @oldsongsplease @TheWordOfErynn great question @Forgotemme @TheWordOfErynn ...damn it This is Erynn. She had a very busy day at the beach. Took a sandy snoozle and found a magical ocean orb. 13/10 will never forget it #SeniorPupSaturday https://t.co/J58adbpru7 @introvertedpnw @ChronicleBooks it’s technically 8+, so they should be just fine 🤗 @MissGandaKris bless you... bless you........ bless you This is Taíno. He was found on the side of a road in Puerto Rico. It’s possible he was hit by a car, as his front right leg is severely deformed. He’s having surgery to correct it as I type this, and you can support him by clicking the link below. 13/10\n\nhttps://t.co/CFSaf0yJd2 https://t.co/0kmssIdpLG @jonday87 LET’S GOOO @ClemsonFB 12 @chelseacutler @jeremyzucker @photokohli they’re good dogs... @darth @madisonmcd3 SO PATIENT DARTH @JarrettsJeweler @madisonmcd3 *gives you the password to the account* @saraohlms @madisonmcd3 why didn't you warn him earlier This is Brody and Flynn. Flynn wanted to be as tall as Brody, but now Brody is much more susceptible to sneaky forehead chomps. 14/10 for both https://t.co/Fiz2INOHPj @kungfoo_izzy1 🤗❤️ @erinmh95 it does indeed @MichaelaMuzzy us right now trying to get it to you asap https://t.co/u14QysR2Hd @LifeOfJay98 he found a clue and this is how you treat him smh @BetaPositiveSA they esplode it could have been anyone please don’t raise your voice at him https://t.co/Ep48QjaR1j @Valkyrae so speedy @Vevosaur @stephanieeklun1 pibble 🤗 @Vevosaur @stephanieeklun1 good one @NJDevil00 hi marty! @bunsenbernerbmd @stephanieeklun1 very cool bunsen @HalfOnionInABag booooo This is Ace. His ear is standing up and it’s never done that before so he wanted to show you. 13/10 thank you Ace that is splendid https://t.co/HBjlh5vM9V @susysucks wow @terebill awwwwomg 💖 RT @terebill: ⁦@dog_rates⁩ It’s a very good day for very good puppers who were very patient waiting for their game to arrive! Lola and Mais… @ewarren happy birthday bailey @CRMCoke because i like it @waitwhoisclaire @ChronicleBooks they’re just really good dogs claire @Colts nice @Kaitie512 @ChronicleBooks you can raise that rating when you play 😋 @l3eecher @ChronicleBooks ability to boop @theskiff13 @ChronicleBooks ahead of the h*ckin game @Kinopain @ChronicleBooks no, some are good girls Our card game officially launches today! Here’s a sneak peek of just 4 of the 50 dogs you can “adopt” and play with. Buy it using the link below 🐶🎲\n\nhttps://t.co/XFBeeE9cmQ https://t.co/vXdlc9KiXs @dontidentify11 @Kel_Hari @TheSamiJoShow no @dontidentify11 @Kel_Hari @TheSamiJoShow you can’t prove that @lunar_vacation it was so perfect 🤗 @NicoleNeyStalks @TheSamiJoShow no still 12/10 @Le_tivitci @TheSamiJoShow well he's also on a diet This is Oatie. He was about to eat the flower but stopped himself. He’s too old for such churlishness. 12/10 a self control king https://t.co/uBV4lstkkx @Chris_Slater4 LOVE YOU TOULA @SportsNation speedy bois @jonisongbird @ChronicleBooks ❤️❤️❤️ @xo_french_xo 😍 @Lana @whitesox i'm losing my mind lana @whitesox i'd like a word with everyone who gave any of the dogs less than a 10 @elithedodo unstopupple zoomies @kimberly_saltz she didn't have to flex so hard This is Molly. She was born with rear-end paralysis, but just got some fancy custom booties to help her out. 14/10 she won’t stop smiling https://t.co/GSMDdCBQkI @cmcewen_4 h*ck yes connie @ebrtennisfan peel the transparent layer off 🤗 @verobotic WOOHOO @mifflangstone @Hozier ❤️ @ChrisRolph1 where do i sign for it @Rinnie1978 @Hozier there are captions @TPaningning she’s my hero @Hozier willie and i miss you very much RT @Hozier: 13/10 would meet @dog_rates again. https://t.co/8pxobajCi5 @veronicaasawyer 😋 @laurDIY honestly very impressed you spotted him @ImRileyRoo @Hozier don’t tell hozier but i was more nervous about meeting you @DeityAnimalResQ @Hozier BEST DAY EVER I met @Hozier at a dog rescue https://t.co/JtrS3Ghr9B @rachelandmax not this time :) We’ve been working really hard on a video for you. It’s very much an experiment, but please tell us if you enjoy so we can make more like it. Posting in 15 minutes ☺️ @Philip_Walker &lt;3 @Climatologist49 he was trying to help 🙄 @the1975 see you tonight 🤗 This is Louis. He just had a big dinner. Ready for bed now. Hoping you could tuck him in. 13/10 yes sir right away Louis https://t.co/rtbsqEWsZ4 @MrsHGWells i’m so sorry ❤️ @1flym picturing that makes me smile so big This is Tully. She made a new friend today. His name is Reginald and he’s kind of shy. Wondering if they could schedule a sleepover. Both 12/10 https://t.co/bS7qCzwHX5 @miguelkings11 @vickyyborrero she says emerson in the video you colossal   dumbass @hitRECordJoe hi joseph @millerlawmd yes 😏 @kimberly_saltz omg @NewYorkBound99 👀 @ChronicleBooks LET’S GOOO RT @ChronicleBooks: Only one dog can be named the Goodest Dog in @dog_rates' newest game...but not to worry: no dog will ever be less than… Our card game comes out in a week! You can pre-order now and we finally have some international availability! 🎲🐕 https://t.co/nNO1n4jXYf @KrissiAmiet 😂😂😂 @Lana @BrockOgami howdy lana @BrockOgami https://t.co/HwR7H7maU4 This is Emerson. He’s just trying to transport his large leaf. Not sure why obstacles were put in his way. 14/10 we believe in you buddy https://t.co/yXYKGajJEF @marklovar 💖 RT @marklovar: Massive thank you to @dog_rates for featuring my son in their calendar. Today is his day, he’s even blushing 💖 #WeRateDogs h… @jacksfilms jack @BarackObama tell Bo his socks are uneven but otherwise amazing pic @BlightedAlex it's all we can ask for tbh This is Esa. She’s learned that as nap frequency increases, so does the effort required to keep her tongue in her mouth. 13/10 #SeniorPupSaturday https://t.co/T1JYOLUodo @Judgemen0t i will relay the message cooper This is Stella. Her owner recently noticed she wasn’t growing properly. It was soon discovered she has an intrahepatic shunt, preventing her liver from filtering blood. Fortunately, she’s a candidate for surgery and you can help her get it below. 14/10\n\nhttps://t.co/XpS6GCtwk7 https://t.co/xeQGD8CvLf @AbominableFoMan yay! we just did a big overhaul of the way we handle things so i’m happy to hear it ☺️ @CaseyNeistat hi murray @machpe you’re welcome ☺️ @ScufGaming @OpTic_Scumper 👀 @OpTic_Scumper buzz is always a good boy @brant @kansascastle @dogfather what a handsome summer cut charlie @brant @kansascastle @dogfather hello! how is charlie? @kansascastle @dogfather @brant pippin lives on ❤️ @AGreatReadUK @ChronicleBooks WOOHOO 🎉 @00NathanD @kyrapaigee__ nice This is Beaux. He would like to box, but only if you go easy on him. Might hit you with a left hook or maybe a swift puppercut. 12/10 https://t.co/NadDw1OtHn @Fexican12 i’m so sorry ❤️ This is Luna. It’s her first time playing outside and a bee stung her nose. Not sure what she did to deserve this. 13/10 would hug softly https://t.co/ohTxRbeIz6 @jms___ @mak_betz https://t.co/VKXPeeRKo2 @Delta will do ¨̮ @Delta hello! last week my mom and little brother had the best customer service experience with Kim and Johnny, two of your special service desk reps in Cincinnati. To prove it, here is one of the many pics of Kim’s pup, Jackson, that she texted my mom later that day ❤️ https://t.co/3ToQ6P1HWc @mak_betz :))) @BSmithFlyers @scate1999 omg brian omg This is Tyson and Snickers. Over the years they have perfected the duo snoozle. Tyson always waits for Snickers to fall asleep first. 13/10 for both https://t.co/JYkUx9zNeb @malloriesullivn @dallasnews omfg @OxfordPolice what a magnificent boy @OxfordPolice did we find out if his name was waylon? @OxfordPolice *ignoring timestamp* i see you listened to me he’s innocent please release him https://t.co/W0WCJbNlXX @delaneytarr thank you This is Milo. He can’t believe he was hit by a snowball in April. Way too late for such frigid nonsense. 13/10 would chilly boop https://t.co/BZaOn0tlqS @tracerbacer7 i mean that looks pretty fun RT @IvePetThatDog: I pet Pippin. He is a 19 week old Cardigan Welsh Corgi. Pippin likes to play for 1 hour, then nap for 2. He loves people… @IvePetThatDog PIPPIN OMG @bphill021 @shinnguards @bumble that... makes me so happy @Phil_Sledge happy birthday lexie :) This is Xena. She got a new bed for her 10th birthday. Wanted to show you how she plans to use it. 13/10 many mini wags inbound #SeniorPupSaturday https://t.co/9IW4c201k4 @UrbanBumpkins 🤗❤️ @biz it is the followers who are awesome. they come through for these dogs every time ☺️ @jvail654 @heathervail1 @frozencemetery 😂😂😂 @Indigo_Leah well bulleit hit his goal and that’s all that matters 🤗 @Indigo_Leah i will never understand the motives for commenting like that @akcyclepsycho i like your beard buffy @frozencemetery the options are donate or shut the fuck up robbie @ElaineADJ ❤️ This is Bulleit. He was born with a back deformity compressing his spinal cord. As he grows it will continue to paralyze his hind end. He does a very good job with his acupuncture, but needs surgery to live a long happy life. You can help him below. 13/10\n\nhttps://t.co/WeQkEfAqD0 https://t.co/8fshzwlD61 @SockPuppetMars @MattWalshBlog don’t give him attention @CrisisTextLine @Mizzou omg hi ranger @ForRover @gofundme @TSGPPod i was STRUGGLING. major props to u sir @Great_Dayne @gofundme @TSGPPod he is so magical @PRlNCESSKlNK ❤️ go listen to me talk about how amazing all of you are ❤️ https://t.co/jPY9kSewnZ This is Cricket. Back in September, you guys raised all the money for his surgery. I finally got to meet him and his friends, and we wanted to thank you for being part of a community that’s contributed over $500k for dogs in need. He insisted all of you receive honorary 15/10s https://t.co/Pzr1b5jBbH RT @TeganG_: Sooo... I found a puppy in a ditch on my way to work this morning. How was your day?! https://t.co/JPJJqUz3kJ @tsmom1219 :) @OpTic_Scumper omg he looks like a great listener tbh @blissdaya @lindseyjanelle_ do they look like bunnies abby This is Ruby and Max. They pick up a piece of litter on every walk. Sometimes their ears get tangled, but the planet is worth it. Both 14/10 https://t.co/GnDxanAsAF @calvinstowell @sweetappelpie HI FINN This is Gwendy. She has lupus, so she needs to wear doggles and sunscreen whenever she plays outside. Doesn't seem to mind it. Actually quite stylish. 14/10 https://t.co/weXcscWJAL @MsWakilbe wow @RedfordNBaxter 😂😂😂 @Kurokodairua 😍😍😍 @hottierockstar ok tell them i said hi but also that i love them @hottierockstar omg are the pups ok??? @cht_mgmtprof that was limited, but there are a lot of requests to bring it back, so we'll keep everyone pupdated :) @stasiuuuuhh which ones did you get??? @s_campbell7817 just pass them We finally restocked your favorite sticker. Now all the dogs will know you’re thinking of them \n\nhttps://t.co/6aKAcx8m3P https://t.co/cOnKBebXJl @hess_clint phodography This is Corgi Beach Day. It was delightful. 14/10 for everyone. See you next time! https://t.co/YWxauy7Wej @KPCBrass so am i @LiamMcCullough2 😳 @miragonz congratulations ily RT @miragonz: today is tycho's day in the @dog_rates calendar please congratulate her https://t.co/TKbtBs8zzt @OpTic_Scumper that’s the spirit king @caroline_szwed cash you are looking v handsome this evening @bunsenbernerbmd just checked with the dogtor and you're correct bunsen This is Paisley. She’s been diagnosed with chylothorax, a condition causing fluid buildup around her heart and lungs. She underwent a massive four-part surgery yesterday, and could really use your support. You can help the best girl beat this below. 13/10\n\nhttps://t.co/1NFyE96rU1 https://t.co/mHMUdB1lHo @collspahn you’re welcome @KallieK11 🤗 This is Kishi. She called dibs on that chair five years ago and they’re still in effect today. Her tail is a little longer but it looks like she’s wearing the same socks. 12/10 https://t.co/cgnb0nIekI @TwitterVideo can confirm @IAmSteveHarvey hi steve @darth :o @hypatiadotca @dogfather i spent 20 minutes trying to cut it perfectly @darth BIG AGREE DARTH This is Faye. She wanted to bring a little sunshine into your life. Heard it can help with the happiness. 14/10 thank you so much Faye https://t.co/xVB12MOX86 @KaleyKinsel but so good This is Jimi. He’s just making sure you didn’t forget him in the tub. Would love to be dried off now please, if it’s not an inconvenience. 12/10 of course Jimi right away https://t.co/Kwh2dVxERe @jacob1973 @nathanwpyle strong agree @forsgroup omg @IvePetThatDog how are the cats today sir? @vanvanthesal that’s Khaleesi 🤗 https://t.co/OSjGCuPRvi Very funny April Fools’ joke guys, but seriously please stop sending in pics without dogs in them. We only rate dogs. Thank you... 13/10 https://t.co/x0FQHJh7uy @IvePetThatDog 😂😂😂 hey Nigel @Starbucks actually do it starbucks do not mess with my heart @Wevans0987 omg RT @davanlanee: her little smile :,) https://t.co/69K8tuEOSs @josephruscitti @Beauford31 my goal was everyone @bondjamesbond81 @Beauford31 that’s cheating This is Beauford. He just got a brand new banana bandana. Smiles whenever you try to say that three times fast. 13/10 #SeniorPupSaturday https://t.co/BT0xOP7jrP @SarahLauch @livelikeroo on it @davemusson omg 😂😂😂 @caroltoddnyc @dog_feelings milton says thamk u https://t.co/dncBWPV1lP Meet Milton. He was diagnosed with bone cancer in his back right leg. The amputation was successful, but he has a long road of chemo ahead. He’s doing his best to beat this and says exploring on four legs was too easy anyway. 14/10 you can help him below\n\nhttps://t.co/jJ8WJdq6yQ https://t.co/KqcUveLo0g @kaaaaaiden https://t.co/CAmeRp64ps @dreaasays @Dumbo 🐘❤️ @actualvargas @Wikipedia @SoyOtroLuis can confirm @Dumbo @luuzx_ me going to get him all the feathers https://t.co/nUylcMtuJh @darth @Dumbo @luuzx_ NOT JUST FLY DARTH... HE CAN SOAR @tangotime92 https://t.co/IIXFfmokDk @Phil_Sledge @Dumbo @luuzx_ francisco told me they are his inspiration @AcumiTheReaper @pattimelt95 @Dumbo @luuzx_ runnerpups* and that would be difficult since it was a 25,000-way tie for second place @pattimelt95 @Dumbo @luuzx_ it was so much fun patti This is Francisco. He came forward during our search for magical ears like #Dumbo. Claims he’s only tripped over them once. 13/10 can probably hear a caterpillar cough #ad https://t.co/61cWD1yMYD @elephantactics that’s exactly how i type when i see a dog @jocelynseip thank you for this @DantRagee lmao @katienolan i'm just so proud of her @darth I THOUGHT SHE WASN'T GOING TO MAKE IT DARTH BUT SHE DID @RedPawRelief she is my hero This is Penny. She would like to take a moment and teach you about determination. A stick calculating queen. 14/10 never give pup https://t.co/ejvzyJMjr9 @LouisvilleBSB can i come? @WyndhamChamp @Sedgefield1926 omg hi zeke @dnanderson @Dumbo maybe next time :/ @KatHennessy01 @Dumbo a pupfessional @dnanderson @Dumbo only dogs sorry @Dumbo well hello there @flparrothead @Dumbo incredible @kono_in_orlando @Dumbo ...omg In honor of #Dumbo coming to theaters Friday, please reply with pics of your dog if you think they have exceptional ears like him. The winner will be rated Thursday! #ad https://t.co/bdhssfYDqC @SpikeTheBeetle omg @Teilo_tw ❤️ @AshleyJPL @Mayor_Max omfg I’m speaking at Christopher Newport University tomorrow night and this flyer for it implies I am a golden retriever puppy. The bar could not be set higher https://t.co/Gdy2f0zfJP @yashar @Dumbo i saw a few people tag you! but i apologize i'll do better This is Thor. He thought he was going to the park. Even brought his teddy bear. But you just passed the park exit, and now he’s refusing to look at you. 12/10 please turn around this instant https://t.co/CEfF5Ezq9Y @TwitterMovies @Dumbo :) https://t.co/6QRCllTPaf @sw1sh_and_flick @Dumbo is not @Britta_Bee12 https://t.co/dZ9pTd8ygQ @Dumbo OMG HI DO YOU LIKE MY PROFILE PIC I PUT HIM ON MY HEAD ☺️ @Andr33928879 @Dumbo look closer This is #Dumbo. He's not like the other dogs. Seems to be a fan of feathers. Curly nose. Simply exceptional ears. Could perhaps even use them to fly. 14/10 would protect at all costs. #ad https://t.co/KzJ9gEgMfL @JGhosty @Ninja https://t.co/xVclHqFWt8 @kimmysdaydreams 😂😂😂 @Razi_Films ball is in your court sir @BetoORourke @TMB_DIGGY @stumpyalice omg @stumpyalice i just love her so much This is Alice. Without your undivided attention she could explode. 13/10 not sure why you’d risk it https://t.co/NgvklFUJKB @USCocksman good boy hank @bmkibler ❤️ @CristinaVee omg @ambrown75 he’s had quite a journey This is Rowan. He fell and hurt his paw during a hike. A fancy custom brace is helping him walk around right now, but he’ll need surgery and physical therapy to get back to 100%. He’s still in very good spirits and you can help him get better below. 13/10\n\nhttps://t.co/tSnbZudV8h https://t.co/mv7IpR57Sx @darth @maireadlynn GIVE 👏 HIM 👏 A 👏 WAGON @darth @maireadlynn BEST DAY DARTH @darth @maireadlynn i would like to see him be carried from office to office darth @RedPawRelief omg could we feature your determined fire pup video? @scootmagapril omg HOW IS IT??? @rolledupwater65 @GoodGir1GoneRad no further questions @darth @GoodGir1GoneRad NEVER A DOUBT IN MY MIND DARTH This is Nacho. The kitchen exploded. That is all we know at this time. Offered to help get to the bottom of it. 14/10 thank you Nacho https://t.co/pzdySTgOPL @onetailatatime @IvePetThatDog thank you Thelma @IvePetThatDog @onetailatatime wow my favs are together without me 😔 This is Küna. On the left is a pic from the day she was rescued. On the right is a pic from one year later. She went from spending her time alone in a crate, to a comfy bed with a new best friend. 13/10 https://t.co/inaKl4sdvd @llyceab @dogfather 😋 @JessicaSydnes ☺️ @stephmsharp he combined the stickers what a legend @calvinstowell i love him RT @calvinstowell: anyways look at cute photos of my dog from this weekend, he was born with a disorder called iris hypoplasia so he has to… @GillianHTurner ☺️ https://t.co/3htkg7qB6h @Kpedhere ❤️ @abby_geniusz @AFKduringPistol @Sike1216 square pup* @bunsenbernerbmd ...omg This is Hazelnut. She overheard someone make fun of her hat. Thought it was perfect for a night on the town, but now she's not so sure. 14/10 ignore them sweetie it's brilliant https://t.co/21IOKQILh4 @jacksfilms thank you @souljaboy can my people get in touch with his people? @eamonator you’re very welcome. if anyone else would like to join the movement of making sure dogs are told hi: https://t.co/JTMVHVhL34 @vinnesttree @saberlolii i did not. we only rate dogs @Shoegameking1 @saberlolii it's quite clearly a bear We actually only rate dogs. We don’t rate curious bear cubs who like little chin scratches. Thank you. Please only send dogs... 12/10 https://t.co/r6piO9SIJW @EnglishDiva2 ❤️ @ZLOK puplifting @smwol298 alright well i'm crying now @smh_doodles “right this way my fren” @darth THAT'S RIGHT DARTH This is Charlie and Maverick. Charlie had his eyes removed due to glaucoma, but then Maverick came along as his little helper. Now they’re doing amazing. Both 14/10 https://t.co/qjkhYLihEO @BlairBraverman @dogfather YAY BLER @UnicornOfWar proud @PietroCoso YAY ❤️ @rickygervais thank you for After Life @Lin_Manuel hello tobi This is Gabanna. Her human Jose rushed past firefighters into his burning home to rescue her. She suffered burns on her nose and paws, but will be just fine. The family lost everything else. You can help them rebuild below. 14/10 for both (via @KUSINews)\n\nhttps://t.co/FpH4QmZW2i https://t.co/UfIED0AOuW @bergopolis it’s true @binita_nandy he did @helmickkm @handmade_LC ooo nice This is Louie. He didn’t want to miss the great bubble migration. Only occurs every few years. Managed to eat a few. 13/10 good boy Louie https://t.co/3B6cJi86JC This is Ziggy. The dog in the mirror won’t stop copying him. Not even the reverse wiggle threw him off. 14/10 please pick him pup https://t.co/h723cjbQzy @1stClassFrance it tells me that you probably forgot to add some disclaimers @AndrewNicolais thank you for sharing your stray pup friends with us andrew @hanbananxox @AndrewNicolais we reduced the original 104/80 This is Stumpy. He’s a stray pup in Thailand. Wanted to introduce you to his stray pup family. They’re a little dysfunctional but what family isn’t. 13/10 for all https://t.co/ZWYpAzoVnu @loganandreoni29 @JZACMusic i live with jzac @CharlesPulliam omg This is Dough. He’s a basset hound working undercover as a lab. Can’t discuss the mission, but it’s very important. 14/10 rare as h*ck https://t.co/f6w2FZYU8V @ericgeller @taningski eric This is Cookie, fluffy overlord of the blue slide. You must pet him before commencing a plunge. 12/10 of course your majesty https://t.co/8cVT8Ad0dG @kate3423 omg it looks so good @awhalefact :( @IvePetThatDog so floppy gideon so floppy @hellomichielle omg hi pocholo @ChrisEvans @SuperpowerDogs very good job @NateWantsToBtl i’m losing my mind @jaydendesino @dog_feelings arguably just as valuable :) @John_In_SX @dog_feelings this is why you have literally 0 followers Meet Milo. He’s a smiley boy who tore a ligament in his back left zoomer. The surgery to fix it went well, but he’s still at the hospital being monitored. He’s going to work very hard to fetch at full speed again, and you can help him do it below. 13/10\n\nhttps://t.co/ncfN496SOv https://t.co/qVu7v531dk @kittykat5359 😍 @dre143 HELLO OTHER WAFFLES @Sam_QBES messaging the vet now. cancel the surgery that's just his goodness setting @Sam_QBES it’s usually like 300bpm, so i assume he vibrates instead of wags This is Waffles. He can’t believe you let him taste the spicy flower. He usually loves everything. So much he’s been diagnosed with OAVRT, meaning his heart consistently beats way too fast. Surgery can correct it, and you can help him get it below. 13/10\n\nhttps://t.co/fJNanxYMLz https://t.co/XoCrlLdGCr @TiffanyDavid113 ❤️❤️❤️ This is George. He just graduated with a double major in snuggability and good sits. Wonderful job George. 14/10 please congratulate him https://t.co/mivGBNZ27O @jchennifer WOOHOO! RT @jchennifer: Guess what came today !!! @dog_rates 💙💙💙💙💙 https://t.co/Bxjat27DuZ @MattGalatzan omg @MLB @rhyshoskins haha the inflation https://t.co/TYONEwILx8 @SlaveToBoredom @anneeobrienn pup pup and away :) This is Ollie. He activates his ears one at a time. Must be pupparing for takeoff. 13/10 an honor to witness https://t.co/KzyLJlkPVh @seanlintn :o @JOE_co_uk @rickygervais “the last dog i’ve seen is always the best dog i’ve ever seen” wow relatable @Hozier @sacredeeer idk i’d go 12/10 @champagnamami how can i help This is Colt. He’s making his way downtown. Has a very big interview, but afterwards he pawmises he’ll be home bound. 14/10 https://t.co/mK8pg4WfEi @hooperre @drozcr 👀 RT @dog_feelings: hi. if you would like to cuddle. i certainly wouldn’t oppose @wx_becks amazing @TipaOdiosa @Linnnnnnnnnn94 you attac for the snac you better watch your bac This is Lilo and Boggins. They are battling for the last snack.  Boggins started strong but was no match for Lilo’s sneaky paw chomp. Both 13/10 would buy more snacks https://t.co/OVhVpkI9Qm @Franklinsays @Carolyn46348716 this is adorable @BasedGerm @GBeckTV why would you say that. he's already self-conscious This is Benny. He’s still working on crate training. A little self-conscious because other dogs his age already have the hang of it. 12/10 ignore them Benny you’re doing great https://t.co/t5F83tuewM @kate_pettyy https://t.co/8WmQM1ecjw @kate_pettyy compose yourself kate this is huge @RedheadCakeLady no no they just showed the videos it wasn't live. nothing is real @cathyfarman ...omg This is Dodger and Rosie. They took over the WeRateDogs Instagram story today. Showed you their first baths and everything they love. Both 13/10 would go watch: https://t.co/CE9TIutp7l https://t.co/Jr1QHanX9z @miclcm73 @ImJapanda nice This is Joe. He rode the train today. Was a little nervous but his scarf helps him feel safe. Made sure to say hi to all the other passengers. 14/10 #SeniorPupSaturday https://t.co/WOSdcG0t1k @leocleocats hey wtf @Von_Maur @yaggi12oz we don’t plan on stopping anytime soon ❤️ @extexcali hey maybe actually read the thing thanks @itsteeherbo good one This is Nymeria. She’s a special needs pup who’s been diagnosed with severe bilateral hip dysplasia. This means two total hip replacements. Her new family is dedicated to giving her the amazing life she deserves and you can help them do that below. 13/10\n\nhttps://t.co/1xEC4uJSRU https://t.co/ImCkoWT2s4 @RJCaughey @darth he wink at u https://t.co/2cEk5YM4m8 This is Jessy. No one told her the snow would be sticky. On the bright side she could decimate you in a snowball fight right now. 12/10 somebody help her https://t.co/wJnLGJSvfo @bstephenson173 this is... incredible @TJFixman @HackettKate @mackenzieflynnn are you calling him a liar TJ https://t.co/BRdCZEmm4L @TJFixman @mackenzieflynnn he wants to know if there’s a pawblem here TJ https://t.co/grd0xMDwj7 This is Legend. He was photographed getting a belly rub one month ago and again today. Hopes you notice he’s been working on his smile. 13/10 https://t.co/kYs3z2prjv RT @itsbl0ndie: Daisy will always watch me put dry shampoo in so i figured i would show her what it’s like 😂 https://t.co/ev9BuzFoTl @Tbrown1504 please tell your dog i said hi for me @sunsetandfire the classic h*ck a wonderful choice @shezminty \"tell your dog i said hi\" is the best seller obviously but \"dogs :)\" is the newest one and honesty my fav @mila_gros22 the good dogs thank you for your support &lt;3 We made some fancy vintage hats for you! Three designs in three different colors. On sale for the next 24 hours :) \n\nhttps://t.co/aNPBAbZATu https://t.co/rA432lgLEj @ChrissyCostanza no it’s ok i said so @WhyIsKorisTaken @josh_f00 IT'S HIS FIRST TIME LEAVE HIM ALONE @artdecider @josh_f00 a jury would never convict This is Mochi. It’s his first robbery. Forgot a weapon but would still like you to please put your hands pup and show him where you keep the snacks... or else. 12/10 https://t.co/XM9I4VJAgW @caroline_szwed cash is always good @hitRECordJoe may he rest in power ❤️ @delaneytarr he was so good delaney This is Duke. He was first elected mayor of Cormorant as a write-in candidate in 2014. In 2016, literally everyone in the village voted for him. Duke passed away last week at the age of 13. He served with great honor and fluffy passion, and has been awarded the very rare 15/10 https://t.co/uwPtQ7gFYW This is Willie. She was recently rescued from poor conditions where she developed Carpal Laxity Syndrome. Wanted to show you how strong she is now. 14/10 would adopt below\n\nhttps://t.co/jMvzVswF1S https://t.co/Xp5JMa6GFY This is Kumo. He’s proud to announce he picked out his first raincoat. The sky droplets don’t stand a chance against him now. 14/10 really hopes you like it https://t.co/pncQhSvTHD @akaTRENT @JCCarnz @BCrawford247 holy h*ck RT @ohhey_mariah: My brother sent me this video of my dog in the wind and I thought I should share😂 https://t.co/vss2Ej3UQ0 @olearyjerryo is gunney your profile pic i love him so much @Wagerchats it's their overall goodness score @Wagerchats that's the dog's rating. she received 13 points out of a possible 10 points This is Shadow. She’s a retired service pup. Despite her advancing age, she really loves the occasional zoom. Sadly, the most recent one resulted in some torn knee ligaments. She needs surgery to correct them and you can help her get it below. 13/10\n\nhttps://t.co/ZITxyfZ9B8 https://t.co/3WhyzlPDRv @Picklittle @zacxwolf he’s doing so well This is Marty. He heard you needed some help shoveling the driveway. 14/10 thank you so much Marty https://t.co/thLIobU2mX This is Lucy. She hasn’t made it out of bed. The world just seems like a lot today. But she knows how much her human needs her. 13/10 you got this Lucy https://t.co/GX9YIMMqo0 In honor of #LoveYourPetDay, please reply with a pic of your pet so everyone can love them with you @Sethrogen hi zelda This is Anakin. He’s a smiley boy. Hopes you had a good day. Here to fix it if not. 13/10 won’t stop smiling til you smile back https://t.co/hlLYIrsYJZ @Konoko_kun @AlitaMovie https://t.co/eGociVITBN @BrandenHarvey @AlitaMovie honestly same @salvds @AlitaMovie you’re very welcome ☺️ @DancingQueen_DQ @AlitaMovie spoilers are ok when it has to do with the well-being of a pup @AlitaMovie i’m just glad he’s ok tbh This is Little Marks. He’s the half-doggo, half-robo, 100% good boy in @AlitaMovie. Wanted you to know he’s doing just fine. 14/10 #ad https://t.co/AQVzqF9sG8 @akrin512 @erinislost @yaledoglab that’s perfectly fine @akrin512 @erinislost @yaledoglab she also has her CGC https://t.co/BdTzUADHZS This is Freja. She’s quite involved when it comes to her schooling. Wanted to show you all her certificates. Studied at Yale for a bit before pursuing her “Bachelor of Dogness” elsewhere. 13/10 inspirational as h*ck https://t.co/qUwMBNTRwo @IvePetThatDog @Twitter now you will never be mistaken for some amateur dog petter @Csensi_Aspen stolen @A_Legend90 @_rosmery he looks innocent @darth @_rosmery did you like my needle pun darth or was it too much This is Dina. She got her first shots at the vet today. Needle-less to say she’s pretty pupset with you. Thinks a hug would help though. 12/10 https://t.co/Ap8edAMCkc @Ninja how’d they do @MoveOn i’d go with 12/10 tbh @TravusHertl um those are doggles 💁‍♀️ @darth @RockHawkx THANK YOU DARTH @RockHawkx i'm guessing @darth is already on it This is Koda. She heard you think about going on a car ride to the park. You better not be joking she'll get her things right now. 14/10 would keep the windows down https://t.co/bBcSt9NSkV @IvePetThatDog FEEL BETTER GIDEON @RachiRojas @zilkerbark @Lin_Manuel yesss This is Abby. She never leaves the house without her crown. Needs everyone to acknowledge her majesty. 13/10 would pull her throne anywhere she wants #SeniorPupSaturday https://t.co/897uyMutB6 @DavidDobrik 3 dogs in the latest vlog i really appreciate that thank you @limecrisplee HAPPY BIRTHDAY 🎈 @HamishSutherla5 if you go to past campaigns (we always leave them up) most have pupdates from the owners 🤗 and if you donate, those pupdates are emailed to you as soon as they’re posted This is Koala. A few weeks after being adopted, his new family noticed he was always tired and sick more often than not. It turns out he has a very large liver shunt, but surgery to remove it can give him a long happy life. You can help him below. 13/10\n\nhttps://t.co/VC8Ueq9TWz https://t.co/E5O3EYpPsl @darth COULDN’T ASK FOR A BETTER ONE DARTH @PowerfulPaper https://t.co/p06p7kXxPZ honorary 15/10 for Oppy, the very good space rover https://t.co/nJl3T2dKYp This is Hudson. He is a lovebug. Here to grant you any amount of adoration you need to make it through the day. 13/10 showed pup just in time https://t.co/6p2aNcZayL RT @katilou10: Leo is me. I am Leo. ⁦@dog_rates⁩ https://t.co/5xJa5zNXZr @darth @matt___nelson you can start here darth \nhttps://t.co/MKaiSXp6Jd @darth @matt___nelson HELLO DARTH @Tesla https://t.co/2tKRGXT0AX @MamaMeyer2003 @wx_becks https://t.co/RU6j04HRxO This is George. He doesn’t chew socks. He just likes to hold them. They make him happy. 14/10 a self-care king https://t.co/ykOxXxNt1s @drewsephee that’s what we strive for @wolfchild59 they have more pawgress on the sanctuary’s IG :) https://t.co/nZlWZfInX5 Pupdate: Milo is still doing amazing https://t.co/xMHkGSUjO4 @Adam_Jacobi @matt___nelson @raquella_ella1 nice @raquella_ella1 omg hi guppy ☺️ both the black and white versions of this sticker are available here :)\nhttps://t.co/VKXPeeRKo2 @Sprite @JZACMusic no contest @ViatorLion10 ☺️ This is Gryffin. He’s wondering if you got the cuddle report he forwarded yesterday. Also could you convince HR to be more lenient regarding belly rubs in the workplace. 13/10 and don’t forget he needs the penguin toy specs on his desk by five https://t.co/Vh5TLKObrp @ArianaGrande all dresses should come with Myron from now on i don’t make the rules @DanielleLMB @dog_feelings a good one @Goose_1288 indeed This is Milo. He was born with pupside down paws. Last month he had extensive surgery to fix them, but today he is home and happy and learning how to walk for the first time. 14/10 you’re doing amazing, Milo https://t.co/3tNZaW0VGa @johnehoover @AdamJKass HI ALSO KODA @LonelySpaceKid @AdamJKass omg This is Koda. He heard you’ve been petting other dogs. No need to lie to him anymore. Expects several snacks to ease the pain. 13/10 please say you’re sorry https://t.co/n58MYMGRZF @Dixongenuous dude same @WhyIsKorisTaken i will stay at home with mozzie 24/7 and hug him Meet Mozzie. He was rescued from a kill shelter and became very attached to his new human. He suffers from severe separation anxiety and often hurts himself when alone. A specialized training camp is his last hope. You can help him get there below. 13/10\n\nhttps://t.co/UBDvZNwswB https://t.co/D72tjnv219 @daz_tazer @BeardedGenius i’m glad it annoys him @WholeFoods will do ☺️ @aikamotz @matt___nelson we’re sorry they took so long, enjoy the stickers ❤️ @wiggyslice @herculeselton ELTON JUAN OMFG This is Nimbus. He is the most at peace while swinging. It allows him to forget his h*ctic pup schedule and focus on himself for a change. 13/10 would push anytime https://t.co/Tyzbjj5IWx @faithborn13 @WholeFoods nice @people 🤗❤️ @mashable it’s true @Panthers @Proud_KCS 13/10 easy RT @GeekandSundry: .@Dog_Rates Announces a New Card Game Packed With Good Doggos, 13/10 Would Buy https://t.co/fFjhqfLc5C https://t.co/fEhQ… @scottesq 🥰 This is Chico. He just merged across four lanes to make his exit. Also pretty sure he left his water bowl on the roof. Trying not to make eye contact with other drivers. 12/10 stay strong buddy https://t.co/5OWaqNwgNR @onetailatatime YAY NICHOLAS 🎉 @GreenT128 @ChronicleBooks it does indeed @kathygriffin @emily_delacruz same kathy same This is Missy. These are her best angles. She hopes you like them. 12/10 thank you for sharing, Missy https://t.co/UmHmCk7zSP @ChronicleBooks WOOHOO 🌎🌍🌏 @kelly_knox @ChronicleBooks on it 🤗 @IvePetThatDog @ChronicleBooks OF COURSE WE CAN @IvePetThatDog @ChronicleBooks GIDEON I’LL BRING IT TO THE NEXT DOG SHOW @AstronautPony lol the ideal consumer @SuperRobotPug @ChronicleBooks 🙄 you don’t even have the game yet https://t.co/6ifXjLrkmv @Steventonthat i agree steven @ChronicleBooks 🤗❤️ @ChronicleBooks IT LOOKS SO GOOD THANK YOU GUYS @stbernardsoup @gositonacactuss @ChronicleBooks @ChronicleBooks is publishing it :) @johniadarola @ChronicleBooks i’ll bring it to the office @LauraBaileyVO @ChronicleBooks @TheVulcanSalute omg laura please play our game with me @klfvaughan @ChronicleBooks of course there is WE MADE A GAME! 🎲\n\nIt’s like a dog show but each of the 45 dogs has 6 characteristics (floof, boopability, etc.) plus an overall goodness score that fluctuate with event &amp; reaction cards but it’s ok they’re all good dogs just buy it thanks\n\nPre-Order Now: https://t.co/cdcrJwflNQ https://t.co/mZ1bV3xMTK @magicstars64 i’m so sorry. uk suppliers didn’t believe the publisher when they said to buy a lot of them :( @onefaithlove @aliverescue lmaooo @tarajwillis @aliverescue https://t.co/aQhnj9H2Ua @DonovanCrawfor7 good one @aliverescue PROSECCO GO FIND YOUR FOREVER HOME BB 💞 @jencobb1978 we knew everyone needed it :) This is Prosecco. She doesn’t mind bath time as long as you hold her steady. Likes to let the water run over her feets. 14/10 I love her so much https://t.co/WfbR5ohmhq @harmc_123 @BrotherNature 👀 @AnimalPlanet @sarinahoskins i’m both slightly offended and very impressed @pat_miels ☺️ I know it’s cold out so this can get confusing, but we only rate dogs. Please don’t send in flirtatious polar bears. We don’t know what to do with them. Thank you... 12/10 https://t.co/QwMvFXdZiq @CoryBooker nice @TylerGiek i’m told he always kicks one off while he’s sleeping This is Cooper. He likes to eat rocks. But today he didn’t. Wanted to show you he’s maturing. His churlish days are behind him. 13/10 https://t.co/H1GO88cHu5 @jenquattlebaum @budweiserusa chin pup* @sancheet @budweiserusa i ship it @budweiserusa YES THOSE EARS @budweiserusa OMG LOOK AT HER EARS IN THE WIND BUDWEISER This is April. She’s the star of the new @budweiserusa Super Bowl commercial. Wanted to introduce you to her clip clop friends before it airs. They really like carrots. 14/10 for all #partner https://t.co/sxkfduSNcI @FOXSports @AnimalPlanet they all did so well @CrainHarrison @AnimalPlanet Annabelle and her older brother Leonardo gave a tour of Denver’s best dog spots on our Instagram Story today! Check it out :) https://t.co/CE9TIutp7l https://t.co/Flap9PLkqZ @david__raleigh DAVID DON'T YOU START WITH ME This is Cadogan. He’s had the same morning routine for the last 13 years. Knows exactly how many spins it takes to get to breakfast. 13/10 #SeniorPupSaturday https://t.co/0HVNHkYSEu @mayapolarbear 6/5 stars @Acallofthevoid 🤗 @jaytay777 OLIVER!!! you’re doing so well buddy. this pic your human sent me made me happy cry for like an entire day https://t.co/W7d6DHytLW @hyqnotised she’ll sort through all offers later today This is Zora. She was recently diagnosed with osteosarcoma, a very aggressive bone cancer affecting her front left leg. An amputation followed by chemo is her best option for a wiggly peanut butter-filled life. You can help make that happen below. 13/10\n\nhttps://t.co/Bzk24lxKfo https://t.co/Vw7IkQmwIX @jrovner @KffDogs i’m so sorry Julie ❤️ @NYJVPA @bunsenbernerbmd climate change isn’t political RT @beth_phelan: THE PHOTO MY SISTER JUST SENT ME OF HER GREAT DANE AND THE NEW PUPPY THEY JUST GOT. \n\nLOOK AT IT. https://t.co/6EsDWzq1UX @IvePetThatDog WOOHOOOOO @fentybeauty omg hi mia he’s innocent https://t.co/ROi52V1Yjb @kelvintemp @tofu_corgi nice @tyllyn @tofu_corgi they must notice the stumpy legs This is Tofu. She has infiltrated the shiba ranks. Gained their trust. And will report all intel back to headcorgers. 14/10 they don’t suspect a thing https://t.co/cfaCkZh9Mt @onetailatatime omfggggggg @david__raleigh I’M NOT THAT ORGANIZED DAVID This is Taco. He couldn’t finish his carrot. Decided to save it for later. Asks that you please watch over it while he naps. 12/10 anything for Taco https://t.co/AGDwfaEw5o @Samuraiko @ConstantFail https://t.co/UDSJF1kXNe @mstatileal @LisaJayLJ 😂😂😂 @brokencasbutt67 @LisaJayLJ take it back This is Boise. He’s wondering if you’ve seen the vet. Has successfully avoided them for the last hour and a half. 13/10 would help him hide https://t.co/6rnxnYoSyh @ja_amber @darth i think the better question is why don’t we @molly_knight @darth i have our dogs of 2018 video ready to go @darth bb i miss u @JShahryar @HSMedical i agree super fuzzy Alright haha very funny. Sending in a picture without a dog in it. You got me. But really please only send dogs we work hard over here and deserve to be taken seriously... 13/10 https://t.co/HGQspFpbxb @stormcloude @AnneCutler hey i think the owner knows more about their dog than you do @j_thorn_7 @Jaack 🥰 @CheddarBigNews looks like i need to come back @caroline_szwed reply if cash is your king @_rachel_howard dumb cute Clyde took over our Instagram Story today! Go watch it: https://t.co/CE9TIutp7l https://t.co/DVRlffKAHL @skgreener omg @klamach @deannasummers omg ❤️ This is Elmo. Today is his birthday. He has congestive heart failure, but he’s such a good boy and takes his pills with a slice of cheese every day. 14/10 #SeniorPupSaturday https://t.co/fTtaBeOHPz @Twitter https://t.co/4VBglK3DAH @Thesherbertime 🤗 thank you for supporting us @IMAX @ChrisEvans @SuperpowerDogs rebarkable* ...see you need me @ChrisEvans so ᵘʰʰʰ how can i be a part of this RT @oohhhkayyy: my dogs stuffed animal was left outside and my dad made sure so save him.. https://t.co/ysgViljoxS @bigredIRL by reading them @hitRECordJoe omg hi joseph ily This is Carbon. He found a bottle of ibuprofen while his human was at work. Thought they looked yummy and admits he didn’t take time to read the label. He’s on several treatments to remove the toxins from his system and could use your support below. 13/10\n\nhttps://t.co/j56SudWFrP https://t.co/Q4n6IeJX5G @FMoxon ❤️ RT @BenSmithDC: Today, @dog_rates gave their 8th 15/10. Look back at all the other puppers who won the same rating. https://t.co/yUQFd0yF9u @juniper_bears @CityofHanahan yes yes of course i hope that was implied This is Jake. He was rescued from a burning shed at three weeks old. The same fireman who saved his life adopted him just days later. Jake has since been sworn in as an honorary firefighter and to this day he helps teach fire safety at local schools. He is our eighth ever 15/10 https://t.co/aR6YMlZHlo @gabby_elanea he’s innocent @JColeNC i’m a middle child This is Beau. He’s practicing being the ring bearer for his owner’s wedding. Will try his best to get down the aisle successfully but no pawmises. 13/10 https://t.co/DyUiN0u0st @jahmin32 @JusticeIsFemale try Wal-mart @NHL co-signed @sehnaoui omg @JusticeIsFemale it’s true that’s not how clouds work @Emilyling19 @jennifermerr nice @CraigKaminsky @IvePetThatDog ❤️❤️❤️ Here’s a good boy trying to get his education. Forgot a pencil but is too nervous to ask for one. 14/10 would help him with the homework https://t.co/kkApq0Uok9 @KatieAlgieri idk tbh This is Ginger. She just got new banana pajamas. Anxious to know what you think of them. 13/10 they’re absolutely delightful, Ginger https://t.co/YxfCUvZ0xO @StLouisBlues i think Barclay should get to ride the zamboni tbh https://t.co/SyV44Du0Hr @SheRatesDogs should i just forward these to you or what? https://t.co/CN0c9aFGma @TheBigRedBeanie @hayfowl ok jealous Say hello to Sancho. He is extremely puppared for his walk today. The frigid elements don’t stand a chance against his hat and sweater combo. 12/10 https://t.co/0KKjSDv4aC @DemetriusHarmon nice @TheMartyred @breeeezzzzz how will we ever recover @NadiaMollitor @vegasvin https://t.co/04rr6nFoKQ This is Midge. She can hear a butterfly burp from half a mile away. Hasn’t stopped smiling since she was rescued last year. 14/10 good girl Midge #SeniorPupSaturday https://t.co/5fQiMWNYks @breeeezzzzz very good boy @dog_feelings can confirm @jadenthomm she’ll have her people contact your people @jadenthomm she wants to know if they’ll make her zoom faster This is Pennie. She went to the vet after refusing to eat. A blood panel revealed abnormal enzymes throughout her body. She was placed on IV support and is using an NG tube for nutrients. She’s trying her best to get better. You can help her below. 13/10\n\nhttps://t.co/5KAyl02VxB https://t.co/BxYpuNXSaO @ewarren i think so elizabeth i think so"}