{"tweets": "IDÔLE✨ @lancomeofficial https://t.co/Upe3kVNAff DUNE Official Trailer  https://t.co/dpsP33Dc9U !!!!!!!!!!! https://t.co/ua6vVybYPk Ohhhhh shitttttt https://t.co/jAAQLoXjWO https://t.co/gmVKyS660w Just posted a photo https://t.co/WZuvp60fxh Y’all know what today is!?!?! #BeyDay https://t.co/LMEAbEd6eD @ava Thank you so so much, sending you so much love✨ 😏 https://t.co/3CREPcrkrT I’m incredibly grateful for all the beautiful birthday wishes I received yesterday, feeling very very special, so thank y’all ♥️ Here’s to 24 https://t.co/wfX9vyUu8b I’m incredibly grateful for all the beautiful birthday wishes I received yesterday, feeling very very special ♥️ Here’s to 24 https://t.co/lP6HAJuELQ This means so much, thank you Queen✨ https://t.co/ejN6YjGFdy @OsopePatrisse Thank you so much♥️ It’s lost https://t.co/kynxnq5rkp https://t.co/y8C6ipnNJD Yo, you bout to make me tear up over here man, thank you for this, I appreciate you very much... https://t.co/vbRMTQZK6e RT @empiremagazine: Timothée Chalamet talks to Empire about #Dune’s ‘awe-inspiring’ desert shoot. Read the story and check out brand new, n… RT @BarryJenkins: In power \n\nEternally in power Rest in great power. https://t.co/SDjVfJ9Lrw RT @empiremagazine: The second collectible cover for Empire’s WORLD-EXCLUSIVE #Dune issue, on sale Thursday 3 September, features the Freme… RT @OsopePatrisse: Jacob Blake survived. \nJacob Blake survived. \nJacob Blake survived. \nJacob Blake survived. \nJacob Blake survived. \nJacob… RT @Labrinth: Welcome to the @euphoriaHBO mini-mart 🦋  \n\nhttps://t.co/s3ejEzjrsy https://t.co/0YwaDw8CWe 🤗 https://t.co/3ZRcJr2wkx hometown of Oakland. If you are in the position to give please continue to share the love by visiting https://t.co/TLs7gGsVLT to donate school supplies and or food. Sending lots of love to all the students in OUSD on starting your first week of school.\nThank you to @convoyofhope @wellsfargo @ousdnews @lahf1997 @100BlackMenBA for all of your hard work and dedication in helping me feed and gift thousands of beautiful families in my— https://t.co/M1fOoVSEAX Thank you for your talents, it was so special to work with you both♥️ https://t.co/sCVBgNhyhL https://t.co/QHHkaVOgBD Thank you @instyle for this very special cover and interview with @osopepatrisse \nStyled by @luxurylaw \nShot by abdmstudio \nMakeup by @officialsheiks \nHair by @larryjarahsims\nWearing alietteny @mateonewyork https://t.co/eTCPhjpjvV Thank you @instylemagazine for this very special cover and interview with @OsopePatrisse \nStyled by @luxurylaw \nShot by Donté Maurice &amp; Ahmad Barber\nMakeup by @OfficialSheiks \nHair by @LarryJarahSims \nWearing Aliette &amp; @MateoNewYork https://t.co/J0Y74cAnis @JanelleMonae Thank you sis♥️ @MatthewACherry Appreciate you! @chloexhalle @IssaRae @kerrywashington @ReginaKing Love y’all✨ @IndyaMoore @IssaRae ♥️♥️♥️ @yahya So proud of you man! This is beautiful who’s watched and given our show life, thank you @samlev00 @hbo @a24 for everything and @televisionacad for this beautiful acknowledgment, thank you, thank you, thank you. We out here Emmy nominated y’all!! I’m honestly speechless, my heart is just overflowing with love and gratitude. I’m so incredibly honored to work beside the talented people that I get to call family. I am a small piece of a big beautiful puzzle and I’m so proud of all of you. Thank you to everyone out there— https://t.co/sRfjmOIVJl RT @BerniceKing: Elders, now ancestors. Hallelujah. https://t.co/ze53PFMTuh Malcolm &amp; Marie https://t.co/99RWzgLFbD @OsopePatrisse No, thank you!🖤 .@OsopePatrisse taking over my Instagram today!🖤 🥺 https://t.co/mzKtBnNMxB @finstkind Get rid of it @finstkind What and how was this edited...what did they do to my face...this is what nightmares are made of @MatthewACherry @TheAcademy @VictoriaMahoney @thumbelulu @nlyonne @stellamink @NiecyNash @StaciRCollinsJ @iFrankAbney @katcandler @kelvharrJR @carthew ♥️♥️♥️ @ruefilms What in the edit is going on in the first picture lol Daily Digest with @OsopePatrisse Juneteenth style!✨\nhttps://t.co/Jz3lGzRIpt *honor *amongst (leave me alone, at least I’m consistent😂) What an hour to be amoungst these incredible ladies, thank you @BET ✨ https://t.co/B1h4r8MeAt https://t.co/T8PgUYK4ky RT @oranicuhh: if the money allotted to police was put into communities for things like mental health care, housing, education, etc. \n\nmayb… RT RT RT https://t.co/nKK607rr3f RT @BerniceKing: No arrests have been made for the death of #BreonnaTaylor, who was killed in her home by a hail of bullets from @LMPD offi… RT @AlwaysAnthea: Hi guys,\nMy awesome friend @dayaspsychic made a carrd with BLM UK specific resources that she’ll keep adding to from peti… RT @ReginaKing: Today would've been #BreonnaTaylor 's 27th birthday. She was a full-time EMT at 2 hospitals in Lville, Ky. She was a belove… Say her name. #BreonnaTaylor https://t.co/LHugOdJO9G Say her name. https://t.co/oH8QfZ17Bz Do not stop applying pressure, more resources on my page. mvmnt4blklives https://t.co/oNXJHI3qQn RT @MichaelSkolnik: The amount of police brutality at the anti-police brutality protests is proving a lot of points. RT @IDONTMIND: Racial trauma is real, and it is a threat to mental health. Here are some resources that focus on black mental health if you… RT @kendrick38: When we fight, we win!! Small win but must celebrate them as we CONTINUE FIGHTING. Only a small dent in the $3 BILLION budg… Week of Action https://t.co/oKYcXRXP3R @Mvmnt4BlkLives Period. https://t.co/O6Ohe7RQIE RT @nataliesurely: it’s almost as if curfews are workarounds to make protests de facto illegal RT @battymamzelle: UPDATE: This is the official GoFundMe set up by Breonna's family. All donations should go directly to them. But please d… RT @JerryPistons15: @Chameleon876 Her name is GiGi 🙏🏾🖤🤎 https://t.co/OH3C8KgJhZ RT @JanelleMonae: I do not consider myself an activist or an organizer . I have a platform , YES , BUT there are people who ARE REALLY ABOU… RT @kerrywashington: Buy black!!!! 🖤🖤🖤  https://t.co/irTSVWOEi9 RT @GeeksOfColor: Reminder: If you are going to post a picture for #BlackOutTuesday, do not use the hashtag “Black Lives Matter”. Informati… RT @sarahljaffe: think how quickly they can do this vs. how slowly they could provide healthcare RT @BerniceKing: No arrests have been made. \nNo officers have been charged.\nRemember #BreonnaTaylor.\n#JusticeForBre matters. \nSign. Share.… https://t.co/LX3okwN5MW RT @REALITIGRLFRND: 𝐒𝐀𝐘 𝐓𝐇𝐄𝐈𝐑 𝐍𝐀𝐌𝐄: [𝐀 𝐓𝐇𝐑𝐄𝐀𝐃] RT @africanarchives: On this day in 1921, The Tulsa Race Massacre happened in the affluent black community of Greenwood in Tulsa known as t… RT @EricOchoa110: \"How much time do you want? For your progress\" - James Baldwin #AhmaudArbery #SeanReed https://t.co/Om4UvgefOn RT @qasimabasir: Now would be a good time to remind Everyone that this happened earlier this month. No tear gas. No bullets. RT @Sifill_LDF: This boy had his hands up when an NYPD ofcr pulled his mask down and pepper sprayed him. ⁦@NYPDShea⁩? Mayor ⁦@BilldeBlasio⁩… https://t.co/dCAQEB87OV RT @shidoggg: Don't forget NIA WILSON 👼🏽♥️ My sister was murdered by a white supremacist named John Cowell . Didn't know him , never seen h… RT @Lin_Manuel: Breonna Taylor. George Floyd. Tony McDade.\nNever coming home.\nIf that sits in your heart and it hurts, let it manifest acti… RT @MatthewACherry: Say Her Name #JusticeforBreonnaTaylor https://t.co/Ll26ajkLRX ... https://t.co/MpIVLc4p2e RT @grassroots_law: #GeorgeFloydWasMurdered \n\nHe was dragged from his car, pinned to the ground, and choked even as he begged for air by of… RT @aliciagarza: I’ve gotten a lot of questions about what we can do right now. Some food for thought. So special to me♥️ https://t.co/sYHk0NLnQ2 @AlwaysAnthea 😂😂😂 @dayahubb Idk prob some hacking scare shit Is it back?? Just waking up, don’t know what’s happed with my Instagram figuring it out now. RT @GradTogether: Tonight is the NIGHT!! Shout out who are you most excited to see on the show! 🌟⬇️ #GraduateTogether https://t.co/c8jUmmjg… RT @euphoriaHBO: blo0ooo0ppersssss are finally here https://t.co/BzLMkiSNck RT @MichaelSkolnik: #AhmadArbery https://t.co/ryFjsMYxG5 https://t.co/WRWxxgI02P @detectiveruez No but for real, love y’all, hope everyone’s ok out there♥️ @detectiveruez Something Dune \n\n@VanityFair \n\nhttps://t.co/4jtGCqf624 https://t.co/SXHV82eOcB RT @VanityFair: EXCLUSIVE: Timothée Chalamet is Paul Atreides. \n\nYour first look at Denis Villeneuve’s #Dune adaptation has arrived: https:… I’ll think about it😂 https://t.co/vkdnu8DfMa RT @zahraloum: how everyday feels https://t.co/elJephfeI5 Bts from @Bulgariofficial 🖤\n\nhttps://t.co/mTL64PFuuE https://t.co/I63Hv8a5yN @tomsbaessett These weren’t taken yesterday lol I’m inside♥️ RT @euphoriaHBO: here we go !!!!!!!!!!!!!! https://t.co/Qyf0fzEAdk https://t.co/LlVhOaLvaQ Incredibly honored to cover .@vogueaustralia Thank you for having me♥️\n\nhttps://t.co/EyGfE28cJk https://t.co/mx3ESXDmaW .@Bulgariofficial \n\nhttps://t.co/yfC5pkN6hj https://t.co/RYN0GE9hxm RT @Bulgariofficial: Break the rules of jewelry and stand out in the NEW #Bzero1Rock jewelry collection Thank you for a gorgeous night, proud to be an official member of the @bulgari family.\n\nhttps://t.co/8GTb7afdpT https://t.co/B72Askvw3L https://t.co/KmbS5U5iy0 https://t.co/QmEG11wthh @MatthewACherry So incredible!!! Huge congratulations to you💫💫💫 @j_janae_ Yes lol https://t.co/owaq91Ez3s Just posted a photo https://t.co/EEbF5bNIyC RT @kerrywashington: Beyond devastating what is happening with the fires in Australia. If you’re looking for more information or ways to he… Hey I’m good, miss y’all too. Happy new year🥰 https://t.co/iSv8jpBxSP https://t.co/o97HrKp3uo https://t.co/4B7teYUUYM @uhheyimpeter Never You know, you can live and not tweet https://t.co/lEymSMYuYJ RT @MatthewACherry: #HairLove is live! It’s an animated short film about an African American father learning how to do his daughters hair f… Teint Idole campaign beside the most gorgeous @Lupita_Nyongo 💫 @LancomeUSA \n\nhttps://t.co/dY7fYcfMX7 https://t.co/VR8CtbYTsZ @killingrue @AldiUK Hahahahaha what the hell https://t.co/g23eZkZjVm https://t.co/R7awBjIfZ0 🌻 https://t.co/KVG4LomfrV @jeremyoharris @euphoriaHBO My faves Thank you GQ Australia, proud to be your woman of the year🖤 https://t.co/KvRnV6r4dI 🖤 https://t.co/9cVLWGnvL5 @iamjojo @Kehlani 🤢🤢🤢 Clever lol https://t.co/fa0KoNudXC https://t.co/sC4gNtsnSd I will not succumb to your peer pressure lol @MatthewACherry Idk what the kids do these days Sorry for the links lol Just posted a photo https://t.co/c22R1XpaGN 🖤 https://t.co/GVhjSgSHx0 Just posted a photo https://t.co/RoBkKplbV6 So excited about this cover, thank you @Allure_magazine 💕 @TommyHilfiger  @LancomeUSA https://t.co/UActX2d9Bk So exited about this cover, thank you @Allure_magazine 💕 tommyhilfiger @LancomeUSA https://t.co/KZgD62sBXv ME THREE♥️ https://t.co/MOepm3SwKn Thank you PCA’s for a very special night, feeling incredibly grateful♥️ https://t.co/cnmke2x5nl Thank you PCA’s for a very special night, feeling incredibly grateful https://t.co/FHpTDm0VIM @ReeseW Love you, thanks!!!!🤗 Love you🌻 https://t.co/T0ar8UyAJ0 Lancôme L’absolu Rouge campaign outtake♥️ https://t.co/lWmL8CeG6l Lancôme L’absolu Rouge campaign outtake https://t.co/3mVqjrGjWu @RUEDEESHA https://t.co/UDo4kmY0dz @hollandsrue ♥️ @Neva_Serious Bye✌🏽 @Neva_Serious Missed y’all toooooo @MatthewACherry https://t.co/Cg9gn50C0n My kid’s 4 today, again slow down time🌻 https://t.co/EkoKlT4OX6 My kid’s 4 today, again slow down time🌻 https://t.co/KStoeAIez3 Last night was incredible, what an absolute honor to be a part of it all. Thank you @ELLEmagazine https://t.co/nrsf2fcn8C Last night was incredible, what an absolute honor to be a part of it all. Thank you @ELLEmagazine https://t.co/ZNF8AKo2bb https://t.co/6GUkeuAC6m @homecominqs I can’t stand y’all truly lol https://t.co/iymQGkz1K6 Thank you @ELLEmagazine for including me, what an honor💖 https://t.co/KM8xcmbSMX Thank you @ELLEmagazine for including me, what an honor💖 https://t.co/zGzKcKYOTb RT @ava: Diahann Carroll walked this earth for 84 years and broke ground with every footstep. An icon. One of the all-time greats. She blaz… https://t.co/JV4Rfrd4rj https://t.co/ql7ko1pYA3 RT @dayaspsychic: this is about to be me listening to the euphoria soundtrack tomorrow and everyday after https://t.co/MhMuJIjaOw Thank you to @thr for having me and my gorgeous glam squad on your cover! @officialsheiks @ursulastephen https://t.co/76Ewv57SCC RT @LittleMissFlint: I am shaking right now. \nWe are just $575 to hit my first goal of $100k. \n\nWhen I first tweeted this Wednesday it was… https://t.co/VNSRL27Y8Z RT @THR: Meet Hollywood’s top hairstylists and makeup artists that will take A-listers – like @MargotRobbie and @Zendaya – to new heights t… RT @MarkRuffalo: Registering to vote takes less than two minutes. If you haven’t registered, be sure to get it done now vs later! #VoterReg… https://t.co/GkjLpgJRUl https://t.co/fRtaNRYA1v Just posted a photo https://t.co/24Q6FBz7WX Just posted a photo https://t.co/DYPsldRpRA Just posted a photo https://t.co/WBpZtNhWny @supr_hero_trash ♥️ @tomsffh They’re not fake lmao they’re vintage books my uncle collected for me, 100 of the greatest books of all time. Happy birthday RueRue (some footage that didn’t make it, ready to go back now) @euphoriaHBO https://t.co/WnnydGtMZf Happy birthday Rue Rue (ready to go back now) https://t.co/TyixY1NGzk https://t.co/1VQ0hmHPNs https://t.co/XyEaS6fLyH #TommyxZendaya https://t.co/5jUIyxlHWz 🎬 #TommyxZendaya https://t.co/ZF5wJJWHab #TommyxZendaya Fall campaign https://t.co/E458BzGEsG #TommyxZendaya Fall campaign https://t.co/5Kv5atgs0M https://t.co/F2su6KV5ch https://t.co/j096PUquCF So much gratitude to everyone who helped make me and @luxurylaw visions a reality. Thank you thomasjhilfiger for your guidance and trust, you promised me creative freedom and support and delivered in the most… https://t.co/YB4GtmKyiV Whoever took this, thank you for capturing my joy...still feeling a bit like a dream. So many pictures and long posts coming✨ https://t.co/gSeFl2ZVnk @aaronphilipxo @TommyHilfiger Love you♥️ 🌫 https://t.co/hWJ9S9Z7J8 🌫 https://t.co/cDov85f8yj A dream, thank you to my @lancomeofficial family for an incredible first fragrance launch together💫 \n\nhttps://t.co/IMrar9XmSo https://t.co/5Nf2h89JMR Y’all know what today is https://t.co/DC0gWzppWp Thank you @garage_magazine For having me on your cover and to the extraordinary Simone Leigh for allowing me to be a part of your art. \n\nhttps://t.co/XS4AeHKt5t https://t.co/sRXkQYg4rG Thank you @garage_magazine For having me on your cover and to the extraordinary simoneyvetteleigh for allowing me to be apart of your art. ryanmcginleystudios https://t.co/hd2xRH34xU Hahahahhahahaha https://t.co/Nz5IGdAFue @chloexhalle @ZendayaMedias Love you✨✨✨ @stormreid @ZendayaMedias Love you Lil one 💖 To all of you beautiful people, thank you from the bottom of my heart for the kind words and pure love every year for my birthday, means so much to me. I know I haven’t been active lately but I just had to say thank you. Keeping this energy as I step into my 23rd year of life, thank you for all the love.\n\n📸 https://t.co/4I1dEetNWa via https://t.co/NxPR6lYMyD https://t.co/xoWktuiGaC This means the world to me, thank you ✨ https://t.co/FVlziGDiib Jordan year what’s good @sebhaal ♥️ Range lol https://t.co/audwJl2xUv 🤗 https://t.co/gO56NJEJEw RT @lgbtxluthor: friendly reminder that the Amazon forest has been on fire for 20+ days now, wildlife is being killed and half of brazil is… RT @Genius: “i'm proud to have my music involved in something like this. i’m excited about everyone getting to see this extravaganza.” ✨\n\ns… Because there’s no Euphoria tonight...I present your favorite tv sister duo @stormreid\n\n📸 https://t.co/VPR2Ijmsph via https://t.co/NxPR6lYMyD https://t.co/qyHiRdZ8M2 @MARVELOLOGY First off...that lighting and photography played me. Receipts https://t.co/2xyaiiZDhg Tell you how much of a bad bitch I am, I just flawlessly put on bottom mascara in the car without a mirror. https://t.co/feuDQznVXR RT @EVILSPETER: today is the first sunday without euphoria and I don’t know how to act @Zendaya please do something to entertain us https:/… @AlwaysAnthea Listen, that was the style back then @fatherlyjada Kiss my ass lmao Too* I truly hate this damn app sometimes...\nI’ve worked to hard for this shit lmao https://t.co/hQVTY5AqOg RT @Zendaya: @Labrinth 💙 https://t.co/nc6jOKQAYq @Labrinth 💙 https://t.co/nc6jOKQAYq Wore Rue’s hoody today, haven’t worn or washed it since we wrapped. Safe to say I’m deep in my feels lol https://t.co/8g6Urjf6qW #EuphoriaFinale RT @Zendaya: https://t.co/RVxXzjk2vC I have a lot to say, and I don’t know how to get it out, or even process these last 8 weeks but I’ll try. I’m so grateful for this show. For the beautiful family I’ve gained from it, for the self discovery and purpose I’ve…\n\n📸 https://t.co/gHOxm3NEfH via https://t.co/NxPR6lYMyD https://t.co/PkL58wVC9Y @maydayparkers Literally texting each other now, don’t worry that’s my sis, clearly our ig’s are trippin, we’re both confused as hell My heart https://t.co/LWfFKBu58h I really can’t believe that tm is the last episode of Euphoria... i know it’s just the first season but still... I feel that... https://t.co/YizJYmg7nI Episode 7: The Trials and Tribulations of Trying to Pee While Depressed \nDetective Bennett\n\n📸 https://t.co/fso3ahcfIU via https://t.co/NxPR6mgnqb https://t.co/bwkwYKiZnP Waking up to this...I love y’all, thank you💖 https://t.co/dOUOGCvwyZ #EuphoriaHBO Only two left. Episode 7 tonight💙\n\n📸 https://t.co/4FjfJNQcNe via https://t.co/NxPR6lYMyD https://t.co/8SZcxSMG9g 📸 https://t.co/H2sQe8sGAO via https://t.co/NxPR6lYMyD https://t.co/vX9wYaY8a8 . https://t.co/LKo7ZSd5AL So y’all really out here being gorgeous as hell?? #SelfiesForZendaya @dayaology @AlwaysAnthea Accurate If you watching @euphoriaHBO you’d know what’s good https://t.co/ILkFApxeGQ RT @aaronphilipxo: WATCHING EUPHORIA Episode 6 tonight💙\n\n📸 https://t.co/fwSb7Kq4dG via https://t.co/NxPR6lYMyD https://t.co/gqwjd8jAXi @AlwaysAnthea Whatchoomean??? Lmao RT @iSmashFizzle: Invest in the arts https://t.co/zqXc7nlMFy That time Law convinced me to have a whole ass photoshoot in our hotel hallway in Paris for no other reason than this gorgeous dress. Happy birthday to a visionary creative genius otherwise known as @luxurylaw\n\n📸 https://t.co/ZqGYFRGmIq via https://t.co/NxPR6lYMyD https://t.co/jdAYSWty0d RT @spiderlingdaya: a zendaya mood board https://t.co/D3TSDw8zJS RT @IlhanMN: 👋🏽 I am where I belong, at the people’s house and you’re just gonna have to deal! https://t.co/W0OvDXGxQX Wow...stunning https://t.co/3LaMoh57QW Episode 5 tonight 💙\n\n📸 https://t.co/SthiruoA5d via https://t.co/NxPR6lYMyD https://t.co/RiN6Ww2LG4 @emoblackthot Always https://t.co/Z6i1OnhkqY I took this last week, ignore the makeup on my shirt\n\n📸 https://t.co/NrpzzKh9UO via https://t.co/NxPR6lYMyD https://t.co/uzB3ZTDQ9E In honor of our movie Spider-Man: Far From Home doing so well, I thought I’d share some gems I found while reminiscing on last summer...Enjoy lol https://t.co/pcqCKPWHFX @z_mikoto Wrapped the movie lol Literally just got the call. Can’t say thank you enough for the support we’ve seen, wow... https://t.co/XJtdQaWaL9 @A24 @KingJames @euphoriaHBO Period Thank you for your love and support, appreciate you man💙 https://t.co/jHzSjfgjt1 #feelEUPHORIA Tonight. @euphoriaHBO #EuphoriaHBO 💙 https://t.co/Ds7GCIrzX8 Episode 4 tonight💙 @hbo https://t.co/BvSjiaezMx Absolutely heartbreaking, my heart goes out to his friends and family♥️ https://t.co/X8PAGo0Igi @Hectorisfunny 💙👊🏽 Grateful I didn’t roll an ankle today with these shoes in these beautiful yet inconvenient cobblestone streets lmao @holygroundharry Damn...but it’s so much easier lmao When in Rome\n\n📸 https://t.co/N9RpqRC51F via https://t.co/NxPR6lYMyD https://t.co/iXufbRGSNy @zenfieya Same Incredibly grateful to my @lancomeofficial family for having me as the face of their newest fragrance Idôle , what a special night in Paris🌸\n\n📸 https://t.co/R0lZ4DrLCm via https://t.co/NxPR6lYMyD https://t.co/DdOlC25JNq @chloexhalle Love you more!!! So freakin excited for you💫💫💫💫 Yeeeeessss!! Here for thiiiissss!! @chloexhalle ♥️♥️🙌🏽🙌🏽 https://t.co/8hpuSKb4rD Makes* Seeing everyone enjoying #SpiderManFarFromHome make me so happy💫 PFW 19\n\n📸 https://t.co/dOJtpLVi0l via https://t.co/NxPR6lYMyD https://t.co/5hkECe7G59 @papermagazine 😂😂😂 @dayadances @AlwaysAnthea It’s the angle, don’t do me, I grew into my head long ago @kerrywashington @euphoriaHBO Means the world to me coming from you, love you so so much💫 This is me, feeling very badass with my mace. Spider-Man: Far From Home is out now!!! Hope you have fun, and remember to try not to spoil stuff lol🕷\n\n📸 https://t.co/uUxrZZfaCW via https://t.co/NxPR6lYMyD https://t.co/lPjnEQMZCd This is me, feeling very badass with my mace. Spider-Man: Far From Home is out now!!! Hope you have fun, and remember to try not to spoil stuff lol🕷 https://t.co/YBDrefvDkt It’s a valid concern https://t.co/XpP9TwXcA7 RT @ZachBarack: Wow the viral marketing team is killing it https://t.co/yyB8fjhr3V See you soon Paris✨ The cutest @stormreid https://t.co/sZS6Vzq9dz Tonight at 10 on @HBO https://t.co/GjYuAAjzh8 Tonight at 10 on @hbo 💙 https://t.co/1CyVwWJkcW I can’t believe how fast a week goes by, new episode of @euphoriaHBO tm night at 10pm💙 @emoblackthot I’m so old wtf @emoblackthot Is it a app or something @emoblackthot Idk how or what this is lol The spidey suit, but make it fashion https://t.co/CdxgiTEnYn @dayasroses I don’t know which ones to post...so stressed lmao Last night was a dream, so incredibly excited and proud to be apart of it all again. See you all July 2nd♥️🕷 https://t.co/29q6HNzlpq Tonight was fun♥️🕷 Headed to stephenathome 🧡 https://t.co/iFgKoOVtDI @katarinabotkova .... @SpiderManMovie @colbertlateshow 🤗🤗 @spideysvkkstr We were running out of time so I had to take charge and do a speed round lmao Rue rue 💙 Reminder https://t.co/EMCOAYnHE6 💙 https://t.co/N0AdU8nCZs Tonight. @euphoriaHBO https://t.co/FDX0n6ppNm @dayastooth Why is this so accurate Episode 2 tomorrow night at 10pm on @hbo This is just a glimpse of what’s to come, thank you for the love and support of our show already. 💙 https://t.co/aSQE0pdfff Side note this trailer always gets me...every time. What is wrong with me. https://t.co/pSM8OeAnxP This is just a glimpse of what’s coming, thank you for the love and support of our show already. Episode 2 tomorrow night at 10pm on @hbo 💙 https://t.co/o44h0Vk6qO Just posted a photo https://t.co/97T5E6IVYG Check me lmao https://t.co/CqmLIxtsEO @spiderlingdaya Aawwwww cutie 💖 I like to base my outfits off my hair color https://t.co/6noL6g88KR Makeshift shoot https://t.co/znCyY44SlU I like to base my outfits off my hair color https://t.co/ElEhJwv8EV It’s all happening...still crazy to me https://t.co/Q8fE13ErJC @hughesytweets Still red lol, just not showing up in that pic @_Triumphgaming Too late https://t.co/epvjtrVmnh Face it, Tiger... https://t.co/MarjvPnwNS .@jnwtts face in the second picture is all that matters https://t.co/6Ajz4D5xXv Not a bad backdrop 🇬🇧 https://t.co/IgEBukHCtp Face it, Tiger... https://t.co/nGEIiRbb6u .@jnwtts face in the second picture is all that matters https://t.co/EKwfttHd3H Lmao https://t.co/LPU7TRKV9C @spideyplan I dyed it, semi-permanent @PopAIertNews Although flattering this is and always has been a rumor lol @VIRG0DAYA MJ homage ♥️ Just waking up in London, heart racing. Thank you for the overwhelming love💙 @euphoriaHBO https://t.co/RVxXzjk2vC Please read https://t.co/jAV1gOanjL I really don’t think I’m ready for tonight 💙 Thank you, for real💙 https://t.co/dcBSxgLnFS Via my last ig, sorry for my shitty camera work, I had to pass it to my mom cause I was getting to emosh If you watch our show, I hope you watch this first... https://t.co/LcTFbD8j0s @emoblackthot Everyday https://t.co/VUei18IiU6 .... https://t.co/GuOQUcqRNG “Yo, what the fuck!!!” https://t.co/OmSzukgelK 💙 https://t.co/mRRkKK2vHd Kinda crazy https://t.co/CPMcK7NkWv Just posted a photo https://t.co/pSyHtGaVpI To everyone in this photo, I’m honored and proud to be standing next to you. Love you kids💙 @euphoriaHBO https://t.co/k3O0AN4UE1 To everyone in this photo, I’m honored and proud to be standing next you. Love you kids💙 euphoria https://t.co/RyJ8c8nVp4 Happy birthday to my right hand, my big brother and partner in crime @DarnellAppling You are so special, and the world is better with you in it💫 https://t.co/5UYP7OS7or Happy birthday to my right hand, my big brother and partner in crime @darnellappling You are so special, and the world is better with you in it💫 https://t.co/gN3apub93N Thank you @GlamourParis for having me and my @TommyHilfiger collection on your cover✨ https://t.co/6bH691q8wH Thank you to glamourparis for having me and my tommyhilfiger collection on your cover✨ https://t.co/DwDlTa21XV @ianaIexander Awwww thank you♥️♥️♥️ Just posted a photo https://t.co/afHDziXDjn Seeing Red Part 1 @papermagazine https://t.co/bCgvu4ToCY ♥️♥️♥️♥️ https://t.co/6CGhdGJscE Thank you @papermagazine for having me on the cover of your extreme issue, it was my absolute pleasure creating something special with you♥️ https://t.co/8VjA12Htmf I hope you all love my Vogue 73 questions more than Noon loves me💛 https://t.co/VazoL0hTOI I hope you are all loving my Vogue 73 questions more than Noon loves me💛 https://t.co/4gW1DhDhuI @aamndamaee 💖💖💖 Euphoria is out in 15 days y’all...wtf https://t.co/GYmeXSfxMf My heart, this is pretty damn cool https://t.co/67LR2D8vRJ Happy birthday weirdo, thanks for being the wonderful person you are, we’re all very lucky to have you and your weirdness👍🏽 @TomHolland1996 https://t.co/e8DVf41H6F Happy birthday weirdo, thanks for being the wonderful person you are, we’re all very lucky to have you and your weirdness👍🏽 @TomHolland1996 https://t.co/3SmWVzPFwo RT @eemmmmauel: Me explaining \nMy love for my\nDog and how I \nWould die for him                   My dog https://t.co/qy2O9tsJke @queendayas It’s coming relax children, I just woke up lmao @prfctspidey @AlwaysAnthea Don’t play me 🤗✨ https://t.co/NdQA5BUw9G Finally did one🍋  https://t.co/KkXQRZkqlq @spideysunwin I truly can’t stand you all *exciting assholes @holIandings Me this morning.... https://t.co/FQaXprABno I went outside today...exiting stuff oh shit heyyyy! (why do I look the same) https://t.co/Sm78qzP9Lc Something literally anything https://t.co/Kcgeh1VpH9 RT @BriannaLeigh_: It was apparently @Zendaya day today at Barnes &amp; Noble. 😍 https://t.co/jpwrvdnM59 .... @voguemagazine @tyler_mitchell_ https://t.co/NZ2GaiQy99 @Allthelxvesm Thanks for telling me! It’s beautiful♥️♥️♥️ @emoblackthot I’m still at work Official poster https://t.co/YnPqaELXKe @mjxtodd It keeps saying link attached and then you guys say it’s not there...ig is trippin Official poster. https://t.co/RsVyfR7zcV Euphoria. Full length trailer, watch til the end. https://t.co/6JqsKUbDqK Euphoria...watch the full trailer now. https://t.co/jghltuELFT Still freaking out... @voguemagazine https://t.co/Agqajp7Z2r @homecominqs Look at noon being a spoiled brat and refusing to step in the puddle lmao RT @TomHolland1996: AND JACOB BATALON!!@JimmyKimmelLive @zndyahs Please look how low I have to reach...I mean...just saying lmao Clearly we had a terrible time on @JimmyKimmelLive https://t.co/IXZhxgEskz @JimmyKimmelLive @ZendayaMedia @TomHolland1996 @CobieSmulders @SpiderManMovie https://t.co/7Gl3vaiPJm See you soon!! https://t.co/mPbc1MOCt1 @emoblackthot @lauradaya Messssyyyy @g_droggon Nah he’s just Instagram stupid It’s all happening♥️ https://t.co/Yx11mYD5HU Waking up to this is an absolute dream. Thank you @voguemagazine for having me again✨ https://t.co/9o2xzQ9uOW Waking up to this is an absolute dream. Thank you @voguemagazine for having me again✨ @tyler_mitchell_ https://t.co/sktpAY64Ic @TheEveningTimes Can you guys help me contact her family? Done and done💖💖✨✨ https://t.co/rLbAWRJFhU @tomxhollanddd He may have won the battle but I....I won the war You the shit, appreciate you✨ https://t.co/XS3LpQThlC RT @ClintSmithIII: The woman who said Emmett Till came onto her lied about what he said. The officer who killed Oscar Grant lied about what… 💖💖💖 https://t.co/jSkN2y0jLA Thank you to my Fairy Godbrutha for a fairytale ending to my Disney days. https://t.co/zA5oaiBANb Part 2 https://t.co/XxG559EHtc Underneath the magic. Thank you to all the very very smart people who somehow built and made this dress work💙 https://t.co/8Ri2kYQYHj Underneath the magic. Thank you to all the very very smart people who somehow built and made this dress work💙 https://t.co/unoMaFKadt RT @hemmingsxworth: #MetGala ZENDAYA \"lost\" A SLIPPER ON THE STAIRS, SHES SO DEDICATED TO THIS ROLE THE ACTRESS REALLY JUMPED OUT https://t… *SPOILERS AHEAD* New #SpiderManFarFromHome trailer is out!!!!!! https://t.co/pot9Sx3FMx “Bitch please, you’ve been to space.” Oh shit oh shit oh shit https://t.co/aPdwYpwtyv @Winston_Duke @ira Yoooooo lmao @ira Listen... https://t.co/8knScMnP9b I got re-mad about it cause I’m headed to the airport lmao I’m not holding a grudge or anything... Hey @JetBlue you guys lost my luggage about 7 months ago with no word, and when I was directed to your website to get reimbursed for my lost items, your website crashed on me twice. Any help here? @softchelles Well damn. @hughesytweets 😂😂😂 RT @VanityFair: Get an exclusive look at @HBO’s Euphoria, starring @Zendaya, which will debut at @ATXFestival https://t.co/v1exOYwQ1b Still don’t wanna talk about it. https://t.co/DBGeLdb9sa @AlwaysAnthea I felt this on a spiritual level... 💖 https://t.co/Fxcj5mCkre @parkercheIIe Just went to go brush my teeth and coincidentally remembered I was wearing this to bed https://t.co/HLmkmrD3HM @parkercheIIe Literally, as soon as I get a day off, or three hours off lol RT @MarvelStudios: From the end credits to the endgame... ....a masterpiece https://t.co/li56gGMaeX RT @IlhanMN: As countless people attend Easter service today, our prayers are with the people of Sri Lanka who lost loved ones in these hor… Thanks for coming to visit💖💖💖 https://t.co/ZhLoL4T76v @tumblrdaya I don’t even know what that means @Zendaya https://t.co/BXjjTxEopV Just woke up...y’all know what time it is.... https://t.co/H5hZQM6TPi @emoblackthot ♥️♥️♥️♥️ RT @sonaiyak: In a rare feat for Hollywood, #LittleMovie features 5 black women in major roles: @marsaimartin, @IssaRae, @MoreReginaHall, d… June 16 #EUPHORIA https://t.co/xVKRqRb89F RT @HBO: june 16. #EUPHORIA https://t.co/wp2MWjyVFq June 16 #EUPHORIA https://t.co/4Whw7ASV7W She’s a Virgo #TommyxZendaya https://t.co/2Bs64X5PoC She’s a virgo #TommyxZendaya https://t.co/n0ahpK6E3r ♥️ https://t.co/Ja7DAzKhx3 RT @MichaelSkolnik: Nipsey was all about his community, investing in Vector 90, a co-working space in South Central LA for entrepreneurs an… @MatthewACherry @KadeemHardison https://t.co/ghrQgaCVFs Weekend? What weekend? I don’t know what that is. I second this https://t.co/nhCO6hLBld @MatthewACherry Appreciate you🙌🏽 @chloexhalle @HBO ♥️ Euphoria coming soon to @HBO @A24 https://t.co/ofr3z7AyXx Euphoria coming soon to @HBO https://t.co/Pq7EqEqiIG RT @Marvel: Your friendly neighborhood Spider-Man has gone global. Check out the new international #SpiderManFarFromHome art and see the fi… Gotcha https://t.co/zgO0G1YURl @zendayawlw Look at the next picture before you assume I’m whack lmao You are so stunning, like wtf, and your support means the world to me...💖💖💖 https://t.co/U38PVFttW0 @ava @ZendayaMedia 🤗✨ Thank you sun https://t.co/4rK51djf09 Thank you sun https://t.co/qAhnFG5pBH Golden girl \n\n#TommyxZendaya https://t.co/TFXEytN0Gd Golden girl\n\n #TommyxZendaya https://t.co/OmscMCTgPr 😂💖 https://t.co/HeyPOmeQna @dreamy_daya @slayagedaya I don’t know where that came from but I’m flattered lmao @slayagedaya I didn’t, I had ideas but the tommy team executed it! I wish lol We fine as hell💖 https://t.co/Z5D2vGA319 @MStadem 💖 @Zendvyaa I deff would have told y’all if I did, have a good night💖 @DayaHive I saw that, I think there was just a little mix up from shake it up days, but I do appreciate her message💖 Dear @LUXURYLAW ... https://t.co/zqZe5n7uo7 Dear @luxurylaw ....swipe for the rest✨ https://t.co/dQLYVuhCfn I’ll be back when I land in 10 hours with more posting...be ready 😂 Grateful for you, thank you sis♥️ https://t.co/rYeTNjYAEY History. https://t.co/Gwrx9orGbv History. https://t.co/EC26vWga9s So to every woman on that stage and the many others who weren’t, we love you, we see youand we thank you. ✨@luxurylaw https://t.co/hAuZh3fCcH I’m still not truly convinced the other night really happened, cause that’s how dreams feel. Our show was a celebration and appreciation for all of the iconic women who fearlessly pioneered and opened doors that are the very reason I’m able to exist in this space.... https://t.co/f8TQXt8k77 I’m still not truly convinced the other night really happened, cause that’s how dreams feel. Our show was a celebration and appreciation for all of the iconic women who fearlessly… https://t.co/EelKiGQr24 My suit from last night is from my Fall collection btw https://t.co/e1ENThdfA6 @BrunoMars @LUXURYLAW @TommyHilfiger Thanks man, appreciate the love♥️ Then this happened, me and my family proceeded to pull over and take a lot of pictures♥️ https://t.co/XpWk0AnJtY The feeling of stepping out in your own collection✨ #TommyxZendaya https://t.co/TRRamrXGzV The feeling of stepping out in your own collection✨ tommyhilfiger @luxurylaw #TommyxZendaya https://t.co/8qbxQPD2bW I- 😍 https://t.co/YshsDXVW43 @AlwaysAnthea @hellamaree @plsdontdeleteme @smhmaree 😍😍😍 ...speechless. https://t.co/msbxi7xAkK ....speechless. https://t.co/Fpy0Fxm8fF Making the call✨ https://t.co/vKD1K3Q1RQ RT @ava: 70 years badass. https://t.co/bfBnjBDkCY RT @mefeater: Some looks from the TommyxZendaya Spring 2019 RTW Collection ❤️ https://t.co/SMdvf6t4hD We ain’t done✨✨✨ https://t.co/x4eymVNWGL @ralpdibny Yes...she does😍 More loooooooks https://t.co/wtebV8eNsH Looks looks looks https://t.co/g5nEQJd1yk I’m still in shock and so emotional and moved by this show...I’m speechless. Thank you a million times ✨ @TommyHilfiger #TommyxZendaya RT @IAMFASHlON: Zendaya just showed her #TommyXZendaya collection and had the one and only Grace Jones return to the runway to close the sh… @tvfanatic97 Can anybody find that pic without the watermark??? Who you tellin?!?!?! https://t.co/g8Fg1Jvtvu 3 and a half hours until the show!!!!!!!!!!!!!!! @TommyHilfiger #TommyXZendaya @spideymjj You see that blue light...that means cool sweetheart https://t.co/eJcyON6qpj Raise your hand if you get to show your @tommyhilfiger collection in Paris tomorrow night✨ https://t.co/kdIUhVtCiw Raise your hand if you get to show your tommyhilfiger collection in Paris tomorrow night✨ https://t.co/sX6R69abOE See you in the morrrrning💖💖💖 https://t.co/GH9Myuo0Ok Layers https://t.co/BaWuPBPcto Layers https://t.co/flwB24Feci 🥰 https://t.co/OsZta0Yeaj Oh shit!✨✨✨ https://t.co/b7ZZ1VRReU RT @TommyHilfiger: We can’t wait to show you the full #TommyXZendaya collection on the runway! Don’t forget to tune in live at 9PM on March… Law being shady as usual♥️ https://t.co/1VnPN2h4tQ Law being shady as usual♥️ https://t.co/JVOGRGL5ju Work attire https://t.co/CXD2lsGIhy Work attire https://t.co/Cc18WJTy8t I’m ready https://t.co/qmBcT94L2i Mary Poppins has officially arrived in Paris https://t.co/gS5IcikEQd Marry Poppins has officially arrived in Paris https://t.co/u8eMmkBelx @prfctbws Relax it’s coming The drama of it all... https://t.co/sZr9QxPwqa The drama of it all... https://t.co/hGWRi7l3yV Thank you @vanityfair and @LancomeUSA for an absolutely magical occasion the other night. Honored to have hosted beside the phenomenal @radhikajones and @ava ♥️ https://t.co/OBxRuW0Iz3 Thank you @vanityfair and @LancomeUSA for an absolutely magical occasion the other night. Honored to have hosted beside the phenomenal radhikajones and @avaetc ♥️ https://t.co/dFlpQvSjmI Ok last one🌹 @LancomeUSA https://t.co/UOjf7bD6OW When the queen @lupita_nyongo herself welcomes you to the family... @LancomeUSA 💕 https://t.co/yCgaR8T0Mx When the queen @Lupita_Nyongo herself welcomes you to the family... @LancomeUSA 💕 https://t.co/mejUWWZZaE @LancomeUSA I’ve been so excited to talk about this and now I finally can!!! I’m officially the newest face of @lancomeofficial ! I’m absolutely honored to be amongst so many incredible women. Can’t wait to show you all what’s coming♥️ https://t.co/pCm3RAvR0a I’ve been so excited to talk about this and now I finally can!!! I’m officially the newest face of @LancomeUSA ! I’m absolutely honored to be amongst so many incredible women. Can’t wait… https://t.co/px1x7v5jgJ @IamGMJohnson 💖🤗 Thanks✨ https://t.co/dO1XSeLNsE Thank you so much for your warm welcome♥️✨ https://t.co/qqlXSMN6YR ♥️♥️♥️ https://t.co/7hjDapzPzo It’s been a good day💖 https://t.co/PxkSYiZrxK @MatthewACherry Let me get in on this😩✨ https://t.co/rJPxWaQhuF Shoutout to @DarnellAppling for braiding me up before we left the house for Vogue. Thank you @voguemagazine for featuring me and my @TommyHilfiger suit in your March issue✨ (outtakes added) 📷 @micaiah_carter #TommyxZendaya https://t.co/8i9ZHeLSW3 Outtakes https://t.co/I7Q6yKAvAW Outtakes https://t.co/OYK633t5hp Thank you @voguemagazine for having me and my tommyhilfiger suit in your March issue✨ #TommyxZendaya https://t.co/7IyzGb77Cp @hughesytweets @rihanna I couldn’t breathe, cut me some slack lmao Need I say more? \nHappy birthday to the baddest...@rihanna https://t.co/achC7SpCs3 Thank you✨ https://t.co/ppXmi325Ht @MatthewACherry @TommyHilfiger @LUXURYLAW 😂 Love you💖 https://t.co/Hm9fXAxYW9 Muahahahhahahha https://t.co/8jOkPQAQMY #TommyxZendaya https://t.co/zuBVJ8L4yO An all-over zodiac printed silk suit...why not? \n\n#TommyxZendaya https://t.co/zlzg9bx9yd #TommyxZendaya https://t.co/yL7HgWaJGF Am I about to flood your timelines with pics of my tommyhilfiger collection...yes. https://t.co/AAW8hOMV4q #TommyxZendaya \n\n@TommyHilfiger @zendieyo Come for me...ok ♥️ https://t.co/M82ZbHreUs ♥️ https://t.co/swHNL1YHst See you July 5th https://t.co/BVn6zlaLns This just made my day....I’ve made it!!😮🤗 https://t.co/Zpxk8FZtR6 Anxiously waiting to show y’all the whole spring collection...#TommyxZendaya\n\n@tommyhilfiger @luxurylaw https://t.co/zgHGBFpClD Anxiously waiting to show y’all the whole spring collection...#TommyxZendaya\n\ntommyhilfiger @luxurylaw https://t.co/FLR3oSCO1u RT @InStyle: Get ready to love bell bottoms, psychedelic-print turtlenecks, and platform clogs all over again. @Zendaya's @TommyHilfiger co… RT @alissa_ashleyy: @Zendaya @InStyle im ready https://t.co/FuTK1AwQIg Thank you @InStyle 💖 it’s all happening!! https://t.co/3uu3KlLQOZ RT @MichaelSkolnik: The national emergency in America is that Flint still doesn’t have clean water. 😍✨ https://t.co/pUcKFJSl2X @hughesytweets Honestly idk, but I’m cool either way💖 @shining_sheep Well you gon see it again lmao So crazy, so proud✨♥️ did that!! @benjpasek @heyitsjustin @kealasettle @ZacEfron @RealHughJackman https://t.co/Kbmuki58HV RT @ZacEfron: Unreal!! Amazing!!! 🙏 @Zendaya @benjpasek @heyitsjustin @RealHughJackman @kealasettle @GreatestShowman https://t.co/7lPZt4IMGm RT @RealHughJackman: And the @RecordingAcad goes to ... @GreatestShowman @AtlanticRecords @pasekandpaul and the entire cast and crew! #Gram… RT @RecordingAcad: Congrats Best Compilation Soundtrack for Visual Media winner - 'The Greatest Showman' @GreatestShowman #GRAMMYs RT @AshlyYailin: The flavor.... sensational https://t.co/NbbjMyfjNh For the record my little niece had nothing to do with it, it was purely my shitty installation😂 Remember that wall I did in my little niece’s room...well my sister just sent me this https://t.co/rI9ksoRUUw @MatthewACherry 😏👊🏽 RT @MatthewACherry: Get it @Zendaya https://t.co/TLndEg3Elw @DarnellAppling I’m tired leave me alone RT @spideyscovey: people are still pronouncing zendaya as zenDIEya? in 2019?????? https://t.co/p9t0wNQSNN RT @common: Wishing a Happy Birthday to our Brother Trayvon Martin who would’ve turned 24 today. RIP. https://t.co/xsYbclHmSn I’m tired but not sleepy, if that makes sense Still https://t.co/zjZolYsCWE RT @MatthewACherry: @ava @NFL @Kaepernick7 Join in on our 2nd annual #JanetJacksonAppreciationDay instead https://t.co/ptG4QrFUiv Ain’t nothing wrong with me, but good to know I have backup lmao @emoblackthot What we waiting for? @emoblackthot I’m done 😂 https://t.co/cjLH4BQpUU Honored to be amongst so many amazing leaders✨ Share how you’re making history and contributing to your community to be that 28th person! We appreciate and celebrate you. https://t.co/DVyzveEXRa \n\n#HappyBlackHistoryMonth #DreamInBlack https://t.co/68VioZRjVX The Cheetah Girls didn’t have to go that hard on Cinderella RT @BerniceKing: I, too, sing America...\n\nTomorrow,\nI'll be at the table\nWhen company comes.\nNobody'll dare\nSay to me,\n\"Eat in the kitchen,… My stans coming for me after I log out https://t.co/e6K4sbldTu @spidychelle @depressive97 On yo ass https://t.co/vbO3O7A8wl @depressive97 https://t.co/OvB5hR07s2\n\nFirst of all, y’all not bout to come for my execution of this choreo without context assholes😂 Happy birthday to the most brilliant, gorgeous and talented woman. Thank you for being a constant inspiration and mentor for me. @kerrywashington https://t.co/yttnSnQd4a RT @FATHERBONNET: holdon.... Beyoncé offering lifetime tickets to all her shows if we win a contest for going vegan? bitch hand me some let… RT @IamGMJohnson: Check on your LGBTQ folks today.\n\nMany of us already walk with the burden of knowing an attack can happen at any time. To… I just hope there is justice in this hateful and targeted act of violence. Sending @jussiesmollett my love and wishing him a speedy recovery. We love you. https://t.co/CReCJi2Hn6 This is heartbreaking and terrifying...please pay attention to what’s happening here. Sending all my love to @JussieSmollett https://t.co/YTJ6bwLDkZ @Kehlani duuuudee😩💖 https://t.co/n8Dfp4DXgw I’m going back to sleep @ trump’s whole team https://t.co/2zIeoSuwSS ✨ https://t.co/e4cMU7bCFt ✨ https://t.co/Rs4pWj7twq @tvfanatic97 @spideyplan Oh I did lmao y’all have too much time on your hands @ruemj It’s on warm sweetheart RT @BerniceKing: There will be an overflow of King quotes today.\n\nMay there be an overflow of his love for humanity &amp; his heartfelt commitm… “We need leaders not in love with money but in love with justice. Not in love with publicity but in love with humanity. Leaders who can subject their particular egos to the pressing urgencies of the great cause of freedom…..a time like this demands great leaders.” -MLK https://t.co/rNKhcDdXQU “We need leaders not in love with money but in love with justice. Not in love with publicity but in love with humanity. Leaders who can subject their particular egos to the pressing… https://t.co/MpteZqoN47 @tvfanatic97 @hughesytweets ^^^ @hughesytweets @AlwaysAnthea @spideysdayaa Talkin shit 😂 @AlwaysAnthea @spideysdayaa Thank youuuu!!!! @spideysdayaa But that’s the thing...I do RT @xiocon320: @Zendaya https://t.co/LtezHAJO28 Y’all gon leave me and my typos alone Personal goal this year; to keep things in perspective and allow myself to thoroughly enjoy things instead of over analyzing and stressing over every single probable negative thing that could happen, that hasn’t and probably won’t. RT @ava: Many want to know who the kids are, particularly the one trying to stare down the elder. Those kids have already told you who and… RT @harpersbazaarus: .@Zendaya talks family ties and keeping it real. https://t.co/TeXIARQx0a Mood til July 5th... https://t.co/OOOzJkyG4B Mood til July 5th... https://t.co/XFVFPHnSWe @chloexhalle 🤗💖 @deIuxeverytimes Shhhhh Good morning!!!! Spider-Man Far From Home 1st Official Trailer!!!!! https://t.co/2peW9gOCqa Goooodmorning!!!!!! https://t.co/zaWRPBHDOW @AlwaysAnthea Come on complex simplicity lmao @lissablizza 💁🏽‍♀️ @KirkDeveyck Yooo😂 RT @TomHolland1996: I’ll see what I can do 😂 https://t.co/e4fBy5J7oz Already finished that one https://t.co/1vNmm5086V It always starts normal https://t.co/nu9LkmTSiS It always starts normal https://t.co/ORRskE3AkE This shoulda been my holiday card https://t.co/EkK6XDW1BK This shoulda been my holiday card https://t.co/y76en6HeVz @marsaimartin @IssaRae @MoreReginaHall So proud of you!! Love youu💖💖💖 *is in @SpiderVerse orrrr *in @SpiderVerse is\n\nWhatever works for you In time lol https://t.co/fBZoyHm1gK Sometimes I just randomly think about how absolutely gorgeous the animation is in @SpiderVerse is. Yes👏🏽👏🏽👏🏽 @marsaimartin @IssaRae @MoreReginaHall https://t.co/A12jxMY0vP See you in Paris... https://t.co/ydVXksE9Kg #Euphoria premieres on @hbo in 2019. https://t.co/pq5xIy5x8Q @hughesytweets He literally hasn’t stopped sniffing me since I got through the door lmao @moodyseavey I’m aware @imsorrytony Go away lol Sneak peek https://t.co/vW0qAQoe13 Debating on *whether or not I should post this wisdom teeth video on ig, cause I look a hot ass mess... Still feelin weird but better lol @parisdaya So y’all can laugh everyday RT @angelsdebut: @Zendaya the way you say shoutout to moisturization is sending me SJSKSK https://t.co/vpWNBWcCer @morgsbadillo Shout the fuck out Posted my update on ig stories but there’s a couple more vids from right after the surgery that are cracking me up...I’ll post them later. It’s not as funny as the ones you see on here usually cause I’m actually making sense, but still, it’s funny to me lmao...Coming soon lol I get my wisdom teeth taken out in 9 hours...fun times @DEVILSNlTE @AlwaysAnthea Yo😂 RT @MatthewACherry: RIP Oscar Grant. 10 years ago today. https://t.co/U38CdPKsX7 https://t.co/ldItb4O3z5 Here’s to more moments like this in 2019... https://t.co/kzasW0OMl2 Here’s to more moments like this in 2019... https://t.co/06XjiFh1p1 *clears schedule for release date* https://t.co/nHJfMqmyIa RT @ava: I don’t just wear locs. They are a part of me. A gift to me. They mean something to me. So to watch this young man’s ordeal, wreck… Done with y’all lol https://t.co/mIzmPTzKca I guess this gives me an excuse to post these year old pictures. https://t.co/AJOFPFPf7c I guess this gives me an excuse to post these year old pictures. https://t.co/0kEnkHmq74 In honor of this little movie I call The Greatest Showman turning 1 today, here is me as Anne Wheeler doing the utmost. https://t.co/gowEtDHWr8 In honor of this little movie I call The Greatest Showman turning 1 today, here is me as Anne Wheeler doing the utmost. https://t.co/RIy9xcP8Op Mrs. Michelle Obama is really not playing with us with these looks.✨😩 RT @Zendayafan1313: @Zendaya Thank you!! I added $5 to the card!! Now back to studying for finals😑❤️ https://t.co/XV8kYcrkoB Here we go✨ https://t.co/qISchGh8F8 Currently refilling the card...please hold lol @_lowkeyqueen @MarkRuffalo Currently refilling...please hold lol https://t.co/qvnVC9IMS9 What @MarkRuffalo said! Enjooooy! 💖#PayItForwardChallenge https://t.co/PYpGiRsYSp This is awesome, done and done♥️👊🏽 https://t.co/o7sifPIt0G @MatthewACherry @Essence @VashtiHarrison @penguinkids @KokilaBooks @Tweetpathi @Monica_aYoung 😍🙌🏽 RT @lgbtbrunn: @Zendaya Big bird in dramatic lighting is everything we need https://t.co/rOY0cxdKzs Just posted a photo https://t.co/mHudunPeGa The invitation said cocktail casual https://t.co/mDWvCoE17Y The invitation said cocktail casual https://t.co/EsbAT5MZsl Got the privilege of watching it this past weekend. Absolutely breathtaking, every shot. I can’t wait to see it again tm when it’s out. Congratulations to the brilliant cast and @BarryJenkins ✨ https://t.co/HHWCBKabMH @Kamil_McFadden Imma say this one more time. I like the negative space and the framing shape. @ayenissa Listen...I’m getting my little waves back growing out the damage....flourishing lol Y’all too!!! And even got one from @Bosslogic , so you know it’s professional https://t.co/Pl6RVRGiEq Shoutout to all my homegirls who swooped into my dms with the picture pre edited...that’s sisterhood @Oneoftheloves14 Nah I like the shape I wish I could edit the damn speaker off the wall. https://t.co/4yhmpOPFV7 I wish I could edit the damn speaker off the wall. https://t.co/YMwj2MPad0 @ira You too???!! Lmao But until then...leave me alone I have so much coming...I promise you’ll forget how inactive I’m being lol ... https://t.co/jdkAAg6b23 @Lin_Manuel @ira 😩♥️ @spiideydaya Done😂 I swore I’d never be this dog mom, but someone sent me this little turtle neck for noon and my son is fucking it up with his sweater weather attire right now. Flex on em son. https://t.co/7dixaM3jFc 😮 https://t.co/y17mhHjrAn RT @ImaginexJustice: \"You can kill a revolutionary, but you cannot kill a revolution\" Fred Hampton. On this day in 1969, Fred Hampton, the… @tomsflueger First of all... https://t.co/rYuXRpJquQ So I found out I’ve been over watering my Dracaena Marginata...fun fact. My stans in a tweet lmao https://t.co/v2EB18rLMD RT @juliampecharki: @Zendaya 💖 https://t.co/WrO4OHizCI Rains in LA once... https://t.co/ICfHz95Rtv @zenslaya That was low lmao Go read a book https://t.co/qpa8Y202vW @spideyunivrse Good, still at work @niborahsa @DarnellAppling @chloexhalle 🤗 @spideyscovey To be used sparingly All these demands https://t.co/6fghPY0zd7 Last year my new year goal was to be on my phone less, well I’ve been successful. So I’ve been banking selfies. This is from that curated collection. https://t.co/bftsOtorva Last year my new year goal was to be on my phone less, well I’ve been successful. So I’ve been banking selfies. This is from that curated collection. https://t.co/5eQNR4gVpE An abomination. https://t.co/hm29JRvghR An abomination. https://t.co/0OHqL5YJNY Stop. https://t.co/NesPIBMaNn The internet is weird, I’m gone for two seconds and now all this surgery on a grape nonsense. I’m confused. Hi love🤗 https://t.co/CjG1oqE04Q 💔 https://t.co/MIEAjv7eWa Yoooooo😩 https://t.co/mku7QIkmml She’s coming https://t.co/waO2kRtALT @ all my stans coming for me for being inactive... https://t.co/DnzIuucLGL @bbydayaa https://t.co/rEnFNVBNy8 Sorry I’ve been working!\n(This is to be read very sarcastically) I get it ok, I get it. https://t.co/ZVjBIpnzpS RT @Zendaya: Soooo I made 3 @popsockets grips, for each sale they'll donate half of the proceeds directly to @foodcorps an organization who… https://t.co/pP79JJ18YG https://t.co/pP79JJ18YG ♥️🌱 Soooo, I made 3 @popsockets grips, for each sale they'll donate half of the proceeds directly to @foodcorps , an organization who seeks to give every child—regardless of race, place, or… https://t.co/DCahUq5rpD Soooo I made 3 @popsockets grips, for each sale they'll donate half of the proceeds directly to @foodcorps an organization who seeks to give every child—regardless of race, place, or class—the nourishment they need to thrive by connecting them with healthy food in schools! ♥️🌱 https://t.co/4yFFLfeguD The legend himself. Thank you for all you gave us. I could not be more honored to be a very small piece of your world. Rest in Superpower💥 https://t.co/k338fTBSAG The legend himself. Thank you for all you gave us. I could not be more honored to be a very small piece of your world. Rest in superpower💥 https://t.co/HgsFlYyZS2 @Zheliantus Y’all needy😂 @baetoul ....shhhh lol RT @MichaelSkolnik: As we celebrate and honor our veterans, let us remember that 22 veterans commit suicide everyday.\n\nPlease support organ… RT @katie_levans: It’s the 312th day of the year. https://t.co/ySQOiPjMvp @spideysunwin And it’s because his eyes look like the stone tigers eye @spideysunwin Like the animal lol RT @underoosparker: the deed has been done!! there is still time for those who haven’t voted yet! get out there and let your voice be heard… RT @spidychelle: @Zendaya and i told you to go vote so GO VOTE! YOUR VOICE MATTERS! #IVoted #VOTE https://t.co/i2EQrfamoA ✨ https://t.co/Bmvn9yFeNH RT @Zendaya: I voted, you? https://t.co/ZBPIBytYyx Whatever works👏🏽 https://t.co/GYzd129mPI RT @KamalaHarris: RT if you’ve voted and want your followers to do the same. RT @YaraShahidi: Mission accomplished @Zendaya https://t.co/6RiRbDNwXe I voted, you? https://t.co/ZBPIBytYyx RT @shondarhimes: Shirley Chisholm became the first Black woman elected to U.S. Congress on this day in 1968. Fifty years later, her words… I voted, you? https://t.co/Yl2RQVLDvq Currently filling out my ballot... https://t.co/ubNIlPR4J4 @spidychelle @Zendaya @badtimc We went together💖 @ptermj It’s for my mom, and it’s not hers yet lol Y’all thought I was joking https://t.co/o2fveeqS87 The last one...I’m typing this with my glasses on and hoody fully tied in bed with noon... https://t.co/0pUUD44NTH @AlwaysAnthea 3 costume changes. Jack jack, a witch and her princess dress with a Jason mask. As soon as my little nieces get back😂 https://t.co/Mv1LgpURkw @kordayanation That too I’ve been away from home so long I forgot how to use my own shower... You see, the misconception is that I don’t like Halloween...I love Halloween, I just like watching OTHER people dress up. I dress up for a living...I’m good lol @SimplyChance_x Shut up lol RT @memedaya96: good morning let’s get this https://t.co/F5myBiMrIL ... https://t.co/N1B71ghpvL RT @BeauWillimon: A white supremacist kills 2 African-Americans at a store.\n\nA right-wing extremist is caught mailing bombs.\n\nAn anti-Semit… https://t.co/VnXLOPULSA Just posted a photo https://t.co/DZnvzyqzVb 🗣🗣 https://t.co/7lWWXKsEDI RT @jayjuniorrr: me &amp; my girls leaving our nearest polling place on November 6th after voting in the best interest of minority groups that… Outrageous https://t.co/ImUj2hnPcz Omg♥️♥️♥️♥️♥️ https://t.co/f8dwTnwwQc @dayasroses Here we go LOVE YOU SO MUCH MORE!♥️Such an incredible + emotional experience, you were (as always) absolutely freakin brilliant! Everyone, I highly recommend seeing #AmericanSonPlay go go go!!! https://t.co/pJK6fi5ub1 Guess who’s 3 today...time slow down💖 https://t.co/msycF6QJ2A Guess who’s 3 today? Time slow down https://t.co/gwGo4ZT5la @dumas1000 No I’m not lol 😂 Awwwww this makes me smile ear to ear...thank you for taking the time to make this 💖😘 https://t.co/Oz2WaEWI4W 😳 https://t.co/mSiROksOHH Spring 2019 collection coming soon✨ #ZendayaXTommy https://t.co/nzHepxeOtt Spring 2019 collection coming soon✨ #ZendayaXTommy https://t.co/Aeh9nqoPhE @jackieaina @ZendayaMedia 😂💖💖 It is....it really is.✨ https://t.co/yqT1Aw5mjI RT @MyovichOFFICIAL: @Zendaya Lol your response with your profile picture is everything 😂👌🏻 Wow...so y’all just gon keep going? https://t.co/jguQXJJKWo This is what I needed to see today...like😩 ✨ https://t.co/QlRnwj7VI7 My babies/publicists lmao 💖 https://t.co/WJCwBvoxER 👏🏽 https://t.co/moXwlXj9Eh @dumas1000 I need the hq of this😩 @princessmastro @JSwayArt ♥️♥️♥️ Casual (+ Outtakes) https://t.co/FQvUxkH4to Casual https://t.co/yWwHjMluAj RT @MarkRuffalo: It's Avengers 4: Register to Vote https://t.co/PYLb17NbzP Now that’s how you start your day, supporting @MichelleObama and the #GlobalGirlsAlliance 💖 Goodmorning!! Iconic https://t.co/OMHCTwofli RT @lauren_hoggs: @Zendaya You guys can register to vote at https://t.co/Bmg4IbXLKv Happy #IndigenousPeoplesDay ✨✨ Come on thinking ahead👏🏽 https://t.co/5oiVVfuMvp RT @tomsflueger: @Zendaya me @ anyone who hasn’t registered yet https://t.co/o1Tvmvpwvb @PINK_QueenA This is what I found when I looked it up. https://t.co/AlVsWKSavr Have you registered to vote? If not, do that shit! NO HEAT https://t.co/fAfaYUwGra Just a quick thanks to all of you for keeping this smile on my face. Europe...it’s been real, see you soon NY ♥️ https://t.co/pIHjld3S7n Just a quick thanks to all of you for keeping this smile on my face. Europe...it’s been real, see you soon NY ♥️ https://t.co/AgeuZaOfFN That dramatic hand lol When in Venice... https://t.co/lDFzIsUxyE When in Venice... https://t.co/VxsLfCxKW3 Ummmm....lol https://t.co/TLMetnmiZ7 @marissa__kerri Heeyyyyy RT @esnyprada: @Zendaya I imagine this is your face right now https://t.co/uIeCMfX1Me No https://t.co/UcmTTA7PQd Mind your business lol https://t.co/4DvzROZvrl This is the cutest thing...give them a big hug for me🤗💖 Thanks bro!! https://t.co/MsLl6OuFvj Hope everyone is enjoying @smallfootmovie !!! ❄️ (And yes...I am Meechee) https://t.co/QbWmM3FLPX Hope everyone is enjoying smallfootmovie !!! ❄️ (And yes...I am Meechee) https://t.co/Y9c14lGTvC Like...how fucking gorgeous are you😩💖 https://t.co/cxJWHb0pVT Y’all need to chill lol https://t.co/04rFUOFbLr Yes! Hahahahah https://t.co/MG0ZYcR34R RT @KingJames: Exactly what Channing said. And I mean exactly! Lol😁 https://t.co/V5thYNvnEJ If you go, please send me pics🤗 Yaaaaayyyyy it’s out!!!!🤗 (Shout out to all my grown fans who are still going) https://t.co/BkzStc4MAz A day off https://t.co/URlP4s7v3o A day off https://t.co/9gL98J9lpc Trying to be a tourist but also casually serve face as I know I’m being photographed lmao There will soon be a pap picture of Darnell taking my picture lol RT @gabegundacker: zendaya is meechee: https://t.co/7CAbH0rrZs 😩✨ https://t.co/nDcWv5I5ay Sang my name right and everything 😂😂😂 https://t.co/1rKNc2eff9 Since y’all hating on my twitter layout...what would you suggest my header be? It’s accidental...I’m not that cool. https://t.co/iNohAevzSO Today’s hair inspo... @SMALLFOOTMovie https://t.co/BVfKDFWe36 I had a really great day today and I hope everyone and their families enjoy Smallfoot as much as I enjoyed being apart of it! ❄️See you in theaters in 6 days!❄️ https://t.co/kCcqnvzZb1 Today’s hair inspo lol smallfootmovie https://t.co/QC7VaEzQRF I had a really great day today and I hope everyone and their families enjoy Smallfoot as much as I enjoyed being apart of it! ❄️See you in theaters in 6 days!❄️ https://t.co/8QtXL1b1l7 So nice to finally meet you cutie pie😩💖 https://t.co/70riAZQKTr @rowanville Yes @hellamaree Awww thanks🤗(I can’t find this one without the watermark😩) 😍💖 https://t.co/O9yFlXNrsn Accurate lol https://t.co/O8GHfz0R7K She was in it the whole time, she was laughing and everything. I’ve made it lol https://t.co/QyEfD2cYGc @Arielluvss @SMALLFOOTMovie It’s coming lol Today has been perfect...I saw noon, I saw my little nieces and nephews, and I saw @SMALLFOOTMovie Needless to say...I’m a very happy camper🤗💖 @brinasflowers https://t.co/n59C3vnGZf RT @SMALLFOOTMovie: GAME. ON. Get tickets to see #SMALLFOOT now: https://t.co/Itl72yro0j https://t.co/oIcd3QUYdX Sightseeing https://t.co/SJcco4eHEo Sightseeing @ Prague, Czech Republic https://t.co/muB1tbvtTl Princess...I love her 😩 her little “yesss” lol https://t.co/UtD8ARvo0W I did. https://t.co/IFEeyJ8x39 😩😩😩😩😩 https://t.co/8d3DG3S2CZ RT @TIME: TIME’s new cover: ‘I work 3 jobs and donate blood plasma to pay the bills.’ This is what it’s like to be a teacher in America htt… @stanIeymaree I’m sorry, I really wanted to but then life/work happened and I ran outta time...I’ll make it up to y’all (not sure how yet) but promise lol🤗 💖🤗 https://t.co/yz8I6tGvFU RT @SMALLFOOTMovie: This is one cool cast. Don’t myth #SMALLFOOT, in theaters September 28. https://t.co/wZghGwVZ0w 3/3 Ok I’m done, sorry lol🖤 https://t.co/XCUmGz9Djq 3/3 ok I’m done🖤 https://t.co/tKZhZnaQNq 2/3 (fun fact: I did my own h&amp;mu tonight, hence the lipgloss still in hand) https://t.co/ZBlDJceh9a 2/3 https://t.co/DLfTDRq8Ej 1/3 posts coming...just a warning, I’m feelin myself lmao https://t.co/PZgRfu1f2b 1/3 posts coming... https://t.co/dhj2txq6dT I love a good leg slit... @WhitneyRaeB Hahahah. Never. I’m hilarious. Fact. https://t.co/rhh3eCfiXu So you just gon steal my caption for my video...word😂 https://t.co/FiWbfwUlP1 https://t.co/p9Y1EIKrE0 @avengers_daya We love an international holiday ✨ HAPPY #BeyDay !!!!!!🐝👑 RT @Kaepernick7: Believe in something, even if it means sacrificing everything. #JustDoIt https://t.co/SRWkMIDdaO The Little Black Dress https://t.co/8df2rTMPvF The Little Black Dress https://t.co/Z31V7ZWnIg https://t.co/Ro4EcSFEJf Just posted a photo https://t.co/BWb2cC2Pfp @teeen_dream They are lol Plot twist...my dad got his first tattoo today Mom’s Ok so obviously I’m in London and my mom out here and wants to get a tattoo...any shop recommendations? I'm bout to take my ass to bed, but I really don't know how to put into words how grateful I am for the love everyone has shown me today, thank you for another beautiful and special birthday. (Technically it's still my birthday in Cali, so turn up) Keeping this energy as I enter my 22nd year of life. https://t.co/Fc5DmNBbDR Keeping this energy as I enter my 22nd year of life. https://t.co/tcn1pqcoZj @Hayden_Williams 💖💖💖 Thanks big bro, appreciate all your support👊🏽♥️ https://t.co/imqSF7sdnZ I’m gonna save the birthday video thing you guys make every year for the end of the night✨ I got you lol https://t.co/bgko2lIMDx @spidchelle Damn One more hour of being 21 @asapdaya Well @asapdaya Y’all don’t need to know me this wsll @zenslaya 🧐😏 Life imitating art. https://t.co/JF7adNPpgW Life imitating art. https://t.co/cBCpmYgvaa Get you a hype man like @DarnellAppling https://t.co/ScMtxECK2W Get you a hype man like @DarnellAppling https://t.co/LmVSNB2DkG @SMALLFOOTMovie press dayy❄️❄️❄️ https://t.co/jERuOfGYIz My birthday is coming up...time is moving utterly too damn fast. @Almightyzendaya .... @jadahhkiss @KadeemHardison https://t.co/Jjr5mkwm2X Being a tourist today lol @dayashiki https://t.co/oPnzAx2cm9 Y'all have too much damn time on your hands 😂 https://t.co/BSJdEuBZuh @zendayasabrina @brittaneyelise Same Feeling a little home sick...btw thank you @brittaneyelise for helping me turn my house into one.💫 https://t.co/AYJao6Ew4K Feeling a little home sick...btw thank you @brittaneyelise for helping me turn my house into one.💫 https://t.co/0nidNUj8Jo https://t.co/Sbh8XOCgTb https://t.co/KiOn8GZ7f6 Listen😍 https://t.co/EAsZ3vzgiN @dayashiki @AlwaysAnthea ...haha..funny. RT @KristenClarkeJD: Aretha Franklin was a force behind the scenes during the civil rights movement— donating concert proceeds, posting bai… Queen Aretha. Rest in Power. https://t.co/DNTk0clo1C Queen Aretha. Rest in Power. https://t.co/xPUiz6P21A Vintage. https://t.co/eTpLUIwp2r Vintage. https://t.co/WPi6zsYpg8 Y'all crack me up...I'm going back to sleep, I'm off today, gm/gn✨ @spideyplan @AlwaysAnthea 😂😂😂😂😂😂😂😂😂bitch @spideyroyalty This is a winner @hughesytweets Well you come up with it then @AlwaysAnthea Right? Like how else do you convey that emotion? 😂😂😂😂😂😂😂😂😂😂😂😂😂😂😂😂😂😂😂😂😂😂😂😂😂. 😂😂😂😂😂😂. @queendayas I didn't see his hand...now I must come up with something funnier @fooddaya Noooo https://t.co/01zcpcXpjv @benjpasek @AlwaysAnthea Word! Coulda been* Awwww, and shout out to the Phillip to my Anne @ZacEfron for the kind words up there. Thanks man 😩✨💫 https://t.co/elclVL5JS7 I wish I coulda have been there! Thank you a million times over for all of your love and support, you all mean everything to me😩💖💖💖💖💖 https://t.co/SzsHDyfhLL @bbydayaa Accurate *I always know my angles and hand placements https://t.co/XMqCz2L4ww @thkidsarealrght That shit don’t work lmao My hormonal breakouts popping up every month unwelcome, just when I think I got my skin on lock https://t.co/LZt4XMbE9O This whole thread...💫✨ https://t.co/cj0tIyJwz5 I like my job lol https://t.co/yD7WvJkbMF Good morning from my good afternoon🌻 @MatthewACherry @ZendayaMedia 💥💫 🖤 https://t.co/vwqnoOhoCD 🖤 https://t.co/XPLdg8scy2 @ira @ZendayaMedia @janetmock 🤗🤗🤗 Thank you @marieclairemag for having me on your September cover, and thank you to the absolutely brilliant @janetmock for this interview, you continue to inspire me💖  https://t.co/ibD8q8FkPn Thank you @marieclairemag for having me on your September cover, and thank you to the absolutely brilliant @janetmock for this interview, you continue to inspire me💖 https://t.co/lPPjOc6nLj What a wonderful magazine month😩😍 https://t.co/P10bQCRX0O @chinaxmcclain @chinamcclain @marieclaire That’s my sister, and I agree💖 @chinamcclain I meeeaaannnnnn😩✨ https://t.co/NFAzYcnVCl Thank you for being apart of this, I’m so inspired by you✨✨ https://t.co/NJHra3fnhw You feel me https://t.co/5qm332dBNM RT @aasian: @Zendaya so you just gonna not invite me somewhere i didn't wanna go without inviting me and going somewhere without inviting m… In retrospect, I could have worded that clearer When people don’t directly ask you to go somewhere you didn’t wanna go and they also know you didn’t wanna go, but you still feel a way. RT @yahya: Let me get this one for you @KingJames \n🖕🏾🖕🏾🖕🏾🖕🏾🖕🏾🖕🏾🖕🏾🖕🏾🖕🏾🖕🏾🖕🏾🖕🏾🖕🏾🖕🏾🖕🏾🖕🏾🖕🏾🖕🏾🖕🏾🖕🏾🖕🏾🖕🏾🖕🏾🖕🏾🖕🏾🖕🏾🖕🏾🖕🏾🖕🏾🖕🏾🖕🏾🖕🏾🖕🏾🖕🏾🖕🏾🖕🏾🖕🏾🖕🏾🖕🏾🖕🏾🖕🏾🖕🏾🖕🏾🖕🏾… Goodnight 🌛✨ Update...I did...twice https://t.co/Gbn7BGC34A @snacklynn @ZendayaMedia ... @tomzendayaa You see that X lmao https://t.co/TETSidMFPt I just bowled my first strike...very exciting time for me. 🤗❄️❄️❄️ https://t.co/dMvILwGYEH RT @Drake: side effects include #EUPHORIA. coming soon @Zendaya @A24 @HBO https://t.co/xAaYg1Edks Euphoria. Coming soon. @HBO @A24 @Drake \nhttps://t.co/BDu4zs4gJq Euphoria. Coming soon. \n⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀\n@hbo @a24 @Drake https://t.co/H3ed73s8R3 @dana21x  https://t.co/Obusp6pHoA @bigheadmaree I was bout to say, clearly not much editing needed here 👏🏽👏🏽👏🏽 https://t.co/I6TFmHlMN5 Just waking up to this, sending absolutely all my love to @ddlovato and her family at this time. RT @DarwinBondGraha: The #SayHerName Nia Wilson march in Oakland, well over 1000 strong, feels like a mourning procession combined with a m… RT @ProfChestnut: @Zendaya Retro-futurism of 1962 @laurdaya Mind blown...did everybody know that and I’m just dumb? What time period is it supposed to be set in and why did I never notice that in the first movie? Finally saw The Incredibles 2!!!!!! https://t.co/zSjnOiXEug Happy birthday to my more stylish half... https://t.co/UWzFzRq8aJ Happy birthday to my more stylish half, remember when we talked about a Vogue cover, and then remember when we did it? I love you so so so so much. @LUXURYLAW https://t.co/XKi2ULbL03 Come on booked!!! @yahya ✨ https://t.co/BVb4gPsKq4 @ZendayaMedia @zendayamedias 💖💖💖💖 Small photo shoot in front of a window. https://t.co/3bFnXRHdS8 Small photo shoot in front of a window. https://t.co/rypBRYysJ2 @AlwaysAnthea Just you wait😏 @SighhDaria The other half has clearly been eaten...don’t do me @IHaveLove4Z @zendayascurIs A makeup artist. @iriswestaIlen @wakandapwr Ok https://t.co/wQOwloAvlo @zendayascurIs Wow your mind @wakandapwr I honestly just don’t know where to start @hoorayholland ... @dayadances I know, I know @dayashoco I just thought the shit was cute @hoorayholland Or....an....iPad Jk I’m back Throwback to Noon attempting to make me feel like a terrible mother while packing. https://t.co/8FDfH1mdwJ Throwback to Noon attempting to make me feel like a terrible mother while packing. https://t.co/kYQYkOhUvO Ok well that’s enough activity for today💖💖 https://t.co/R7GLyeRaZ8 @quillgamora Naaaawww Apple juice is underrated @clairemaree64 I had a green juice...check ig for proof 6...or 76? Cue the “we saw that sis” screenshot tweets😂 I’m literally eating a grilled cheese with a glass of apple juice...how old am I? RT @Madridlovatic: @Zendaya *Sonnnnnnnnnnn @PINK_QueenA That works too honestly @hoorayholland @plsdontdeleteme It’s honestly by chance lol I love you alllllll💖💖💖 As in Son lol @PINK_QueenA Son lol @hoorayholland @plsdontdeleteme That’s messed up *n Sooooooooonnnm😩😩😩 https://t.co/39BI7G0tbg @CynthiaEriVo 🤗💖 RT @alexisohanian: Walking to the mailbox was a painful, exhausting challenge for this woman just 9 months ago.\n\nThis is already nothing sh… https://t.co/VIwnWPdr0O Today was a good day. Already obsessed😩 https://t.co/ApsblIPIpW Well damn lol https://t.co/TbnmF04rqB I got an off day, bout to start @PoseOnFX ✨✨✨ I miss y’all, I do😘😘 https://t.co/6rcxJn0Tej RT @JamieoJohnson: I asked Serena Williams if she minded always being the one to beat. \nHer answer blew me away. \n#Wimbledon @serenawilliam… RT @ABC7NY: \"Michelle Obama said when they go low, we go high. And I went as high as I could.\" The Statue of Liberty climber speaks out for… https://t.co/6ZCJlTLcEq https://t.co/6FkdhMwQ09 ✨✨ https://t.co/t8lSf0q2qj @zendaua 2 @CynthiaEriVo The struggle lol you too✨ My body really has no idea what time it is 1970 something... https://t.co/pd5FGTK2o8 1970 something... https://t.co/Gcy3sByPMJ 😮 https://t.co/BZCGRWfeSl @myajasminee @AlwaysAnthea 😂😂😂 Thank you @KatesCafeLondon for the love, hospitality and absolutely delicious food♥️ https://t.co/jbuj0BQHiy She’s everything✨ https://t.co/e9Tg1Zshdk @AuraNinjago You didn’t have to go there... https://t.co/y97tJWDqpt @THR  https://t.co/GmrR5p3BAh @avengers_daya That nasty ass laugh haunts me 😂 I just died Well...good enough lol I’m getting so good at video games y’all...shoutout to my coach @Kamil_McFadden 😩💖 https://t.co/mVUP7f6PZR There you have it https://t.co/rz5WCNUNLp RT @theintercept: About 65 percent of people in local jails across the U.S. have not been convicted of a crime. Many are in jail simply bec… RT @womensmarch: We have no idea if or how the children who have already been stolen from their parents will be reunited. RT @ABC: Experts say psychological impact of family separation on par with abuse: \n\n\"No amount of colorful rooms with lots of great toys, r… ... https://t.co/PYUgY6SQZg RT @common: Archival images of some of the earliest #Juneteenth Celebrations https://t.co/mcg6PJrtSH https://t.co/zVbBZ0HYHI Knocked tf out, love you so much pops...happy fathers day♥️ https://t.co/euPGWu2QzU Knocked tf out, love you so much pops...happy daddy day♥️ https://t.co/6RPad0GLya @melodytheowl Me and @DarnellAppling Someone said I looked like an acorn...goodnight I’ve out-captioned myself, I won’t be able to live up to the last one https://t.co/9RVmfV1Qa3 Check in with me by the morning😂 I’m so excited to learn alllllll these damn lyrics... #EVERTHINGISLOVE This is so adorable, I didn’t even get to meet him😩 @noah_schnapp https://t.co/wUDyaBcbf0 Team hype yourself up. Lookin like a fine ass unwrapped, caramel… https://t.co/xBI6OZEC0n Lookin like a fine ass unwrapped, caramel filled Hershey’s kiss. https://t.co/H0BoL411Rx RT @BeyLegion: Surprise! https://t.co/SYnAm6zCy7 Wow me https://t.co/SKxmtVnFac RT @soledadobrien: \"She's lying\" is another way to put that. https://t.co/gwcm7WAXSG @DarnellAppling 😂😂😂 https://t.co/XPqOFCnmr2 👏🏽👏🏽👏🏽👏🏽 https://t.co/a6My7fiDcr Working lol https://t.co/ca6r6nNGQ5 🏆 https://t.co/p2XG7hXQqJ 👊🏽 https://t.co/9rwxTPjSkR Literally https://t.co/aJjRsGp9Qr Ok...back to work💖 Traumatizing. https://t.co/LiKV96o6Ln ... https://t.co/z63OadMTSX @tompenisparker @AlwaysAnthea Texted him and checked...it’s in October. Tried us😂 All these Geminis in my life!!! To the best big brother/grandmother/assistant/only person in the universe who can genuinely deal with me 24/7...happy birthday!! See you in two seconds😂 https://t.co/Q6RYmFKbfh To the best big… https://t.co/C46p5ZSdBM At the end, she sees my phone and is like \"mine!\" Lmao Applause after the final number in Sing lol Guess who's best friend/baby niece is 2 today? 💖 https://t.co/ykSWiICSNp Applause after the final number in Sing lol… https://t.co/fvDKU2oDop Put that thang down flip it and reverse it. https://t.co/X9LrzHiMBC Put that thang down flip it and reverse it. https://t.co/fqsbWusnNq Happy birthday loser... @TomHolland1996 https://t.co/DGHkmFBXJ4 Happy birthday loser... @TomHolland1996 https://t.co/l1ZM4Fg7CH 👏🏽👏🏽✨✨ https://t.co/I2VrytMKUS @bisxualstark Mind y'alls business challenge lmao RT @Zendaya: Ok well thats all, imma go be inactive again💖 @tomftmarvel I hate you guys sometimes... @thomashollandtw Don't start Why is this news to so many people😂 RT @EboneeDavis: The prerequisite for anybody to occupy space in my life is a commitment to self improvement, self love &amp; self expression. ...I'm from Oakland... https://t.co/ypGz3AO7Ns Game. Seven. https://t.co/ty2GVSn6E5 RT @ACLU: No law requires this — separating parents and children is your administration’s choice.\n\nHundreds of kids as young as 18 months a… Wow...this is horrifying and flat out sick. https://t.co/ienJIAcQII @dayadances That's ok😂 Ps....y'all hella cute. So yeah, thank you for these random moments of pure love and mutual appreciation. I hope it makes you feel as happy as it makes me💖💖💖💖 To all of you... https://t.co/fYvcgbEFjO I just went straight to sleep when I got home from work (cause, cramps🙄) and I just woke up to seeing all you beautiful amazing angels and your #welovedaya posts and I feel so warm and fuzzy inside... Well, that was fun, thanks for the support💖 @boohoo https://t.co/yhxfMuIJ1Z Well, that was fun, thanks for the support💖… https://t.co/pRqr84Kbg2 RT @lokiable: me in the kitchen before dinner, not helping https://t.co/oWnlQ9pmQZ The graceful hair placement over the shoulder seamlessly while still giving you face, back and a walk....goodnight. Forever obsessed. A very happy birthday to the icon that is @NaomiCampbell✨ Love you! https://t.co/RpwIapiZ9k Forever obsessed. A very happy birthday to the… https://t.co/aJcMwTqcTO @KadeemHardison Is it now? https://t.co/adFPMrAlRw She did your favorite shot @KadeemHardison https://t.co/LdejVQMzYq @LilxDaya As I kept it pushin lol https://t.co/jTBqgMoMcD The paparazzi dude at the airport asked me about my feet...yeah. Of all the shit to ask, man gtfoh 😂 Shoutout to my seeesssterrr @_DomNicole who's there killing the shit with Miss Janet✨✨ so proud of you!!! 🙌🏽🙌🏽🙌🏽 did the hell outta that sis @Normani https://t.co/b9IHPknO2u RT @africanarchives: On this day in 1925, Muslim minister and human rights activist, Malcolm X was born. Gone, but not forgotten. \n\nRest in… RT @fred_guttenberg: This has been my fear since February 14th, that another mass casualty shooting would happen before we did anything. No… RT @AntonioArellano: Escaping the shooting at #SantaFeHighSchool \n\n“I shouldn’t be going through this. It’s my school. This is my daily lif… RT @MichaelSkolnik: Santa Fe High School is the 22nd school shooting in America in 2018. I love my home man https://t.co/1UawkocYb8 I hope y’all are happy😂 Twitter stop making me a moment for no important reason challenge. @melanin_mayaa 🗣🗣🗣 Anyone who knows Noon knows he does not fuck… https://t.co/KnJQIb2ph3 @RoyalxMelanin Fuck y’all😂😂😂 Y’all ain’t bout to do my feet with the water warping 😂😂😂 Anyone who knows Noon knows he does not fuck with the pool (so proud mom moment) he got to the first step all on his own 🤗 https://t.co/SmvhharlXC My other half is a college graduate!!!!💫 (The… https://t.co/edlHCr949l My other half is a college graduate!!!!💫 (The pose consistency) https://t.co/fLJCqybZhz Listen here Miss Harrier....YEEEEEESSSSSSSS👏🏽👏🏽😩✨✨✨ https://t.co/Z0YM32yFQ3 @ohstarmora 😍😍 Mommy https://t.co/a0z4v5zUra Mommy https://t.co/NfL8PhNc2S To the Queens of my world...my grandmothers...happy Mother’s Day. https://t.co/m3SsYNBf2E To the Queens of my world...my grandmothers...happy Mother’s Day. https://t.co/VqMVmM9M56 I properly put together the simplest of shelves with no power tools and swear I can build a house. @SpiderlingTom @dumas1000 @DarnellAppling Thanks, it was delish💖 RT @letitiawright: plot twist. I know my worth. @alexiswore1 @SailorMunaaa What??? You look chic as shit...love it😍✨ We’re best friends now...not just in my head. https://t.co/lKUUhcHUz8 RT @silversires: my aesthetic is everyone drawing zendaya w a sword @gryscalepa  https://t.co/94UDLgBRy4 Trying to decide how to display all this dope ass fan art from last night...ig story or ig album post? RT @gicatam: Slaaaay ⚔️ https://t.co/vhnIVcissP Sick https://t.co/EWOg5WrIAd My bad https://t.co/0g6kp3Ubre 💖thanks babygirl https://t.co/NMttXeYnKa Hahahah I got you https://t.co/TI0tuRQ4xC RT @billy_b0nes: BLACK PANTHER VOICE: GET THIS WOMAN A SHIELD https://t.co/6JP5Ah5Wo8 🗡 https://t.co/v1Lu5DJk6r When you settle into character... https://t.co/zBoCS2nfOX When you settle into character... https://t.co/nqSQ8w5Op5 Very much in it at this point. https://t.co/garSM4ecSk 🗡 https://t.co/TXkyTkbaeD RT @Versace: Knight in shining Versace. #Zendaya in a Joan of Ark inspired, custom-molded #AtelierVersace look at the 2018 #MetGala. Featur… Joan of Arc @ZendeeshaMaree 🖕🏽 @spideyaIIen Clearly 😂 My skin always likes to be on some shit and scare me the day before the Met...like why??? @spideychal Always RT @GeeksOfColor: Here’s the video for Childish Gambino's #ThisIsAmerica. https://t.co/6jSvqq3xz0 Do I wear bras....no. Will I be wearing Rihanna’s bras...yes. https://t.co/hAi0hoDirw The weather in NY right now...just perfect When you get to wander around Tiffany’s after hours. https://t.co/CSVrfFDBu5 When you go to Tiffany's dressed as their packaging @AlwaysAnthea Do they...do they really When you’re free to wander around Tiffany’s after hours. https://t.co/QLxPSWgpVW Vintage https://t.co/pQP9gnttI7 Vintage https://t.co/4U7MnVfwLl Dinner at Tiffany’s... https://t.co/J19gDV1vXU Dinner at Tiffany’s... https://t.co/K54vbAg2XO Please...I already have it downloaded on all of my devices. Late. https://t.co/gffyD0nWeM As promised....heeeeyyy auntie @MichelleObama #CollegeSigningDay https://t.co/oEU3LfDdNj RT @LittleMissFlint: @BluegrassLayne @Zendaya https://t.co/qVrA5qzPaq RT @LittleMissFlint: 11 of the 30 pallets of water we gave out last weekend to the people of #Flint thanks to everyones contributions. Over… Just hugged my auntie in my head @MichelleObama ...I'm in a very good place right now. @AlwaysAnthea Done @heystylindaya Tryna spellcheck before y'all do lmao See y'all soon✨ https://t.co/MmIowdsdom RT @ABC: James Shaw Jr., the hero of the April 22 Waffle House shooting, has raised over $183,000 for victims of the deadly attack. https:/… I don’t wanna talk about it. https://t.co/GUi0y0yCjO I’m currently preparing to walk in to see IW.... https://t.co/yN4YiID3ye 🌌 https://t.co/VnqFW9w9Yx 🌌@boohoo zoeygrossman @luxurylaw https://t.co/XmoKrCUXFh @tomholIad Yes...yes you are RT @MichelleObama: On May 2, I can't wait to celebrate my 5th #CollegeSigningDay in Philly! It’s been amazing seeing this event grow into a… Bout that time... https://t.co/whTzJXCCvW \"Smallfoot exists suckas!\" https://t.co/k6hAN5QWhS @hoorayholland @Zac2daman 😭😭😭 Reunited with my brotha from anotha movie!!!! #TheWheelers @yahya https://t.co/wmuLANN2v0 @zendayascurIs I'm done 😭 @zendayasabrina @meechonmars Lmao @meechonmars Right?! Kids these days. Lmao RT @SMALLFOOTMovie: #Smallfoot &amp; Chill in the Ice Lounge at #Cinemacon with @ChanningTatum  @Zendaya, and @Common ! New trailer coming late… I guess he got my attention😂😂 What in the photoshop lmao https://t.co/DnTzoOEKGM My dad called but on the bright side the @SMALLFOOTMovie trailer comes out tonight😂❄️ https://t.co/aoX1qToYXE RT @zendayascurIs: Zendaya after two seconds of being on twitter https://t.co/GAlJ1qFDdC But I blocked off the 27th and I pre-ordered my tickets to prevent this from happening again lmao I'm sorry ok, I was busy and I'm regretting every second of it lmao https://t.co/bS5TpU3g27 Shout out to all the beauties that were hyping me up behind the cameras...that made me feel good https://t.co/Z0UmXtSf6g Shout out to all the beauties that were hyping me up behind the cameras...that made me feel good https://t.co/xAWw9MEXTf This is beautiful...sending you all the positive energy🎇 https://t.co/pxv5JLqn3b @papermendes @jgsnycgirl 🥑🥑 I'm almost ready...I swear https://t.co/bhZxZI6pzB I'm almost ready...I swear https://t.co/XEx21U5IAM Me trying to see yall lmao https://t.co/ulwm3gXS3H RT @africamiranda: “I am Hollywood’s acceptable version of a Black Girl, and that has got to change.” @Zendaya at @beautycon in convo w/ @b… To anyone I miss a picture with, I'm rushing to the chat, and you look gorgeous✨ @voldemost 😍😍😍 I know that's right😍✨ https://t.co/kBp0GQP5MU This was taken last time I was at @beautycon LA...this time we're in NY! See you beauties tm💖 https://t.co/Wz7iwcThvP @ShaunKing Word @OVOZENDAYA @dayashiki 😂😂 @zndayah Karma lmao @zendayascurIs Consistency is key @wakandapwr I'm still thinking about it Shit...I'm bored too https://t.co/y3pjWGuY23 When someone you're not that close with wants to try your drink and uses your straw... https://t.co/9cj2aMhjo0 RT @solangeknowles: metatronia (metatrons cube) (2018)\nmodular sculpture and performance piece https://t.co/6MkfQ34it5 @LittleMissFlint 😘😘😘 Yes for my white shirt being the perfect light bounce. https://t.co/NnHIxGqLWE Yes for my white shirt being the perfect light bounce... https://t.co/LPo3q9eES0 RT @tayloko_: Can we reschedule this? i already got tickets for Infinity War https://t.co/As2qiVmHf9 @belizeanqueen_ Don't do me So...when's enrollment day? https://t.co/XRLPn7TryC RT @JoyAnnReid: “...another woman had entered the Starbucks minutes before the men were arrested and was given the bathroom code without ha… Y'all already know how I feel... https://t.co/0yCt2DDVoS RT @MrJeromeTrammel: So am I the only one who noticed when @Beyonce went to change outfits she changed her damn nail polish? We don’t deser… @SpiderlingTom Shit wasn't moving😂 Saw this...felt compelled to repost it...enjoy. https://t.co/93GEr0sSus 🎇Wow🎇 https://t.co/yTVUvqR1sD @KadeemHardison @Kamil_McFadden Backup lmao @Kamil_McFadden Side note, he's on my couch and before he tweeted this showed it to me and proceeded to ugly laugh... Imagine trying to learn how to play with this ugly ass laugh in my ear... https://t.co/pFLHvrg1Zo My life in a tweet. https://t.co/YWo9cT0Gb8 🎆 https://t.co/0yTmR18mje 🎆@boohoo zoeygrossman @luxurylaw https://t.co/XCzAJAWoAK Accurate lol https://t.co/qpDTJNhbKA @MatthewACherry @Marcos_El_Malo @IssaBrooklynBae  https://t.co/XG1Xc5OUnb @MatthewACherry I've learned my lesson. https://t.co/aEIWl6ZbI4 Ok well thats all, imma go be inactive again💖 Not like many people out there were thinking of investing in a mini drone but you know, just in case lmao I looked at the pictures, same thing. https://t.co/8uQbQ98f5W Quick psa, mini drones aren't worth your coins...that shits broke already. @SPlDEYSTYLES 🙄 @memedaya96 What's wrong with emosh?? Lmao Speaking of TGS...I love you @kealasettle so so much✨♥️ https://t.co/0CZITmVf0W ....rude...but true https://t.co/Wjnd4L8w37 @kingbeyatch Emotional lol So I bought the Greatest Showman and I'm watching all the bts....I'm feeling very nostalgic and emosh right now... https://t.co/hcaA4ehE50 RT @Justinfication: Wow, I’ve seen/heard a lot of MLK footage but this is the first time I’ve seen this interview. How profound this is. ht… So I went through my storage and found a bunch of my grandfathers old shirts...long story short expect to see a lot of cinched button up shirt dresses from me. https://t.co/URokVeOSsm So I went through my storage and found a bunch of my grandfathers old shirts...long story short… https://t.co/QebILYKLTT She would have been 90 today...happy birthday to the great Dr. Maya Angelou https://t.co/IRnvO2xFWu She would have been 90 today...happy birthday to the great Dr. Maya Angelou https://t.co/NKNs5k5PRq Taking photos of yourself with the back camera can be difficult...but worth it. https://t.co/BXCVQXzj4X Taking photos of yourself with the back camera can be difficult...but worth it. https://t.co/ifSCAmxnAb RT @ElleCanada: Zendaya's custom Off-White gown tops our best dressed list https://t.co/IPF9kXiorJ When can I get pre sale tickets... https://t.co/OewzK8AwIr I mean...eff it up...sorry twitter Is that my sister @D0MB___  ?????ayyyeeeeeeeee fuck it up. https://t.co/dBnHoXKWjR @fentybeauty  https://t.co/uPQKx3KF69 Wooohooooooo👏🏽👏🏽✨✨✨ https://t.co/dW5IgfcFm3 @kaidiablo I'm dooooonneee😂 baby steps...baby steps I've forced myself to like avocado this year..I'm not at the \"eat it plain with a spoon\" stage yet but...I like it. Please, do not forget #BlackLivesMatter #StephonClark https://t.co/474DSVBGLm Please, do not forget #BlackLivesMatter #StephonClark https://t.co/SQCwwCWYBp Red carpet me is ready for this✨ https://t.co/FQGRGXMMAy RT @ajplus: Louis Vuitton named 37-year-old Ghanaian-American Virgil Abloah as artistic director of menswear. He’s the first African-Americ… @clairemaree64 https://t.co/eOQWdD5zp3 Ok, last post of the day...Happy birthday to the coolest of the cool aka my mommy. There's nothing I could type that would define how absolutely incredible I think you are or how much I admire you. Just know you are the queen of my life and I love you beyond infinity💫 https://t.co/GbYZvGdXeX Last post of the day...Happy birthday to the coolest of the cool aka my mommy. There's nothing I… https://t.co/7KrCPIfvJn Sorry for my face lmao https://t.co/UfyUs3z0yf RT @MSNBC: \"Spread the word!\"\n\"Have you heard?!\"\n\"We... Are going to be... A great generation!\"\n\nMLK's granddaughter leads cheer at #MarchF… RT @nowthisnews: Everyone needs to hear this Chicago native explain how city, state, and federal governments are enabling gun violence #Mar… @memedaya96 Why?😂 Thank you for all the continued love and support...you know I love y'all🤗 #KCAs @hughesytweets Swear, we didn't know he took this. Today we #MarchForOurLives https://t.co/fS2uXWLq3E Today we #MarchForOurLives https://t.co/oOqTrAbyzL Yoooooo stealing this...yes spidey reference😂 https://t.co/0t7X57FSC3 RT @kylegriffin1: 11-year old Naomi Wadler: \"I am here to acknowledge and represent the African-American girls whose stories don't make the… #MarchForOurLives DOWNTOWN LA LETS GOOOOOOO!!! @spiersbram Can we talk about the fact that I didn't make it and still have no idea who runs it, but it's so accurate I don't question it lmao @comealivedaya I swear I thought I was being original lmao A trio. #NationalPuppyDay Like mother, like son. Like uncle, like nephew. Lmao https://t.co/tbrDWICqI0 All three of us got the same bonnet and the same glasses😂 @DarnellAppling @nooncoleman https://t.co/ycbtiaSn85 @meechonmars @ZendayaMedia Let's start narrowing it down...imma go to sleep and marinate on this. @spidychelle Word @sinfulnicki First of all...I asked y'all😂 Welcome... https://t.co/aisu06eUTw @LenaWaithe @AlwaysAnthea 🙌🏽♥️ @zenfieya Wait for it🙄 @spidychelle Shut up😂 Wait...should we be like Oprah right now and actually start a book club...or I'm doing to much? Lol Thanks for my new book club list lol The music...the vocals...the visuals...the film....wow✨ https://t.co/rV2pK6jAym I really need to read more. I'm officially making this a priority. So if y'all got any book recommendations, let me know... Word....congrats @LenaWaithe this is a cover right here. Beautiful. https://t.co/HKNRBTjv36 Picked a few of my favorite things from @boohoo spring collection and made #TheZendayaEdit 🌻 (I… https://t.co/vwgqyOdp9X @AlwaysAnthea @misfitmaree Y'all...don't hype me up😂 @LVtheMAN Stoermer bruh...Stoermer RT @LanaHarrisNews: Stephon Clark. Officers reportedly shot at him 20 times in his backyard because they thought he was holding a tool bar.… ....I've run out of things to say about these cases. Heartbreaking. https://t.co/V3KJZOEz9P @dumas1000 Cause y'all have me on edge😂 Yeah idk why not, I added it to my edit list of their clothes😂 Imma ask for you lol https://t.co/y0ZUlEgadx @almiba5 I've looked into it, apparently the curve sizes sold out first and that's why they're not showing up as available. @fantamber Already? Damn @SpencerCaliver At least I'm consistent I'm way too juiced about my giant lemon…pun intended🍋 RT @CassiusLife_: .@Zendaya shared just how early her activism began with some special Oakland students. What were you doing in kindergarte… @blkgirlculture @shopskatsz @DarnellAppling RT @shondarhimes: #throwback https://t.co/dJ8dRXpVzB https://t.co/Myz4FyJHts RT @NBTtheShow: Thank you to @Googleorg @JDuncanAndrade and #RosesInConcrete for the best Friday night we've had in quite a while. Support… RT @boohooAus: HELLA HOT RN 🔥🔥 ONLY 2 DAYS TO GO 🙌🏼🙌🏼 21.03.18 #ZendayaEditsBoohoo  @Zendaya https://t.co/7OWxMWQDBk @JackieHollywood I see how that could have been the direction😂 @adorethetimes And we added extra maple syrup for sweetness. @adorethetimes I know it sounds weird but...it's pretty damn good. https://t.co/iZ1WKmxvqB Update...it's pretty good. I'm impressed. Taste more like the inner of one of those molten lava cakes. My mom text me saying she wanted to come over so we could bake..I'm thinking like cake and cookies kinda bake. So you could imagine my disappointment when she arrives and says she wants to make vegan avocado brownies......yeah. I'll keep ya'll posted. Im just tryna make my city proud. Much love brother, thank you. https://t.co/dGHRFP2Mzh The making of rewrite💫...reminiscing a little. https://t.co/UmW4cDfU7P The making of rewrite💫 https://t.co/oUJzFCqoeU @RWitherspoon Very😭✨ I cried three times watching @WrinkleInTime ....I'm a mess RT @_sugatits: Just watched a group of young ladies perform Alvin Ailey’s Revelations via @Zendaya’s IG story and my heart feels so light… 😍 https://t.co/lzgEjKTJIe @derekaasare It's a school in East Oakland I support, that's dedicated to reinventing how we teach our young people in underserved communities and delivering arts and stem education...it's also a bilingual school. Real quick😂 Feels good to go to bed with a full heart, doesn't it? Sleep well.🌹 If you want some positive inspiration watch my ig story. @justimlivin  https://t.co/uMbtUTLede Your poetry blew me away, thank you for your honesty and your gift.♥️ https://t.co/0E0qfRA9Lh RT @sosaamiguel: Roses in Concrete truly appreciates you all!  #Zendaya #Google @DarnellAppling @MichaelSkolnik @Zendaya @Google https://t.… @LauraHarrier Love you more💖 My biggest passion is young people, education and Oakland. So that's where I'll start. Wow....so damn beautiful...like wow https://t.co/OHlBajsVKD @Kamil_McFadden @ZendayaMedia Shit shit shit shit shit RT @Zendaya: @MarvelStudios https://t.co/n4nLweIiSs @MarvelStudios https://t.co/n4nLweIiSs Ohhhhh shiiiiiittttttt... https://t.co/7jpoUmEhIa RT @violadavis: I stand in solidarity with all the students today! The future is YOURS! No progress has ever been made in silence. #Nationa… RT @ava: \"The ultimate measure of a man is not where he stands in moments of comfort and convenience, but where he stands at times of chall… I am so proud, I stand with every student today. #NationalWalkoutDay ✊🏽✊🏽✊🏽 RT @ABC: Students at South Lakes High School in Reston, Virginia walk out of their classrooms to protest for stricter gun laws as part of #… RT @LanceScott18: Rockledge High School stands with Douglas. Love you guys @Sarahchadwickk ❤️ #nationalwalkoutday #NeverAgain #MarchForOurL… RT @Lin_Manuel: We see you, kids, and we're with you. @BallingerMom @ZacEfron Yes!!!!!!!! So good!!!✨✨✨ This is such a me joke...I'm mad I didn't suggest it first. https://t.co/XFOfRhuXS6 RT @ava: “This is 64!” - @Oprah #HairFlip #WrinkleinLondon https://t.co/APFZA9L39I ... https://t.co/NmBBkhWgSJ We must meet https://t.co/75a72UJsFq RT @boohooUSA: ✨ The @Zendaya Edit is Coming - https://t.co/sO79bw2m3I  ✨\n\n🧡 #ZendayaEditsBoohoo 💫 3.21.18 🧡 https://t.co/KDC2waVp0p Heeeee'sss ssooooo adooorraabbllleee😭 https://t.co/i7MZG9T7se I know that's right👏🏽 https://t.co/k9J8xkli0O RT @shadowandact: For the first time in recent memory, two films directed and led by black talent are first and second at the box office. #… Me @ y'all https://t.co/x3OVspEHEs Going through this #loveforzendaya tag...thank you, you all really make me so happy🌻 😂😂😂♥️ https://t.co/SUohLY7LN4 RT @spideysunwin: zendaya: *breathes*\n\ntwitter: zendaya is so relatable when she breathes: a moment @stormreid @WrinkleInTime Always babygirl! I got you! It will..neevvvvverrr be enouuuugghh I gave it all I had lmao Almost popped a damn blood vessel in this car trying to sing \"Never Enough\" full out, or Keala's adlibs in \"This Is Me\" RT @theblackpanther: Happy #InternationalWomensDay to these amazing heroes! https://t.co/ziXAehiruz Whoooaaaaaaa....that's awesome https://t.co/cqtwqTlkEm @chloexhalle 💖 #Grownish is my shit @YaraShahidi @chloexhalle @Kamil_McFadden @dumas1000 Shut up sucka Wardrobe change✨ https://t.co/QeC1hNO6FE 😘😘 https://t.co/DYm6QnCD4V RT @TheWrap: #Oscars: Jordan Peele Becomes First African-American Winner for Best Original Screenplay https://t.co/QDhnyUGlRZ https://t.co/… Oscars 2018 https://t.co/35RjCHH3CM It was a chip...and I caught that shit hella quick https://t.co/DGCrwgFYYc I have sang out, screamed out and done full choreo from the wings...I'm so proud of you @kealasettle YOU KILLED THAT!!!!!!!!!! Get out!! Yessss RT @VogueRunway: .@Zendaya wears @GiambattistaPR Haute Couture at the #Oscars. See more from the red carpet: https://t.co/jsYih2O2Sn https:… Woke up with a cold but I'm still cute tho This is so beautiful https://t.co/SfNFk4CAGS ✨✨ https://t.co/s750byMDuY If this wasn't me lmao https://t.co/oCrXwbSrDk RT @MarvelStudios: @RobertDowneyJr @ChrisEvans @chadwickboseman @DanaiGurira @MarkRuffalo @DonCheadle @AnthonyMackie That’s a FANTASTIC ide… \"Fuck it up then leave, come back, fuck it up and leave again.\" Come on Bey! Then I wore it to a party... https://t.co/cUacWuuXtL 1980 somethin... https://t.co/A98YX7iMwx I prefer my looks straight off the runway. https://t.co/zbpMRZdbjd I prefer my looks straight off the runway. https://t.co/d357g3pAgB I've waited my whole life for this very moment https://t.co/kNfmVOH6VC @AlwaysAnthea happy birthday beauty! Thank you for all your support and real ness. Have an amazing day...full of happy smiling faces!!!😘😭 My heart♥️ https://t.co/wTbtH6oE4h Wow...this is absolutely stunning https://t.co/iS0aXMeSbf RT @ElleActually: \"The money will also help centers open in Atlanta, GA; Baltimore, MD; Chicago, IL; Harlem, NY; Hartford, CT; Memphis, TN;… I'm already planning to do this again for @WrinkleInTime btw Wakanda forever...Oakland forever. Thank you to all the beautiful young people of my home town for joining me this weekend. You all, much like this movie, are absolutely brilliant✨ #BlackPanther https://t.co/qsO09ZnQJX Wakanda forever...Oakland forever. Thank you to all the beautiful young people of my home town… https://t.co/ikVYdG2U3N The absolute cutest lil thing😩 https://t.co/TWktpcHvpg RT @MichaelSkolnik: What an amazing day in Oakland with my dear friend @Zendaya.\n\nIt was an honor to share in the joy of bringing 300 young… “It’s like a Bugatti space ship!!!” When “Oakland 1992” came up on the screen we all got super hype!!! Watching @theblackpanther movie in my home of Oakland, at my old favorite movie theatre, in a theatre full of kids....best way to watch it. I'm sitting in an exit row and the lady asked me if I was over 16.....yes mam...yes I am. The future. #rp https://t.co/nyrr4OQCdC The future. #rp https://t.co/iIHjgNIbtK @spideycarter I'm laughing cause this man hid behind a car so fast😂😂😂 @TomHolland1996 Staaahhhhppp😭 https://t.co/1HKze2PNzv When you realize you ain't really got the juice cause paparazzi only find you when @TomHolland1996 is in town... Young people are so powerful... #StudentsStandUp ♥️ https://t.co/gYVnrprRtC RT @Phil_Lewis_: This kid is not here to play at all #StudentsStandUp https://t.co/kmsehVt2HM RT @MrFilmkritik: Teenagers are old enough to have assault weapons, but not opinions? https://t.co/rTWlllJQtB 😍 https://t.co/YH17ikzICh RT @theblackpanther: #WakandaForever #BlackPanther https://t.co/Qj8zrrFaFI RT @kordayanation: Zendaya is me when it comes to doing anything in life https://t.co/Ff2etOQZzt Hard to read. https://t.co/AxXiCBNigf Hard to read. https://t.co/8xEv6qLRGl With the queen herself. https://t.co/8fHwMxGoMM RT @sarahchad_: Today I rallied at the federal courthouse in broward, alongside fellow survivors. https://t.co/LPCWSdIbIR @tightyspidey Yo tom needs to chill Burberry 🌈 https://t.co/q2ERZxj7uF *regardless I only deleted my last tweet cause I haven't fact checked her age, but reguardless, she's a HIGH SCHOOL STUDENT with more passion and strength then the people who run the country, so again, I wish I had half as much of that in high school, and now! #EmmaGonzalez YESSSSS EMMA GONZALEZ!!!!!!! Thank you for your voice, and for your bravery and honesty while using it✊🏽 https://t.co/7y7Su02uSz Burberry 🌈 https://t.co/n8QPU8oSXe @Kamil_McFadden @dumas1000 Swweeet potato True stan. https://t.co/iIWievDn86 Nice to meet you, you're stunning btw💖 https://t.co/IU1pBSn7Zd @KarenJ31738247 @clairemaree64  mom look😍✨ This is fantastic😂😂😂 https://t.co/4fQh9C9YqH \"Don't tell me there's no such thing as gun violence.\" This is devastating. https://t.co/rmChnlLf3x ...this is devastating. https://t.co/pg0MD2VNPv Where's this video lmao https://t.co/nRbxsGltN4 Y'all messy that's all lmao @YourBoyAntny Make it stop😂 The jet lag I'm about to experience right now. Team no sleep. I 🗣WAS🗣LOOKING🗣AT🗣THE🗣RUNWAY🗣 https://t.co/ZUjjcqetyO ♥️♥️♥️ https://t.co/o9lzOuEIY1 https://t.co/vKi0CZnH7U When you got the gym at 4, but gotta investigate some shit at 5. https://t.co/bFWi6myKI4 When you got the gym at 4, but gotta investigate some shit at 5. https://t.co/ReLXQUcnvi @dejacarter_ Love you siiiisstterrr https://t.co/3a1gpHPC63 RT @Zendaya: @DAYAFULFILLED Whoa whoa whoa y'all not bout to have me out here lookin shady😂 I was looking at the runway and asking Law when… @DAYAFULFILLED Whoa whoa whoa y'all not bout to have me out here lookin shady😂 I was looking at the runway and asking Law when the show was gonna start. Don't do me. They were super nice. Heartbreaking...our schools aren't even safe. https://t.co/Gg2FYntGbl Thought I'd just stop by NYFW, hope you didn't mind. https://t.co/VuOMj1annh Thought I'd just stop by NYFW, hope you didn't mind. https://t.co/XQ70Wwj3DG Happy Valentine's Day suckas. https://t.co/NN1jwqlJji Happy Valentine's Day suckas. https://t.co/iUgvXNppxU Roses are red, violets are blue, leave me alone. I need to go to bed and stop falling into my archives. Gn Please try. https://t.co/NJsRB1ihso I just wanna do a video of all three of us roasting the shit outta ourselves lmao Reminiscing on our leather sweatpants, hello kitty obsessed, high top, nail art era when \"ayyyee\" and \"Swag\" left our mouths way too often lmao @D0MB___  @dejacarter_ @Kamil_McFadden https://t.co/uXZFndcM40 Come on noowwww😍✨👏🏽👏🏽👏🏽 https://t.co/r1dkL3bZpC Happy bday gaaawwwgeous✨ https://t.co/2jiGTJkdI0 This is one of my all time favorite pictures, daddy dancing and singing me to sleep. My old mans getting old. Love you daddy, happy birthday. Although I could just say all this in person cause I'm across from you at dinner right now lol https://t.co/bRtCljTE6A This is one of my all time favorite pictures, daddy dancing and singing me to sleep. My old mans… https://t.co/dzMlEmVQKE Wishing a very happy 18th birthday to my lil sis @YaraShahidi Thank you for your brilliance, geniusness (if that's even a word, she would know lol) and pure heart . I love watching you gloowww✨ https://t.co/86hQQYck6I So, my little niece has them hands and just played me outta my fried zucchini stick. Wait for it. https://t.co/GzcXRJuUw0 So, my little niece has them hands and just played me outta my fried zucchini stick. Wait for it. https://t.co/Q0RxDOiQ9D 🌞 https://t.co/kn9af34OZk 🌞 https://t.co/Bv82jVxdcG @meechonmars It's necessary This is awesome, two bright beautiful lights✨💡(side note, Storm may be my long lost little sister) https://t.co/FoVG1RGo7h Word https://t.co/eEc8R6wdaO @spideysunwin Mood. It's never that serious...it must be a slow night. Why? Why is this a moment? https://t.co/GOF3ligKMV @AlwaysAnthea I haven't in a long time, but I should. Isn't he tryna- nvm. https://t.co/WKM53G57vr I literally have a coloring station at my house, in my house we all find it quite therapeutic. It helps me with stress. https://t.co/ja5yNTXuds I thought that all these \"satisfying\" video of people mixing paint and cutting soap and shit were stupid...I have been watching them for a solid 45mins straight. 😍😍😍 https://t.co/i4Jo7daFzW RT @AlwaysAnthea: Zendaya with the perfect combination of #BlackHistoryMonth and  #NYFW content on her app https://t.co/B4QzfhR8lF RT @MatthewACherry: #WhatBlackPantherMeansToMe It means that my kids and young black kids everywhere will see themselves as heroes capable… The art of transformation. https://t.co/ymIIgOKe0L The art of transformation. https://t.co/4Z1aLb96Uv RT @CRFASHIONBOOK: Zendaya Opens Up to Cardi B in the New Issue of CR Fashion Book https://t.co/ctPyM27DNe Relax...there's still re-runs @kordayanation  https://t.co/ZIvYKEz1YT The end of an era. On to the next. Thank you for continuing to grow with me.💜 https://t.co/HhftlKOkGx The end of an era. On to the next. Thank you for continuing to grow with me.💜 https://t.co/HDsKuJGEA9 I love y'all https://t.co/dl3IFM4tlj @Livabearr Thanks babe...love youuuu!!! Look out for my real parents in the crowd at KC's graduation lol @kealasettle Queen Keala✨ @YaraShahidi Thanks beauty, you're the best🤗 Tonight is the last episode of KC, and therefore my last episode on Disney channel.... Love you V...so much♥️ https://t.co/S2mDPjgMPy @benjpasek @thejeremycarter @noah_schnapp I knew it couldn't have just been me lmao I'm extra super duper hype to watch tonight's @ScandalABC because  the one and only @KerryWashington directed it!!!!! Let's goooo!!! 9pm #KerryDirectsScandal 👏🏽👏🏽👏🏽 Happy #BlackHistoryMonth y'all!!! https://t.co/tQfDgVpqRp @JohnBoyega @Variety 👊🏽 @YaraShahidi Word! RT @YaraShahidi: big sis//lil sis! https://t.co/S9zvqmwN50 Glowy💡 https://t.co/Ne3m7BSRyK Glowy 💡 https://t.co/28ce85X9oO I always say if I wasn't in entertainment I'd be a teacher, like my mom. She worked at Fruitvale for 20 years, so to come back with @Verizon Innovative Learning Labs and give these kids a hands on STEM experience was so freakin fun for me and them. #weneedmore https://t.co/V5k0djfDqH I always say if I wasn't in entertainment I'd be a teacher, like my mom. She worked at Fruitvale… https://t.co/GF097BwtTr Wow😍 https://t.co/i9HTw4GfGT Although I do appreciate all the positive emotional takes on that tweet lol RT @DarnellAppling: “Eat some Pop-tarts”  😂 https://t.co/XqKdE3N1PU Finish this sentence... \"wakin up....\" Yes little onnneeee!!! Killed that!!! @jdmccrary https://t.co/sCBBpV4Ehs @hollandchalamet  https://t.co/Taoo7IEi2o Ha. @hocogrande Sometimes I just have random thoughts I wanna get off my chest in the moment but don't want them clogging my feed 😂 or I just can't spell. Random thought, that's all. We're kind of a package deal✨ https://t.co/y5RsSekwRq We're kind of a package deal✨ https://t.co/xIpFPNbbzC @aasian Hahahah my bad, I was just debating on if it was you and how I was gonna say hi from my car without being weird😂😂😂 so yelling was what I came up with💁🏽 Not bad for the new kid comin up. Very honored to be included, thank you @vanityfair ♥️ https://t.co/8MqEg0bhJi RT @VanityFair: 12 extraordinary stars, one very momentous year. The 2018 Hollywood portfolio is here: https://t.co/6PfsFsPzK1 https://t.co… I love working. @AlwaysAnthea You know me so well... Meet Rodney✨ #weneedmore https://t.co/QLKp0kwPZN RT @SAGawards: Sterling K. Brown makes history by becoming the first African American male to receive the Actor® in this category! #sagawar… My deepest condolences to you and her family, my heart and thoughts are with all of you. We were very lucky to have met her in that brief moment♥️ https://t.co/sgJ2OaTpMv @smhmaree Babies damn, it was 2am leave me alone😂😂 Hi cutie pie💖 https://t.co/HXWFi1YRFT So powerful...speak on it https://t.co/rDFxmwf7vy So Noon is knocked but I can't sleep... https://t.co/ou0bKSpCR4 I love you guys lol There's a huge difference lol space intended https://t.co/tQgfKMoKsv Why do I look like such a bad ass little kid in that picture Me + Grandma + Zink; Grandma's front porch, Oakland CA, circa 2001 https://t.co/rNvl82QoYP Me + Grandma + Zink; Grandmas front porch, Oakland CA, circa 2001 https://t.co/u5NfnIxkqX RT @meechonmars: an amazing group of people https://t.co/VAhdnJj5SE 😂😂😂 https://t.co/iulNUkhp2j You ever be killin it in an argument and then just sit back and be like...wow...I really should pursue a career in law. \"First of all\", \"bottom line\" and \"end of story\" are all phrases you should avoid when arguing with me cause that means war. It was a cute backdrop💖 https://t.co/FsZ33rEqZw 👏🏽👏🏽✨✨ https://t.co/AHpOwei5cX Thank you's do not quite express my gratitude. We must continue to be brave and tenacious in the face of injustice and hatred, just like them. Use our hearts, minds and platforms, just like them. We must learn from and follow them. That's how we say thank you. Happy MLKDay. https://t.co/WyKnU54mSq Thank you's do not quite express my gratitude. We must continue to be brave and tenacious in the… https://t.co/PL975miCRc RT @BerniceKing: As you honor my father today, please remember and honor my mother, as well. She was the architect of the King Legacy and f… My fam😩 https://t.co/LlUUTF3wE2 RT @davidaxelrod: It is jarring when the evening news begins with a disclaimer suggesting to Americans that they might want to excuse their… Come on now....this is inexcusable https://t.co/5spIRN4R2t For no particular reason.... https://t.co/1lYvjRk7NS For no particular reason... https://t.co/lBdg2ep7eg RT @Habiba__Ogah: When your mama sends you a howler : #BlackHogwarts https://t.co/J3Jz9NUTj3 RT @PUSHABRI: The portraits in Hogwarts be like #BlackHogwarts https://t.co/08qNAC6UY7 Yes yes it is https://t.co/RrnxzYDtIY When you ask somebody what they wanna eat and they take too long... https://t.co/msvbRU1WL7 I had to make an executive decision I wasn't even gone that long lol https://t.co/3xxTCQC6os So for ig...serious question...post all together or separately? I wasn't even gone that long lol https://t.co/P4tT4ZzWEx So so cool✨ #weneedmore girls to see the world of possibilities. Learn more at https://t.co/sgiMBMnKPD https://t.co/MCR1cQxsoM Yes...this is great content https://t.co/RIUchxzWvd RT @JasFly: Critical thinking requires critical listening. So freakin gorgeous, so happy for you✨@kealasettle @pasekandpaul https://t.co/fwpZJz90ki RT @YaraShahidi: Commit to love 2k18 /\nYour identity is valid 2k18/\nSupport your global community 2k18 /\nVote in midterms 2k18 /\nCreate art… https://t.co/rhCMdfSKC0\n#Lookoftheday RT @MichaelSkolnik: The only scandal... https://t.co/g2sFjQPMCH Yes @YaraShahidi YESSSS!!✨✨✨ https://t.co/RWl6vWFo4J https://t.co/rhCMdfSKC0\n#Lookoftheday New Years facetime call with my little niece and her spidey jammies ♥️ https://t.co/KcNQW0AuBD New Years facetime call with my little niece and her spidey jammies ♥️ https://t.co/z71yA5xbLZ Looking back on this year, one of my favorite days was hanging out with these amazing kids, showing them the technology of a recording studio (they even sang in the booth too lol) We need more young people to have opportunities like these! #weneedmore https://t.co/d0VN0wDv4z Heartbreaking....rest in power #EricaGarner https://t.co/1CeLHgqXK5 Finally made a makeup tutorial with the absolutely stunning (and fellow Oakland native) @alissa_ashleyy ✨✨ New Years Eve Glam, we hope you enjoy! On my app and website now! @covergirl https://t.co/5OXELaXfRT Finally made a makeup tutorial with the absolutely stunning (and fellow Oakland native)… https://t.co/9oTWijAjbe RT @MichaelSkolnik: Deeply saddened by the news of our friend, Erica Garner. \n\nPlease say a prayer for her and her family today. RT @antwrangler: Camera battalion. #thegreatestshowman @zendaya waiting between setups. Brooklyn Navy yard. https://t.co/qQZcKOosA6 https:/… Hope you've all had a beautiful day, Merry Christmas and lots of love from me, Noony and his adorably festive collar 🤗💫 https://t.co/S6FCaWmEUN Let me get up, get my life together and do something today before I change my mind. Wait...y'all notice Law chasing my train hhahaha Because this gif is fucking hilarious, How bout for all the loners out there who are doing what I'm doing right now on Christmas Eve, how bout y'all caption this and let's make each other laugh...Merry Christmas Eve. https://t.co/DemER9mgL7 Ew https://t.co/zfVw3NNjBm I have just been napping all day...and I'm exhausted. The holidays are a time to give back, and I'm happy to have teamed up with @verizon who has donated over $200 million to schools in need over the past 5 years. So much great work, so let's keep it going...join us at https://t.co/sgiMBMnKPD ♥️👊🏽 https://t.co/GWAI0tzJqm RT @queenjordan94: @Zendaya Me looking around tryna find u even though we in different states https://t.co/jKsADE9NkQ In the back of this movie theater about to watch people watch me... https://t.co/sSxJp9AVhl What in the Stranger Things... Cause I was almost positive it was some UFO alien shit... Ok some kind of closure https://t.co/NNnUbqi9tn Wtf is in the sky... ♥️😘 https://t.co/igE5ufLX0w 🏆 https://t.co/XzfaDLkbpY Dear yellow eyeshadow...I think we make a good pair https://t.co/8K5LGeqRF5 Ok only a couple more of these https://t.co/PUqS4G5IvE Finally home to get my house together..feels good. @brittaneyelise is making it happen right now✨😩 https://t.co/rhCMdfSKC0\n#Lookoftheday Learning to fly...btw the movies out now✨ https://t.co/JkHBBxH4h9 \"Black Butterfly\"🎶 https://t.co/I8Hnj3Fc7e RT @SJLI_CA: BIG thanks to @Zendaya for highlighting us in her #12DaysOfGiving! Check out our website at https://t.co/59A62XrOts &amp; if you f… RT @alissa_ashleyy: ❤️❤️❤️ hope you guys are loving the videos! (On my channel &amp; Z’s app!) https://t.co/RzDFU30urA Trying to make a clever caption about my dress being a butterfly and flying back home from… https://t.co/lf4oZDg6jY RT @tylerkilledit: BIG s/o to @Zendaya for highlighting my organization in her 12 days of giving! Check out our website  https://t.co/io5YH… https://t.co/rhCMdfSKC0\n#Lookoftheday RT @hellamaree: Mood! https://t.co/8KIBQZNfNO https://t.co/rhCMdfSKC0\n#Lookoftheday Ok I'm too indecisive on which one to post...so I'm getting on this 17 hour plane ride and I will revisit this upon my arrival I got you https://t.co/Upoid7PVWZ Your favs https://t.co/hENyWj0hDM Your favs https://t.co/sUz4767qrf Don't do me. https://t.co/3xZTy71bTk I always cover my phone microphone with my pinky...dumbass ♥️♥️♥️ https://t.co/p5HafavKzm RT @HashtagLunchbag: Telling folks how it's done! Thanks @Zendaya and team for spreading the #HashtagLunchbag love. https://t.co/BafKrPwYgA I did it. https://t.co/9Nz5mYjlnR I figure it'd be a good investment. https://t.co/zjvpVGBU4h Debating on if I should just buy all the harry potters cause I'm getting sick of renting them for 24 hours, falling asleep, and then having to re-rent them the next night...plus I want options. Late nights in London🇬🇧 Hope you guys enjoy. https://t.co/5Tz7bVTxgp Ok so on my website and app I'm starting a Christmas countdown and each day I'm highlighting a new amazing cause/charity you could easily get involved with♥️ https://t.co/Vi88Hh0OTO OMG😍😍😩😩 @TheRock https://t.co/NZ1MtOxMWk Thank you Mexico City for such a warm loving welcome...until we meet again♥️♥️♥️ Long story short...we won lmao @jimmyfallon https://t.co/oqLzNDxZPD RT @BeauWillimon: Thank you Alabama!\nAnd thank you to everyone who worked so hard to elect @GDouglasJones.\nThis is what hope feels like.\nLe… https://t.co/i7PmBzRNWf \n#Lookoftheday RT @VaughnHillyard: Father, who says he's a local peanut farmer in Wicksburg, outside Roy Moore rally talks about losing his gay daughter a… RT @ava: Dear Alabama, Remember the best of yourselves. You've done it before. Selma marches. Montgomery bus boycott. Birmingham bombing ac… Don't ask😂 https://t.co/7QSgmMalNA So freakin proud of you😍👸🏾 https://t.co/Y9SJYgcg3w RT @jimmyfallon: Tonight: @Zendaya, Billy Crudup, and music from @BigSean and @MetroBoomin #FallonTonight @zndiaya No heat...roller set under low warm temp hair dryer There's more coming...the paparazzi people just haven't uploaded them yet...but they're coming https://t.co/hCqJPWsAMs On top of the world♥️ https://t.co/lSU6nXhMj1 On top of the world♥️ https://t.co/tdJhJl3Q77 RT @SWatercolour: @Zendaya @GreatestShowman  https://t.co/gsUJgy59MP Today's accidental reference...Golden Globes✨ https://t.co/L0T3D98HDw Today's accidental reference...Golden Globes✨ https://t.co/Gpm7CkOCYt I never got a prom in high school soooo... https://t.co/6QiO6rOKuo THE dress. https://t.co/YwRpua1W48 RT @AlwaysAnthea: Bitch now it’s playing Pony this is the quality content I signed up for https://t.co/oymjn0L3r6 My heart 😩♥️ https://t.co/l69dLYhzI0 I haven't posted anything about the premiere the other night cause I'm still in shock a little bit. This is only my second film, so you could imagine the nerves, but it was a magical night and I'm lucky to be next the these incredible people. Thank you for believing in me. https://t.co/KoJfJ8X5TM I haven't posted anything about the premiere the other night cause I'm still in shock a little… https://t.co/S9wy70zzvm RT @TomHolland1996: Day 3 of The Brothers Trust second event. Thank you so much for your support. #fightEB https://t.co/Jydcdqws5z https://… RT @ZacEfron: About last night. #GreatestShowman https://t.co/hnEllrFPgb Remember my name...FAAAAMMMEE. https://t.co/XHbZZ2dC5F @ZacEfron is a mood. https://t.co/6YriHZnjbB Daytime. Evening. https://t.co/JPW07g2lPf Evening. https://t.co/ju1hv2PAl4 Daytime. https://t.co/VqosSTxAeM https://t.co/rhCMdfSKC0\n#Lookoftheday 90's supermodel moments... https://t.co/W0ysqcec7h 90's supermodel moments https://t.co/F2qf7itREL https://t.co/rhCMdfSKC0\n#Lookoftheday A platinum blonde pixie tonight cause why not? https://t.co/wUgKKNBZGt A platinum blonde pixie tonight cause why not? https://t.co/UrNmo1Sjmc @EboneeDavis @MsAmberPRiley Thanks beautiful♥️ Last night at the London Evening Standard Theater Awards I got to present the stunningly beautiful and incredibly talented @MsAmberPRiley with an award. Much deserved queen✨ https://t.co/Ww93lu5qhB Last night at the London Evening Standard Theater Awards I got to present the stunningly… https://t.co/Gokuj1TlZ2 Waaaadaaaaap https://t.co/mItEHzDBMo RT @thestandardarts: .@Zendaya presents @MsAmberPRiley with the Best Musical Performance award #ESTheatreAwards https://t.co/Ltgj8o3hy9 RT @matthewamiller: Oh my god, he just admitted to obstruction of justice. If Trump knew Flynn lied to the FBI when he asked Comey to let i… Didn't he jus- fasho. https://t.co/iHPVBT2ddt *catches light and a slight gust of wind, says in head easy breezy beautiful covergirl as I take the photo* https://t.co/RNOb2c4RIu *catches light and a slight gust of wind, says in head easy breezy beautiful covergirl as I take… https://t.co/VkuwVeInHj 🌻 https://t.co/iQ1It0ckOZ Going live on my app RT @common: My heart breaks reading about what is going on in Libya right now. Please RT to spread the news. We are not talking about this… A few of my favs 🎇 https://t.co/FHpb5LmPTe 🕺🏽 https://t.co/7wFpdU6yBs Lucky to be your covergirl ✨@instylemagazine @laurabrown99 @luxurylaw https://t.co/g2rxAtN8o2 Lucky to be your covergirl ✨@instyle @laurabrown99 @luxurylaw https://t.co/rGGKk0LjlP Yooooooooooo, yooooooooooo ooohhh shiiitttttt *my words exactly watching  #InfinityWarTrailer * RT @InStyle: No one knows how to have fun on set quite like our January cover star, @Zendaya 💥 https://t.co/VtZtVAV3g9 https://t.co/rhCMdfSKC0\n#Lookoftheday Classic😂 https://t.co/ktXr919TVu I need em all...(shout out to @KadeemHardison up there) https://t.co/GwQsra4aS9 RT @kordeeell_: @Zendaya  https://t.co/BwTag2vISt Don't make fun of me for posting again...I felt the need to elaborate and there's still no edit feature. Hello from me, my son, and my big ass feet♥️ (No, but seriously.. why do my feet look so big at this angle) https://t.co/cfHALBPrbf Hello from me, my son, and my big ass feet♥️ https://t.co/j816xg8cpP A photo of me taking a photo of a photo of me. https://t.co/QSjdhHuGPx A photo of me taking a photo of a photo of me. https://t.co/ATw7grl1fa RT @tomszndaya: @Zendaya it’s my time to shine https://t.co/uPAa1LXwq0 Live your best life... https://t.co/lHosDWLUp8 Oh shit, heyyyy https://t.co/8wUOfsJN8f Thanksgiving at the beach yesterday with my mama...(she's taking the picture, that's why she's not in it lol) 🌞 https://t.co/QKf0ZTfCLi Thanksgiving at the beach yesterday with my mama...(she's taking the picture, that's why she's… https://t.co/NllwX933Re Use Zendaya10 for 10% off 🐘✨ https://t.co/m2nmg8oVQo Very happy to be saving the elephants with Ivory Ella (and my little nieces lol). Now more than ever elephants need our help. Join the herd today and help keep these majestic creatures on our planet. 🐘✨@ivoryella #savetheelephants #sp #ivoryellapartner https://t.co/ozIDjUgppa Very happy to be saving the elephants with Ivory Ella (and my little nieces lol). Now more than… https://t.co/qLv6MyA5xE RT @TheEllenShow: Check out the new trailer for #Smallfoot from my friend @ChanningTatum! https://t.co/aKLgACP36B RT @GreatestShowman: #ImagineTheGreatestHoliday with The #GreatestShowman🎩 &amp; @Bloomingdales! Follow along on The @GreatestShowman Instagram… See you soon🤗 https://t.co/x8w1BoOIlL ❄️Kinda excited about this...here's Meechee🤗 #Smallfoot in theaters September 28, 2018.❄️ https://t.co/7sKE5WBmIM RT @ZacEfron: Let's #RewriteTheStars.  Check out my duet with @Zendaya here https://t.co/ihFy0CJwpN https://t.co/OZoy635yb8 ....I have waited so long for this very moment. https://t.co/S6jKUX7iPz The song is herrreeee! ZxZ #RewriteTheStars @ZacEfron https://t.co/La2FEkCxYK The making of a trapeze artist..btw Our duet is available now...so go listen and stuff🤗✨#RewriteTheStars @zacefron https://t.co/lT1l3WENiv The making of a trapeze artist..btw Our duet is available now...so go listen and… https://t.co/1Nr9aN5QvF RT @ryan_cortezzz: I asked zendaya what the key to success was and she said \"I'm trying to figure that out still. Maybe sleep. Don't be an… True story...be good man👊🏽 https://t.co/FJnwP5FpOz Nowhere like Oakland...I love my home man. Quality footage https://t.co/eFsp6cuvBN This administration is really out here trying to destroy the world...like wtf? https://t.co/OWgfqK0lVD Damn lol https://t.co/JG23Sk6GHK Just posted a photo https://t.co/1kP4EQswhH RT @FUCCl: mmmmm how tho? @Zendaya https://t.co/cNZxMURxOh 🎀 https://t.co/B7KVf64I2P I just presented @RepMaxineWaters with #GlamourWOTY Lifetime achievement award...a moment I won't forget. 💗✊🏽 ✨The Greatest Showman...December 20th✨\n https://t.co/ODxXol028J ✨Everyone's got an act... The Greatest Showman, December 20th✨\n\n (Link to full trailer in bio) https://t.co/h7D0kOn0Wy ALL THESE NEW TRAILERS FOR THE GREATEST SHOWMAN...IM PRETTY DAMN EXCITED!!!!! RT @GreatestShowman: The #GreatestShowman🎩 is the greatest holiday movie of the season. Watch the new trailer now. https://t.co/WDGU7eCd52 RT @RealHughJackman: So tell me do you want to go ..... @GreatestShowman 12.20.17 https://t.co/kGZR4XznZY 1960 something... https://t.co/NX7IC56GKq Real quick...this is not a parody account https://t.co/jKIX3p6Lqx RT @EboneeDavis: I fuck with me so heavy. A corny joke...get it? https://t.co/Mt3bvxvNFQ Every damn day....@DarnellAppling https://t.co/dMGZsqqIsj RT @GreatestShowman: Thanks @Zendaya for your incredible work on the exclusive Zendaya x Aqua collaboration with @Bloomingdales, inspired b… This is real...thank you to all those brave and selfless men and women, I sure hope this country works on the way we treat and care for our heroes when they return home. #VeteransDay https://t.co/nt00ewDvcG Staaahhhhhhppppp https://t.co/Np3rtxWRX1 Set it off https://t.co/06gmolZU5R Set it off https://t.co/GKHmnwtKeZ Get into it https://t.co/9v2sOExSC7 RT @Bakary510: When people ask me if Im hungry https://t.co/93FL18gA0H https://t.co/h4NHJkKLf3 I was like...kinda. My mom just asked me if I was trying to grow a unibrow...good chat. I've been flipped off twice today in traffic...fun times. Awww love, thank you! https://t.co/SFvQKTb2Jd Yeah me and myself are really happy...wedding details to come. https://t.co/nXzaypBFOp 💍 https://t.co/cdtatVW687 Met this gorgeousness tonight @Kinglimaa #forevermark #tributetoyou @forevermark https://t.co/tNu19CfE8T 💍 https://t.co/mqhcnFHEEm A cover...took my breath away. Congratulations @edward_enninful what a way to start adwoaaboah 💥 https://t.co/jp8ZzhL9Pi A cover... https://t.co/pgdx0pjt5o RT @BritishVogue: DID YOU SEE? @gurlstalk's @aboah_adwoa is @Edward_Enninful's first British Vogue cover girl https://t.co/7KYIqrCIum https… RT @jayveeme: Zendaya looking too good, the photographers wanted to wrap her in foil to save her for later https://t.co/dp02iBa3vC This tweet is golden https://t.co/R45pnB1LsM Now listen😍😩 https://t.co/OrxTCQjoMV ....all my heart is with the victims...changes need to be made. https://t.co/uKkkzA74iD Wow...tell me about myself... https://t.co/lKCn8xMF8p Don't really have a caption...just happy. https://t.co/J7YYlk9mZd Don't really have a caption...just happy https://t.co/JesGHPqp0U I got a whole 4 days off... https://t.co/a4kfOTFPXc Ugh...so good🎆 https://t.co/MyZEsnxvS8 For what...I was just hired to act😂😂 https://t.co/x5vlepmoni I connected to this tweet on a very deep emotional level. https://t.co/MOLTTXE6hG Thanks @bloomingdales for this very special collab! Pieces inspired by @greatestshowman Zendaya x AQUA available online now🎇💫\n(Link in bio) https://t.co/cUln2CJ051 Thank you bloomingdales for this very special collab! Pieces inspired by greatestshowman Zendaya… https://t.co/AvahMyDUEL No one ever made a difference by being like everyone else. #GreatestShowman https://t.co/4frD6FYzeB RT @RealHughJackman: These two will “Rewrite the Stars” @Zendaya @ZacEfron @GreatestShowman https://t.co/QnryX3kFbU What are all these damn expressions I'm giving lmao https://t.co/rSPRKDpPaW ✨Oprah approved✨ https://t.co/ak3N9y0WvE I call the second one... \"Wind in hair Vs. Lipgloss\" I was told to post...so I found these gems. https://t.co/38SqCxZxHn I was told to post...so I found these gems https://t.co/jaKPzYFSqW Yes mam😂😂 https://t.co/RWrLoEsUFC \"Just kidding I don't care, bye.\" Well done👏🏽 https://t.co/7ahXCJ3jex 💕💖💕 https://t.co/Y0W8hzIEOU https://t.co/rhCMdfSKC0\n#Lookoftheday This is amazing...doing some now🤗 https://t.co/bJyqm2vpZf YOOOOO!!!! Pre-release is here✨✨✨✨✨ @GreatestShowman https://t.co/7sVqIkUcX1 Somewhere in the corner of a party... https://t.co/iTCYv2bOC1 Reporting live... https://t.co/HLz7EqfxcK RT @kiwisays: It is 2017 and there are really people out here pronouncing @Zendaya as \"zan-die-uh?\" 😒 Can't believe imma tweet this but...I found some bomb ass vegan ice cream😩✨ Damn...that's messed up but hey babe, nice to meet you for real this time💕 https://t.co/VKyvOkNPMj Thanks for sharing your story love!😘 https://t.co/KQAA7YHySf Last nights inspo...my stunning aunties (my daddy's all the way on the left) and a hint of Angela Davis. photo cred: grandmas living room https://t.co/V3otGVwwRp Last nights inspo...my stunning aunties (my daddy's all the way on the left) and a hint of… https://t.co/5v1NIfTLpd 🤗🤗🤗 https://t.co/BSH0YZU7Yy Vintage. https://t.co/pY3kAbUx1r The other night @hm x @erdem fashion show🌷 https://t.co/hTU7pQQN7m You're so amazing...thank you for your brilliance🤗✨ https://t.co/f7aaOg12qW RT @CalvinKlein: Woman of the hour: @Zendaya received the Gamechanger award at the @GLSEN #RespectAwards, wearing a Spring 2018 CALVIN KLEI… No, thank youuuu!!!♥️🤗 https://t.co/NG87Sl7THt RT @GLSEN: \"Your purpose when you have a platform is to sometimes to get off and let someone else stand on it.\" -@zendaya at the #RespectAw… RT @caseycreates: So @Zendaya and I were both struggling to find the restrooms at @GLSEN #RespectAwards and that's how we met #iconic 💛 htt… Beyond honored and lucky to be here tonight @GLSEN Respect awards...so much love and empowerment in this room.✨❤️💛💚💙💜 RT @kerrywashington: I'm looking forward to tonight's @GLSEN #RespectAwards. \nhttps://t.co/z6cafvRwyX ...Noon is 2 today guys....😩😩😩 #happybirthdayson #dogmom https://t.co/tlWFqLq3wH ...Noon is 2 today guys....😩😩😩 #happybirthdayson #dogmom https://t.co/el4WXipEei I got y'all💥 https://t.co/f9ZcWpaD3X 😍😩 https://t.co/F61jf9spMm ✨Happy birthday man!! @zacefron Thanks for having my back the whole movie, quite literally.✨ @greatestshowman #greatestshowman https://t.co/4Nk9suAlSu ✨Happy birthday man!! @zacefron Thanks for having my back the whole movie, quite literally.✨… https://t.co/2yhdeF3kXo ✨✨✨ https://t.co/3X0DkfUSnm RT @AlwaysAnthea: Their lack of reaction to her antics is the best part https://t.co/Ld0N1SBgSx You ever just feel like.... \"that's all I got, that's all I got\" https://t.co/r7ilWTDP2V You ever just feel like... https://t.co/7A49658RTt Miss Simone♥️ https://t.co/rI1fnfby41 RT @glamourmag: Yara Shahidi has the best advice for young girls. #Glamour4Edu https://t.co/CL4zLJ4fBy Let's go ✊🏽✊🏽✊🏽 https://t.co/8AwiSSFT3R RT @mindykaling: Why is it helpful men speak up? Bc that's what this personality fears most: the disintegration of the tacit male support f… #DayoftheGirl ...and I truly thank you for making the first huge steps towards assuring that this industry be safer for young actresses like myself. As a young woman in this industry, I am deeply grateful to all the courageous women coming forward and speaking their truth... https://t.co/rhCMdfSKC0\n#Lookoftheday I can'tlol but you are gorgeous babe✨😍 https://t.co/9CDSMKlUcM RT @dayaparadise: Zendaya out here looking like the third Jackson member of the iconic music video \"Scream\" https://t.co/yNI5wxVjJL https://t.co/rhCMdfSKC0\n#Lookoftheday ✨Happy birthday to the one...the only.... @BrunoMars ✨ @DarnellAppling face hahahahahahhahahahahahahhahahahahahhahhhahahah😭😭 https://t.co/1kiIpGqre5 LenZuno...I can dig it https://t.co/VEUMg4JK6Z LenZuno...I can dig it. (Swipe to watch me live my best life at this damn concert) https://t.co/N4n4pvTgDf Oh heyyyy shuuuggaa https://t.co/451ha9zR6y I was LIVING MY BEST LIFE at Bruno's concert tonight! Let me tell you something👏🏽👏🏽👏🏽 😍 https://t.co/BB402roZvV RT @YaraShahidi: We finish each others sentences.....THAT'S sisterhood!! #zendaya #forceofnature #leaderofthepack https://t.co/uY6jahmhZs 🖤 https://t.co/ZkfcKZAWAH ✨Inside the spread✨ https://t.co/xWs9eGRdA2 🦁@glamourmag https://t.co/gTFhBVaBQk ✊🏽 @glamourmag https://t.co/Dwl1DYDaHS https://t.co/FKgzJY8izd ✨Just a normal convo with  my sis @yarashahidi but it’s ALSO MY @GLAMOURMAG COVER!✨Thank you! #poweredbywomen ✨Just a normal convo between me and my sis @yarashahidi but it’s ALSO MY @GLAMOURMAG COVER!✨… https://t.co/V7jhTH4NgL Proud to have partnered on such an important film with @verizon. Watch the full doc at https://t.co/cg5k6tdkqK ✨ https://t.co/SaXLHqga8v I MISS THEM SO MUCH😭😭 https://t.co/AOHsWXBLyS 🌷 https://t.co/rp5dDLkL9U 🌷 https://t.co/5bLqglZJK7 Tonight at the 'Without a Net; The Digital Divide in America' documentary premiere NYFF ✨ https://t.co/55Nk6Qc7Pp Just posted a photo https://t.co/wzkrCH6cDp RT @MichelleObama: Happy 25th anniversary @barackobama. A quarter of a century later, you're still my best friend &amp; the most extraordinary… This is a list of the deadliest mass shootings in recent US history. Now we add the deadliest to… https://t.co/DlcBM9df6W Where is the change? I only tweeted this 6 months ago... https://t.co/ALJPxQED6f I only tweeted this 2 months ago... https://t.co/Xifz4qOTRH There's nothing I can tweet that will heal the heartache being felt today, but all my heart is with Las Vegas. This is domestic terrorism. Don't worry...a press tour is coming... https://t.co/7RRWYaHrbq The extra ass nail art I used to get in my teenage years....I can not😂 RT @TheRickyDavila: This made me cry. I can't say much more. #PuertoRico \nhttps://t.co/lOdoAeG0gD .....and that's a series wrap! 😭😭😭😭 Currently filming our last scene of KC Undercover.... 🌞 https://t.co/oVkTGOpKwk RT @rihanna: --- @realDonaldTrump ----&gt; https://t.co/fE1Rd3bMDp \"Has nice eyebrows\" hahaha good luck babe🤗 https://t.co/DSnT9Bak7b RT @DavidBegnaud: About 44% of the population in Puerto Rico is without drinking water, according to the Department of Defense. \nIt's 90 de… Watch tonight! It's an issue too important to ignore. https://t.co/SMbPx8OAX9 https://t.co/rhCMdfSKC0\n#Lookoftheday Amazing....I'm so excited about this!✨👏🏽 https://t.co/Qf3auHfnfe I should hope I didn't mess up my 8 lines lmao I had those doowwwnn😂 https://t.co/OjS4gRCWgu RT @getnickwright: The protests have been hijacked by folks with an agenda. I tried to set the record straight this morning. I think this i… RT @MichaelSkolnik: This is Puerto Rico TODAY.\n\nNO drinking water!\n\nPeople getting water from a RIVER!\n\n@realDonaldTrump, this is YOUR disa… https://t.co/rhCMdfSKC0\n#Lookoftheday RT @brennanmgilmore: My grandpa is a 97 year-old WWII vet &amp; Missouri farmer who wanted to join w/ those who #TakeaKnee: \"those kids have ev… She's everything✨ https://t.co/J4wPYSFgXo RT @ACLU: Don't confuse #TakeAKnee for disrespect. Respect and love for America doesn't require blindness to its failures. https://t.co/UMA… 1968... https://t.co/1MZMVM909P 1968 https://t.co/PnImZq8bfO Solidarity. #TakeTheKnee https://t.co/zjLHmCN0zF Take the knee. https://t.co/byDihfeMk4 RT @MichaelSkolnik: Dozens of players on the Jags and Ravens took a knee during the first @NFL game played today in London. https://t.co/QN… RT @robinthede: BREAKING: Steph Curry and the Warriors have released this official response to being uninvited to the White House: https://… RT @NYCLU: If peaceful protests did nothing, the powerful wouldn't try so hard to silence them. #TakeAKnee https://t.co/0aONI66gJF RT @ava: He's not declaring war on NFL and NBA. Owners are his donors. He's declaring way against black people with opinions. https://t.co/… No like I really love her...like double love her cause I love her and Olivia so like...I love her twice. @kerrywashington https://t.co/2SQNiPxTxL https://t.co/UQRX8nYUrD As the daughter of two teachers, this issue is so near and dear to me. \nSupport+watch this film ✊🏽#closethedivide https://t.co/cg5k6tuVii https://t.co/HviBB2h8TC As the daughter of two teachers, this issue is so near and dear to me. \nPlease watch and support… https://t.co/lgbgGTtvTB RT @common: Mexico City was hit with a magnitude 7.1 earthquake today. My thoughts + prayers are with the people of Mexico: https://t.co/4e… RT @GLSEN: We are honoring @Zendaya at the Respect Awards for her work in promoting social justice. 👏 https://t.co/VKE78CsOyG https://t.co/… Hell yeah!!! History is made. 👏🏽👏🏽✊🏽 https://t.co/aI9QUSLNF1 Hell yeah!!!! History is made. 👏🏽✊🏽 https://t.co/VxXWCbJpYC RT @Variety: #TheNightOf star Riz Ahmed: \"I don't think any one award changes the systemic problem of inclusion\" #Emmys https://t.co/OKzli6… RT @FeministaJones: \"First Black to ______\" is still a phrase in 2017 America\n\nWe arrived here in 1619 RT @ComplexPop: Donald Glover is the first Black actor to win the #Emmy for Best Actor in a Comedy Series since 1985. \n\n#Emmys https://t.co… 👏🏽👏🏽👏🏽✨✨✨ https://t.co/JBonCtVyYq RT @deray: keep ya head up. https://t.co/YZyxDZcq28 Shut up hahaha https://t.co/0X2hdsBRQc Princess moments https://t.co/Vvu0Jnt8ZI Princess moments. \n\n@csiriano @mateonewyork @luxurylaw https://t.co/FxWks1vYoh Vintage https://t.co/Z4KHMUiMgp 🤗 https://t.co/s6Obz08Fkj This account scares me...like this captures noons essence perfectly...this is noons acutual profile...I'm convinced. https://t.co/g5wxwN1aoD Me and @Kamil_McFadden bout to bust our asses but it's cool tho.. https://t.co/40AtLA2ipT https://t.co/rhCMdfSKC0\n#Lookoftheday RT @JordanUhl: A government figure is demanding a reporter lose her job because she was critical of a government figure. https://t.co/6b21q… https://t.co/rhCMdfSKC0\n#Lookoftheday Yes!✨ https://t.co/puaAvABDzc .......somebody get them... https://t.co/Te8U4ArO1Y I raided Dwayne Wayne's closet...thanks tv pops for your fresh old tee✨ @KadeemHardison https://t.co/c9iqqr5W4F Right👏🏽😂 https://t.co/s1qaMV9PtF I raided Dwayne Wayne's closet...thanks tv pops for your fresh old tee✨ @KadeemHardison https://t.co/RYpw73OSZZ https://t.co/rhCMdfSKC0\n#Lookoftheday This is so cute, thanks babe🤗 https://t.co/vBtgmDoX1x Bahahahahaha😂😂😭😭 https://t.co/QKlajZ56Su Don't ask😂😂😂 https://t.co/B9CDchdKEh Brows, mascara, gloss...couldn't decide soooo here's both🤗✨ https://t.co/G6E29HoKKB Brows, mascara, gloss...couldn't decide on a filter sooooo here's both🤗✨ @covergirl https://t.co/HR5tnER76t RT @TIME: Ava DuVernay is the first black woman to direct a film nominated for a Best Picture Oscar #SheIsTheFirst https://t.co/JThC5Rzsea… RT @TIME: Ilhan Omar is the first Somali-American Muslim woman to become a legislator #SheIsTheFirst https://t.co/VAszMCZ5jz https://t.co/P… RT @paolamendoza: The DREAM ACT must be passed to protect 800k #DACA recipients. We must urge Congress to act TODAY!\n   \nPlease call these… RT @LoganLaurice: When the 'current political climate' and climate change are simultaneously devastating.. RT @nowthisnews: ‘I’m gonna be sent back to a country that I’ve ever been to and I’m gonna lose every opportunity that I have.’ https://t.c… Thank you @DylansCandyBar and @COOLHAUS for makiking my birthday extra sweeeeet🤗🍬🍭🍦 https://t.co/kFwSbBumkY In full effect.... https://t.co/jfGwjy3mMs Because I love Beyoncé with my whole heart... https://t.co/TL32XwFo6G Why am I just seeing this??? Thank you so so much🤗 https://t.co/20iWHPG94I Happy BEYDAY😍👏🏽👏🏽👏🏽 ♠️ https://t.co/uD7sMvB1Bf Thank you all so so so much for such a beautiful day...I don't know how I got so lucky✨ I love you You guys really don't know how much this means to me...thank you for all of your unwavering… https://t.co/catztrAFfw Legend shit https://t.co/i8F9jW7Cka He killed that🤗 so adorable!! https://t.co/kqkwtCyEzU Hell yeahh👏🏽👏🏽👏🏽✊🏽 https://t.co/DGpjChtqFN #SelfiesForZendaya wow you guys are fucking stunning...😮😍 Thank you for this, I surely will. All my love✨ https://t.co/JE7kBbK8fu Love you so much V....always here for you♥️♥️♥️ https://t.co/K1Iilpju9s RT @kerrywashington: Let's help @Zendaya with her birthday goal! https://t.co/QboDIDTER0\n https://t.co/2p22opYlsd You two are so adorable😩😍 https://t.co/DgdQzMXy4u Awww✨♥️ https://t.co/MPpv87yeOX Love this! Thanks babe✨ https://t.co/QVLFfLTWAT Will do! Thank you so much✊🏽 https://t.co/r32miVtRXZ ✊🏽✊🏽✊🏽 https://t.co/bWaEsQh3F2 Thanks gorgeous😍✨ https://t.co/DV5X6wsatB Thanks babe👊🏽❤️ https://t.co/8if4cJdGya ITS MY BIRTHDAYA!!!!! https://t.co/CsQd6Av1ee Love you sis/queen♥️✨ https://t.co/jEGzLYK7GG Thanks babe♥️✨ https://t.co/2SVF7vk2g0 Hahahah you're the best...thanks partner in crime👊🏽😂 https://t.co/dga3NFDjwr It's been my pleasure🤗 https://t.co/Op65ONC1f8 Thank you for all your support and guidance...love you big bro✊🏽 https://t.co/vBqliEDrHO 😍 https://t.co/0vRO3nzZ1L Thank you love👊🏽 https://t.co/SzCwbYGo7P Yadadamean👌🏽 https://t.co/eoCnwW27eq Love you ladies✨ https://t.co/Vq7PanTngQ Thank you brother, much love to ya♥️ https://t.co/nDzepR1gBf 🤗✨ https://t.co/AqcPAJtDgr 😂 love you little one lol https://t.co/Jj8gtHqVBI Going to bed...in the morning I'll be 21✨ Thank you for all your support♥️👊🏽 https://t.co/jPLwGzU4jm I'm excited...y'all really are the best!!😩♥️ https://t.co/T3KiE9ZUpD I gotta wait two hours and then I'm reading this whole thing😍 https://t.co/CM7tj2kJDt Awwww babe❤️ https://t.co/TZG3b2gc2d RT @LoganLaurice: I 🖤 that @Zendaya makes her bday an op to give. Text ZHOPE to 50555 to donate $10. I went to https://t.co/y4OOYORNjy to g… Awww😩❤️ love you! https://t.co/wxkoN5uzsm RT @ConvoyofHope: @zendaua @Zendaya Hi Amber! You can donate from anywhere! https://t.co/aDS5dZdBVo. ✊🏽👏🏽👏🏽 let's gooooo!!! https://t.co/T496NdnlvM No contribution is too small,and it's super easy to help.Text or go online NOW to donate! ✊🏽 (LINK IN BIO)  @ConvoyofHope #HurricaneHarvery https://t.co/PHDX8VYgZ1 With the devastation of #HurricaneHarvey I knew what this years birthday project had to be..I… https://t.co/1RZcrHr80u I get really excited for these...🤗🤗🤗 https://t.co/lPx4ksqQxn https://t.co/rhCMdfSKC0\n#Lookoftheday Happy birthday angel... https://t.co/wWMmJbxauk 😲😍 https://t.co/zypPCyCMX5 My heart is with Houston...stay safe♥️ RT @MichaelSkolnik: Stay safe Houston. PLS SHARE. https://t.co/9Glnx6EDF5 If it wasn't clear before...sad. https://t.co/UAd277VG4z RT @MichaelSkolnik: Eleven personal trips this year by Trump to Mar-A-Lago: $29 million\n\nMedical services for transgender people in the mil… ✨Happy birthday to the powerful light that is @ava Thank you for your creativity, your voice and your compassion.✨ https://t.co/3yyggqqmKi 🙏🏽✨ https://t.co/IFZxXGu7md RT @votevets: There's NO reason for a transgender ban. Military isn't asking for it. Americans don't want it. This is about Trump embrace o… 🤔 https://t.co/0utn9yPXLn Why my dad lookin at me like that in the first pic, that look that remind you that you grown but you ain't that grown lmao https://t.co/LhvI7VaKHl Why my dad lookin at me like that, that look that remind you that you grown but you ain't that… https://t.co/RNzcGD91KR Me and @DarnellAppling clearly lmao https://t.co/JjdvPrEvsN #ImWithKap ✊🏽 RT @NYjusticeleague: The @NFL @nflcommish better pay attention cuz the people are showing up!!!!!! #NoKaepernickNoNFL #ImWithKap https://t.… https://t.co/rhCMdfSKC0 \n#lookoftheday On my lunch break...ready to dive into part two. https://t.co/tGiiqq1gJl RT @RVAwonk: -White supremacists planned the rally\n-White supremacists attended it\n-White supremacist killed someone\n-White supremacists ce… That's me tho. https://t.co/Xw0XekcuSk That's what I'm talkin bout😏😂 https://t.co/pJSnSOsZaN Hansjdndndkmdn (I did the keyboard smash y'all) https://t.co/HKgjZCNUaC \"The only thing necessary for the perpetuation of evil, is for good people to do nothing.\" Jane Elliot Damn...I just read part 1....I strongly suggest you all take the time as well. https://t.co/cRiZmcoL1G RT @ava: Charlottesville. Barcelona. Widely covered. Sierra Leone. Not so much. A catastrophic flood occurred there Monday. Worthy of our a… Taking pictures in front of my roses and shit... https://t.co/R5rbRrlJ0d Taking pictures in front of my roses and shit... https://t.co/sFQk2gKH9E https://t.co/rhCMdfSKC0\n#Lookoftheday Supa Dupa Fly  🛫 @jetluxlife https://t.co/Hrp49ztIw5 RT @MichaelSkolnik: Boston\n#FightSupremacy\n📷: @djouly73 https://t.co/sPGu8Rsjnv RT @BrunoMars: #VersaceOnTheFloor https://t.co/lJV32yGt0a 😁 https://t.co/2ZBts60HL3 RT @jaketapper: Slavery, racism, torture, rape, treason and sedition are all worse. https://t.co/7rAF6lmQUj 🌴 https://t.co/5pxMMgGET6 RT @sarahwhelmed: THERE ARE NO MONUMENTS TO HITLER IN GERMANY, EVEN THOUGH THAT'S PART OF THEIR HISTORY. THERE ARE MEMORIALS FOR VICTIMS. T… Provocative....where??? You look amazing♥️♥️ https://t.co/8jmMO4qCHa https://t.co/rhCMdfSKC0\n#Lookoftheday RT @ava: I feel like... I don't know what I feel anymore. Shock. Been there. Disgust. Done that. Rage. Ongoing. This is bizarre and revolti… Stay aware, stay ready https://t.co/2upM9rOd0L RT @itsgabrielleu: You cannot be an ally &amp; stay silent &amp; complacent in the face oppression/hatred/murder. Interesting to see which \"friends… RT @SenMarkey: It’s a sad day in American history when the President of the United States defends white supremacists. RT @LibyaLiberty: Impeach. Now. NOW. https://t.co/owxNETJ7RD https://t.co/rhCMdgam0A\n#Lookoftheday RT @ShaunKing: WARNING.\n\nCriminal evidence. \n\nThe vicious criminal assault of Deandre Harris by white supremacists. The clearest video. \n\nA… #VersaceOnTheFloor https://t.co/4BsJk3y0QX ✊🏽 https://t.co/B9ZmN5vreO 🌌 #VersaceOnTheFloor🎆 https://t.co/0Mez0BkerM Pretty much https://t.co/JrmmQXm0uG RT @voguemagazine: Watch @BrunoMars's new music video for “Versace on the Floor,” starring @Zendaya. https://t.co/fU8laE6eNL RT @Versace: Bruno Mars sings Versace on the Floor in Versace custom-made shirt, trousers and slippers. Starring Zendaya in a custom gold c… When the flyest man out here calls you for one of the flyest songs out..you make it happen.… https://t.co/ynPnfhq3jL 🎆🌌🎆\n\nhttps://t.co/cmIDohPCrQ Oh did I forget to mention...I did a video with the flyest man out here @BrunoMars #VersaceOnTheFloor https://t.co/FW4yDAb2S9 RT @BrunoMars: Versace on the Floor video is here, starring the oh so fly @Zendaya. Love you #Hooligans! Let's goooo! https://t.co/KCGolQsK… Menswear... https://t.co/fBmGgHgqrv Menswear... https://t.co/bq36UzGhss Come on thru Bruno!!!👏🏽👏🏽👏🏽 https://t.co/wjam5Kg4dG RT @MichaelSkolnik: Heather Heyer is her name. She was 32 years old. She was murdered on Saturday, August 12th in Charlottesville, VA. May… Daya https://t.co/KtF0j2yqDS Sup. https://t.co/uMGuWQrqDN Thank you to all the beautiful faces that came out to see me at #BeautyConLA love youu😘✨ RT @ACLU: We condemn the voices of white supremacy heard in Charlottesville today, and all violence. Our hearts are with those killed and i… 😩✨ https://t.co/BOTbXC5T4r 😘😘😘 https://t.co/aSVUubwD4c On a positive note tho...I saw @YaraShahidi 🤗✨ https://t.co/Q3LUkg9onK On a positive note tho...I saw @yarashahidi 🤗✨ https://t.co/OKqsFTaag0 . https://t.co/2WQX33xZmN RT @FUCCl: \"when you're accustomed to privilege, equality feels like discrimination.\" RT @tbonier: Tamir Rice was killed for having a toy gun. He was 12. https://t.co/DBhLc1eM4J RT @MatthewACherry: Imagine if a group of black people anywhere showed up in public armed like this in a right to carry state or not. https… RT @Neubadah: Confederate flags, Nazi salutes, and Klansmen having their rights protected by a black police officer. \n\nThis picture hurts.… CALL IT WHAT IT IS. IT. IS. TERRORISM. RT @deray: This is America. 2017. https://t.co/AltzK7Zq7R I really don't know what to say...but this is terrorism. This is America TODAY...not 40 years… https://t.co/dZ5iHN0h31 RT @jk_rowling: Hell of a day for the President to forget how to tweet. https://t.co/ABffmwwH8D RT @MichaelSkolnik: This is domestic terrorism. #Charlotesville Zx2 @annieleibovitz @voguemagazine @GreatestShowman https://t.co/f1F6KLGVYL ✨Zx2 ✨annieleibovits @voguemagazine greatestshowman https://t.co/w8F7gpHStX See you tomorrow💜 #BeautyconLA @COVERGIRL https://t.co/mnHBFqhJTd See you tomorrow 💜 @BeautyconTweets @covergirl https://t.co/Yd6MJ0X5wY Shut up snitch https://t.co/20sBxFxsIs Let me get off my phone and get back to work RT @thegreatkhalid: this is quality https://t.co/s7MnvXR8EA That shit would be tight😏 I sure hope Kendrick tours internationally soon cause then he can call it DAMNIT 💋 https://t.co/rk01SeZ3aR ✨Rock with You vibes✨ https://t.co/IpTftlTypV Also...I finally met this guys @johnboyega 👏🏽👏🏽 https://t.co/TOEjrqHFEd RT @YaraShahidi: Big sis out here killin the game @Zendaya 😘😘 https://t.co/w0Ei50BCNr Shoutout to @chinamcclain and @yarashahidi who I just found out did the same pose...I love… https://t.co/U7a1IemFw7 Thank you gorgeous♥️♥️♥️ https://t.co/Pf1VuKQkiq RT @BritishVogue: .@Zendaya's 70s disco makeover is the most fabulous thing we've seen all week: https://t.co/FdR2RfZWfX https://t.co/FOVsO… ✨✨✨ https://t.co/6TJTkriFL4 Recap of last night...with my fellow cover stars⭐️ https://t.co/9dNqYmWlXC 💖 https://t.co/L0hcSnehvH Thank you @Variety lucky to share this cover♥️ https://t.co/Hna80IqgiH Thank you @variety lucky to share this cover♥️ https://t.co/8vX4pTrIMw RT @Variety: Inside Variety's Power of Young Hollywood issue featuring @Zendaya, @JohnBoyega, and @ChloeGMoretz #POYH https://t.co/92vHlMq9… 👊🏽✨ https://t.co/gv9jdGKOwo Nothing but the best. https://t.co/ChTYkZBXlT RT @Variety: How @Zendaya fell in love with Spider-Man and launched a movie career #POYH https://t.co/eMzV7WhT0L https://t.co/SnWv0qaRKd Thank you for having me on your cover and for a great interview❤️🤗 https://t.co/dLTzZNr4l4 RT @IsidraxChavez: @Zendaya Not to mention she DID THAT too! This whole episode was woke af. https://t.co/fHXnNZhWHq Go to my app for the full story time 😂😂😂 https://t.co/ztZUaRYDSP 🤗stunning babe https://t.co/4uzvYQJ6Ea 🌞 https://t.co/MIJ52O5ZeS Happy birthday to the flyest to ever do it👏🏽✊🏽 #ObamaDay @barackobama https://t.co/iIkyuyhRzw Happy birthday to the flyest to ever do it👏🏽✊🏽 #ObamaDay @barackobama https://t.co/RJpBv7uQ18 RT @Complex: Happy birthday @BarackObama 💯\n\n#ObamaDay https://t.co/xIsQ50Anpf Soooooomebody once told me.... goodnight y'all https://t.co/4v2fJCdn2v RT @RepJudyChu: Nevertheless she persisted. https://t.co/Ln6AGj5Kzq Thank you for bringing your legendary comedic talents to our show❤️💋 #KCUndercover https://t.co/dXbeO5oYKd I watch Shrek too often in my adulthood. Am I hip now? Girl jsdbidnajshoxlcn.... https://t.co/PKsa8OmjcD Hstshdjdkjdksksndhxh https://t.co/MLDeMFyvwG 😂😂😂😂 https://t.co/ftjWfvnVzu RT @thefader: \"We write to change the world.\" \n\nHappy birthday to one of the world's most beloved writers, James Baldwin 🙏❤️ https://t.co/N… It's not funny. https://t.co/z6XkQgkV5u I'm gonna start wearing red lipstick more often. 🐞playing with filters🐞 https://t.co/eg9XrHJUv2 🐞 https://t.co/Ig8xjSuELz #blackwomensequalpayday ✊🏽 (more info on my app or online) https://t.co/Xw2jqFQ7S6 You can't make this stuff up....😂 RECLAIMING MY TIME....RECLAIMING MY TIME. This gives me so much joy...I feel it deep in my sprit!!! Yesss! 👏🏽👏🏽👏🏽👏🏽 https://t.co/h9TzzVe87o RT @Demetrius32000: I'm living for Black Disney #RavensHome #kcundercover #k.c.undercover https://t.co/9Lk3aMfxp2 😂😂 @Kamil_McFadden https://t.co/J3zdZd5Uah Right. https://t.co/THxjhvc8IT Wow...with everything that's going on, sadly I'm not even shocked (The fact that his \"speech\" sounds like a shitty standup) https://t.co/zXNJJzNODk RT @MichaelSkolnik: I've watched this 50 times to see everyone's individual reaction. 😳 https://t.co/U2jLS5xiAL Currently buying all your shirts✊🏽 https://t.co/BKI6ubM3Hf Repost repost REPOST!!!#transrightsarehumanrights https://t.co/LpZuY4yd20 Repost repost REPOST!! #TransRightsAreHumanRights https://t.co/2hD2GqI9cV RT @Lavernecox: To all the trans folks currently serving in the military thank you for your service. I am sorry your \"commander in chief\" d… RT @ACLU: #TransRightsAreHumanRights https://t.co/6hb5EHoj9A RT @eggsysbucky: @Zendaya embodying my constant mood https://t.co/ecqN1BUIjV Love and dancing😂😂😂 \"Watch me react to my 1st Youtube Vids \" #happysmileyfaces  https://t.co/kWmWx6M0jO This is precious😩❤️ https://t.co/WNNOZHv0ZC I love Michelle Obama with my whole heart...just a random thought. The online browser experience for android is basically the same thing😘 https://t.co/zdkaiT1CO9 We hope to keep this going, tell us what you think❤️✊🏽THE REST OF THE FIRST EPI UP NOW!! LINK IN BIO!! + we don't just focus on hard hitting topics,we always make sure we uplift people with good news.Positive stories to motivate &amp; inspire.(3) ...without either being bored to death or just confused😂 So we said...let's make it simple, real, quick and strip it down to the basics. (2) As a young person I feel that sometimes it's hard to find a way stay updated and educated on important political topics... (1) \"Ise Lyfe's \"The Bazics\" - what you should know about police brutality\" on #ZendayaTheApp https://t.co/TfZyUubUaf Sometimes you have to create the content you wanna see. Started a little show on my app with my mentor/big brother @iselyfe ... #TheBazics. https://t.co/ZIuc7AcLu0 Sometimes you have to create the content you wanna see. Started a new quick segment show on my… https://t.co/hEByIYv3V6 Gorg...😍 #zendayaapptips https://t.co/eOXwonJvag We've been at this fashion shit for a while now...you've been my one and only stylist since I… https://t.co/AjlM4m6yIx Next to queens...❤️ https://t.co/1PChTsteEi RT @SpiderManMovie: You only go through high school once, but it changes you forever. #SpiderManHomecoming 🕷️ https://t.co/11ZCBJKcDM RT @UNAIDS: #TBT #MandelaDay 2015 &amp; promoting HIV testing among youth in South Africa w/@Zendaya, @NicoandVinz &amp; @NdabaMandela. https://t.c… Why is my mother like this??😂😂😂@clairemaree64 https://t.co/UdM6WLhegG RT @ava: Facts. https://t.co/fM33eeUU3N RT @TomHolland1996: Your time is nearly up! Go to the link in my bio to win the chance to watch Spiderman with me and my brothers. #letsmak… Breathtaking. ❤️ https://t.co/4AYN08wO5e I'm done😂✋🏽 https://t.co/XEEipLyG4d Wait wait...my favorite is when it says we go on vacations together HA! I haven't been on a vacation in years!😂😭🤣hbu @TomHolland1996 ??? https://t.co/zSkvcfzzTa 👊🏽👏🏽 https://t.co/8yTxBv8mAH Damn straight!!!! Did that Jacob👏🏽👏🏽👏🏽 https://t.co/xnjXALJt31 Wow😍😍😍 https://t.co/UryOJW2YY3 😍😍😍 https://t.co/75qwi5KE5m RT @JenJen2182: I'm about to flood this hashtag  #BringBackObama https://t.co/tGFR2LfLkv RT @paolamendoza: #BringBackObama https://t.co/MLpboHsei7 🦁 https://t.co/WWi7rssCHB Various creative ways to.....🖕🏽 https://t.co/5eWPxF8UKL When you have couture gowns in your hotel room, you're bored as hell with jet lag at 3am in Paris..this is the result. Not bad😏😂 @LUXURYLAW https://t.co/pfqGT0QPMY ✊🏽✨ https://t.co/gDyblot72L ✨🌻✨ https://t.co/XKboXXTZpS Sunshine ✨🌻 https://t.co/TwYWkA6SaL Sunshine https://t.co/3It18axgV9 Just living my life✨ https://t.co/G1grhDJO8h \"I love my friends\"😂😂😂 https://t.co/vqUkF9Sb2v RT @HustleAndFro_: The KKK is a hate group. Police are keeping them safe. When Black folks protest for our right to life, police harass and… Mood alllll dayyyyyyy.... #SpiderManHomecoming https://t.co/Yp88Xrx1hN RT @karabodegon: Taking a painting break from being sick to appreciate @Zendaya in #SpiderManHomecoming https://t.co/D5ngPABfGl RT @mxwzy: Cover so iconic I had to frame it. Keep shining @Zendaya . https://t.co/Za4yYm7vZF RT @Jon_Favreau: Tonight's the night. #spidermanhomecoming Very...very intimidating😏 (just missing @lauraharrier) TOMORROW IS ONLY A FEW HOURS AWAY!!!… https://t.co/4UppXRAw7D RT @bigesmallz01: Ready for Spider-Man homecoming! https://t.co/o5msVWSwGI Trying to get tickets for #SpiderManHomecoming tm and all the good times/seats are sold, normally I'd be mad, but in this case, hell yeah!!! I've wanted to do one of these for a long time...Towel Series @mariotestino https://t.co/bLMWJjSYSs I can pull off that second look very well too😂 https://t.co/cdTDNHF12G Baby face... @covergirl https://t.co/Jwhm60Js5T Just a sweatshirt really...casual @viktor_and_rolf @luxurylaw @mireyacierto https://t.co/vH2XUcS981 RT @shawna_queen_: @Zendaya they tried you https://t.co/a7r8K9i27c Moments https://t.co/IkCe3FzhMP 😍awwwww cutie! https://t.co/ku96PSBYDL Thank you for having me @chopard @ralphandrusso ✨ https://t.co/PavHBeWuuQ Hellll yeahhhh @TomHolland1996 you did that! https://t.co/8bbbVUSppH Waits til morning to get HQ's from tonight😂 https://t.co/PHlTlWxpoD Y'all are crazy, thank you baby😂❤️ https://t.co/YHVOBMqGYo RT @VogueRunway: .@Zendaya stepped out in a look that was easy yet polished in Paris. https://t.co/L6Kt1lCV0y A view... https://t.co/D8gnde0dt1 How it should be✊🏽 https://t.co/kuGUvhSlcB Fit for a princess... @chopard @ralphandrusso https://t.co/PD6LYx4GWt RT @ava: White supremacy is such that it allows a clearly diminished man to post this and proceed, but blocked the dignity of Obama at ever… Like no one hacked it, it's not a parody account...that's really him...that shit is just embarrassing. I just want you all to remember...this is a tweet from the \"president\".....ok https://t.co/9KqscBCMST Morning from us😂✨ @voguemagazine https://t.co/WLDv2XpMOD Morning from us😂✨ @voguemagazine https://t.co/l8XDADFLtq 😘 https://t.co/G8yrJsAlGz Vintage 🌹 https://t.co/G0v3IzEstc RT @ZBHappy4me: @Zendaya proud of YOU 2017 edition be like… https://t.co/B5kwDaosS8 RT @deray: What kind of person brags about defunding peacekeeping?! https://t.co/CfGOZVAja5 My mean mug tho lmao https://t.co/hrhtsRPkQO My handsome little nephews escorted me down the carpet... https://t.co/9576b2pWgk 😘😘😘 https://t.co/pPPHUSGnSd Had trouble choosing which one soooo...here's both😂 https://t.co/OMtJbWlUtw Then the legend that is Michael Keaton helped me with my dress....night made. https://t.co/kucq2yZpdy Can someone help me find these without the watermark😂 https://t.co/bNyLXSXt4v 😂👏🏽👏🏽 https://t.co/TDlxYywgKD Don't ask what's happening to me in the last two😂...just overwhelmed by the beautiful goddesses next to me most likely... https://t.co/cZ3rTtFzwv So...recap...let's start with this action shot lmao https://t.co/v4o0D1ilC0 RT @voguemagazine: .@Zendaya brought 1960s glamour to the red carpet. https://t.co/mXQNHG3aTQ RT @RottenTomatoes: With 27 initial reviews, #SpiderManHomecoming is currently #Fresh at 96% on the #Tomatometer 🍅 --&gt; https://t.co/NPNTFOg… Over the moon right now...goodnight, sweet sweet dreams and I'll post like crazy on ig tm...just a warning🌝🤗✨ RT @MatthewACherry: Zendaya did that tonight 🔥 https://t.co/u4zhM3kWgA RT @GeeksOfColor: Zendaya 🔥🙌🏾. #SpiderManHomecoming https://t.co/gKFB1oNtXm RT @MichaelSkolnik: Proud of these two incredible people for an amazing opening of #SpiderManHomecoming. It has been a joy to watch you bot… You know my family😂😂😂 https://t.co/LhKfZXYsTO I'm comin!! I'm bringing like 6 of my little nieces and nephews...plus the rest of the family...shit takes time😂 https://t.co/FxQCMUzPBz The full debut trailer is online now! Check link in bio or my twitter🎩✨ #GreatestShowman https://t.co/UUXQR5lvtW RT @Variety: See the first trailer for @RealHughJackman's original musical #GreatestShowman https://t.co/3AcVacnZiQ https://t.co/UWtS7DZgQO It's here!!!! The debut trailer✨🎩 #GreatestShowman https://t.co/KoTvPJgKvN RT @GreatestShowman: It’s showtime! Watch the debut trailer for The #GreatestShowman now! 🎩 ✨ 🎶 🎪 https://t.co/qwRYjvaVzE Safe to say...that was his home lol👍🏽✨ It was the address on his collar + 2 mins away, the side gate was unlocked, they had another dog the exact same breed and two dog houses lol https://t.co/9Y2S8Iar2r So we just had a bit of an experience on snap...just found a dog and then found its home👍🏽 RT @pasekandpaul: Merci, @ZacEfron. Throwing the @GreatestShowman #TrailerTrapeze to you, @kealasettle. https://t.co/El905RI8hL RT @ZacEfron: Thanks @Zendaya! @pasekandpaul, here’s the @GreatestShowman #TrailerTrapeze. Catch! https://t.co/i56Da25dZN RT @RealHughJackman: It's a #TrapezeTrailer - @GreatestShowman style. Over to you @Zendaya ! https://t.co/ljyZ2bHSR3 Got it, @RealHughJackman! @GreatestShowman #TrailerTrapeze, coming your way, @ZacEfron! https://t.co/sS0ckg1jNS Got it, thehughjackman! greatestshowman #TrailerTrapeze, coming your way, @ZacEfron! https://t.co/zwa8G0Qi6S Goodnight...sweet dreams An important thread... https://t.co/apnGrRszI6 Nothing like that fresh nail click when you get a new set💅🏽 you just wanna tap on every damn thing lol RT @coolgirledgley: First and only Vogue magazine got this for you @Zendaya https://t.co/2P3SVRnQFs RT @AcoPensal: Go get @Zendaya the APP for free on the APP Store now! You won't regret it ! 🙌🏾 😂😂 https://t.co/0yzultNOQP 😂😂 @ all of us touching each other @TomHolland1996 @LauraHarrier https://t.co/9mIb8mqhnf I got you👏🏽👏🏽👏🏽 https://t.co/4g6Cw8QCHq RT @misfitmaree: GO ENTER ZENDAYA'S CONTEST FOR A CHANCE TO WIN A BROW MAKEOVER BY HER BROW STYLIST!! 💙💙 (download the zendaya app while it… Darnell's back there like...what the hell did I get myself into😂😂😂 https://t.co/aHnTxVqwja So proud of you babe...you look😍😍😍 btw https://t.co/QSx1QXjQf4 🌼 https://t.co/IWMXaQctBu To be genuinely happy...🤗 https://t.co/2om0xDW1zA ✨Needless to say...today was a freakin incredible day... #SpidermanHomecoming https://t.co/Z56rMBPITr RT @RyanDestiny: A factual fact https://t.co/B2RUMcB9tK Don't let people make you feel like it's wrong to be in love with yourself, or think you're the shit...that's how it's supposed to be. Lil bit https://t.co/vF0F40PSvB Honestly it gets worse...I love these people man https://t.co/X6rCkOktgc One big happy family...where @TonyRevolori at? https://t.co/ENkHcpqta6 RT @peachytimes: SHE LOOKS SO GOOD OMGMFKFKSKD FIRST TIME SEEING IT IN PERSON @Zendaya https://t.co/m9sXeLyy37 RT @Almightyzendaya: @Zendaya A glo up 😍 https://t.co/9Q1rJFYjlq Oohhhh snaaaappp https://t.co/kkzij6qpZF RT @kaysey_dee: My girl @Zendaya on the cover of @voguemagazine https://t.co/H3IMSnciDE I just got hops... https://t.co/JunrVcCDeB Thank you @johnhardy these are beautiful😍 https://t.co/4rBnAQKcLM RT @xBeBrave: YESSS🌈😍🙌🏼 @Zendaya @dayabyzendaya https://t.co/SOTeElVLZC RT @eveewing: Next time you see a lemonade stand portrayed as the picturesque ideal of youthful entrepreneurship remember this image. https… RT @Bakari_Sellers: When we talk abt race this is a clear example...and the @NRA is quiet. I'm infuriated. https://t.co/mIZjISWYsO I'll just have to do a skincare routine vid on my app one of these days🤗✨ https://t.co/brHvTLPRFX ✨African black soap, rose water/ witch hazel, vitamin E oil and tea tree oil for problem spots✨ I swear🙌🏽 https://t.co/Lqh3LMb2J4 ....I can't take this...come on now... #PhilandoCastille https://t.co/za2lVXUCty Smile more. https://t.co/M8yXfTNLuQ #PhilandoCastile REST IN POWER. NO JUSTICE. NO PEACE. #BLACKLIVESMATTER Do you see that baby being escorted from the vehicle moments after??!! Does that image not haunt you? Murder is murder. That...was murder. We live in a country where black people can comply, do everything right and still be MURDERED over a brake light..in front of their child!!? If you find this in any way  acceptable...shame on you. I'm so disturbed and disgusted. https://t.co/T8fKCeoKLq RT @RealSway: + @Zendaya speaks on how Oakland molded her, landing her role in “Spiderman” movie &amp; lessons from her recent breakup https://… Casual. https://t.co/8bcDp1n8z9 Im sleep,thinking I was sleeping my ass off,putting in them hours,sleeping in gooood...why my body just gon wake up alert as hell at 8:30am https://t.co/kC6SrBAJN0 ✨✨✨ https://t.co/wiVFnfCieM 🤷🏽‍♀️ @jimmyfallon @FallonTonight https://t.co/mkhWoBXXK2 A work of art😂 https://t.co/e5OJ6vfVGK RT @FallonTonight: .@zendaya has it covered 👌 #FallonTonight https://t.co/hJJ71KmYr4 I love my angels😍 https://t.co/EwpkucA4vR This boomerang will make sense later 😂 @jimmyfallon https://t.co/sJ0diuluPI Let's goooooo😆 @jimmyfallon https://t.co/lHS6xeP1BD 🤗🤗🤗✨✨ https://t.co/9iGoV2dINR Beauty....Through the Decades https://t.co/Rr7ac8zQAZ Wow😍 https://t.co/emtlWzq6iK Exit🥀 https://t.co/80Hm1paVIA Entrance 🎀 https://t.co/tCqHSytQZ4 Interviews with @RealSway are always my favorite, that's cause OAKLAND ALWAYS IN THE HOUSE!!👌🏽👌🏽 RT @jimmyfallon: Tonight: Playing something fun w/Amy Poehler, @Zendaya is here, and music from @Imaginedragons! #FallonTonight RT @GMA: 🗣 @Zendaya IS HERE\n\n@SpiderManMovie #SpiderManHomecoming https://t.co/eLZWRvSWlh Good, now you know what \"a Zendaya\" is😂😂😂 #itsalllove https://t.co/QwmxJNM931 I'm actually nervous to see my @voguemagazine cover...in real life...like...hold it in my hands....it's like holding one of my dreams. Happy #Juneteenth y'all!! https://t.co/CmMhI3k75s RT @TheRoot: #Juneteenth isn't just an obscure black holiday. It should be a national celebration.\n\nHere is why Juneteenth is important for… 💔 https://t.co/9H2WqAKRKa RT @KaylinStrahan_: @Zendaya 's app is so resourceful. I love that she includes the rights of citizens. #staywoke #missblackillinoistalente… RT @MichaelSkolnik: SHE HAS A NAME: a 17 year old Muslim girl named, Nabra, was kidnapped and murdered after leaving her mosque on Sunday m… Wiiiiiiiiiiiiiild wild wild thoughts 💥 RT @filmWard: Superstar fistbump! #Zendaya #Barcelona #SpiderManHomecoming @zendaya https://t.co/VRePZZGCtS RT @voguemagazine: To really understand how @Zendaya got here, you have to go back to 2013. https://t.co/9SzWlzt4Xw RT @Alaaaaaandra: Zendaya really brought her nieces for her vogue shoot I thrive to be this successful 😭 https://t.co/Sf9kB8ihv7 RT @ShaunKing: I must remind you that #PhilandoCastile never even broke a law. He wasn't speeding. He was racially profiled and pulled over… RT @YaraShahidi: We won't stop fighting for peace until society stops undermining our community &amp; undervaluing our lives #PhilandoCastile #… 🍯 https://t.co/hfXGrcFxk1 Everyone deserves a hype man like @tomholland1996 #hewillsmithedus https://t.co/PwmKcGiTE8 https://t.co/liqrUvs8x4 \"The system continues to fail black people and will continue to fail you all...\" -Valerie… https://t.co/W4iH9kJmIc JULY @voguemagazine https://t.co/TqKJJyaWSS RT @74secondsMPR: \"The system continues to fail black people and will continue to fail you all,\" said Valerie Castile, Philando's mother. RT @74secondsMPR: \"If Philando can die under these circumstances ... each of you could.\" - Glenda Hatchett, attorney for Castile family rea… Good to see you again babe!!!❤️ https://t.co/3q4FrVp8j1 RT @ZendayaTheApp: Zendaya's App is free until the next month! RT @misfitmaree: zendaya ALWAYS got y'all covered. if y'all don't go download this app while it's free! https://t.co/YyISWE1Z7p When you wake up in London and are on the cover of Vogue so life is just poppin....article link in bio🤗 https://t.co/yxVPbUaBUt When you wake up in London and are on the cover of Vogue so life is just poppin....article link… https://t.co/77Nz8r7bta Not possible without you. Thank you queen, for paving the way❤️👑 https://t.co/eVlJbJgAdF ❤️❤️❤️ https://t.co/oqD1fjG0yl RT @blkgirlculture: Zenday on the cover of Vogue's July Issue || she killed it y'all 😍 https://t.co/IXIuRDGYEb Thanks my love, your support means everything😘 https://t.co/s0nhQ20R1E RT @GeeksOfColor: Zendaya for Vogue. Wow 🙌🏾🔥 https://t.co/5LSfGG7FLX Thank you princess😘👑 https://t.co/xf7viDMy1u 🤗🤗🤗🤗 https://t.co/vBPJzHZ9Rp I hate y'all😂 https://t.co/zTSDaMWTj1 Thanks babe...love you😘 https://t.co/zTsuVvrdwc Sad😂😂😂  https://t.co/5E5qSPp3Zs RT @CalvinKlein: Rise + shine: @zendaya takes flight on @voguemagazine's July cover wearing CALVIN KLEIN 205W39NYC. https://t.co/ZkEnUOhAnr 🤗thank you love! https://t.co/NATlUSRnTj I really don't have any words right now...I'm grateful, honored and a million other beautiful things...I'M ON VOGUE Y'ALL!!! https://t.co/SPHAiG2XsB RT @voguemagazine: .@zendaya shows off 100 years of fashion in under two minutes. https://t.co/HGQOyUQLyJ https://t.co/elQb5VLwO7 I really don't have any words right now...I'm grateful, honored and a million other beautiful… https://t.co/D4XmL9GiFU @spjdeypooI Molly Goddard Peter and Michelle clean up nice https://t.co/WXNZuqNrTQ I told my mutha Ri I would slay in her Manolo pumps one day, I've been preparing for this day, I would never let her down. So. https://t.co/L1Mv1bMza6 Right, cause nothing says \"sweet romance\" like dragging each other for filth on twitter.😂😂😂 https://t.co/bCfgxN8k4t Like would I really be myself without misspellings? At least you know it's really me... https://t.co/kkWZJySwkB Y'all know what the hell I mean...freind friend same shit https://t.co/uZx1R9lxDC Watch yourself, I still have more followers than you right now...tread lightly my freind...tread lightly😂😂😂 https://t.co/HdYZ3zvxUR I really can't stand him😂😂😂😂 @TomHolland1996 https://t.co/4KEifhg0QS Stealing hearts since 96' https://t.co/EviIIRQWBe 🦋 https://t.co/cAwbAbUDZd RT @sonypictures_es: ¡¡Son Tom Holland y Zendaya!! Y están presentando en España   #SpiderManHomecoming Podrás verla en cines el 28 de juli… I really been planning to use that caption for a minute now...sad😂 Top knot cause I'm top knot-ch ....bun intended 😂 https://t.co/ABBHVy5D5W Top knot cause I'm top knot-ch ....bun intended 😂 https://t.co/TZp41kclDS What's good @TomHolland1996 https://t.co/cwHxGzFvMI Noooooo😂😂😂 https://t.co/cAX6RhMBNs RT @MichaelSentino: Riley Curry is the real MVP https://t.co/v498Hor5wi Work up in Paris to some good news! FOR THE TOWN!!! LETSS GOOOOO!!! 🏆💙💛@warriors #DUBNATION RT @warriors: Larry is back in the Bay! 🏆 #DubNation https://t.co/HXo6MH1gMy 🌈🌈🌈🌈✊🏽✨ RT @MichaelSkolnik: #EqualityMarch 🏳️‍🌈 RT @AlsoPurple: Thread of #BlackPanther Black Women Badassery https://t.co/JHKMHLFcH3 Still not over this...I'm ready https://t.co/ydb6Vu0qzw Daya Denim Romper and Denim Mules available online or on my app💎 https://t.co/FhrS6icVna So cute lil mama🤗 https://t.co/Ry84XcHnUd RT @Iauraharriers: @Zendaya i read this in Beyoncé's voice from pretty hurts People always ask me what my 10 year goal is...and my answer is always, \"...to just be happy.\" RT @asapdaya: a healthy sleep pattern? i don't know her I think my mom's happy about it.. @clairemaree64 😂😂😂 https://t.co/FkrxTNydkd And we won?? Good night..goooooood night😏 Shoutout to the big Spider-Man Homecoming poster on the court....that was tight Lil sis is out here doing it right...so proud, flourish babe✨🙌🏽 @YaraShahidi You're the coolest...I wanna be like you when I grow up😩👏🏽✨ @YaraShahidi https://t.co/8hQP9e2n82 I'm late cause I been with his ass all day but...Happy birthday to my right hand man. Thank you… https://t.co/r0ZR78DPK8 Why is time moving so damn fast??? That's what's up 👊🏽👏🏽✨ @LauraHarrier https://t.co/DB4VWUmHLT ✨\"Welcome to my birthday darling!\"✨ #MarleesFirstBirthday https://t.co/LyezBOG0nc Wow I look amazing!!! Love my hair like that😂😂😂 #imoverit #thisisgettingoutofhand https://t.co/YLQ6HUB5u0 Tonight's inspiration...Josephine Baker https://t.co/nDUxThCCab Zendaya Day on..... @DisneyChannel 😘 RT @Loveonoverload: Zendaya Day has already begun with KC Undercover on @DisneyChannel! #ZenDAYa RT @Dizzyfuh: Disney is doing @Zendaya day and Sadie is hype https://t.co/uEzJkTg88w As usual...making fun of Tom😂 Happy birthday man, you're a great ass human being and deserve… https://t.co/HZJlcv0B3A ✊🏽 https://t.co/3BXnqcPJ9b @AlwaysAnthea Cause I looked good😂 Imma answer some question from y'all for an app video I'm making right now so send me and @DarnellAppling your questions noowww😘😘😘 https://t.co/vXBugy25yU Both of you shut up😂😂😂 https://t.co/GSKy0FGTqq Got my dad watching Get Out...his reactions....pure comedy😂😂 RT @nowthisnews: Watch his congresswoman take a blowtorch to Betsy DeVos' 'heartless' education budget https://t.co/hGOGlsRuPI This is actually super cute...thanks @DisneyChannel family❤️\n\nhttps://t.co/H5k54eHag0 Literally every time I say anything, my stans be like😂 https://t.co/ZYYZL67N8d Well I know what @DarnellAppling and I will be slappin on our long ass drive home from work today 😂👏🏽👏🏽 lets go! https://t.co/a0m1qKLNUC One strong little princess! #TeamAliya https://t.co/zkBM3RqRqm 7. 7. 17. https://t.co/awCfXlp57L Live footage of me right now.... https://t.co/kHSnWmL91J They just Me'd my baby girl @NormaniKordei nah.... RT @AugensteinWTOP: Richard Collins III's graduation gown draped over front row chairs at Bowie State University ceremony.  He was murdered… The world we live in...all my love to Manchester...wow. RT @MichaelSkolnik: Hug your kids tight tonight. Tight goldinsidedaddy https://t.co/YKouwph1BL I know that's right #TeamValMani let's gooooo👏🏽👏🏽👏🏽 @NormaniKordei @iamValC https://t.co/IEdmlmRF9m Thank you for having me @cirque #MJONE 🕶🌎☝🏽️ https://t.co/H8LY4PctRY 👸🏽 https://t.co/72AvHj6DpE RT @m_giacchino: Who's ready for your friendly neighborhood you-know-who?\n\n@SpiderManMovie @MarvelStudios https://t.co/iSHk4IvVgk 😏 https://t.co/7ZI23t6Tx8 Imma cry real tears with this one... https://t.co/JKLWafyPOq RT @ShaunKing: If you know Malcolm X only as an angry Black man, you don't know him. He had joy in the midst of pain, smiled often, and was… RT @norm: On this day in 2001, the movie Shrek debuted. https://t.co/8zHk4TK22d RT @pettyblackgirI: This is Surya Bonaly, the first &amp; only Olympic figure skater to land a backflip on one foot. I love black excellence. h… RT @EW: ICYMI: We've got your first look at Hugh Jackman and Michelle Williams in 'The Greatest Showman': https://t.co/c3mYij5iB0 https://t… RT @EWTimStack: Your first look at @RealHughJackman's epic holiday musical 'The Greatest Showman' w @ZacEfron &amp; @Zendaya https://t.co/gDF6b… I'm stressin over here... https://t.co/h6TdymWFgf Thanks @jetluxlife for getting me home to see my grandmas this weekend🤗 https://t.co/QTJnJdAWDb My Queen @clairemaree64 https://t.co/QWg0Ni5WEm Magic https://t.co/R4TPP3D9Tt RT @TRINArockstarr: Yoooo ! @Zendaya 👀😳😩😁😂😭😂😭 #Fuckboy 🙌🏽❤️ https://t.co/eIVhuND7F4 When you finally start putting the pieces together, and shit just ain't adding up... https://t.co/axJfG6nsny Girl...yes😂 https://t.co/htyuWEvyBy Daya Drop 2 https://t.co/FBPqONieWb Put some hot sauce on my burritoooo babaayyyy... .......I'm bout to be a little \"Bitch baby\" about this https://t.co/CPXnjzwP4j RT @pettyblackgirI: They said her smile wasn't \"authentic\" &amp; they wanted \"rawness,\" then told her to smile while receiving criticism. I'm g… RT @MichaelSkolnik: If Trump is under investigation by the FBI, he should not be allowed to appoint the next person who will lead the inves… RT @MatthewACherry: I miss the days when the biggest presidential scandal was that time Obama wore a tan suit https://t.co/dcvOd3Qwol Me yesterday😂😂😂 https://t.co/ygwrh27rbi Mood... @KadeemHardison https://t.co/QeJjqRzz3v Baby Groot and Noon are the same...😂😂😂 Awwww guyyysss🤗 https://t.co/Vy9BYYWd8R RT @spiderfitz: me buying all the Spider-man Homecoming merch the next couple of months https://t.co/FBqr7Hj5wz ✊🏽 https://t.co/kkBybOls2i RT @ArsenioHall: LOL 😂 yes. Crushed it! 🎵 📺 @Cheron_hall https://t.co/I8oG3vdJU4 Bloop. She did that. https://t.co/2r5z2SM8b7 What in the bold faced lies..... https://t.co/OZ9Y5DucfF @fatbellybella Just taking notes from the best😘🤗✨🙌🏽🙌🏽🙌🏽 RT @fatbellybella: @Zendaya why you snap like that ?\n❤️😍😍❤️❤️😍❤️😍💋💋💋💋💋💋💋💋💋💋💋💋💋💋💋💋💜💋💋💋💋💋💋💋💋💋💋💋💜💜🌈🌈 https://t.co/aWr3PB547A @potterftperseus Just roasting tom as usual lmao RT @JeffJSays: YUP! @Zendaya killed this too. I wasn’t ready. I was looking at the screen like \"That you, Erykah?!” The head wrap &gt;&gt;&gt; lol g… I'm crying😂😂😂😂 https://t.co/BrQbF7oRtn @_kyew I love this😂 I think green is my new power color 🍏 https://t.co/jXJrMXwcSf RT @IWriteAllDay_: Zendaya is starting with \"Tyrone\" and this headwrap and I'm just https://t.co/S4bGpKcK0q RT @BlkBillGates: TARAJI P HENSON SAYING \"YAAASS ZENDAYA\" JUST COMPLETED MY LIFE https://t.co/WQnAt8gxau RT @sierradenise__: My mom was really singing😂 @zendaya #LipSyncBattle https://t.co/ZIoH3oaSTU Watching Tom fuck it up like.....👏🏽👏🏽👏🏽 @tomholland40 https://t.co/i4gd6kFThy 😂😭 https://t.co/o1Id4Zlzhu He did that😂👏🏽 @TomHolland1996 https://t.co/jCt3zKLO56 RT @MTV: You are an absolute goddess, @Zendaya. #MTVAwards https://t.co/VS0TvpU2FP RT @__two4__: If y'all ain't watching @Zendaya on LipSync battle we can't be friends for the day 🤷🏾‍♀️ https://t.co/uOTJZZOPYv RT @zitties: zendaya lip syncing @fatbellybella is the greatest thing 30 more minutes! Z vs. T letsss goooooo!!! @SpikeLSB Toooooniiiiiiiiiight (24k magic opening voice) ...my Bruno debut...on MTV @spikelsb https://t.co/LgsRwzya2y Them boobies ain't mine tho g....that's how I knew it wasn't me 😂#ittybittytittycomitee Honestly just randomly stumbled across it while stalking myself on twitter and thought it was me😭😂 RT @eggsysbucky: Just over 5 hours to go before Tom and Zendaya's LIP SYNC BATTLE https://t.co/cjWnxPwui3 Please look at this little princess😩❤️ https://t.co/nE5KC5RBEo @KanayaMonet Can you post one of just her so I can repost on ig? Shessss so cute I can't🤗😩❤️ Baby girl!!!❤️❤️❤️🤗 https://t.co/zCnOCrvzLN RT @TheCut: Zendaya's new collection stays true to her sporty roots with casual, athleisure-friendly, gender-fluid pieces https://t.co/NUkp… Thanks babe!😂😘 https://t.co/4Cptfjla84 😂😂😂😂 this is great! https://t.co/s2hlhLgSfz RT @Almightyzendaya: Zendaya as Bruno Mars! A CONCEPT!!!! https://t.co/Aj78fucl4j RT @vmagazine: Get a look at the second drop of @Zendaya's clothing line, #DayaByZendaya: https://t.co/UyTBEfVJky https://t.co/0cZjHBOorZ @Bfranklins  https://t.co/5CKJ4VLoei Bruno Mars...or me??? The world may never know. See y'all Sunday 😏✨ https://t.co/bawGVcUa7I Bruno Mars.....or me???? The world may never know. See you Sunday @spikelsb @brunomars https://t.co/5o2LPX3j0S RT @MTV: Is that @BrunoMars or @Zendaya?! Don't miss a new episode of #LipSyncBattle before the @MTVAwards this Sunday at 7:30p EST! https:… RT @voguemagazine: Here is your first look at Daya by @Zendaya's latest collection. https://t.co/ubLvbjH7Dx \"Black boys deserve to grow up too.\" https://t.co/e5vW87ewKh Love those kids😂😂😂 @LauraHarrier @TomHolland1996 https://t.co/89JjTQieGF Word for word.... https://t.co/lpMo005YIP Y'all.....this is not a drill....Ri to the muthafuckin Ri😩😍 Too quick😂 https://t.co/luO3S7ZKkq Step two...give em a nasty over the shoulder shot while you try to figure out how to get in the… https://t.co/fr75CbMRB8 ....my heart. https://t.co/mR0QXIo7lA First step...get in the car https://t.co/WMiA7tH2i6 .@deray So glad this happened❤️ https://t.co/U1loWF7pup D&amp;G https://t.co/n4xrKeC0HK RT @Complex: Breathtaking, @Zendaya 💖💖 #metgala https://t.co/9ORcRFRXeu RT @AlejandrhoAcost: @Zendaya #Andino #DolceandGabbana #Colombia #Bogota 😍 https://t.co/WlUi1V1ySv © https://t.co/nlEmehGveM RT @xBeBrave: \"Imma just marry myself cause I'm the only one who can give me what I need\"\n\nyes girl @Zendaya https://t.co/HyqvZQqf1G When you and your assistant don't fuck with nobody....rbf https://t.co/74qu2irDyK Hi mom😂 https://t.co/SKd44UXcPI In order to tweet I have to stop my live stream on my app, so imma tweet that I'm live streaming on my app...and go back to live streaming😂 RT @BraddJaffy: Andrew Jackson was a slaveholding plantation owner. He also died 16 years before the Civil War began. This Trump answer is… Giving them legggggssss!!!!!! @LoganLaurice 😍😍😍 https://t.co/HOfjuk8j53 Ugh yesss....I'm speechless 😩✨ @itsgabrielleu https://t.co/VEK78A35UN 😍👏🏽👏🏽👏🏽 https://t.co/4tzzWqaT92 Night✨ Imma need all y'all aspiring models out there not to be so damn gawwwgeous lol😍👏🏽👏🏽 😏🤔 https://t.co/GmZSKXMfFl Just put this up on my APP, @allanface shows you how he did my makeup for my DXZ shoot! @covergirl glossy as hell, just like I like it ✨✨✨ https://t.co/THppqVHaiU Just put this up on my APP, @allanface shows you how he did my makeup for my DXZ campaign shoot!… https://t.co/XG62qHzOD1 RT @MichelleObama: Always inspired by your powerful contributions @Beyonce. You are a role model for us all. Thank you for investing in our… Available online N❤️W @dayabyzendaya https://t.co/iB71cGupGC Available online N❤️W  @dayabyzendaya https://t.co/ySO1fDoJ2k 🤗❤️ https://t.co/M215FGNcFq @AdrienneBailon 😍😍😍😍😩😩😩 https://t.co/St5XzPTPzZ When my agent and I show up in the same shirt👌🏽 https://t.co/FugAAOQ8O8 Yooooo!!!! I'm convinced this is @TomHolland1996 😂😂👏🏽👏🏽👏🏽 https://t.co/EP3738nufu Shut up😂 https://t.co/z3QftsZ0MA Meetings at Disney be like... https://t.co/3MRTcBkqgM #1YearOfLemonade https://t.co/CWzjkga8gw Bout to put you on to some good music @prestosings https://t.co/TKhlSXdANl Let me stop being messy😂 😍😍😍 thanks baby https://t.co/a1qjtiD8ZO Us against the world son 😂 https://t.co/72P0Ots7oO Lip gloss appreciation post...I am posting this for no other reason than the fact that my lip… https://t.co/nsIpxRvMGJ @GirIHackz Still got it😏 https://t.co/913BZsLHdP RT @Zendella_magic: This is so beautiful 😍👏🏿@dayabyzendaya https://t.co/ZPoZb0iqIk RT @Jiilliiana: Received so many compliments when I wore this dress ! lead someone to the website !Love 😍❤️ https://t.co/uULUNBfft6 @dayaby… RT @Travon: Serena Williams won a grand slam while she was pregnant so every man should probably shut up about everything forever. 👏🏽👏🏽✊🏽✊🏽✊🏽 https://t.co/v4umwIWtos Aight back to work😂✌🏽️ But hey...I can't complain🤗 My immune system is a mess right now and my schedule could care less like...can a girl heal for a moment😂😭 Rhymes with Ronald Dump.... https://t.co/KiEXjXOh8u When someone you don't like starts liking something that you just started liking, so now you can't like it anymore...hate that. 😂😂😂 https://t.co/q8YW9DiyeZ I caaaannnttt!!!😭 -LH❤️ https://t.co/he6JDh9kpM @LauraHarrier And so it begins😑😂 @LauraHarrier how many times you bet this is bout to happen to us? Lmao https://t.co/qBLUsCVAgc Mom wanted a little more lol💜💗💙 #immaprofessionalatthispoint @clairemaree64 https://t.co/GamlUmPtMn 🏆 https://t.co/Q34vwA0Nfe *s Thanks @verizon for letting me be apart of making that happen!! My parent are teachers,I've seen the difference it makes and the eyes it opens,#weneedmore young people to have access to that experience(3) Every young person deserves a quality education, deserves every opportunity as any other young person regardless of their school district(2) #weneedmore young people to have access to hands on learning with technology.....(1) https://t.co/ORUzVuVXAU Every young person deserves a quality education, deserves access to hands on learning with… https://t.co/cM66B1Z6XI RT @Essence: #woke100 @zendaya is part of a new generation of young talents who aren’t afraid to speak out against inequality https://t.co/… RT @deray: what is the world coming to? https://t.co/POqirQeWtP RT @LaceyCrisp: BREAKING: a man in Cleveland has shot at least one person live on Facebook and is threatening to kill others Cleveland 19 N… Heeelllllll naw lmao https://t.co/oFYjAxk075 Actually😂👏🏽👏🏽 https://t.co/PVI8UQc9iS Welp..... https://t.co/mhAqmXmlGR RT @ShaunKing: This man has been an officer for 20 years.\n\nIf you think THIS is his first time being horrendously brutal, you are an idiot.… Taking my little niece to the one and only @ShaiAmiel 😍 go check my snap!!! Just did a light color and style on my mommy...I mean....I could open up a salon at this point💗💜 @clairemaree64 https://t.co/4cELu9ZyoV 😂🤗😘 https://t.co/UMKHOVhvQa RT @flawlessmarieee: I swear @Zendaya gives zero fucks  about what she's wearing😂 she even got them slippers too 💀😂 https://t.co/MaXtMrZaUM RT @kimjowonn: I live for Zendaya livestreams https://t.co/DDt9hD8hf7 @Kamil_McFadden is teaching me about the play station😂😂 Target shopping live on my app😂 RT @CNNSitRoom: BREAKING: US drops largest non-nuclear bomb in Afghanistan, four US military officials say https://t.co/wa0FkxBQ7E https://… RT @deray: Nope. https://t.co/vLsrv2qbzL RT @xowenm: Say her name...she's Sheila Abdus-Salaam &amp; she was INSTRUMENTAL in helping LGBT parents gain the same parenting rights as biolo… You want a good laugh...go watch @DarnellAppling getting his armpit waxed on snap....mind you...he's very very ticklish😂😂😂 snap: zendaya_96 That's how you do it when you you don't know HOW to play...but still want to play. Currently forcing @Kamil_McFadden to play Hitman so I can watch and strategize😂😂 https://t.co/hiDrfCOy3x Lil mama got the pose down and everything #youngqueen #representationisimportant https://t.co/9ACGDqjtIC You know what...imma go with this theory😂👏🏽 https://t.co/HkMFR4HFNY But really tho... https://t.co/VMzCitPnch RT @Travon: Rest well Charlie Murphy. Thanks for one of the greatest comedy sketches in the history of time and space. https://t.co/KHz1MqG… RT @CushKobain: *Charlie Murphy walks into heaven* https://t.co/CAGt4C45ER Rest In Peace to the legend that is Charlie Murphy, thank you for always bringing us joy and laughter🙏🏽🙌🏽 https://t.co/TZ53R1FSJs Muaaahh💋 #covergirl https://t.co/GpLlh6ndha ....... https://t.co/jGeuy7ks80 Auntie Daya in full effect. https://t.co/EnY5SoUdEL RT @mattcompton: Donald Trump sold \"Hillary for Prison\" buttons in his official campaign shop. https://t.co/alNt5fjTuu Me actively trying to stay positive🤗 https://t.co/OxKoFOwt7L Me actively trying to stay positive🤗 https://t.co/BkXOZ89mA0 Whether you agree or disagree, sometimes it's simply the dialogue that's necessary. National sibling (plus dad) day 🤓🤓🤓😀🤓🤓 https://t.co/XT30BmWOxv RT @MichaelSkolnik: HE HAS A NAME: Jonathan Martinez, an 8 year old boy, who was killed while studying at North Park Elementary School in S… 🌪@dayabyzendaya https://t.co/mnhwptdZL7 🌎❤️ Every. Single. Day. What the hell??? School is supposed to be a safe place for children....we need gun control, NOW. https://t.co/NWKnuLh5rQ RT @DavidYankovich: The White House should just come out and say; \"This country cannot feed our veterans or elderly because Trump has 3 res… I am appalled and absolutely disgusted....this is unacceptable. https://t.co/ZO7X2Cbdve RT @juliamacfarlane: A passenger on that @United flight who watched as an Asian doctor was violently removed from his seat due to overbooki… Finally catching up on scandal😩🙌🏽 Noony King😂 https://t.co/gBN6vpZWXo Our relationship in a clip😂 full video on my app! #IMAGROWNASSWOMAN https://t.co/U4q0vOQyTH Always wear your seatbelt kids. https://t.co/nyG5BG4c2Y RT @NiaSioux: 🖤🖤🖤 https://t.co/cN3fjWImav RT @HeyKunz: Dolce &amp; Zendaya https://t.co/kk10anVrO5 RT @yalljust_myfans: The fact that kids all around the world didn't understand the significance of this scene makes me sad😭 https://t.co/An… RT @MichaelSkolnik: Trump will bomb Syria, but won't the let the children who are being bombed into the United States. Now I hope you all have a beautiful day and focus on more important shit, like the state of our country or just humanity in general🤗 Y'all do not have to use my name to drag other people down, that shit is always wack and you know it. RT @iselyfe: Honored to be featured on @zendaya app #zendayatheapp. Download the app now and watch the… https://t.co/kU8Qc9aV1s RT @MichaelSkolnik: Hard to watch. But, damn, I had to do it, to bear witness to the horrors of chemical warfare. The suffering of these pe… RT @AlwaysAnthea: Checkout \"Artist Spotlight: Ise Lyfe \" on #ZendayaTheApp - my favourite piece of content on this app https://t.co/a4jD7Vw… Introducing someone who is like a big brother to me, a mentor, a strong guide in my life and… https://t.co/iHxCYoMeHN DxZ SPRING LINE FIRST ROLL OUT AVAILABLE ONLINE OR ON MY APP NOW🌹❤️ @dayabyzendaya https://t.co/Zmd0K1GARr DxZ SPRING LINE FIRST ROLL OUT AVAILABLE ONLINE OR ON MY APP NOW🌹❤️ https://t.co/c2I6QCxV9W To the most phenomenal woman, happy birthday Dr. Maya Angelou, you are greatly missed. https://t.co/EOUO5Gg4da To the most phenomenal woman, happy birthday Dr. Maya Angelou, you are greatly missed. https://t.co/7c79yDFUZk Forreal, if one more person ask me how I get my hair like this😂😂😂 and no you can't touch it✋🏽 https://t.co/yYotEr6Tuh RT @meagnacarta: This is the picuture I have been waiting on for like 3 years. COME ON NATURAL. https://t.co/HF8AYpsciB Yooooo😂😂 mood til 7-7-17 https://t.co/QcAie1sME4 RT @NSBE: Zendaya Shows Students Incredible STEM Career Opportunities In The Recording Studio https://t.co/CzsttsEfip Tonight was crazy😂😂😂 Donald Trump is president.... wish I could say April fools but... https://t.co/fUYpcbHfVm 🤗😍 https://t.co/O0WyxA4ytH RT @HuffPostEnt: .@Zendaya works to help students build careers in tech and science https://t.co/t8o6RaUBb0 https://t.co/uSYgBNwt9K Hahahahah but really tho😂😭😭 https://t.co/964EQe6p3K RT @nowthisnews: Is this what making America great looks like? https://t.co/h1bOk40cbS 🙌🏽🙌🏽🙌🏽😻 https://t.co/Keqvxi3qj6 Always babe, thanks https://t.co/l7IHk0Ed1S RT @CinemaCon: .@RealHughJackman talks a flim seven years in the making @greatestshowman and presents a sneak peak #CinemaCon @KayCountryman wasssaaaaappp https://t.co/Axzd4Doz11 RT @Variety: .@RealHughJackman debuts fantastical \"The Greatest Showman\" footage at #CinemaCon https://t.co/VFiX0ShLiO https://t.co/B7Gr1kE… RT @ACLU_NC: This unacceptable proposal would keep anti-LGBT provisions of #HB2 in place for years. #RepealHB2 https://t.co/e5i1Uqzszy RT @HRC: We'll explore every legal option to strike down laws motivated by hatred toward LGBTQ &amp; trans ppl in particular. #HB2 proposal's a… RT @mdyttoo: When you trying to find out who Zendaya's makeup artist is and then you discover it's actually her https://t.co/bc8L2E25tt RT @aubreypage_: zendaya wearing a sylvia plath tee in this spider-man trailer is Truly Iconic™ Snapped : zendaya_96 https://t.co/QiUh8Vdvps 😍😍😘 https://t.co/0ytgjoWqQZ RT @dejacarter_: Pardon me🙎🏽 https://t.co/RcTm8jTo77 REPOST REPOST REPOST!!!! @yarashahidi https://t.co/h4aztOys24 RT @MaxineWaters: I am a strong black woman.  I cannot be intimidated, and I'm not going anywhere. #BlackWomenAtWork Awww shiiiittt😂😬 https://t.co/3eRbR4yHyE RT @JoyAnnReid: These basic, rabid attacks are meant to degrade black women by implying they aren't even women. It's the lowest of the low. RT @JoyAnnReid: Not only was it racist, crude and disrespectful of a sitting congresswoman, it was also familiar: in right wing trolling of… RT @lovely_apryl: Listen, Bill O'Reilly. If we're talkin' about hair...🤔 #imjustsayin https://t.co/BAJAt0KuZn This is so disrespectful https://t.co/5ixfE16HNS RT @Marvel: Does the suit make the man? Watch the all-new #SpiderManHomecoming trailer now and make sure to see it in theaters July 7. http… RT @RobertDowneyJr: Step into my trailer... #SpiderManHomecoming https://t.co/BQ05FGrq0h RT @AlwaysAnthea: Lmao at this end message https://t.co/Ikv1m7qQDW RT @ChemyBeber: @Zendaya Another one on italian magazines. Absolutely stunning girl @dolcegabbana #DGCapri https://t.co/nvCJewB27l @NFL nah Me as a child https://t.co/lSp1GWmdTW Crying😭😭 https://t.co/X5YOQGm451 😂👏🏽 https://t.co/NC6PurksXd RT @sailedsouls: I've always thought zendaya got her makeup done but finding out she does her own makeup for award shows has me mind blown Time is going too fast... When a drawing got you looking like a campaign... ponyy_boyy @dolcegabbana https://t.co/CRoaDU9NR7 RT @pettyblackgirI: He stalked &amp; stabbed a man bc he was black, revealed plans for a massacre to kill more black men &amp; y'all still won't ca… RT @BlackMajiik: Bloop. https://t.co/peF2pyC05F RT @deray: Trafficking is often portrayed as a \"foreign\" issue that does not happen \"here\" but the reality of domestic trafficking must be… RT @deray: Some of the missing teens did run away from home &amp; have returned. This does not mean that others have not been subject to traffi… Header? 👍🏽 or 👎🏽 You betta😍😍😍 https://t.co/kT8XC6V28w RT @ElleCanada: We love Zendaya's take on the cocktail dress https://t.co/1nLkVDR8P8 https://t.co/qt214l08C7 This is fly.... #SpidermanHomecoming https://t.co/m4UQRGZBEC This is awesome👏🏽👏🏽 https://t.co/CxvPCSl7Am RT @BraddJaffy: Watch this\n\nJohn Lewis is shouting on the House floor: I'll “fight every day…I oppose this bill with every breath and every… ✊🏽✊🏽✊🏽 https://t.co/ufqzptW1Li RT @SpiderManMovie: Homework can wait. The city can’t. #SpiderManHomecoming https://t.co/Po7VJaCfWg RT @EBONYMag: Black children account for 33% of total missing children cases, a grossly underreported issue: https://t.co/GhNXcj3vI2 #missi… FIND OUR GIRLS https://t.co/ZIaBhJMv16 RT @peoplepower: Eliminating essential health benefits like maternity care would devastate our most vulnerable communities. Call in, and he… RT @NYDailyNews: .@SHAUNKING: It's no accident that we hear so little about missing black girls in this country https://t.co/yYJYDHY3UH #Mi… RT @ava: For all who are not aware and for all who care... https://t.co/zXjQhQCfbC D&amp;G https://t.co/5N9xhYM3x9 RT @PINK_QueenA: We want to thank you so much! This meant so much to us and we thank you @Zendaya @dayabyzendaya https://t.co/Fde0zPfHMi Let us not forget....reposting this from teenvogue #justiceforflint https://t.co/8Dwk67IFdj RT @jwxtins: @Zendaya I found you here in brazil girl hahaha @dolcegabbana https://t.co/nnHH9AlgKT He's literally laying on my face...my son #nationalpuppyday https://t.co/niBe8C95uv RT @Big_Boi_Rique: @Zendaya me- \"hey, is that zendaya?\"  \n Girlfriend -\"yeah\"\nMe-\"I love zendaya\" https://t.co/ObpUatW9dh RT @Almightyzendaya: Y'all is this really happening??? 😭😭😭 @Zendaya @dayabyzendaya https://t.co/olSAMxZkWp 😂😂😂😂 https://t.co/rNA0i1iI8r RT @LOLAW0LF: I plan on buying at least one item from every collection zendaya drops but I'm tryna figure out where I'm gonna get all this… Ain't this the truth @DarnellAppling you can't hide from me!!!👀 https://t.co/FxEUSqpZDe RT @Zendayaiisland: I can't with you @Zendaya https://t.co/YUsBcXCWEK Mood https://t.co/UCPQO06PWH I'm also doing the most in snap...just so you know SWIPE TO WATCH ME DO THE MOST FOR NO REASON. https://t.co/8DraQguPnm RT @TheWrap: 30 Under 30: Young Actors and Actresses Who Are Taking Over Hollywood (Photos) https://t.co/z6i54TtReY https://t.co/BXeV0YXKd4 Thank you @UniStudios for giving my little niece the best Harry Potter birthday ever!! #WizardingWorldHollywood https://t.co/d1NMpDwR3c Thank you @UniStudios for giving my little niece the best Harry Potter birthday ever! Wish I… https://t.co/m38M6LVcH9 So many captions for this...go ahead https://t.co/Ikkntl4A7c RT @paolamendoza: New Yorkers came together on a beautiful crisp day to stand together and say #NoBan! Props to Mikhael Tara Garver! @lsars… @PINK_QueenA I'll dm you Let's try and make this happen babe!! https://t.co/OrfzUCMtSa 😍😍😍😍 https://t.co/hdZIr2j2dJ RT @asapdaya: men: you wear so much makeup because you're insecure\nme, an intellectual: https://t.co/A4vrjdJXf3 RT @celinedion: Qui est votre icône mode? / Who’s your style icon? @THR #LawRoach #Fashion #Styliste #CélineDion #THRSyliste - TC https://t… I'm taking my little sick ass to bed lmao See this why you 007 😂😂 https://t.co/L1TRQCmoZW Me: Ugh why am I sick, this is ridiculous! \nMy immune system: https://t.co/okzuoEgDvO RT @1multikentish: Celine Dion and Zendaya together in a photoshoot.. I am speechless https://t.co/wZwnhHPsXJ I can't...why did @DarnellAppling say I looked like him this morning😂😂 https://t.co/1VWlJu7B9z @_Riiiahhh 😂😂😂 Work....he get on my nerves sometimes😂 https://t.co/LTO7A5dHB4 Dear @luxurylaw , I cannot describe the immense feeling of pride I have right now. Law...you… https://t.co/gM5nhtZLp4 RT @THR: #THRStylists cover 2/5: @CelineDion, @Zendaya and stylist @LUXURYLAW https://t.co/2Ryia1lNph https://t.co/OEd6yTwqFJ A trio.... https://t.co/cB00WC4sG8 Thank you for this...give that angel a big hug for me😘😘😘 https://t.co/SwAu4xoZAo RT @maddow: BREAKING: We've got Trump tax returns. Tonight, 9pm ET. MSNBC.\n\n(Seriously). RT @MichaelSkolnik: #TrumpTaxReturns Luh you more mama! Always here...can't wait to watch you🤗😍😘 https://t.co/iZfK9Eycv0 RT @MTVNews: ✨ @Zendaya just hit the red carpet in a gorgeous $38 (!!!) dress ✨ https://t.co/jfdUMJmpJS A look https://t.co/ERqFL1p5HK RT @Allure_magazine: .@Zendaya wore her *own* $38 dress to the #KidsChoiceAwards: https://t.co/OTMbiOVKEu https://t.co/siO33q3TTi RT @voguemagazine: Leave it to @Zendaya to bring a little elegance to the orange carpet: https://t.co/uubjVCLenX RT @HPLifestyle: Zendaya's latest red carpet dress only cost $38 https://t.co/z4t8oJLD3Z https://t.co/ycFxymkC2a Walking past  ____insert name____ like. https://t.co/dWkwlcYuNO RT @_maiyah_: Remember this video every time somebody says Sandra Bland was being combative for stating her rights. https://t.co/ooxeGSIHop They give me purpose. https://t.co/jiOHptHgeX When your little niece joins you for her first orange carpet🤗..the other little one was too shy,… https://t.co/iZxwebM6DA Thanks baby girl...keep shining😘 https://t.co/fCBVAdYEqi @dayabyzendaya copper slip coming soon https://t.co/VdW0DDmUEO 🤗💋 https://t.co/ttoZ0thzwV RT @dayabyzendaya: More Satin Dresses this spring 😏 #DayabyZendaya #AllDaya https://t.co/u5sTtWUoWG KCA's @dayabyzendaya https://t.co/5DIvkK2l5f Thanks love!❤️❤️❤️ https://t.co/yzjOMTvG2Z RT @Prozoldier: @Zendaya they played formation for you, the kcas know wassup Thank you babies...I appreciate you all so much #KCAs 😘😘😘 https://t.co/cwSsSWJ9ep @KadeemHardison I'm down RT @hi_im_Quee: Feminist af 💋 @Zendaya \n#feminist https://t.co/SwbUYiNvTU ✊🏽 https://t.co/tpBXSF4WxG I love watching people play video games in story mode...that's my shit 😂😂😂😂 I'm done https://t.co/WDTWzRscFm Thank you love... https://t.co/M5rdowFjcd Thanks for coming baby girl🤗 https://t.co/3b2vfiGOqw RT @minerley: First look at an incredible program we're launching with @Zendaya and @verizon. #WeNeedMore https://t.co/3xWb8FhVz1 via @bill… RT @BGainesRMMS: These 5 girls are headed to @CapitolRecords to learn about music #engineering with Zendaya. #GirlsInSTEM @VZFoundation #we… Love you baby girl...continue to shine so bright😘🤗 https://t.co/cAVyKS1IXk RT @Phil_Lewis_: A successful woman https://t.co/z3mlH3z5pO Self explanatory... #internationalwomensday https://t.co/Qm7OcbPqql HAPPY INTERNATIONAL WOMENS DAY FROM KC UNDERCOVER!!!✊🏻❤️✊🏿❤️✊🏽 https://t.co/G47qkYVVlF RT @Home_Halfway: My insulin, with no insurance coverage, would cost me about $3,000 a month. $36,000 a year. An iPhone 7 is $650. https://… PYT https://t.co/XNxjBhH1dM RT @notdrawn2scale: cash me blinding basic people @ prom @Zendaya https://t.co/NlGXZM5HuU RT @ava: Their dream? Not be kidnapped, tortured, raped, forced to mate, work for another's gain, torn from family + culture. https://t.co/… RT @WhoopiGoldberg: Ben Carson..please read or watch Roots, most immigrants come here VOLUNTARILY,cant't really say the same about the slav… 🤗😘 https://t.co/MiI0xAfNrs Trying to figure out a routine for your skin that really works for you is so important.. I'm super into skincare right now... Who did I think I was? 😂😂😂 A look. Grandmas heels and hat. https://t.co/jdXeVB8iAo RT @bombblackgirlss: *your jam randomly comes on*\n\nFriend 1: Don't start..\nMe:  https://t.co/zPyXsnaUb2 😂😂😂😭😭😭this is a real ass tweet lmao https://t.co/iW4obdsBoa The brown bread at Cheesecake Factory...I could live off that shit😩😍 RT @dimpsare_beauty: I can smell this box . https://t.co/VVuHJykCpA RT @iamSarina_: My daughter and her celebrity look-a-like 😍 @Zendaya https://t.co/cEQ3mxHqBz Just gonna post this again cause today.....is the day.... #Logan @RealHughJackman https://t.co/6FkbzzmhwU @DesiredNloved neither did I https://t.co/K7XR1QMxGs RT @IAmNotYourNegro: We agree with @Zendaya. Catch #IAmNotYourNegro in theaters today! https://t.co/jnYjklbiNv I was 16...I look the same....😑😂 https://t.co/rES9hVTOoo I miss Oakland sometimes...randomly OSA af....hella reminds me of something that would happen at my old middle school👏🏽👏🏽👏🏽 https://t.co/ZgxG8FrHgV RT @AlwaysAnthea: Since its #ParisFashionWeek just wanted remind you of these looks from last year https://t.co/04VC9QzPdY I'm ready😍👏🏽👏🏽👏🏽 https://t.co/f0LBDE0vkT On this episode of \"How bougie can you be?\"😂 Noon's first jet ride jetluxlife https://t.co/HGrOh5wPWa Happy birthday beautiful aka 007😘🤗😂 https://t.co/Ev09E2impc Hey twin🤗😘 https://t.co/5efPF4nTRb With all these mix ups in result announcements we've been having recently....how bout that election? I genuinely love this photo... @AshDSanders @_trevante_ https://t.co/5adX6ro02v A campaign... https://t.co/oBDr2yZJqT RT @vulture: With MOONLIGHT's screenplay win, this Oscar telecast just set a record: It's the first ever to feature more than 3 black winne… Look at this woman😍😩 https://t.co/pa1eOSBhmB BLACK. EXCELLENCE. EVERYWHERE. Guys😭👏🏽 @benjpasek @justinpaulmusic https://t.co/JfLDERzFQ8 RT @TheAcademy: And the Oscar goes to… https://t.co/i846CnSDAi RT @TheAcademy: And the Oscar goes to… https://t.co/1fIRibTqmF Goodnight from us... https://t.co/GLkYvmhHCH RT @Refinery29: Zendaya's new song with Prince Royce has a twist we love: \n\nhttps://t.co/ZffCblTCq6 https://t.co/wQboy9gzuP Every time I look on twitter now I just expect to see some crazy stuff about what trump fucked up today... Bts with the one and only @princeroyce on my app now! Thanks for helping a playa out with the… https://t.co/RVOd5kpb7m Bts working with the one and only @PrinceRoyce so glad to be apart of this...and thanks for helping a playa out with the spanish😏👊🏽 #X https://t.co/eZTpfLEmFf RT @NylonMag: Talking to @Zendaya about her journey as an activist and the #WeNeedMore project #BHM https://t.co/QrZXdH5O3q https://t.co/Wb… @nylonmag https://t.co/3Gnd4Hrj8v RT @sydegee: talked to @Zendaya about why #weneedmore kids interested in STEM for day 24 of #UNAPOLOGETIC! (📸 by @Ricky_Michiels) https://t… Not hola sis😂 https://t.co/dfLBdcukAo I really appreciate this...it means more than you know ❤️😘 https://t.co/hiNhLgJlPl 🤗 https://t.co/ym9WK8hzHi RT @andyvega07: Y'ALL SLEEPING ON ZENDAYA 🔥🔥🔥 https://t.co/77aOwdpy2u RT @valxvee: didn't realize that zendaya singing in spanish would change my entire life wow RT @JxsmineMoreno: ZENDAYA SINGING IN SPANISH CAN CURE ANYTHING AND EVERYTHING IM SHOOK SHE REALLY DID THAT RT @HerNameeIsRocio: @Zendaya your Spanish is 🔥🔥🔥🔥 #PrinceRoyceFIVE Breaks my heart...THIS. IS. OUR. REALITY. https://t.co/95SgEw3Zes The man, the myth, the legend.... thehughjackman https://t.co/GTmjep57qC We meant @ me on twitter sowwy😂😂😂 https://t.co/Nwtxi9Pm4L RT @ChemyBeber: @Zendaya YAS GIRL YOU'RE ON THE ITALIAN MAGAZINES @dolcegabbana https://t.co/4xqvfFNsrH RT @ACLU: We want trans students across the country and their parents to know the law is on your side and we at the ACLU won't stop fightin… RT @janetmock: I was a trans student. I know how vital it is to feel safe, welcomed &amp; affirmed. Equal access enabled me to attend, stay &amp; t… RT @MichaelSkolnik: Protect trans kids. \n\nStop the bullshit. What carefree looks like https://t.co/g2yKHjEeTb The robot part😂😂😂😂✋🏽 https://t.co/uZDy7ZAsOF If this ain't me😂😂😂 https://t.co/cg7W6HYuE1 @KelleyBakerBrow https://t.co/o2SSU7hbiY RT @dkHaze: #IFirstNoticedIWasOldWhen they didn't recognize the dude from A Different World until I told them it's Zendaya's TV dad https:/… What is this?????😍😍😍 @HaagenDazs_US https://t.co/MwyfJcSKNz When your favorite scent in the world is seasonal so you gotta buy them all... @WilliamsSonoma https://t.co/qXgVhIrAF5 RT @MichaelSkolnik: The energy at the #IAmAMuslimToo rally is absolutely beautiful. The unity among the people is powerful and we will be r… RT @MuslimIQ: Powerful Nike commercial featuring athletes who are exclusively Muslim women. https://t.co/suvzMi12P7 RT @deray: How many times did you talk to Russia?\n\nTrump/Flynn: https://t.co/HatiiLFX5F 👏🏽👏🏽👏🏽👏🏽 https://t.co/4XEkI257Ll @nypost https://t.co/zCSYXIosLY RT @VanityFair: .@Zendaya on viral tweets, having a voice, and using social media for good. https://t.co/IC5DqNbuBi Woke year-round vol. 2 celebrating these brilliant and talented people. On my app now. #BlackHistoryMonth https://t.co/iicY7S6rdZ Why is he talking about himself in third person...I don't get it. https://t.co/sXWURTdCak Mood https://t.co/1BAycfTfpB Same https://t.co/Ub5kto0f6E RT @voguemagazine: .@zendaya did her mom's makeup for Valentine's Day. https://t.co/cZ8eBfV0WX Flowers from auntie daya to my little princesses... https://t.co/s28InowGqw 😂😂😂😂😂 https://t.co/SltDIVORsk Who needs a valentine when you feelin yourself this much... https://t.co/FpvycyOjQh Just posted a photo https://t.co/cVJS5uXUGC I did my Mommy's makeup...on my app now!! Happy Valentines day💋💋💋 @clairemaree64 https://t.co/qIJcHQoO4i RT @RollingStone: Chance the Rapper is the first black hip-hop artist to win #GRAMMYs Best New Artist since Lauryn Hill in 1999 Need I say more? beyonce https://t.co/7PJsx6IaqW I'm not even by a tv and I'm crying 🙌🏽😩 https://t.co/UAcN6UM8nQ LETS GOOOOO!!!! Congrats man, you deserve it all!!!👊🏽🙌🏽👏🏽👏🏽👏🏽 https://t.co/uWpYsl6Blr 👏🏽👏🏽👏🏽😂 https://t.co/URRzsCEd4q Always, keep being amazing😘😘😘 https://t.co/E2AfNzVmYJ Naw you bomb🤗 https://t.co/hPnxZ17sbY Woke year-round, celebrating black excellence on my app #BlackHistoryMonth @IssaRae @donaldglover @ElaineWelteroth https://t.co/OUC3u7emPb All I do is steal my own pics from snap https://t.co/bJ7GoXUgsD That's the idea😂 https://t.co/t4fF7yfxuk For those who wanted to know...I copped these earring on the streets of Harlem...$5 https://t.co/3eooNu404R That one time my dad tried to get in a cold ass lake and was immediately like \"oh helllllll… https://t.co/CLCxlNDC6B RT @OG_EC: Get you a girl that can do both 😍🖤 @Zendaya https://t.co/yS5E6s4UKe Anytime gorgeous girl🤗 https://t.co/rT4O7fUlQ8 You bettaaa 😍🤗 @dayabyzendaya https://t.co/JydkxoWrSd RT @Sethrogen: @Zendaya 🔥 For everyone that keeps pressing me for the face products I use..it's up on my app now😏😘💁🏽 It doesn't matter how many times I watch Superbad...that's shit will always be hilarious to me😂😭 RT @VanityFair: See Vanity Fair’s Vanities stars, from Aja Naomi King to Zendaya https://t.co/pKJyDEVPou https://t.co/86ZquUU4Sb She would have been 30...still we SAY HER NAME. #SandraBland https://t.co/PcWTkHclET RT @womensmarch: We remember Sandra Bland today, on what would have been her 30th birthday, for her bravery and her voice. #SayHerName http… RT @VanityFair: Of course @Zendaya's ultimate goal is to be like @Oprah https://t.co/nqh218Kkxs He's literally holding my life in his hands😂😂😂 https://t.co/16ernyKuel Sing it little man👏🏽👏🏽 https://t.co/0Ez407MPGq RT @BraddJaffy: Trump just named 9/11, Boston, Orlando and San Bernardino to justify his travel ban. None of those attackers were from coun… RT @AlwaysAnthea: I hit a wall in the library and that new vid on Z's app was exactly the short break I needed. 😍 https://t.co/5FD0vD9nn3 I highly highly recommend seeing this... iamnotyournegro https://t.co/3tkpPYTG2j I took his, he took mine lmao https://t.co/JuhEqirS5k RT @ava: \"A civilization isn't destroyed by wicked people. It is not necessary that people be wicked. Only that they be spineless.\" - James… RT @sonsandbros: On his 22nd birthday, we remember #TrayvonMartin. Sending our love and prayers to Ms. @SybrinaFulton #BlackLivesMatter htt… Thanks babies😘 https://t.co/KIM8SoWgPq Simple black slip @dayabyzendaya https://t.co/ljhOUK9wAq RT @africanarchives: First Black girl to attend an all white school in the US—Dorothy Counts—being jeered and taunted by her white peers. h… RT @spideyxo: I love being on Zendaya's App, watching her videos, reading her texts and listening to her radio. It's just so relaxing. Get em mama😂👏🏽👏🏽👏🏽 https://t.co/6ldNLcNvSw vfvanities sabrinaelahi https://t.co/g94BJLELJj Thank you for always being a great source of light an knowledge...appreciate you brother🙏🏽 https://t.co/O2NrXEr7FI So cute😍😍😍 https://t.co/HsCzjPRIl8 Because people will always try to take from you...be thorough about your business. Best piece of advice for this industry,act as though every contract you sign you're signing your life away. Pay attention to the small print Brows and lips vfvanities https://t.co/giKnYO8Ohr 😍 https://t.co/dfKbZZbqhw Wow....this is a mess https://t.co/vRhrd6G6Al 😘🤗 https://t.co/htGd30SIbp RT @liyahXmaree: ETHEREAL 👑😍 https://t.co/khEER3RC8p Cracking my damn self up on snap😂 @bverhoev @KelleyBakerBrow RT @MikeAdamOnAir: .@Zendaya's eyebrows have been killin' the game since Sept. 1, 1996. https://t.co/tjIZshNuyx 💁🏽🤗 https://t.co/HTh573HbPR 🙏🏽 https://t.co/FQ77r8UcKY Billie taught me... vfvanities https://t.co/gAZ5oPyrlL 🤗 https://t.co/D37klTgUqR RT @SpiderManMovie: Check out the #VFVanities Instagram for exclusive captions and photos from #SpiderManHomecoming’s @Zendaya all day long… RT @VanityFair: .@Zendaya is taking over the #VFVanities Instagram. Check out exclusive captions and photos all day long, right here https:… When your earring flys off mid shot...go check vfvanities page for my ig takeover https://t.co/xUJ7vUd2oD RT @TeenVogue: These stars are young, fearless, and unapologetically black. #BlackHistoryMonth https://t.co/p85G6YYkw3 I'm speechless...a maternity shoot!!!!😩 https://t.co/OEAFLMRrZd Archives, February 2015...Happy #BlackHistoryMonth https://t.co/Jrqo0dx9CT Absolutely radiant, congratulations Queen. beyonce https://t.co/b19YrCvFFb Absolutely radiant😍🤗 https://t.co/Et0nCVtk6Q 😩😍 https://t.co/6W7RxQsVtz Oh but you can😏 https://t.co/zpB48PzCpA When you wake up and remember the current state of your country... https://t.co/40uchDUTle Anytime, anytime😂😂😂 https://t.co/Kl7yFChpUT RT @AkilahObviously: how. do. you. fire. the. attorney. general. for. doing. her. job? Let's gooooo!!! @yahya https://t.co/2AW6IfFMTo .... https://t.co/VF01EhjkmQ Thank you Ms. Yates✊🏽 https://t.co/CvZVgNPNQt RT @deray: Sally Quillian Yates of The House Resistance, First of Her Name, The Unburnt, Queen of No Bullshit and The Constitution, Breaker… I'd read this if I were you..thank you brother https://t.co/SeIrUzHCOf RT @heyadiana: Today, at Detroit Metro Airport, protesters made room for Muslims to pray.\n\nThey used protest signs as prayer mats.\n\n#nomusl… I told y'all...@lyft for the win RT @ACLU: WATCH: ACLU Executive Director Anthony D. Romero coming out of the court where the ACLU just argued and won block of Trump's Musl… RT @annabelpark: Love is what makes America great! This is happening at Dulles right now. #MuslimBan #Dulles #NoBanNoWall https://t.co/WP3X… Say it👏🏽✊🏽 https://t.co/Oh8tI2sZiI RT @nytopinion: To Republicans who remain quiet, or tacitly support Trump's immigration ban: history will remember you as cowards. https://… RT @yjtorbati: .@CoryBooker addressing crowds at Dulles, said he had been told those still detained would be released soon https://t.co/mAt… RESIST RT @MoveOn: JFK airport #MuslimBan #NoMuslimBan #NoMuslimBanJFK #NoBanNoWall https://t.co/Z2iwNdXPM1 RT @tommiesunshine: NYPD JUST SHUT DOWN THE AIRTRAIN TO #JFKTerminal4. #NoBanNoWall #WeStandUnited #NotMyPresident #100DaysOfResistance #Re… RT @TeenVogue: These stories in response to the #MuslimBan are devastating. https://t.co/vpmTaBzQz2 RT @tparsi: Confirmed: Iran's Asghar Farhadi won't be let into the US to attend Oscar's. He's nominated for best foreign language film...\n#… RT @BraddJaffy: Take 90 seconds and listen to Steve Schmidt on truth. https://t.co/GEBfUJlTNp RT @ACLU: \"Extreme vetting\" is a euphemism for discrimination against Muslims. Period. RT @_illestCee: im really speechless right now because becoming a plus size model has been my number one goal RT @dayabyzendaya: @_illestCee We are ready, when you are!!! @_illestCee hey, you're gorgeous lol Can we find her @....I'd love for her to be a @dayabyzendaya model😍🤗😩 Stumbling across this is stupid shit, she is fine as hell head to toe and garunteed does't know you exist my man. As for her, slay on queen. https://t.co/7IKDJkaQ5F Another day at the office... https://t.co/yGOJosr7O2 ... https://t.co/aT9u6DEquV RT @ACLUTx: This acct is tweeting the entire manifest of the ship full of Jewish refugees turned away from the US in 1939. #RefugeesWelcome… RT @ava: History of the marginalized isn't taught in school to black, brown, white, anyone. But we can teach ourselves about each other. Gl… America....come on https://t.co/stsz7vFW5L Y'all ain't bout to drag me😂😂😂😂 cause I agree.. https://t.co/sHdS3MRdgk @Phour_Loko @BET not to shade myself,but helll naw,that is BEYONCÉ...QUEEN BEY! 😂 #idhaveanervousbreakdown #beyoceisthebestcastingforbeyonce RT @jessicaCaremoor: @Zendaya This made me cry. Sis, I remember this video &amp; loved you..I'm just realizing this was u:) So proud of you, st… Happy birthday to one of my sHeros Angela Davis, 11 speaking her name, 20 meeting her, words can't begin to say it all but thank you. https://t.co/qr5rW674xE Poem by @jessicaCaremoor 🙌🏽 Happy birthday to one of my sHeros...Angela Davis. When I was about 11, I spoke her name in a… https://t.co/3g0Ido8pTW @tholland2013 I like this for now lol I need a new header....can y'all help me find a good one? RT @voguemagazine: How @Zendaya gives her mane a much-needed break. https://t.co/H4KSAQWwP1 When you've spent the past however many years growing your damaged hair back, avoiding heat,… https://t.co/4lliCqvSJv RT @createdbyerica: One minute you're writing your book &amp; the next, you're watching @Zendaya explain lace front wigs &amp; extensions. I hate y… RT @NYDailyNews: .@ShaunKing: Why it matters that 2017 is a record year for black Oscar nominees https://t.co/Kz7MxuimMA https://t.co/9HJ5x… RT @dinnertabledoc: Congrats to Viola Davis, Octavia Spencer, Ruth Negga and Naomie Harris on their #OscarNominations ✨🙌🏾👏🏾🙌🏾✨ https://t.co… 😍 https://t.co/yZlCXk4wJs Alternative facts....didn't know that was a thing... a bit of an oxymoron... Proudly a part of herstory https://t.co/4megVfk2aU Get up...stand up https://t.co/Q8E5SVvr3N That's right... https://t.co/YIGWNegQSc Just posted a photo https://t.co/dkeF3dGj6J .@BraddJaffy @MSNBC the truth over here like... https://t.co/i7cEIwYbhY RT @deray: Remember, part of the Trump White House strategy is to lie so much about obvious things so as to keep us in perpetual response m… RT @voguemagazine: .@Zendaya is taking over our Snapchat from the #WomensMarch in Washington, D.C.! Follow along: https://t.co/1S9J2vgqmy Couldn't be more proud....I am here, we are here!!! #WomensMarch https://t.co/HibJJlcTTC Taking over @voguemagazine Snapchat all day for #WomensMarch..let's gooooo!!!!💖💖💖💖💖 RT @MichaelSkolnik: The crowd is growing quickly.  #WomensMarch https://t.co/9W3Cws1iWX RT @MichaelSkolnik: The stage has been built! #WomensMarch https://t.co/8B5bnkrDde https://t.co/AhgJ3fPMJS This was a candid shot at a photoshoot in which I was lucky enough to have a moment with the… https://t.co/MHXFLlQ4wq RT @people: Donald trump’s twitter header used a photo from Barack Obama’s 2009 #inauguration https://t.co/uXDMTEQcAD https://t.co/v6f1mAH6… RT @JahovasWitniss: Wait... what!?\n\n#Inauguration https://t.co/zs8rx1MjMc @jaysuper2009 https://t.co/lcd0Z6CQ7c My president is black...feels good to say. Thank you for all you've done and all you represent.… https://t.co/aQZpZPrunL Me trying to ignore the bs all day today.... https://t.co/SUpivOIGli @CBSNews one more time with this gif.... https://t.co/UIb92MJEio RT @CushKobain: The protest gonna be more lit than the inauguration. https://t.co/nnK8Zl1Utj @Blackkout__ @AlwaysAnthea tell em!! https://t.co/KUMtMagr9f RT @FameAdventura: Since y'all claim he's done nothing... #ThankYouObama https://t.co/5ubjut3mIA RT @RevoltTV: #TBT One last time for old times sake. #MyPresidentIsBlack ✊🏿 (via @gothiphopblog) https://t.co/2ua3rHREtT RT @deray: #MyPresidentIsBlack I'm still in denial a little bit... @DavidNakamura @POTUS https://t.co/yjKIxrUJ4P This was taken three years ago today (we all look a little rough😂) ....HAPPY BIRTHDAY TO THE… https://t.co/Y27dN5Kc7M Shooting a movie hun #dontcomeforme 😂 https://t.co/7mFY3LDvAt Oh lord🙈 https://t.co/C5bwGfPGZ8 🤗🤗🤗 https://t.co/RyeJHF9qXw RT @laurjbrown: oh that's cool i just met zendaya outside dear evan hansen and we bonded over seeing the show multiple times and she's so n… For the third time... https://t.co/DFzYwnAb0Y Going to see @DearEvanHansen again...this time I'm bringing pops...this will be my third time...I'm a little obsessed lmao https://t.co/UZoQgzyHiQ RT @yahya: So inspiring! My \"Dip\" was when I got laid off from my gov't job in 2010. Such a beautiful/important message in this assignment.… Why you gotta front me off like that... #itwasmadefromscratch 😏 https://t.co/6hrZmlMpMi RT @NWE_MissStubits: @Zendaya Today we read about our favorite celebrities and how they've overcome the \"Dip.\" Abby chose you! She loves yo… Happy birthday to the queen that is our FLOTUS...thank you for your compassion, brilliant mind,… https://t.co/KajAPFdPPV RT @ImmortalTech: First they criminalize you, then they kill you, then they act like they agreed with you all along... https://t.co/hSuMoFS… My baby😩😩😩 https://t.co/81DFkvC1xd RT @TheLifeOfWale: White House never looked this saucy!!! https://t.co/x4W3DmH8vN RT @TeenVogue: If you missed @FLOTUS in conversation with @Zendaya from our Dec. issue, check it out https://t.co/NdxIJ2yBHg RT @harpersbazaarus: A Day In the Life of Zendaya https://t.co/qwISy2d7Tz https://t.co/mcV9np1Wgh Thank you Dr. King https://t.co/a78MBxzkn8 In honor of MLK day.... https://t.co/PfODEztrjX 😂😂😂😭😭😭 https://t.co/T44WJtwQB2 😭😭😭😭 https://t.co/WFA6eZJyHo 4 dayzzzz https://t.co/bQ3IDLtEqP RT @esther_5121: Different sizes, different body shapes, different colours, that's what makes us all beautiful, you are doing a great job @… Looks...@dayabyzendaya spring is not a game. https://t.co/CEWziWPopT Looks @dayabyzendaya https://t.co/pI64g24VKg RT @_FreddyB10: Gotta cop some of this Zendaya gear .@eatjaredtweets done https://t.co/mjN2nluELV RT @TPAIN: @Zendaya lol ✊🏾🦁 I can put you in a mansion...somewhere in wiscaaansin...a poet. RT @_zaraahmed: Daya by Zendaya is literally fire 🔥🔥🔥 @Zendaya RT @Amna461: Literally can't wait .... I saw the models on your snapchat and I was like slaayyyyyy @Zendaya https://t.co/QVDaGwrW8k I meeeaannn😍😩🔥@dayabyzendaya https://t.co/FRJIonn4v0 Yo this second round of @dayabyzendaya not a game...the first was just a little test run😛 https://t.co/aGsGTJpYpf RT @misfitmaree: zendaya chooses the most diverse people to display her clothing line &amp; i love it RT @lilacjuls: \"met\" the bae @Zendaya 😂💖 https://t.co/k4mtOquTuv I plan on doing this aswell👏🏽👏🏽😂 https://t.co/6zpblo2IHg Missing my son (even tho he couldn't care less that his whole ass is on my arm...knocked😂) https://t.co/dDQR8vRRFe 😘😘 https://t.co/i6IQiuu4r9 RT @womensmarch: Unity. Protection. Power. Progress. WOMEN RISE UP. Join us on the 21st at the #WomensMarch on Washington. \n\n#WMWArt: @weez… Me. https://t.co/zGAkQN5svF RT @yasmines_xo: WHAT A WOW WHAT A LOOK https://t.co/E632Z0kRPA I see you booiiiiii👏🏽👏🏽 https://t.co/NPBQLlcoAm 🤗 https://t.co/VUcW5tr19o And you too child😩 https://t.co/jWer4yBhcj Bless you child https://t.co/Orx4YS0VQ7 @chloeandhalle angels😍 https://t.co/5yMJ15BNA5 Gloves and foot raps while we at it😂👏🏽👏🏽 https://t.co/LlLalxI8ql I'm very comfortable in a tiara @dolcegabbana francopagetti https://t.co/eYjM12qJlG We must find the HQ😛 https://t.co/AVBH8RkFo5 🤗🤗🤗 @dayabyzendaya https://t.co/5iWmfPtqkS? 😩😩😩😍😍😍😍 https://t.co/cuev8g9k9R RT @CanDoKen_: I like the message @Zendaya sends to all of her fans and i think more people (female and male) should believe in their beaut… Love this little interaction here lol https://t.co/XXXPe4xRzd RT @iHave3Testiclez: @dakiddmaraj I figured 😂 I got some https://t.co/qUJXp4Opk3 RT @Deeeestiiiiny: After watching @Zendaya hair mask tutorial I decided to try it...let's see how this goes🙏🏽 RT @iLoveAngieM: S/o to @Zendaya 's bare beat face tutorial and this HD powder. I am so poppin right now. See you there. #WomensMarch on Washington January 21st 9am-4pm https://t.co/EMcHAroGm2 https://t.co/rhCMdfSKC0\n#Lookoftheday See you there. #WomensMarch Washington January 21st 9am-4pm https://t.co/KVPtPYREUH RT @KamalaHarris: In the middle of the night the GOP took the first step towards repealing the ACA. I voted no. #SaveACA\nhttps://t.co/JLXX6… RT @MichaelSkolnik: If you’re just waking up, you should know that 51 Republican US Senators voted at 1AM to repeal the Affordable Care Act… RT @LOLAW0LF: Even the customer service for @zendaya's app are the nicest people!!! why am I not surprised?? 😍🙌🏾 https://t.co/uvGDVjou1R @AmIKylieYet *boww* 😂😂👏🏽👏🏽👏🏽 https://t.co/Yo9k5593bC 😘thank you my love.. https://t.co/eU0luT19GK RT @HaagenDazs_US: @Zendaya We heard you have some expired coupons for Häagen-Dazs. DM us and we can get you hooked up with some current on… RT @dayabyzendaya: Patched Military Anorak x @thisiskeithjacobs\n#DayabyZendaya #AllDaya https://t.co/9hBv7iVh5n I wanted to do something special for y'all for the new year! Free subscriptions to my APP ALL JANUARY!! Hope you enjoy😘😘 https://t.co/n7GTMc0lv5 I wanted to do something special for y'all for the new year! Free subscriptions to my APP ALL… https://t.co/DBJvT9B0My RT @HuffingtonPost: \"Yes we can. Yes we did.\" -- @POTUS #ObamaFarewell 😍❤️ https://t.co/AQtwgF0mji RT @xsantaniax: Major props to @Zendaya for watching President Obama's farewell address live on her app🙏🏾 #ObamaFarewell Thank you, thank you, thank you...a million times...thank you. https://t.co/k5KUH4mgBW RT @slimboidre: Tune in to the zendaya:APP. she &amp; darnell are live from home watching obama's farewell address. Its leettt 😄🔥 @Zendaya RT @ChardanayTommo: Me and sis watching one of the greatest Presidents say goodbye together @Zendaya https://t.co/HNtnVrN9nW Me watching my president Obama's farewell address tonight...I'm not gonna be able to do it y'all... https://t.co/RQoaY5HEPV RT @kerrywashington: Watch @POTUS make his farewell address tonight 9pm ET. #ObamaFarewell https://t.co/36ztQRjoDG https://t.co/1A6seeYH4A RT @womensmarch: 11 DAYS until the #WomensMarch on Washington! We call on ALL defenders of human rights to join us on the 21st. RT &amp; spread… Thank you @johnhardy 😍😍😩😩 https://t.co/YmWtlKeoVI RT @papermagazine: Cher, Hari Nef, Zendaya and more will join the Women's March on Washington https://t.co/El4zFf5e7o https://t.co/DOaDxZNQ… As if I needed another reason to love Meryl Streep....thank you for your voice. RT @shondarhimes: How DARE Meryl exercise her right to free speech like that's a thing we are allowed to do here in Ameri- wait...hmm. #Mer… RT @deray: #MerylStreep, truth-teller. #GoldenGlobes https://t.co/tuxxp5fgOU *last year* but thanks for the shoutout doe https://t.co/syxupPObyZ I'm not even there...so I really did the damn thang!!!😂😂👏🏽👏🏽👏🏽 https://t.co/oPka6NIH1K Gaahhhh😩😍 https://t.co/LWMPGBZQse RT @waveymaree: A SWEAT SUIT IS TWO PIECE ROGHT?? IM GUNNA DIE. TAKE ALL MY MONEY. TAKE IT @Zendaya 👌🏽done https://t.co/sJLtqhKGML RT @womensmarch: Support the Women's March on Washington today. We'll see you 1.21 in D.C. https://t.co/eNUNMAL4ji https://t.co/7HvxJnbXcH Goodnight from me and my Frank Gallagher jacket...shameless Shameless reference @ Manhattan Bridge https://t.co/AzqvtlI2Zn Apart from freezing my ass off...today was a great freaking day... @ Manhattan Bridge https://t.co/0QH5aDhV7k Layout? 👍🏽 or 👎🏽 A cali kid with no winter clothes...hence the denim coat and vans https://t.co/h0ii0bVbNV And then I started dancing or...something @ Manhattan Bridge https://t.co/Rf9eugDx1B Turn the weather into a photoshoot @ Manhattan Bridge https://t.co/iwHQtMfLaD @Zendella_magic and lil man can't afford ya I'm about to post a gazillion pictures of a very very happy me living my life in the… https://t.co/rLZUSxnEsR Just posted a video https://t.co/UD6bdwabqb Ew😂 https://t.co/HpczLGr8zu Been there😐 https://t.co/mtt2D3QCot No offense😂 The painful bright ass shade of green that appears when a non-iMessage user texts me....pisses me straight off. @TomHolland1996 @HazOsterfield yooooo....I caaaannntttt😂😂😂😂 https://t.co/fI4ACt3rm0 Cause black don't crack...👶🏽💸 https://t.co/2LO1hxIs7Q RT @ABCPolitics: FLOTUS appears emotional in concluding remarks as First Lady, saying the role has been \"the honor of my life\" https://t.co… Soooooooo lashy 😂@covergirl @jcharlesbeauty https://t.co/kYrbt7IJV0 The fact that I am so focused on my phone...sad😂 https://t.co/3xfSzktZKr Giving \"black princess on vacation in Capri\"   What an honor @dolcegabbana francopagetti @luxurylaw https://t.co/CYOcEn1QAV RT @COVERGIRL: LIVING for @Zendaya &amp; @jamescharles 10-minute eyeshadow challenge. 😍 Check out the full story @Cosmopolitan: https://t.co/Cb… All I do is work, eat, watch Shameless, sleep and mind my business. The life. RT @Almightyzendaya: Curvy girls representing Daya by zendaya 😍👏🏽👏🏽👏🏽👏🏽love it! https://t.co/p0UEoGkRcD RT @DoualyX: This afternoon, witnessed the swearing-in ceremony of @IlhanMN, the nation's first female, Somali-American lawmaker. Via @MPRn… RT @xBeBrave: Checkout \"My Visit to Washington \" on #ZendayaTheApp\n\none of my favorites so far.✊🏼 @Zendaya  https://t.co/e4FedhiVRl Repulsive https://t.co/MWfNTKRRnz RT @SaintHeron: Here’s why @BarackObama's Emmett Till Civil Rights Crimes Reauthorization Act of 2016 is so important: https://t.co/DaIOUJi… RT @RealHughJackman: And .... we're back on set at The Greatest Showman. https://t.co/uCrLrrcRQH RT @dolcegabbana: #DGMillennials Zendaya, Sonia Ben Ammar, Thylane Blondeau shot in #DGCapri by Franco Pagetti for Dolce&amp;Gabbana SS17 Adver… RT @dolcegabbana: #DGMillennials Zendaya, Sonia Ben Ammar, Thylane Blondeau shot in #DGCapri by Franco Pagetti for Dolce&amp;Gabbana SS17 Adver… 😂😂👏🏽👏🏽👏🏽 https://t.co/GV9HsMU1QF RT @MichaelSkolnik: 😢 https://t.co/r3dMjYvnEj RT @USATODAY: Zendaya was most of us. https://t.co/HWOzIhwmQN https://t.co/rhCMdfSKC0\n#Lookoftheday RT @MarkoftheGODS: Viola fucking Davis ladies &amp; gentlemen. https://t.co/jV0eHcao35 While everyone else is turnin up....goodnight https://t.co/fuW27wlb6k Happy new yurrrrrrrrrrr You gonna miss 2016?   Nah. https://t.co/nIRTDFynez RT @erinetoile: New Years look in my @dayabyzendaya velvet blazer https://t.co/ksjAkLvdfH RT @louisquantrille: Shoutout to Zendaya for making a clothing line for everyone. Ready to flaunt it in my @dayabyzendaya 😏 https://t.co/q7… Giiiirrrll....I honestly don't know, some shit should just stay in the past😂😂😂 https://t.co/jVr40C4NkG RT @xCYNcity_: New favorite heels 😍 Thank you @Zendaya  for making these 😘❤ https://t.co/DIJ8gO9qep The many faces of.... https://t.co/wbwNziVDJY https://t.co/i7PmBzRNWf\n#Lookoftheday RT @AlwaysAnthea: \"The only thing that can scratch a diamond is a diamond, the thing that can get to me is me, know dat\"\nI really hate Z 💀 https://t.co/i7PmBzRNWf\n#Lookoftheday RT @lljanessall: God bless @Zendaya for blessing us with this 💣 line \n😭🙏🏽 #DayaByZendaya #OBSESSED #canwearalldaya  @dayabyzendaya https://… RT @zoextalley: do we realize how powerful images like this are? culture is changing https://t.co/DPHm55JSqw https://t.co/i7PmBzRNWf\n#Lookoftheday RT @89ZEVOR: DAMN😭😭😭 @Zendaya @Zendayas_Dad https://t.co/rstV1hJgs5 RT @THR: #SpiderMan stars @TomHolland1996 and @Zendaya, among THR's 100 Best Photos of 2016 https://t.co/OpoyOkizng #THR100 https://t.co/P5… You have no idea https://t.co/OoxKc2A02Y RT @TheRealAishah_: My black cotton lace yoke dress by @Zendaya arrived this morning and I couldn't wait to style it! 😍 #DayaByZendaya Go c… RT @jojapunxz: Christmas☃   @Zendaya @dayabyzendaya https://t.co/rkIlqw7bCe https://t.co/i7PmBzRNWf\n#Lookoftheday RT @katelynn_adrian: Best Christmas gift is @Zendaya 's clothes line @dayabyzendaya because I was able to make this my Christmas dress http… RT @slowfast5512: Why Zendaya always has a mouth full of food on snapchat 😄😜 One year ago today https://t.co/eNCWzNnRFM He was not from val😂😂😂😂 https://t.co/eHOlasxOTK RT @L711Rod: This Christmas has been made 😪💯 @Zendaya https://t.co/QPXjxyTBOu RT @KeyWaaWaa99: I've never cried over a gift before 😂😂😂😭😭🎉🎉🎉 @dayabyzendaya @Zendaya https://t.co/nsbK3Y8Dzn RT @golden_lea8: My favorite Christmas present of all time, absolutely in love 😍😍😍 @Zendaya #DayaByZendaya #MERRYCHRISTMAS https://t.co/4Om… RT @kimberlye_e: When you buy @perrrttyinpink daya by @Zendaya and she starts crying, so you start crying 😢 https://t.co/RdQ4U5HbeQ My first Christmas in my own home. I always wanted the big tree (it's huge, honestly what the… https://t.co/FOcXOJFvOB Hey twin 😂 https://t.co/fwZGAdSvTS I caaaaanntttt😂 https://t.co/2g1LB4Ipbz RT @KMFash: the ideal \"trying Wasabi for the first time\" outfit\nPeep the clothing 😏 though, 🤔 I wonder who she's wearing @Zendaya @dayabyze… RT @Christiana1994: #blackoutday in @dayabyzendaya the shirt is dope, thanks @Zendaya https://t.co/CFWS9eKXaZ To bad that's not me love lol https://t.co/o3JfwzPKGt RT @wmag: When it comes to her own label, Zendaya is still her own best model. https://t.co/dNJlGnYvqJ https://t.co/qYR8jJmzEp 😍😩 https://t.co/wDtYdVylkR RT @livsingh95: When your order from @dayabyzendaya @Zendaya arrives and you have to take a moment to appreciate the packaging 👌 https://t.… RT @peterparkersmj: if you're still debating on buying #DayaByZendaya debate no longer, it's worth it! https://t.co/gbBWhSnXqQ Thanks sis🤗😘 https://t.co/QSATR90FEh RT @Free_ashair: Can I also get a shout out? Straight from México @Zendaya #dayabyzendaya https://t.co/oFKoYcUzFv He sang that.... \" I...I I I I....I'm so in love with you...\" so smooth👏🏽 https://t.co/eYHkouC0an Dawww😍 https://t.co/NCIWSrXkUU RT @BET: .@Zendaya stuns in a jumpsuit that only costs $68 https://t.co/owytm2Zu8q Oh hey😊😏 https://t.co/zXs4kTmIDq @dayabyzendaya 😏 https://t.co/ATuo8Eii1A RT @Zac_Posen: Balancing the KOOKY and the CHIC is what it is all about! Right, @Zendaya?? #ProjectRunway 😂👏🏽👏🏽👏🏽👏🏽 https://t.co/0wXNvGpOWx Thank you for having me projectrunway 💋 https://t.co/u6prA0J2bD My face on @heidiklum body= @JLo https://t.co/7mGV5LQANs RT @ProjectRunway: #ProjectRunway season finale guest judge, @zendaya has been busy designing some clothes of her own! Check them out: http… RT @justjaredjr: We can't wait to watch @Zendaya on the @ProjectRunway season finale tonight!\nSee the sneak peek pics here: https://t.co/BT… This is crazy, and terrifying. https://t.co/l9Nlff8Iqa 😊😘 https://t.co/bctZQqZlZG https://t.co/rhCMdfSKC0\n#Lookoftheday On my APP NOW! You want a good laugh and some holiday cheer, watch me and @darnellappling try to… https://t.co/QVOKrZJmit RT @Jessica_Davis13: @Zendaya I luv it mami!!✨ https://t.co/JciNutWZMG RT @MisffitTiffany: @Zendaya I just placed my order after seeing you on #GMA thanks for the discount and free shipping I can't wait to rock… RT @GMA: SURPRISE! It's a 🚨STYLE AMBUSH🚨 courtesy @Zendaya in Times Square! Look how excited these ladies are! https://t.co/SEplto1NvG RT @ANTMVH1: Boss looks. #ANTM https://t.co/E9AscnB60j Congrats to the challenge winner tonight on @ANTMVH1 did that @KyleAMcCoy 👏🏽👏🏽👏🏽😜 https://t.co/V9gcjTMJlZ The list of people I look up to is very small...and I get to see two of them, from that little… https://t.co/L87hbcDe8A RT @Oprah: Tonight on CBS, 8/7c. #OprahandFLOTUS https://t.co/nbBsferxpK RT @sALeMs_vIsiOnS: @dayabyzendaya + @weareivypark = Happy 21 year old Salem Henok 😊 https://t.co/J0QbDygBEB You know you've made it when you become an alternative presidential candidate suggestion on SNL 😂 https://t.co/9xHLhp9M9A RT @Highdeflove: The two clothing pieces I have from @dayabyzendaya by  @Zendaya https://t.co/ykfSD9cTHj Tonight on #ANTM with my muse @luxurylaw https://t.co/3w340xYbNB I been having some weird dreams lately...I don't even dream that often😳 Yes baby😘😉 https://t.co/8x61yiaDNG Yaaaasss body😍👏🏽👏🏽 https://t.co/tOeX5yECCB You spelled goddess wrong😏😘 https://t.co/ayfBmuCk7h RT @sararose316: Shout out to @Zendaya you made the list for alternate choices for President. https://t.co/shXhTShfu4 RT @thenikkibellar: Just got the zendaya app and it's the bomb 💋💯@dayabyzendaya @Zendaya https://t.co/ZvA4reXx0j @ZStanAwards2016 I can't with this whole thing...I love yall😂😘😘😘😘😘😘😘 😍🙌🏽 https://t.co/JD7gnT6HRW 😩😘 https://t.co/ezniYnuu3E 😊 https://t.co/93sU998VwJ RT @Almightyzendaya: I'm a current subscriber @Zendaya @dayabyzendaya https://t.co/dCjracieul People say we got the same smile... #likemotherlikeson https://t.co/1YmCE6P4tO @AlwaysAnthea @Zendella_magic that's my girl👏🏽👏🏽👏🏽 My muthaaaaf*cking brothaaaa👏🏽👏🏽👏🏽 https://t.co/eBg1DyzSaQ RT @UNICEF: “There is no safe place left in #Aleppo”. The nightmare that is reality for children in #Syria @SingerHanaa https://t.co/GwbjZH… Thanks for the free rides @lyft! \nSide note, cute video😘 https://t.co/oSjjOolMMd #TeamLyft @disney https://t.co/fPNVBvzPSz Awww sheeittt we in here!!! @dayabyzendaya #4 https://t.co/k3rVJg0BtO RT @voguemagazine: Pop culture greatly influenced 2016's most searched fashion designers on Google. https://t.co/gBxUZOEd8g In here🙌🏽 https://t.co/GB8s2WsVAv RT @FootwearNews: .@Rachel_Roy, @Zendaya, @kanyewest among most searched designers in 2016 https://t.co/3edPA5lwpJ https://t.co/dDWPlyJTor RT @Phil_Lewis_: Lit. Lit. Lit. #GoldenGlobes https://t.co/M6BPjzOtg7 An interaction. ICONIC...Cindy taught me😘 @CindyCrawford https://t.co/WjeELzPd4Y RT @CindyCrawford: Uhh yes @Zendaya --&gt; https://t.co/icDonoOyq6 https://t.co/USjNycVYbD 😏 https://t.co/vKD8jy9CjZ Does your hair ever just... https://t.co/vrFvXzeJ8P Not an attractive sour straw...that was a creative ass insult😂😂 https://t.co/IFymLr2zRk Legs and looks https://t.co/0rryh89n3U My bad😏 https://t.co/AUEq4Y1iqg 😂 https://t.co/DD9TqSUb5z 😊😏 https://t.co/qQRRh0Cuva RT @httpzendaya: these are important. https://t.co/u5qPQE4BJ1 RT @Allure_magazine: The super-powerful way @Zendaya is speaking up about race and privilege: https://t.co/viRrvmMtOH https://t.co/g7QCA57M… RT @Allure_magazine: We're all about how @Zendaya wants us all to lift each other up instead of tearing each other down: https://t.co/8eYvm… RT @TheRealKamie: *lives* *dies* *lives again* 😍😍🙌🏽🙌🏽 https://t.co/Q9XNVeCqH0 I love him https://t.co/ms7LplFhI5 Thank you @Allure_magazine for having me on your cover😊 https://t.co/T76poJaFJQ RT @Allure_magazine: 5 ways @Zendaya would change the world: https://t.co/Vw7GN8UZLK https://t.co/zH4DQsfucv RT @Allure_magazine: “It’s OK to be focused, but I can’t get to a point where I don’t like what I’m doing.”—@Zendaya https://t.co/PMwIdE2zC… 😍 https://t.co/PtvoJiIN1d I'm done😂👏🏽👏🏽 https://t.co/rzrw7qbT4n 😍😩 did the hell outta that https://t.co/iUuyVBfIEc Soooooooo👏🏽👏🏽👏🏽 https://t.co/sJuDHQzVk4 It's happening...I repeat...ITS HAPPENING! #spidermanhomecoming @tomholland40 lifeisaloha… https://t.co/GtJH2LxhZ3 RT @Marvel: It’s time to suit up. Watch the official #SpiderManHomecoming trailer now and see the movie in theaters July 7! https://t.co/pd… It's real people...this is not a drill👏🏽👏🏽👏🏽 RT @AlwaysAnthea: Mood all day https://t.co/zg7kkzgpob 😍👏🏽 https://t.co/6esrg8V64G RT @nerdypoc: The Spider-Man Homecoming trailer is dropping tomorrow night on Jimmy Kimmel! https://t.co/M1wEUn3AO9 RT @AgentSpiderMan: How I feel about that 17 second teaser. #SpiderManHomecoming https://t.co/Tn8rlIvMpw When you drag yourself....😂😭Me trying boxing video up on my app now https://t.co/H5AQUUHa7H Oozing sex appeal😏 https://t.co/eKqg4x9fow RT @asapdaya: me to me: act normal\nactually me: https://t.co/bcCf2TXWYd RT @Marvel: Tomorrow, Spider-Man comes home. Tune into @JimmyKimmelLive for a first look at the #SpiderManHomecoming trailer! https://t.co/… OHHHH SHIZZZZNIT https://t.co/AOvwUUJyDN RT @xBeBrave: \"protect the heart of this country, which at the end of the day is the people, it's the kids, it's the young people\" @Zendaya… #ProtectTheHeart RT @MichaelSkolnik: #ProtectTheHeart Things on my app I'm really proud of, it's just good for the soul, when we need it the most. @michaelskolnik @paolamendoza #PROTECTTHEHEART https://t.co/tPjEtsR8rO RT @AlwaysAnthea: @zendaya teamed up with @MichaelSkolnik and @paolamendoza and had a great conversation on her app about post election Ame… The stuff on my app I'm really proud of, you do not have to pay to see this or anything...this… https://t.co/vnDUDcOnQN 😂😍 https://t.co/m3OFCtIqzi 🙌🏽 https://t.co/R6nc2FkLgE RT @SaluteMeImJenn: All around girl goals @Zendaya RT @savvaughnac: so excited to wear these ❤️😍 @dayabyzendaya @Zendaya https://t.co/hVFOzAuena RT @Logan_loading: When Christmas comes early!!!! Too excited to wear my new clothes @Zendaya @dayabyzendaya https://t.co/ZO8x5GkOV4 RT @dancezwitwolves: Rocking my @dayabyzendaya @Zendaya joggers and man they warm as hell https://t.co/a0SxIiK5Lq RT @zenustin: Y'all sleeping on Zendaya's packaging😍😍 https://t.co/wroutFW6Tp Thank youuuuuu!!😘😘😘 https://t.co/oL8rNtHcxf RT @KevoooT: Why am I not a model for my wife yet? @dayabyzendaya @Zendaya https://t.co/9EfAkgLB0Q RT @tjholmes: Yes, there are complexities in law. But to many, it boils down to this: An unarmed man was shot 5 times while running away.Th… RT @markberman: JUST IN: South Carolina prosecutor confirms she will retry Michael Slager after mistrial today https://t.co/88SgL8xlal #wal… #JusticeForWalterScott Daya sweatsuit....more New Yorker looks... @dayabyzendaya @kizzmetjewelry https://t.co/o1LnCkFi2k Eff it upppppppp https://t.co/58FrKFtyH1 One of the best musicals I've ever seen, so beautiful, emotional and honest. I urge everyone to… https://t.co/LLQk2WBp5a RT @katierosman: 🎭 @Zendaya showed up for  @DearEvanHansen bway premier. Producers weren't expecting her. \"A big get,\" said PR guy. She's v… RT @DearEvanHansen: What a trio! @Zendaya, @kealasettle &amp; Michael Gracey have arrived! #DearEvanHansen #openingnight https://t.co/jktG4JwyRs RT @savvaughnac: I wore @dayabyzendaya and @KizzmetJewelry and I got a lot of compliments on both so thank you to @Zendaya and @clairemaree… RT @Highdeflove: @Zendaya : you might as well get peanuts and just chew them.\n💀💀 that's it the same thing Z A hero...honestly https://t.co/Jx1D62ySu1 😂😂😂😂😂 https://t.co/bFltyWr35L RT @flawlessmarieee: @Zendaya: I wanna use a real plate   Darnell: But you don't clean 'em        Zendaya: yeah but you clean them https://… fixing it https://t.co/rk2R9WexfM RT @Babyzswagger: But the faces you're making tho 😩😂 @Zendaya https://t.co/dBdeWHaVQ8 see!!! https://t.co/hIwh8TvvZk RT @ChardanayTommo: When @Zendaya tells you screen shot noon cause he has a sparkle on his nose https://t.co/h4623TtMwE RT @Rosegoldmaree: How cute is @Zendaya live on her app 😍 https://t.co/mE9JdhbnW5 IM LIVE ON MY APP TRYING TO COOK FYI 😂 RT @misfitmaree: me in the car: \nditches the car radio and opens zendaya's app to listen to hers https://t.co/KQVbdVodva No bullshit...the radio on my app is POPPIN😂😂😂 RT @paytonmorrisonn: I like how @Zendaya 's app plays music🎶. So I can gig while I shop. LIT🔥 RT @zinatvanessa: Zendaya The App is lit✨ Come thruuuuu😍 https://t.co/iTfa2RoL9Z RT @begum_475: @Zendaya @dayabyzendaya 😍 👌 https://t.co/uxmuGBLls4 😍 https://t.co/fQrzELiklR Well my mom😂 https://t.co/drgJMrMH3U I think I'm a New Yorker now.... https://t.co/iAWZhPBv1U RT @aishalove98: @Zendaya radio got me like 🙌🏾🙌🏾🙌🏾 https://t.co/4SGU610uLh Fine😍 https://t.co/ji3mGYAC2e The rest is on my app😏 https://t.co/pYTRQs7HVl RT @CraZy_Precious: Zendaya's radio on her app &gt;&gt;&gt; 😍😩 https://t.co/kjMMkaqZ02 Coleman Family...the people I do it for, my motivation, my support, my everything. (The only… https://t.co/RtVxnaqGJK RT @sneakinbieber: i love your app Z! keep slaying @Zendaya https://t.co/KBlMhn5WLr RT @abinsolk: Just subscribed to Zendaya's App and I have never been happier 😀😀 I love you 😂😂😂 https://t.co/3Ma6niFBDC A. HAM https://t.co/vmmaJgBBwd Thank you again to @MANewYork and @annayabsley for the honor of Launch of the Year...and thank… https://t.co/tA0b6olC0c Last one https://t.co/MS96iZ37z0 RT @voguemagazine: .@Zendaya is no stranger to the odd retro-cool beauty statement. https://t.co/atqEvIJYNl RT @MichaelKors: V. chic: @Zendaya in Spring 2017 Michael Kors Collection. #FNAA30 https://t.co/Y1EgOAzIMZ V https://t.co/hNchUOproy Shoutout to my highlight https://t.co/nDpPab05eo Finger wavy https://t.co/Vq2wfRVePV Mood #footwearnewsachievementawards #launchoftheyear https://t.co/k2T4uy8kW1 RT @justjaredjr: .@Zendaya perfects her #Daya clothing line in this new video from her app! https://t.co/yYxFtcKH5G https://t.co/rH3C71Tqze RT @FLAREfashion: 4 reasons @Zendaya fans will be obsessed with #ZendayaTheApp—like the beauty tutorials: https://t.co/HZw0rOQlgT https://t… RT @MikeThrone_: can't wait until my jacket come @zendaya new line DAYA is so bomb! so many unisex pieces 😍 #NewShootComingSoon Post game https://t.co/f81ifoGUgW This captures the awkwardness a little better😂 https://t.co/wzOpEVT7Ht Game day looks https://t.co/z8tEnbRP93 RT @WEMovement: #WEDay is off and running! Watch @Zendaya host this epic world-changing event on @mtvcanada and @much! https://t.co/feWduOA… I caaaann't lmao😂 https://t.co/3PaaNvU5bI Damage control😂😂😂😂✋🏽 https://t.co/NIbD2SZMxn The look of awkwardness😂 https://t.co/PYaZ4oE8WO RT @purplexchi: Deleted pics and apps to get my early Christmas gift  ❤️THE Zendaya APP!!! Been waiting too long 💕😘 https://t.co/q33p1A6qKN RT @walkingholland: LOOK WHAT I GOT @Zendaya https://t.co/03nN0uyxJQ RT @GVanessaabi: @Zendaya Love it so much !!! https://t.co/NOwhEdch97 ZENDAYA: THE APP available now at the app store😘\nhttps://t.co/Uespmvxq6M https://t.co/D7ulbc8ZY3 ZENDAYA: THE APP available at the App Store NOW 😍 https://t.co/PksqukXfel RT @Almightyzendaya: Another sale? Will be most def coping something @Zendaya @dayabyzendaya https://t.co/bY8MrPIOJz The spread...first thanksgiving at auntie daya's https://t.co/NW96cWMj6w I'm from Oakland for real for real... https://t.co/pkBRjb8whc Lookin down at the spread like.... https://t.co/qObTCAH4eL Done😘😂 https://t.co/igHYZguuEq RT @dayabyzendaya: Self Empowerment Graphic Tee at https://t.co/caT7VgnTVT. Btw we've extended our Black Friday sales 😈#DayabyZendaya #AllD… I meaaaaaannnn😩😍 https://t.co/aK0NJ6JO54 RT @ajplus: This #BLM activist came from Ferguson to stand with #NoDAPL. https://t.co/4InjAnovwM RT @JanelleMonae: Are we back in segregation era?! Police using water hoses!! WTF. We HAVE to protect our first Americans, the natives of t… I hope everyone is having a beautiful thanksgiving, but as we enjoy our festivities, let's not… https://t.co/3vg3e4XxtW RT @KevoooT: Early Black Friday/Cyber Monday on daya by Zendaya? Lit. That's where my money will be going 😂 Oop... https://t.co/YLvXCiLo9u RT @ACLU: Thank you. #NoDAPL https://t.co/aKpnJOC6Zq RT @TeenVogue: We asked two girls from the #StandingRock Sioux tribe to tell us about what's happening to their people. #NoDAPL https://t.c… @JETLUXLIFE 😘😘😘 When you know you bout to get some bomb ass food as soon as you land lmao shout out to… https://t.co/ZxlJKpJ8qa RT @nick2crosby: This Thanksgiving, #ImThankfulFor having basic necessities—like clean water. It's 2016, and it's sad that it's a privilege… RT @MichaelSkolnik: #JamesMeans https://t.co/KbtUytcj65 ....sick.....#BlackLivesMatter https://t.co/g8IBGwrMQn I think we have worlds best real life Spider-Man... today @nyphospital with my favs @tomholland2013 @lifeisaloha @lollipoptheater #PooPoo https://t.co/qKxiikensl I think we have worlds best real life Spider-Man....an absolutely beautiful day at nyphospital… https://t.co/tDGA9Ex17p RT @httpzendaya: I can't believe how fast and big he grew up too.......... https://t.co/lR4AL7sG43 My son/newest daya model wearing the generation Z crop top😂 https://t.co/gUmWuebRVS Perfection😍 https://t.co/Cp1Z1K7yXa Hahahaha let them say what they want...point is they missed me today😏😘 https://t.co/oiHcyMBeMC Rose quartz https://t.co/7H0U0SN4vi Nothing realer than the streets of New York... #blacklivesmatter https://t.co/wEzXuVF1Xd Daya by Zendaya https://t.co/fewPbLDHqr Ugh😍😩 https://t.co/angBUbP6nS Did that😍😩 https://t.co/ShbbDCtef7 Snapped @Misterode_ https://t.co/YP8kPhvIIy RT @ghaney22: Yes #MikePence was at @HamiltonMusical here's what we had to say https://t.co/YIjt7JZ3gF RT @AVAETC: Artists will never apologize for speaking truth to power. Keep asking. Keep getting put in your place. It's on. https://t.co/jo… *buys five tickets to Hamilton* https://t.co/t4U7Voyhhl RT @jonlovett: \"Harassed.\" The cast politely and respectfully read a statement. The president will lie to us about every little thing for f… SAY IT LOUDER FOR THE PEOPLE IN THE BACK!!👏🏽👏🏽 https://t.co/3TkhGcNUUC RT @d_shandiix3: The fact that they are Swag. Surfing. in the White House 😩😭😭 my heart is so full. Unapologetically black ASF 🙌🏾https://t.c… I am sincerely disgusted https://t.co/ZsbjgXuHaR RT @cierruh3: Zendaya is really roasting herself in her snap!!!! I'm dying😂😂 RT @MrsSchmalzClass: @Zendaya you are an inspiration to these sweet #carsonstars who lookup to your #perseverance through #thedip @ClassDoj… So important...these ladies look like absolute perfection😍😩 thanks @BuzzFeed https://t.co/1eZUbiMLuh Girl..... https://t.co/2RNznVZBg5 RT @BuzzFeed: This is what Zendaya’s new clothing line looks like on different body types https://t.co/AyusDExK2o https://t.co/bbzkEhJnkz RT @BuzzFeedVideo: Women try @Zendaya's size inclusive clothing line https://t.co/sE8SoJkmaE I love this😍😍😍honor to have these ladies in my clothes, that all look beyond gorgeous, thanks @BuzzFeed #Inclusion #bodypositive https://t.co/ELDncM2Xf0 So my mom's a dope ass jewelry designer/maker and also slays my line😍@clairemaree64 @KizzmetJewelry @dayabyzendaya #handwrappedcrystalchoker https://t.co/zINrAU0woV https://t.co/rhCMdfSKC0 \n#Lookoftheday RT @glamourmag: \"We can't fight terrorism with racism because they are both based on the same ideology.\" - @NadiaMuradBasee #GlamourWOTY ht… Can I present?? Please please🙋🏽 https://t.co/av6L4jdKrZ RT @Essence: .@Zendaya  and @YaraShahidi are #BlackGirlMagic goals in stunning floral looks: https://t.co/GaLRlTrjjD https://t.co/r2Dv8B4ENo RT @YaraShahidi: #AboutLastNight honored to present #WOTY award to my big sis @Zendaya Thx @glamourmag &amp; @cindi_leive for filling the room… 😘❤️ https://t.co/51IWytVs4h RT @cyrenelovette: Yara &amp; zendaya are some cold girls. ✨ RT @Simone_Biles: got to meet these two lovely ladies today  💜 @Zendaya @KatGraham https://t.co/5LvwoWSSz3 As I gazed up at a balcony full of beautiful young women \"Ladies, you are the leaders. You're… https://t.co/k7Y9tA99Yj RT @glamourmag: \"Ladies, you are the leaders. You're the future. We need you. I'm with you. We're all with you.\" - @Zendaya, 2016 #GlamourW… RT @httpzendaya: bless you @KelleyBakerBrow 😩🙏🏾 https://t.co/9YO192iT6O RT @dayabyzendaya: @thesandylion x Patched Military Anorak #DayabyZendaya #AllDaya https://t.co/XhYMHEycZy https://t.co/rhCMdfSKC0  \n#Lookoftheday Aesthetic https://t.co/w58iNpc8UO RT @berry_sck: \"I'm Muslim and people call me terrorist. Do you trust me? If yes, hug me.\" https://t.co/ItIGhv7CHV RT @StrokeMyWheels: When your Daya arrives ! 😍😍@Zendaya !! Can't wait to rock my new jackets https://t.co/4rGI8dzupy RT @StrokeMyWheels: Details 😍😍😍😍 @Zendaya in love !! https://t.co/OvfUOAs4Su RT @LawrenceR215: In these streets @dayabyzendaya @Zendaya #DayabyZendaya LawrenceXDaya shop at https://t.co/X3okgA7kq6 to get this look!IG… RT @kenzielandman: @Zendaya i love them! even the box they came in is amazing! 💘 https://t.co/AsgIeexmJf RT @spideysniaII: JUST BOUGHT MY OWN COPY OF MY FAVES @Zendaya @TomHolland1996 https://t.co/sDq0vGPIa7 RT @laainers: Here's me happy AF cuz my jumpsuit from Zendaya came in yesterday ! ! ! https://t.co/F3Q9sRuEgf 😂😂😂😂 https://t.co/vjvbo0CXEc RT @MichaelSkolnik: Salute to all of the veterans who have passed and who are still alive. We deeply appreciate your service to this nation."}