{"tweets": "We figured it out! #FreeGuy 👕 https://t.co/fLOd9gqvk0 @HwdSoundMuseum It’s in Free Guy. It’s in Deadpool 1 and 2 as well. @sportslogosnet @DatesInMovies I never stop talking in the film. I changed it to that date just so I could remember it. @TheRossOwenShow Love Stan and Ollie. Don’t forget about Mary MacLane! “Men Who Have Made Love To Me” (1918) @lindseyvonn @RealHughJackman @laughingmanco @AviationGin Deal! He won’t admit it but I know for a fact he’s incredible on hills with no snow. @dparrish77 @RealHughJackman @lindseyvonn I’m the guy on the violin. @OngCody @AviationGin Ahhhhh🌴 @theadrianmolina @BrandonDavisBD @AviationGin Ohhhhhh. When I point the finger at someone, there’s three more pointing back at me. I see. @BrandonDavisBD @AviationGin Straight from the bottle, Brandon? @Alphacat I resemble that remark. https://t.co/BDg1KT8SZH @TheDrewBraswell @AviationGin Oh my god. So much. @gtgreg165 @StarrburyMike Nah, I think if you read the tweet without context of the thread, it would be easy to see it as earnest. All good. @StarrburyMike It was a joke. It seems a poorly executed one @derekmross @MMBakner @AviationGin @Mintmobile It’s not like I can just move out of the crawl space underneath the floor of your bedroom. It was hard enough sneaking into the damn place to begin with. @CasuallyRelyt @AviationGin @koolaid I don’t judge. @BeefGazebo Correct. @Oscarfinnmedia I’m sure headlines have a different plan for us all. @tjredone @NickdeSemlyen No need. I watched it for you. Rest. Just... rest. @crc0427 @ZodWriter @GraceRandolph Watching it was not at all what I imagined. I’m normally so hard on myself. But being a decade away from it, made the experience kinda, weirdly, lovely. @NickdeSemlyen If we’re being honest, I started a little tipsy. @maddyeisenberg I do not. But I wear its memory every single day. Happy #StPatricksDay and good luck to the #SnyderCut on @HBOMax! https://t.co/ain5Y4ivPN Maybe it’s the Aviation Gin talking, but #GreenLantern was nothing to fear! Hundreds of incredible crew and cast members did amazing work — and while it’s not perfect, it ain’t a tragedy. Next time I won’t wait a decade to watch. @AviationGin I honestly don’t know. There’s a lot of heavy hitters in the movie. Not always used in the right way... but still... heavy hitters. Who elevates the movie the most? Wow. Hector just threw his father into a gigantic tornado of fire. That’s exactly how my dad died. E True Hollywood Story should do a “where are they now” piece on Hector’s mustache. I genuinely wonder what it’s been up to. The Christian Bale superhero voice. Who wore it first? They spent 6 hrs each day turning Peter Sarsgaard’s head into an over-inflated beach ball. But the GL suit is a onesie made from old Frogger pixels. So creeps @_PropMaster So creeps. We are all Hector. https://t.co/kntSxQxCrN Parrallax thought he was so bad. He had no clue 2020 would make him look like a fucking Beanie Baby. Go back to space, asshole. Goddamn I miss Michael Clarke Duncan. See if you can spot the CGI! https://t.co/aXUXA8kR2i Still have the ring https://t.co/eDezX6iTQc Beware my power. https://t.co/MNMXNDq1Ej https://t.co/UgzacFhCXI They should have sent a poet Do you have any idea how weird it is to act while being attacked by invisible space energy? Finally... a bar! Oath still works. I stand by my oath performance. Honestly, this cast is incredible. Angela Bassett is stunning. Period. Love Stanley Tucci. This was not bad foreshadowing for my life as a dad https://t.co/sj5jzWrWUt Hey @BlakeLively is in this movie!! Oh boy. Tragic childhood flashback sequence killing a beloved parent. Designed to instill a level of depth and hard fought empathy for our hero. Disney perfected this move. I swear I’m drinking to Grammy winner and international ambassador of joy, @TaikaWaititi. Not to numb any pain I might be in. This protagonist seems reckless but likable I only ever read my parts of the script so this is genuinely exciting for me to watch I enjoyed The OA on @Netflix btw @millipeacecraft @AviationGin Yes Starting GL now. First time ever. Too early to ask for a #SnyderCut of this fucker? 3 min. #GinnerAndAMovie @AviationGin https://t.co/vmCqZCdddZ @ZackSnyder Yes! And we’ll watch 300 and Justice League. I promise I’ll raise my hand to ask questions instead of yelling, “how’d you do that?!” Every ten seconds like last time. Make your own Lantern’s Light green cocktail because @drizly delivers. Also get 5 dollars off here: https://t.co/FhlEQ9NGNV It’s apparently the only fucking movie in existence that’s not streaming anywhere so you’re SOL if you want to watch along. But I’m going deep. #GinnerAndAMovie #AviationGin https://t.co/HsHYofDkBg Excited to see the Snyder Cut. But ahead of its debut – and with the aid of a good amount of #AviationGin - tonight at 6pm EST I’ll do something I’ve never done: actually watch Green Lantern. Happy #StPatricksDay @DanReynolds Papa can you hear meeee? 🎶 Wrong dragons. Wrong Reynolds. #Wrexhamisthename #SoisRyan 🏴󠁧󠁢󠁷󠁬󠁳󠁿cc @DanReynolds https://t.co/8OAbyJ36JC @Project529BC @VancouverPD @project529 Good job recovering it, but even WAY better job photographing it. This could be on the cover of Vogue. @Mintmobile Like, a lot. @AustinJWebster @Mintmobile Yup. They’re from @GarrettLeight @michaela_tim7 It was the best gin I’d ever had before I invested and it continues to be the best gin in the galaxy. That’s right... the galaxy. @AviationGin @riddlefish @Sethrogen I don’t want to speak for @Sethrogen but yes it does. @LaunchPhoto 🤩 amazing @DouglasTodd @dana_gee I make sure it’s excruciating. Huge welcome to our new CEO, Fleur Robinson! It’s starting... @fleurrobo @RMcElhenney #WxmAFC 🏴󠁧󠁢󠁷󠁬󠁳󠁿 ⚽️ https://t.co/oKbJ6gPT1e @Kirstieyf Well... then Happy Birthday, Kirstie. 🍸🍸 @MaximumEffort @ToysRUs And @StateFarm. I hope your jingle is insured because we’re coming for you too. @RealHughJackman I guarantee it. @StuntmanStu 💯 @GrindheadJim @Mintmobile Welcome!!!! @drphiliplee1 @neilhumby That’s where you’re wrong. It’s just love with NTW. RT @people: Ryan Reynolds' Hilarious New HighKey Commercial Has Naughty Undertones: 'It Involves a Bit of a Wink'​  https://t.co/kiveVRtXj9 @Mintmobile This is our best ad yet.", "bag_of_tweets": ["We figured it out! #FreeGuy 👕 https://t.co/fLOd9gqvk0", "@HwdSoundMuseum It’s in Free Guy. It’s in Deadpool 1 and 2 as well.", "@sportslogosnet @DatesInMovies I never stop talking in the film. I changed it to that date just so I could remember it.", "@TheRossOwenShow Love Stan and Ollie. Don’t forget about Mary MacLane! “Men Who Have Made Love To Me” (1918)", "@lindseyvonn @RealHughJackman @laughingmanco @AviationGin Deal! He won’t admit it but I know for a fact he’s incredible on hills with no snow.", "@dparrish77 @RealHughJackman @lindseyvonn I’m the guy on the violin.", "@OngCody @AviationGin Ahhhhh🌴", "@theadrianmolina @BrandonDavisBD @AviationGin Ohhhhhh. When I point the finger at someone, there’s three more pointing back at me. I see.", "@BrandonDavisBD @AviationGin Straight from the bottle, Brandon?", "@Alphacat I resemble that remark.", "https://t.co/BDg1KT8SZH", "@TheDrewBraswell @AviationGin Oh my god. So much.", "@gtgreg165 @StarrburyMike Nah, I think if you read the tweet without context of the thread, it would be easy to see it as earnest. All good.", "@StarrburyMike It was a joke. It seems a poorly executed one", "@derekmross @MMBakner @AviationGin @Mintmobile It’s not like I can just move out of the crawl space underneath the floor of your bedroom. It was hard enough sneaking into the damn place to begin with.", "@CasuallyRelyt @AviationGin @koolaid I don’t judge.", "@BeefGazebo Correct.", "@Oscarfinnmedia I’m sure headlines have a different plan for us all.", "@tjredone @NickdeSemlyen No need. I watched it for you. Rest. Just... rest.", "@crc0427 @ZodWriter @GraceRandolph Watching it was not at all what I imagined. I’m normally so hard on myself. But being a decade away from it, made the experience kinda, weirdly, lovely.", "@NickdeSemlyen If we’re being honest, I started a little tipsy.", "@maddyeisenberg I do not. But I wear its memory every single day.", "Happy #StPatricksDay and good luck to the #SnyderCut on @HBOMax! https://t.co/ain5Y4ivPN", "Maybe it’s the Aviation Gin talking, but #GreenLantern was nothing to fear! Hundreds of incredible crew and cast members did amazing work — and while it’s not perfect, it ain’t a tragedy. Next time I won’t wait a decade to watch.", "@AviationGin I honestly don’t know.", "There’s a lot of heavy hitters in the movie. Not always used in the right way... but still... heavy hitters.", "Who elevates the movie the most?", "Wow. Hector just threw his father into a gigantic tornado of fire. That’s exactly how my dad died.", "E True Hollywood Story should do a “where are they now” piece on Hector’s mustache. I genuinely wonder what it’s been up to.", "The Christian Bale superhero voice. Who wore it first?", "They spent 6 hrs each day turning Peter Sarsgaard’s head into an over-inflated beach ball. But the GL suit is a onesie made from old Frogger pixels.", "So creeps", "@_PropMaster So creeps.", "We are all Hector. https://t.co/kntSxQxCrN", "Parrallax thought he was so bad. He had no clue 2020 would make him look like a fucking Beanie Baby. Go back to space, asshole.", "Goddamn I miss Michael Clarke Duncan.", "See if you can spot the CGI! https://t.co/aXUXA8kR2i", "Still have the ring https://t.co/eDezX6iTQc", "Beware my power. https://t.co/MNMXNDq1Ej", "https://t.co/UgzacFhCXI", "They should have sent a poet", "Do you have any idea how weird it is to act while being attacked by invisible space energy?", "Finally... a bar!", "Oath still works. I stand by my oath performance.", "Honestly, this cast is incredible.", "Angela Bassett is stunning. Period.", "Love Stanley Tucci.", "This was not bad foreshadowing for my life as a dad https://t.co/sj5jzWrWUt", "Hey @BlakeLively is in this movie!!", "Oh boy. Tragic childhood flashback sequence killing a beloved parent. Designed to instill a level of depth and hard fought empathy for our hero. Disney perfected this move.", "I swear I’m drinking to Grammy winner and international ambassador of joy, @TaikaWaititi. Not to numb any pain I might be in.", "This protagonist seems reckless but likable", "I only ever read my parts of the script so this is genuinely exciting for me to watch", "I enjoyed The OA on @Netflix btw", "@millipeacecraft @AviationGin Yes", "Starting GL now. First time ever. Too early to ask for a #SnyderCut of this fucker?", "3 min. #GinnerAndAMovie @AviationGin https://t.co/vmCqZCdddZ", "@ZackSnyder Yes! And we’ll watch 300 and Justice League. I promise I’ll raise my hand to ask questions instead of yelling, “how’d you do that?!” Every ten seconds like last time.", "Make your own Lantern’s Light green cocktail because @drizly delivers. Also get 5 dollars off here: https://t.co/FhlEQ9NGNV", "It’s apparently the only fucking movie in existence that’s not streaming anywhere so you’re SOL if you want to watch along. But I’m going deep. #GinnerAndAMovie #AviationGin", "https://t.co/HsHYofDkBg", "Excited to see the Snyder Cut. But ahead of its debut – and with the aid of a good amount of #AviationGin - tonight at 6pm EST I’ll do something I’ve never done: actually watch Green Lantern. Happy #StPatricksDay", "@DanReynolds Papa can you hear meeee? 🎶", "Wrong dragons. Wrong Reynolds. #Wrexhamisthename #SoisRyan 🏴󠁧󠁢󠁷󠁬󠁳󠁿cc @DanReynolds https://t.co/8OAbyJ36JC", "@Project529BC @VancouverPD @project529 Good job recovering it, but even WAY better job photographing it. This could be on the cover of Vogue.", "@Mintmobile Like, a lot.", "@AustinJWebster @Mintmobile Yup. They’re from @GarrettLeight", "@michaela_tim7 It was the best gin I’d ever had before I invested and it continues to be the best gin in the galaxy. That’s right... the galaxy. @AviationGin", "@riddlefish @Sethrogen I don’t want to speak for @Sethrogen but yes it does.", "@LaunchPhoto 🤩 amazing", "@DouglasTodd @dana_gee I make sure it’s excruciating.", "Huge welcome to our new CEO, Fleur Robinson! It’s starting... @fleurrobo @RMcElhenney #WxmAFC 🏴󠁧󠁢󠁷󠁬󠁳󠁿 ⚽️ https://t.co/oKbJ6gPT1e", "@Kirstieyf Well... then Happy Birthday, Kirstie. 🍸🍸", "@MaximumEffort @ToysRUs And @StateFarm. I hope your jingle is insured because we’re coming for you too.", "@RealHughJackman I guarantee it.", "@StuntmanStu 💯", "@GrindheadJim @Mintmobile Welcome!!!!", "@drphiliplee1 @neilhumby That’s where you’re wrong. It’s just love with NTW.", "RT @people: Ryan Reynolds' Hilarious New HighKey Commercial Has Naughty Undertones: 'It Involves a Bit of a Wink'​  https://t.co/kiveVRtXj9", "@Mintmobile This is our best ad yet."]}