{"tweets": "RT @MSFTEnable: #Include2021 was a global event that brought together external experts and allowed us to explore insights from some of the… *Unmutes mic*\n\n*waits 10 seconds to say something*\n\n*decides not to say anything*\n\n*mutes mic*\n\n*types in the chat instead* RT @MSFTIssues: Did you know water stores carbon? The more it stores, the more acidic it becomes, affecting ecosystems and global oxygen. 💧… St Cuthbert’s is a great example of a school that’s gone from embracing devices in classrooms to innovating with Microsoft Teams. 💻\n\nDiscover the creative ways teachers and students are staying connected through tech: https://t.co/ZV5Pt56M7y RT @Xbox: The Women's History Month celebration continues! Tune in this week as we're joined by different women in game development.\n\nSee y… @erhangazi For a fully immersive XP-rience. @Lehbot82 🙌 @Mohammad_Dawod_ Facts. @stemong 🥺 @serialtoon Yes? ☁ @AleksaRakic19 Indeed. @KayreeTV 😂 @steve_trow 😂 @itsrohanvj 🎶 @JenMsft You're living in the future, Jen. @sarahbeattiee 👋 @Ryan_Deem Not all heroes wear capes. RT @satyanadella: Over the past year, no area has undergone more rapid transformation than the way we work, and as the world recovers, ther… RT @MSFTIssues: A healthy democracy requires healthy journalism, but the news today is not alive and well. (1/2) https://t.co/2oPL0UrMm1 Could this be your next Microsoft Teams background? ☁ https://t.co/2kqFlqhgIa 60% of people living in the Middle East and North Africa have little or no access to drinkable water. 💧\n\nDiscover how #AI and IoT are helping to reduce avoidable water loss: https://t.co/GPT2k3NgAa Today we shared how we’re evolving our hybrid work strategy for 160,000+ employees around the world. Our approach is data-driven and research-backed. Learn more about our research in the 2021 Work Trend Index: https://t.co/Wyu5lCEYvb #WorkTrends #FutureOfWork #Include2021 was a global event that brought together external experts and allowed us to explore insights from some of the brightest minds in diversity &amp; inclusion. \n\nIf you missed any of the key sessions, register, sign in, and catch up on-demand: https://t.co/QonDoBua9R ICYMI: We hosted #Include2021 and brought together external experts and scholars in diversity &amp; inclusion.\n\nRegister, sign in, and get your favorite sessions on-demand: https://t.co/cEulsh2Keq https://t.co/lc2iBmMhBs \"While we don’t believe a single event will provide all the answers, our hope is that the conversations started during Include 2021 will continue long afterward.\" \n\nMore from our CVP and Chief Diversity Officer @Lindsay_Rae_M: https://t.co/U76d9jSEes #Include2021 Prof. Binna Kandola, Senior Partner and Co-Founder of Pearn Kandola, studies unconscious bias, inclusion, and exclusion. Join him now at #Include2021: https://t.co/mxxdfq0GLO https://t.co/yamQHS59tc Dr. Ken Dychtwald, psychologist, gerontologist, author, and Founder and CEO of Age Wave, explores the tensions put on inclusion by the increasing number of generations in the workplace: https://t.co/s14TSh8sQa #Include2021 https://t.co/YcFyeWGr16 Discussing faith as part of the diversity &amp; inclusion conversation can strengthen overall workplace culture. Join Rev. Mark Fowler, CEO for Tanenbaum, &amp; Dalia Mogahed, Director of Research at the Institute for Social Policy and Understanding: https://t.co/mT2smkpxV3 #Include2021 https://t.co/sW8VRc0SwH Did you join any of the sessions at Include 2021? Share what you enjoyed most about your experience using #Include2021. A growth mindset is an important foundation for diversity &amp; inclusion as it emphasizes building understanding over time through intentional effort, making mistakes, and then applying learnings. Join Eduardo Briceño of Wiring Growth now at #Include2021: https://t.co/JtFVE2f2fS https://t.co/p9JA5Q1JvZ @2AccessAbility 👏 Join Charlotte McClain-Nhlapo, Global Disability Advisor for the World Bank Group, to gain better awareness of the spectrum of identities within the disability community: https://t.co/WPt75jkMJS #Include2021 https://t.co/DrgOL72x87 Brad Smith is joined by General John R. Allen, President, The Brookings Institution, and Dr. Camille M. Busette, Senior Fellow, as they share how Brookings is using their research approach &amp; insights to inform their focus on race and inequity: https://t.co/1PUjW33rq3 #Include2021 https://t.co/iSuBMZQDzl Dr. Stephanie Creary, from the Wharton School of the Univ. of Pennsylvania, addresses the need to explore privilege &amp; marginalization in the context of identity, &amp; the importance of understanding our own identity as we work to include others: https://t.co/r4zvv5ybXx #Include2021 https://t.co/xaOzPVWhc6 Chief Human Resource Officers at Microsoft, Accenture, Johnson &amp; Johnson, and Chevron discuss what it means to lead diversity &amp; inclusion work with empathy, accountability, and sustainability now at #Include2021: https://t.co/Rt5V5Cp3LW https://t.co/P6MQjgFwOT @JazzGirl68 😂 @1971genx Same. @suedeyloh @SesameWorkshop ❤ @mrlacey Us too. Alphonso B. David, civil rights lawyer &amp; President of the Human Rights Campaign, is a leading advocate for LGBTQI+ equality. Alphonso will explore how a nuanced understanding of this diverse community can lead to a more inclusive culture: https://t.co/ryJlti5Ndg #Include2021 https://t.co/ZJ7EYkv2yw RT @Lindsay_Rae_M: When we stop making interpersonal assumptions we can build workplaces that are “not only inclusive but also transformati… Dr. Jeffrey Lieberman, Professor &amp; Chair of Psychiatry at Columbia University, is joining us now at #Include2021 to discuss the stigmatization of people with mental health conditions with a focus on how organizations can provide greater support: https://t.co/1UDn7Ib7RE https://t.co/CacGmrZh8F @jennylayfluffy @clarebarclay 😻 @merrie_mcgaw @chasestrangio ❤ @tidwelljackie @chasestrangio 🙌 @DeRiikka ❤ RT @Lindsay_Rae_M: \"Inequality is a problem that we need to redouble our efforts to solve. That might mean being honest that we're not all… @marianaatencio 👏 Microsoft CMO Chris Capossela hosts Sesame Workshop President Sherrie Westin and Creative &amp; Production EVP Kay Wilson Stallings to explore how storytelling can help kids everywhere grow smarter, stronger, and kinder: https://t.co/KC5kV0J1vh #Include2021 https://t.co/ZeE8CIOBoV RT @Lindsay_Rae_M: \"Bear witnesses to the trauma, learn, and then take action.\" What a powerful message. In order to drive change with impa… Chase Strangio, Deputy Director for Transgender Justice with the ACLU LGBT &amp; HIV Project, joins us at #Include2021 to discuss the evolution of how we think and talk about gender in the workplace: https://t.co/LnYwGSJliZ https://t.co/Et6YeBjz1C @ClaudiaMRamirez ❤ @bosemanator @MichaelEDyson 🙌 @therealmarcusb Thank you for this. ❤ Lindsay-Rae McIntyre, Microsoft Corporate Vice President &amp; Chief Diversity Officer, shares more about Microsoft’s growth mindset approach to diversity &amp; inclusion now at #Include2021: https://t.co/l5DzIT0cPM https://t.co/YcDAgvTEDQ @BTTBBrack 3 for 3. 👏 @MaiOui77 ❤ @eeinalem ❤ @burdettchris Thanks for joining us. 🙂 @be_shikha 👏 @k_tnca Us, too. ✨ @krisbienforreal Haven't stopped watching. @TomGlanz_UXR 🙌 @DigInclusionNYC 👏 @hearherhere 🥰 Join Kenji Yoshino, NYU School of Law prof &amp; Director of the Center for Diversity, Inclusion &amp; Belonging, as he explores the ways we cover in the workplace, &amp; how covering demands can put undue pressure on those from marginalized communities: https://t.co/CiKvH6okUd #Include2021 https://t.co/2PdVg3oqhw @RobSemsey ♥ Dr. Michael Eric Dyson, Dr. Adrienne J. Keene, and Dr. Balmurli Natrajan provide perspectives on the global nature of the conversation about race in the workplace, happening now at #Include2021: https://t.co/lE7yL7wq5Q https://t.co/oNjCdv8Ulb @taracdennehy US TOO @therealmarcusb 👀👏 @katscorps Thank you ❤ @clinty Thanks for joining us today. UCLA &amp; Columbia Law School Professor Kimberlé Crenshaw coined the term intersectionality to describe overlapping social identities. Learn how different types of inequities can compound, and the ways that they fuel bias and discrimination at #Include2021: https://t.co/Zs9PIRiYv8 https://t.co/zf2b8vtoZw @reneebsanchez1 A great takeaway. @RostiResetEra ❤ RT @Lindsay_Rae_M: Today, we’re engaging in #diversity &amp; #inclusion with intention. #Include2021 brings together global experts on topics l… Being an effective ally is more than just having good intentions. Award-winning NYU Stern School of Business Professor Dolly Chugh joins us now at #Include2021: https://t.co/HNTH5NvniE https://t.co/eYFYjwp2bA To listen, learn, or engage? Tell us why you're joining Include 2021 with #Include2021. .@FredHum, Microsoft CVP, US Government Affairs, on the digital stage at #Include2021. 👇 https://t.co/cgfGzqqJgg Thank you to our #MSPartner Network for making #Include2021 possible. We appreciate your commitment to diversity and inclusion: https://t.co/IoEAmDvmWQ \"At Microsoft, we believe inclusion is a choice we each must make, both on the individual and organizational level. We know real progress doesn’t happen without real work.\" More from @Lindsay_Rae_M on #Include2021: https://t.co/51tNb8zmAb https://t.co/51tNb8zmAb Nick Parker from the digital stage. 👇 #Include2021 https://t.co/OEwqNz6lbM The industry has expanded its understanding of the power of empathy-driven leadership. \n\nOn the digital #Include2021 stage, @Lindsay_Rae_M shares three steps for leading with empathy. https://t.co/Cq5KrkW7jR We've worked hard to turn employee insights into action for diversity &amp; inclusion.\n\nAt #Include2021, @Lindsay_Rae_M shared how we're prioritizing inclusion at Microsoft. https://t.co/rPJ47ZW4ij What does it mean to create a culture of inclusion? #Include2021 https://t.co/pU5SGlS0MY At Microsoft, we talk about the human case, the business case, and the geopolitical case for diversity &amp; inclusion. - @Lindsay_Rae_M at #Include2021 https://t.co/zbx24hXM07 Lindsay-Rae McIntyre, Microsoft Corporate Vice President &amp; Chief Diversity Officer, is speaking now at #Include2021. \n\nJoin the session: https://t.co/LeXTTRd1ON “… this event is an event which, in a counterintuitive way, is about us all being at our listening best.” Microsoft CEO @SatyaNadella #Include2021 \"D&amp;I is a business priority.\" - Microsoft CEO @SatyaNadella from the digital stage at #Include2021 .@SatyaNadella to @DarrenWalker at #Include2021: \n\nWhen you think about business leaders making an impact in D&amp;I, what's one thing you want to see leaders actually do to move the needle faster? https://t.co/7mOjRcZfHV Q: What should managers and leaders be good at? \nA: Model. Coach. Care. \n\n#Include2021 https://t.co/XbUMPDpBWb Diversity &amp; inclusion is front and center. \n\nAccording to @DarrenWalker, what we'll see in the next year is the difference between performative acts and those engaging in the hard work in an ongoing way.  #Include2021 https://t.co/1LHmld7fbH If we want to empower everyone in the world, we better represent the world inside. More than that, we need to include the world that we represent inside. - @SatyaNadella, Microsoft CEO #Include2021 What Darren said. 👇 #Include2021 https://t.co/MNuJhOxau7 According to @DarrenWalker, D&amp;I is a win-win.\n\nDiversity will lead to: \n◾ More success\n◾ Better performance\n◾ Higher levels of satisfaction among staff\n\n #Include2021 Register for the event to catch all the sessions: https://t.co/YTNt9b2dub #Include2021 Tune into the livestream: CEO @SatyaNadella is joined by Ford Foundation President @DarrenWalker for #Include2021. https://t.co/pF7lYtUwB4 #Include2021 has begun! Join the opening session, where members from the Microsoft Global Diversity &amp; Inclusion team will outline how you can make the most of your event experience, and introduce you to the diversity &amp; inclusion conversation. \n\nRegister: https://t.co/BZBl6xMVtJ Acts of hate and violence continue to unfold, including yesterday's horrifying attack on members of the Asian community. We're angry and saddened, and we start today more determined to bring people together across the world to accelerate the work necessary to drive change. Progress on diversity &amp; inclusion requires us each to examine our attitudes, decisions, and our perceptions. And then we must do the work. #Include2021 https://t.co/2iUJlpZ1HO RT @MSFTIssues: The main obstacle to diversity &amp; inclusion is the lack of awareness. \n\nGet ready for #Include2021 by exploring the ABCs of… @JvDuijvenbode That sounds familiar ... @Brokenvegetable 😂 @Mercedent Can't argue with that logic. @early20smind Fair enough. @webrendyn 📝 @jamesmcroft Impressive! @JenMsft Touché. RT @Lindsay_Rae_M: Tomorrow, @Microsoft will host #Include2021, bringing together global thought leaders for a free, digital #diversity and… If you miss a meeting that’s being recorded, do you actually watch the recording? Asking for a friend. @GlenMitchell1 You go, Glen Coco. @Iamakshaypillai You're on mute. @bhandary_chirag Wowwww. @raidergirlchell Whale hello to you, too. 🐳 @ScottRGross Anytime, Scott. @Millicom 👋 @samvardhansingh So far so good. 😎 @toddjmercer Doing well, thanks! How about you? @nicodevitalia Ciao. 👋 @SEProtomartyr Can neither confirm nor deny. @thomasjo Yes. @Snow90K A strong opener. @animalc95546667 ❤ @film_girl Nm, hbu? RT @satyanadella: I’m looking forward to my conversation with @darrenwalker and learning from the many other speakers at #Include2021 Wedne… @WindowsFrance Bonjour! 👋 By the end of this century, two-thirds of the snow and ice in the Hindu Kush Himalayan could be lost because of climate change. 🏔\n\nDiscover how our #AIForGood Research Lab is working to track the effects with data: https://t.co/eF3fgh3UUa \"The Power of We: A Sesame Street Special\" features Elmo, Abby Cadabby, and friends, as they learn how to become “upstanders” to unfair treatment based on skin—or fur—color. \n\nMore on the special: https://t.co/QCKA8yYYlD https://t.co/nqPwoKPpUv Sesame’s newest Muppets are twins to be featured in groundbreaking Rohingya-language content—part of Sesame “Workshop’s Play to Learn” program supporting children displaced by conflict.\n\nMeet Noor and Aziz: https://t.co/4Y3W0ZHEWc https://t.co/n4WNCLlSlj .@SesameCommunity support for the caring adults in children’s lives help s provide the best start in life. Browse activities and tips on tough topics like parental addiction, COVID-19, divorce, and more: https://t.co/qx4AfIWIkO https://t.co/Jx55l6uZ4Q Sesame Workshop - Everyone's Street. Learn more about the nonprofit behind Sesame Street—a community built on diversity, equity, and inclusion, where people come together on a mission to help kids grow smarter, stronger, and kinder. https://t.co/oRRFeQITM1 https://t.co/3bThP4qxZj Join Microsoft's @chriscapossela, @SesameWorkshop's President @SherrieWestin, and EVP of Creative &amp; Production Kay Wilson Stallings to explore how storytelling helps kids everywhere grow smarter, stronger, and kinder. Register now: https://t.co/xGgfyPwMiO #Include2021 https://t.co/f9yfd7XDme Hi. PBS NewsHour reports as part of their Race Matters series, featuring Nicole Turner-Lee, how the pandemic has put millions of students with limited broadband access at risk of falling behind.\n\nWatch: https://t.co/fBuU0fZq7K https://t.co/9kUvCVndxN In this Brookings Cafeteria podcast five-part series, John Hudak, senior fellow in Governance Studies, explores the facts and tackles the myths that underpin the immigration policy debate. Explore the episodes: https://t.co/H43Epf2G1n https://t.co/0D14e9ZRV2 In this episode of the Brookings Cafeteria podcast, @CamilleBusette shares insights on how social networks in four American cities impact social mobility, and what that research says about social networks by race, gender, and income: https://t.co/P19AxIJEmB https://t.co/EJ6tIBE9EF Join Microsoft's @BradSmi, Brookings President General John R. Allen, and Senior Fellow Dr. @CamilleBusette as they share how @BrookingsInst uses research and insights to inform their work on race &amp; inequity. Register now: https://t.co/oL9BwYMJCF #Include2021 https://t.co/lQrvMRbAVp \"We knew we wanted our new campus to be zero-carbon in its daily operations, so we had to think outside the box.\" - Katie Ross, global sustainability lead, Microsoft real estate.\n\nCheck out the new Thermal Energy Center at Microsoft's Redmond campus: https://t.co/wWsQQ1PmKJ #Include2021 kicks off in just 24 hours. ⏰\n\nRegister to take part in this free, all-digital event focused on diversity &amp; inclusion: https://t.co/305GqS7Ota https://t.co/QL0PBMBcNw RT @Xbox: You don’t need a Vibranium shield to be a hero. Admittedly, it does help.\n\nExplore @XboxGamePass on Xbox #SeriesX and #SeriesS th… More than two million NHSmail mailboxes have moved to the Microsoft Azure cloud.\n\nLearn more about their vision for cloud-first healthcare: https://t.co/EvhoSE9RtH ☁️ Real progress doesn't happen without real work.\n\nJoin us for #Include2021, a free, global, digital event focused on diversity &amp; inclusion: https://t.co/wXnFXuJFDw https://t.co/KvhVw1ZjXV Plastic waste contributes to 80% of marine litter. One startup is using #AI and blockchain technology to combat that fact. \n\nLearn more about the #AIForGood Challenge winner, Carbonbase: https://t.co/bO9WA1jPqn RT @MSFTIssues: We’ve seen the power #AI has to accelerate health research. 🖥️ 🏥 \n\nLearn more about the progress our #AIForHealth grantees… Join us on March 17 for #Include2021, a free, all-digital event focused on diversity &amp; inclusion: https://t.co/QnPCrH9b99 Word of the day: https://t.co/of9E7uoJaP How to address the surge of anti-Asian hate crimes: https://t.co/k6ftnDA1GF We’ll continue this conversation by opening our doors to the public next week in a company-wide diversity &amp; inclusion event where we’ll learn from external experts in the field. We invite everyone to join us on our journey: https://t.co/Woi19nRsOf Learning Together during Challenging Times: https://t.co/lA0cJrBEDS COVID-19 and advancing Asian American recovery: https://t.co/hJiAcZ0QaP A readout of the Department of Justice’s efforts to combat hate crimes against Asian American and Pacific Island communities: https://t.co/KiS4xrVZHA Microsoft condemns hate, racial discrimination, and violence in all forms. #StopAsianHate https://t.co/RIVsoLxiv7 @QueenieKris Great names. @travis_orozco Understandable. @RupanjanaDutta 😂 @slecnapancelka Where is the lie? @janeyalliso_co Bailey runs the home office. @matt40k We do. ❤ RT @Xbox: #XboxAllAccess Is Your All-Inclusive Pass To Xbox\n\nLearn more: https://t.co/nwHXAawbfL\n\n#BethesdaJoinsXbox https://t.co/t0s8L4PdRH @ibmrwhite Pass this on for us: ✋ @KazVentures Onward and upward, Holly. @StiggyBroChaCho ❤ @ELLZ54348178 No. We LOVE him. @jadezonedd BEANS. ❤ @ConsciYashhness 😍 @ItsReallyMyName Aren't we all. @D1Strunk 😂 @JennDavisSharp Same, Felix. @TAlfred12 \"Puppy\" is a state of mind. @jamieyates We see what you did there. @margot_peterson The skill. @thecat438 😹 RT @judsonalthoff: .@Microsoft is collaborating with @Total to further both of our companies’ net-zero pledges. #DigitalTransformation #AI… @Simplyhussam 🐝 @TheCulturePearl Pawsitivity is key. @_s_hari 💤 @AbreuuMatheus Facts. @BrianHackney Oh, to be Amos. @tamstar1234 Same. @AasifAbdullah Wild One. @GlaucoDamas 😭❤ @yuri_flexa Both. 😂 @SGRiverDan Any dog can be a lap dog. @louan_visser Happy early birthday, Max! @saralobkovich ❤ @AlexBlount This is amazing. @thatzanimefan 🐍 @YooHoodY We're the fan. @Benjamin_Mateos He made us smile, too. @DedsAltheman 💚 @kirsten Who could resist? @DrewZilm @Xbox 🐿👀 @ekston @jhochwald @JenMsft 😂 @LundbergBjorn A well-deserved rest. @Worrelpa Look at this loaf. @HumanVanguard Rude but also cute. @DamoBird365 🐔🗣 @BertieBrink That's perfect, thank you. @Jess_Wicklund 😍 @Noctury_ 💚 @Spongeym 🙌 @gannonbreslin 🤩 @ArielSam924 Incredible. 😂 @FrontlineRabbit Love to Athena. ❤ @Bithie We love the enthusiasm. Understanding builds empathy. \n\nJoin us on March 17 for #Include2021, a free, all-digital event focused on diversity &amp; inclusion.\n\nRegister now: https://t.co/DZRP2diO5H https://t.co/2k9CW3qyi1 @chrismarkham_ We understand. @ShawnReynolds_ Called out. @theMMB 🚀 @Xbox *wipes tear* How it started          How it's going https://t.co/I7bZwWvwHd RT @XboxP3: Excited that more players around the world will be able to discover 20 beloved Bethesda games in Xbox Game Pass tomorrow. Most… @yinzerjay80 Looks familiar. @SuperpopfizzYT 💞 @KatSphinx_ Sending love to Bella. 💜 @zoe_bowens ❤ @monkeypuzzle 🐔 @MiStudent41 All the better to hear you with. @jcs98177 Oh, Shadow. ☕ @leestar81 😂💤 @hawka_flocka They are. @Pixelaffe 😍 @AA_priceless Pepper said \"no more work today.\" @5Sweetnlo He's stolen our heart as well. @chri1sw4de 💕 @LuciaMaria83 Merlin Arthur, lord of teefs. @hughes12364 She is an icon. @Estrella_31 ❤ @ferclevs So much fluff. @SkyeTheWeeb 😂 @bitsourceky Sometimes we nap under our desk, too. @MermaidenSea Love this action shot. @SQL_Gal Best WFH buddy. @CybernettX Chilling in a box, as one does. @BurstOrangeTech Hi Popcorn. 🍿 @MissHoadley 😂 @BrianHunt04 Doing his best! @Dragos2305 Noni deserves a treat, or several. @filesamury You win best name ever. @AutumnSchuman This cake. 😂 @rossochs *mlem* @ActualCassandra Hello sweet Yumi. @yooniverse_art 😂 @edbaker1965 👋 @erlaxs Hi Cheeseburger! 🍔 @krngml Lives rent-free in our hearts. @EmsterBuzz \"Please, no photos.\" @All_Mike__ The bowtie though. @noobsita453 We would be too, tbh. @paulbright7 Doug. ❤ @mattkirbylondon 👑 @thekarachikid Samosa is all of us. @Warhans_ Hi Sushi! 🍣 @pina_me Absolutely. 🐉 @SrHombre *derp intensifies* @rssingh001 🥳 @kenji_yoshino @StephanieCreary @AlphonsoDavid @ebriceno8 🖋 Co-founder and partner\n🧠 Business psychologist\n\n@Binna Kandola studies gender bias and unconscious bias in organizations—and he'll be at the all-digital #Include2021: https://t.co/pHP5vLnmVk https://t.co/0AAPqTXA3T @vekzdran Lily has a very important job. @Jeff_Maw Ruh roh. @mattyboy182 Smoosh. @cnrdzn Relatable. @JoshSysAdmin So fashionable. @CDLHamma 10/10 adventure buddy. @UploadSurgery 😍 @lisaschell_ We like turtles. @Hyperkin Wait a minute ... @Benjamin_Mateos A good boy. @Ginger_Graham We appreciate the time, Diesel and Lili. @IvanAtBaja Mood. @keiruuuuh Please tell us they're best friends. @Darthspidey117 😍 @BeagleMaster7 Hi Max. @cashewshideout ❤ x 3. @Meganisrad *gives boop* @ChristianJWhite Hello, Pepper! @Aaron_88 ❤ @davethegeek Angels. 😻 @Crazygamer360 😍 @tamstar1234 Well it is Thor's day. 😏 @CrucialMemory 10/10 would want Royce on our team. @daveberning So distinguished, so refined. @akshattak You're best friends now. We don't make the rules. @TempleOfFive 😂 @sam_mcdevitt MONTY. ❤ @liberaotoiin We love them too. @jonnychipz Tell Luna we say \"woof.\" @the_jamilah Hello, Handsome Hank! @RossRichendrfer So cozy. 😍 @DecryptedGamer Goals. @GillTheThrilll Nails painted? @rorypreddy Plants count if you say they count. 🌱 @ZaccaryVega Balance is a 10/10. @dulciedarling1 Can Daisy lead every meeting please? @Haut3Sauc3 Taking naps between calls is self-care. @pelirroja_jenn Wrennie is one of a kind. 🐾 @Xbox Thanks fur trying. In the first year of our commitment to becoming carbon negative by 2030, we reduced Microsoft’s carbon emissions by 6% or roughly 730,000 metric tons.\n\nCheck out our climate progress report: https://t.co/3WBNnbJaHm Please share pictures of your pets in our replies. ✅ Virtual care is here to stay\n✅ Innovation will continue to shape healthcare\n✅ Balancing innovation with security, privacy, and compliance is critical\n\nLearn more about Canada's #healthcare learnings for 2021: https://t.co/wvIcDZMHOW @implicitazhar 🤯 @jaydestro You hear what I said, Ton? @sxmchxng 🙌 @honorcow \"The latter.\" @jkline120 You're welcome. @Wezzer1993 *sigh* @PrivacyTutor_ We've come a long way. @JoeBeernink 🔮 Breakout rooms, Tasks publishing, Approvals, and more. ✅\n\nNew features in Microsoft Teams are making it easy for everyone to engage and connect. \n\nHere's how: https://t.co/bw3BTiiSP2 @jacksinboston Now that we're all gathered ... @RubyCorgi 😍😂 @roguebogey *swoon* @JenMsft Exactly. @RmTux Thank you, Rami. ☺ @msWordExpert Very precise. @talktodarrell ❤ @sethjuarez Always embrace the awkward. @BadonkaDoge CLICK @cathusmax Did it work? @miabollandx It's called \"fashionably late.\" @SatelliteTracy What did the cat do? @Purple_Jas_x Yes. @Quntry_mouse It's a power move. @clarkesince91 You're doing great, Lauren. ✨ A free look into the future. https://t.co/whLb4iDXTv @golden_daylight \"Duckies\" ❤ @bebunchful 🙌 @JAYCVM Works every time. @msajolliffe @coreyhughesICT 💨 @sarrahghazal Oops. @m3sweatt Good point. 😂 @annie_parker It's the polite thing to do. 👋 @rkaur526 Life moves fast. @Y2SHAF Every day. @WrightDW There can only be one. @Windows 👋 RT @MSFTIssues: Supporting nonprofits that serve Black and African American people. Helping people get broadband access. Bringing in more B… \"During my hour-long meeting in Microsoft Mesh, I constantly felt like this could be a far-future version of Microsoft Teams.\"\n\nCheck out @verge's take on our latest announcement, Microsoft Mesh: https://t.co/p4B1Lu42nE #MSIgnite That moment between when you say goodbye and actually click the “leave” button. 😬 Kriti Sharma created a solution using #MicrosoftAI to support women at risk of domestic violence. \n\nRead more about how AI can empower the next generation of women who want to make the world a better place: https://t.co/UASV74HZd5 https://t.co/MTfsPqMEm3 We’re listening, learning — and more committed than ever to our efforts to foster racial equity, both at Microsoft and in the communities we live in.\n\nLearn more about the progress we’re making in this journey: https://t.co/4KsOy4cHOy @threddyrex Yes. ❤ Thank you for checking in. @sixnfive @surface 😍 @kidnoble 😂 @loverme_justin Agreed. @JoshH520 Always. 🐾 @funkstitch Sometimes we need a change of scenery. @LunchWithALens It's *stays on floor* for us. 😂 @ThisIsIlse The best possible kind of plot twist. @stevelatta1701 ❤🙌 @heygarrett Sometimes it's like that. @Meganisrad We appreciate it, Megan. RT @Xbox: You know how many game releases you’d miss if you didn’t exist for 5 years? A lot.\n\nDive into 100+ games with @XboxGamePass on Xb… @lillydancyger 😂 @Sirlam_ ❤ @NickErebia We're honored. @BrettAndrewW 😎 @aiddya It's too real, Ashanka. @MayoAHernandez2 Ruff call today? @jaydestro Thank you, Jay. 🥺 @FlashFerret 👀 @BrewingTalent We would never. Join us on March 17 for #Include2021, a free, all-digital event focused on diversity &amp; inclusion: https://t.co/YeKnzqnkzF Word of the day: https://t.co/E5bTRaLsiw RT @satyanadella: Welcome to the team, Bethesda! Looking forward to how together we will further our ambition to empower the more than thre… RT @MSEurope: Reimagining business: an interview with @Microsoft CEO Satya Nadella https://t.co/Gx1iHQxouT via @FinancialTimes https://t.co… @BagelBites 👀 @redbox We see you, Redbox. @NickErebia ❤🙌 @chrislongview 😂 @ImJattala Beautiful. ❤ @jonnysun Now I'm falling asleep ... @Xbox 🥳 @aebyeg Bold move. @ergosteur One can dream. @sinclairinat0r 👋 @BagelBites Exactly. 😂 @derekmross 👀 @Emojipedia 🗣🙌🤖👀💾 @yallstari 😂🤫 @_laurenkellyy Facts. @hinx 🐱🗣 @blakedailey It's the GIF that keeps on GIFing. @camrynmorrow @UCStudentGov @UCWomensCenter @ucAACRC @UC_Global @UC_EPS @UC_LGBTQcenter @Holla4Chawla @jan4sal @hicksforsenate @BFA_UC 🤩 @NsovoNHappiness Don't be shy, share with the class. @adamfergusonart @thisislux 🎨🙌 @anthonypjshaw @shanselman 👀 @GirlSecurity_ 👏 RT @Xbox: We've always been fans, but now we're family.\n\nWelcome to Team Xbox, @bethesda 💚: https://t.co/wzgWm20Ndp https://t.co/4f6MprUeXn *unmutes mic*\n\n“Thanks, everyone.”\n\n*mutes mic*\n\n*signs off*\n\n*lays on floor* Let's hear it for our incredible educators who are using technology to make school feel as “normal” as possible, under very abnormal circumstances. 👏\n\nHere's how they're doing it: https://t.co/spanq9c4mQ @kenji_yoshino @StephanieCreary @AlphonsoDavid 🔊 Global speaker\n🤝 Workshop facilitator\n🧠 Growth mindset leader\n\nEduardo Briceño (@ebriceno8) is joining us at #Include2021, an all-digital event: https://t.co/oljOG8BmS8 https://t.co/68zhDouw2w We’re honored to be highlighted in a new @wef + @scuethics case study series focused on how companies incorporate ethical thinking into the development of technology. \n\nExplore the case study and learn more about our #ResponsibleAI efforts: https://t.co/fRcAfpSrhO When you notice that you’re listed as “optional” for the afternoon Teams meeting. 👀 RT @MicrosoftEDU: Happy #WomensHistoryMonth! This year, we’re celebrating with a new series tracing the legacy of female firsts across a va… You can now see Microsoft’s Annual Sustainability Report come to life in a #Minecraft town. \n\nDiscover the free Sustainability City Map designed to encourage environmental stewardship: https://t.co/sEQp1nGIDn 🌲 RT @MSFTIssues: It's crucial that those who can, do. \n\nLearn more about @Microsoft's mission to become carbon negative by 2030 &amp; its $1 bil… RT @satyanadella: It’s fantastic to see how businesses in every industry are using Azure Arc to simplify hybrid management and run Azure se… RT @PlayCraftLearn: It's #InternationalWomensDay! Celebrate with two new lessons for #MinecraftEdu. Travel to Pakistan to help Malala rebui… 📍 Shanghai https://t.co/HUybBWcOM2 @liliasjillian 🗣🙌 @katzmandu 😳 @neko_designer 😂 @WizardIF 👀 @totitolvukall We've come a long way. 🐱 @GuidoKerkhof 🙌 @astriaren We understand. RT @Xbox: Xbox is honoring International Women’s Day and Women’s History Month with a continued commitment to empower women in the gaming i… \"Microsoft's new cloud-based AR/VR platform will beam people into your world, and vice versa.\"\n\nGet a deep-dive look into Microsoft Mesh with @CNET: https://t.co/ODNtFPvfNk #MSIgnite You had to be there. https://t.co/9oip3OIOKT Learn more about the women who inspire us: https://t.co/lOEVPPJse5 When women achieve more, we all achieve more. This International Women’s Day, we’re sharing the stories of women who are shaping society for the greater good. When it’s her, it’s us. #InternationalWomensDay https://t.co/aQhLI15o9V New Microsoft Teams for Education features are here to help you and your students \"spring\" forward. 💻\n\nLearn more: https://t.co/0II3sTpEfe @AFu_ 😂 @LuiseFreese @Grammarly Thank you. ❤ @crrystalvisions Uh oh. @shanselman Whoops. @CB_1878 😂 @jelli__123 @BeccyWoodTV *mlem* @JohnELandry A budding professional. RT @MSFTEnable: Exciting capabilities are coming to @MicrosoftTeams — more flexibility in how you participate in meetings, voice commands,… @ryanrross Don't forget the popcorn. 🍿 @LuiseFreese @Grammarly ☺ @quantumudit The future is now. @jkline120 It comes in handy. @dcschuitemaker Well done, Dirk. @luckyokko 👑 @Dkamps18 Very clever, Danny. @the_jamilah 😂 @_JoshuaTimothy 🙌 @windowsinsider 👀 Register now for #Include2021, a free, all-digital event focused on diversity &amp; inclusion: https://t.co/2bsxn8Ne1A @ComputerScience Our thoughts exactly. Are you registered for #Include2021?\n\nYes           No          I am now!\n 👇             👇                👇 Do your best work - no matter how you work. \n\nCheck out how we designed #Windows10 in cloud configuration to help: https://t.co/UJtiglQhaX ☁️ Ctrl+Shift+Esc @fettwalp Thank you. @rakeshsatyal 😱😱😱 RT @gavriels1: Inclusion is about all of us. But how do we accelerate the work necessary to drive meaningful change?\n\nJoin us for @Microsof… @LucasEduardoMe7 Chaos ✨ @Norman748 Wow, Norman. @JasonJonesLives 👋 @Grammarly Surprise surprise. ❤ The newest Microsoft India Development Center, inspired by the Taj Mahal. 🤩 https://t.co/ujLeQBd5Xw Does this bother you? https://t.co/wAo6ZvPIst RT @Microsoft365: Over the last year, the way we work has drastically changed. We continue to be inspired by how our customers have grown a… @matink No. ❤ @Awritesinger Happy #WorldBookDay. 📚 @CatStolar 🤩 @radiatorcat 🐱👒 @UtdEddie You're a ⭐ @SuperMarielle_2 😂 @Beauchampssch Nailed it. @garetheve @Minecraft This is amazing! 👏 @doctorrah 😳 @EarlTheFlamingo Inbox zero &gt;&gt;&gt;&gt; @SSantos26680416 👀 @c_howard_91 It was worth a try. @deltanr1 @_achu @lauriepottmeyer @alliewiz13 @stephenlrose ❤ @DxnLFC_ Word. RT @MSFTIssues: Hook, line, and sinker. How can you stay safe from a potential #phishing scam? 🎣\n\nLearn from our step-by-step guide below… @bdsams 😏 Jackie Robinson was a powerful force of positive change, altering the landscape of sports and the world forever. ⚾\n\nCheck out the cover of MLB The Show 21: Collector’s Editions honoring him: https://t.co/CsqWsTCZxO 📢 Coming soon: collaborative mixed reality meetings from anywhere. \n\nLearn more about Microsoft Mesh: https://t.co/XuPnB7CHF8 via @TechCrunch #MSIgnite “Just bumping this to the top of your inbox.\" @steinekin @EthanRothamel 👀 @BentleySystems @CollinsEngrInc @MnDOT 👏 @GetFlexSeal Much appreciated, FlexSeal. @RyanHamze 🙌 Technology should help you stay focused and productive, not distracted.\n\nCheck out how #Microsoft365 mobile apps and services are evolving to help you live and work better: https://t.co/J7R3Wl0TVJ RT @Lindsay_Rae_M: Later this month, @Microsoft will host #Include2021, an extension of our investment in #allyship. As this article points… @francesdonald Whoops. @ElliePursey 😂✈ @acast_94 😂 RT @Microsoft365: From learning about advanced calling capabilities in Microsoft Teams to empowering your frontline workers, don't miss all… @mim_s_b 😂 @akipman 🤩 @jaimevelez @MicrosoftTeams 🙌 @reddit So long as the vibe check was passed. @joshisasoftie We're here for you, Josh. @MayoAHernandez2 This is a mood. @kurtiscorrect We needed that. @jonnychipz Doing well, thank you for asking. @Dajimoto Said the office chair. @miggyp123 It's us. @BlutRegnet We have questions. @tcmoysak 🙌 @ClementSharleen 😂 @jenkuntzGP Thanks, Jen. @rparker6112 A classic mixup. @seyitaylor ❤ x 3000 @XboxAmbassadors We've got you. @tomwarren Exactly, Tom. @wingstop Anytime, Wingstop. @legsidelizzy Trying to un-slump. @htcvive You're welcome. @BagelBites 🍤 @ComputerScience Proud of you. @annefleurdd ❤ @Reichental Thank you, Jonathan. ❤ Your Microsoft Teams starter pack. https://t.co/nkxttx9eGh @kenji_yoshino @StephanieCreary ⚖ Civil rights lawyer\n🤝 LGBTQI+ advocate\n🏛 President of the Human Rights Campaign\n\n@AlphonsoDavid will be joining us as a speaker at #Include2021: https://t.co/cKEkHuABAt https://t.co/TD1W1hbCxc Join us on March 17 for #Include2021, a free, all-digital event focused on diversity &amp; inclusion: https://t.co/vSdJG2ID74 Word of the day: https://t.co/i61O9fG6q2 .@akipman describes the making of the #MSIgnite mixed reality keynote and launch of Microsoft Mesh. ⬇️ https://t.co/6LA8Tnabek Posture check. RT @MicrosoftTeams: New features in Microsoft Teams make presentations more dynamic and meetings more engaging: https://t.co/IsPC2errTS #MS… @_JonDouglas You're welcome. @MISSDXCN The perfect day! 🙌 @VirtualisedReal 👏 @dr_katon @LisaCallegari @andsbossi Meetings will never be the same. 😂 @MikevZ @akipman Glad you enjoyed it, Mike! @vbandi @akipman You're welcome. 🤩 @Lady___Lovelace ❤ @mkashman @satyanadella @akipman @HoloLens You never know what will happen at #MSIgnite. https://t.co/OAH6B0gJ4A RT @satyanadella: Introducing Microsoft Mesh, which enables people to interact holographically with others, with true presence and in a nat… For #AI to benefit everyone, it must be developed and used in ways that warrant people’s trust. \n\nCheck out how we're putting our principles into practice: https://t.co/24KZuqE3VE RT @ToniTWhitley: Thank you, @MalaAnand_ for sharing your story of leadership and empowerment - reminding us that we each have a part to pl… RT @satyanadella: A cloud built for the next decade https://t.co/JAMiZvq5pM RT @ramonlaguarta: As we work to digitalize @PepsiCo end-to-end, we've partnered with @Microsoft to leverage #AI in pursuit of even more co… RT @azuread: With the general availability of #passwordless authentication in Azure AD, employees will no longer need to use a password to… @holgermu 🐟 @holgermu @satyanadella 👀 @JoannaStern 😂 @anoushk77 😎 @MichaelGillett We won't tell. 🤐 @seahawkin So comfy! @74type181 🏆 #MSIgnite unlocked ⭐ @harnoor__ We'll let everyone know you said so. @bpcs_tech ❤🐶 Normalize giving time back. @theguyonstage 🎶 @maddiexcampbell ✨ @Mostafa_fareed You are most welcome. @ArmaniMikel Thank you, Bobby. @Makovsky2 You get it. @walkology A true Piscean. RT @NianticLabs: We’re thrilled to collaborate with @microsoft &amp; @hololens on new experiences that will weave together the digital and phys… RT @MS_Ignite: #AutonomousSystems are no longer science fiction or expensive moonshots. Customers like @PepsiCo + @Bellflight are driving b… RT @satyanadella: As the world recovers, it will require much more from the cloud to address our most pressing challenges, and ensure nobod… Thank you for attending the Envisioning Tomorrow keynote from @MitraAzizirad at #MSIgnite. We are excited to learn where your 'what if' takes you: https://t.co/aysHLqLn51 https://t.co/v5v6B6ynhi The latest AI breakthroughs in algorithms and computing enable development of massive scale models that will jump start a new breed of applications. #MSPartner and customers like @AvePoint use this technology to create engaging experiences. #MSIgnite https://t.co/8aHi4Xjguj What if you could use AI to identify which patients are at risk of stopping their HIV treatment? Meet Dr. Sargent and Dr. Darkoh who have dedicated their lives to transform healthcare systems with AI: https://t.co/jy1HgGBLSs #MSIgnite https://t.co/ulEou1vDW6 With #AI, we have the ability to simulate and scale interactions, enabling us to do what was inconceivable before. #MSIgnite https://t.co/nHb6NXRuod At 5 years old, Emily Whitehead was diagnosed with acute leukemia and her doctors tried everything. She was the first in the world to receive an innovative cancer treatment called CAR T-cell therapy: https://t.co/1uPaSVSiAe #MSIgnite https://t.co/qlgjRZ74Fu Advanced technology has made the spread of disinformation easier. Project Origin aims to create a chain of trust for end-to-end authenticated news: https://t.co/LkKGcopotq #MSIgnite https://t.co/PGwiKSvqa6 AI creates amazing opportunities to augment our capabilities, but it must be used responsibly. We're pioneering frameworks, tools, and tech to enhance digital responsibility: https://t.co/dIAUuVP5yY #MSIgnite https://t.co/uFsLtgqHeB Using low-code AI development tools and simulation services on @Azure, any company can create their own #AutonomousSystems. \n\nHere's how @BellFlight uses these platforms to help create autonomous aircraft: https://t.co/KiBxhXqKDb #MSIgnite https://t.co/66dAaMupNx The latest AI breakthroughs in algorithms and computing enable development of massive scale models that will jump-start a new breed of applications. #MSPartner and customers like @AvePoint use this technology to create engaging experiences. #MSIgnite https://t.co/ti3rbwjabn We're envisioning AI that not only frees us up from repetitive tasks but also augments our own capabilities. Imagine the possibilities of this - any field where human reasoning can be taken to a whole new level. #MSIgnite https://t.co/dj4M28aV5X https://t.co/mlu1lNIYJZ All we need to spark imagination is a new perspective – a willingness to break boundaries and look between the lines. \n\nThe most powerful vision of all is how we can use machines to amplify our own human ingenuity: https://t.co/AoHEADksqY #MSIgnite https://t.co/1o8MpkyArc Innovation hinges on our ability to see the world differently. \n\nTune in to this #MSIgnite session with Microsoft CVP @MitraAzizirad to explore how we approach innovation.\n\n⬇️ https://t.co/cLnrh78fd2 @waller_ariana Us too. ♥ @Victorebukaezea 🤯 @diepavan Thank you 😊 @DnsPersson 😂 @okonkwo_odera 👍 @Kenn_Kaii 💪🤖 You weren't expecting trippy music around the bonfire, were you? #MSIgnite https://t.co/PBJpmW692v RT @satyanadella: Announcing exciting updates to Microsoft Teams, ensuring people can collaborate inside and outside the organization, lear… RT @TommyLee: Cynicals: I wish Microsoft would do something different and not the same old keynote...\n\nMicrosoft: Hold your breath...\n\n#MSI… We're committed to enabling IT developers, implementors, and leaders with the platform and tools they need to be ready for the next disruption.\n\nLearn more about the steps we’re making toward that vision today: https://t.co/bnzBpbNzlb #MSIgnite Learn more about Microsoft Mesh: https://t.co/es68fQMHx0 Introducing Microsoft Mesh. \n\nIt enables presence and shared experiences from anywhere – across devices – through mixed reality applications. #MSIgnite https://t.co/xbyO6trHdS We can't wait to see the world we create together. #MSIgnite https://t.co/OZL4P5JUNq We want to ensure everyone can be seen and be heard and fully participate, whether they are at home, in a meeting room, at the office or in the factory floor. #MSIgnite https://t.co/40cRXQQBf6 We’re building @MicrosoftTeams as an organizing layer for all the ways we work. #MSIgnite https://t.co/CE0nTQv3qZ This is what the @MSCloud delivers, and it underlies everything we will show you this week. The Microsoft Cloud is built to accelerate your transformation today and going forward. #MSIgnite https://t.co/kL5jYwmfET Fundamentally, a technology provider should succeed only when it helps the world around it succeed. No one wants to build technology that rapidly scales, but breaks the world around us. #MSIgnite https://t.co/j2aMcA1RCO We need to create continuous feedback loops between the work, skills, learning, and credentials required both for the jobs of today and tomorrow. #MSIgnite https://t.co/goRT8i9ebM We believe the next decade will require technology advances that radically democratize creation. We'll need to expand access to skills, tools, and platforms, as well as connections and collaboration across communities so that everyone can create. #MSIgnite https://t.co/bpr0O8pAjE In this world, data will be more private, more sovereign. Data governance and providence will take on new importance. #MSIgnite https://t.co/zqvzjYNgSk Every organization – small or large, in every industry, in every country – will require more ubiquitous and more decentralized compute power. #MSIgnite https://t.co/ekQxtUbDXe Over a decade ago, we declared we were all-in on the cloud because we understood its transformational promise and the opportunity it would create for every organization. #MSIgnite https://t.co/YX2jKskMax Your hard work, combined with today’s digital technology, is helping fuel our global economy and society in one of its greatest moments of need. #MSIgnite https://t.co/ZAZvlHS05H Take a front-row seat to our vision for the future. 🔮\n\nWe're kicking off #MSIgnite with a keynote featuring Microsoft's @SatyaNadella and @AKipman.\n\n⬇️ https://t.co/yVvYyEcsnR RT @betsyweber: Counting down the minutes until #MSIgnite  starts with my watch buddy, Rosie. Can’t wait to learn about new releases and mo… 🚨 #MSIgnite is about to begin 🚨\n\nOur all-digital event kicks off in just 3️⃣0️⃣ minutes with a one-of-a-kind keynote showcasing our vision for the future.\n\nTune in here on Twitter to watch the livestream featuring CEO @satyanadella. https://t.co/i8SPCDjxac Ever wonder who’s shaping society today? It’s her.\nCreating, innovating, leading.\nAnd bringing the world forward with her.  Because where women rise, everyone benefits.  And when it’s her, it’s all of us.\n#WomensHistoryMonth\nhttps://t.co/UtpwYpbYpT Real talk. 🎙️\n\nNew settings for voice clips are here to give customers more control over whether their voice data is used to improve products: https://t.co/tcQP0STtTQ RT @msftsecurity: Lies we tell ourselves: “Just one more Ignite session…”\n\nJoin us March 2-4 to learn about our approach to security, compl… Welcome to Pisces season, where Microsoft Paint &gt; Microsoft Excel. @kenji_yoshino 🎓 Identity and diversity scholar\n🔎 Field researcher\n🏫 Assistant professor\n\nDr. @StephanieCreary is joining us at #Include2021: https://t.co/qlC6thXnbx https://t.co/5o9qGrpx6M ⏰ T-24 hours until we're live here on Twitter with #MSIgnite keynotes from Microsoft's @satyanadella and @MitraAzizirad. \n\nLearn more about the event at: https://t.co/4AoKDbYf0s RT @satyanadella: Thank you, @MalaAnand_ for sharing this important reflection to start off our celebration of Women’s History Month, remin… @CazWilliams_ Passion. Definitely passion. @BFLouSarah 🙌 @gillybee66 😂 @sonddyyyy GLENN. ❤ @JessBuildsTech Let Winston IN. @thomashaynes_ This is brilliant. 📚 @Adam_StJacques Beautiful. @StegaNetworks Lies we tell ourselves ... @the_jamilah 🙌 @UryensW 😂 @pagerwho One down, 149 to go. @VersaVejo *takes note*\n\nUnread emails are nobody's business. @KaninDesigns 👀 @nanotek7 Well done. RT @MS_Ignite: Wait… you haven’t registered for #MSIgnite⁉️ There’s still time. ⏱️ \n\nRegister today and fill your event schedule with Keyno… @ErdemErkul The energy we need in 2021. 👏 @XboxGamePassPC Second breakfast is not to be skipped. @jaydestro We do this because we care. How are you feeling? You've hardly touched your 150 unread emails. RT @Lindsay_Rae_M: No one should have to fear for their safety or face discrimination because of who they are. We are united together in su… Fly a drone, make it snow, or challenge an AI model. \n\nExplore how innovation will empower you to transform the world around us in one of our most interactive keynotes ever, Envisioning Tomorrow with @MitraAzizirad: https://t.co/acXh1hGs54 #MSIgnite Fuel targets. Space Warp Rollover. Gravity Well. Hyperspace Kickout. The ultimate Pinball. #RetroDay https://t.co/zSE73llFZY RT @MSFTDynamics365: #MSIgnite is coming. We'll be there, along with Microsoft #PowerPlatform, and we hope you'll join us. Wondering what's… @ArtistModro You're asking a lot from us. @eclecticbones Please share with the class. @butwhyt68749305 Thank you.\n\n-Humans @TechnoCannon Bueller? ... @JasonJonesLives 🦗 @moewinner How about 3? @NicoGallegos 👏 @pcttons That look in the last photo. 😂 @ElJefeDSecurIT 😂👋 RT @JP_Courtois: On March 17, @Microsoft will host #Include2021, a free, global, digital event to gain new perspectives and engage in impor… @paulfabretti You've got it down to a science, Paul. @brandonleblanc An excellent movie reference, Brandon. 😂 📚 Author and professor\n⚖ Specialist in constitutional and anti-discrimination law\n\n@kenji_yoshino, Chief Justice Earl Warren Professor of Constitutional Law at NYU School of Law, is joining us at #Include2021: https://t.co/q4zfi483jo https://t.co/M9dKNnVknd \"Does anyone have any questions?\" followed by the longest 7 seconds of awkward silence. \n\n\"IS ANYONE THERE?\" \"Every company has become a software company, and will be soon becoming an AI company.\"\n\nDive into the new AI Business School podcast with host David Carmona, general manager for #AI and innovation at Microsoft: https://t.co/rGzEfnb5zB @SarahSmallwood Jenny is a mood. @GabbyAHarrison 😂 @IgniteCountdown ✋ @adamboxer1 Did anyone bring hamentaschen? @robin_jb @CEBeaton_SJA Are they best friends now? Please say yes. @thekatrinabean Works every time. RT @satyanadella: Our partnership with @AmadeusITGroup will apply the power of Azure and its AI capabilities to create new frictionless exp… @MayoAHernandez2 Yes. ❤ @nbd33 So handsome, so fashionable! @KarinaGonzlezS9 No, not one bit. @MicrosoftTeams *unmutes*\n\nUs: Please put the dog on camera.\n\n*mutes* @JasonJonesLives Your dog should lead every meeting. @vogueandcode It's literally all we want. @andrewlydiard Who could resist? 😍 @CarlosAFrancoS 🐱😍 @Avanade 😂 RT @MicrosoftLife: As the first Microsoft engineer in Atlanta, Cornelius Parker taps into his Southern hospitality and longtime local roots… The Uncovering Talent model presents a new alternative to inclusion efforts within the workforce. \n\nExplore the report from Dr. Christine Smith and #Include2021 speaker Prof. Kenji Yoshino: \nhttps://t.co/wQpcX8emeM You: I’m going to pay attention to every word mentioned in this Microsoft Teams meeting.\n\nAlso you: Wow, look at how cute my dog is. RT @MicrosoftEDU: Our friends at @MicrosoftStore are hosting a new series based on feedback about what you want! You’ll learn tips to super… @matvelloso Those aren't emojis, Mat, but we understand. @siddhartha_c @Twitter You're too kind, Siddhartha. @fjreed13 Looking now. @oh_auntie Rinse &amp; repeat. @MattLockmon We'll never tell. 🤐 @NickDiLo The rubber duck. 🦆 @steinekin 😱 @atlcanadiangmr Wowwwww. @Cubsfan122112 8? @itsrohanvj Very nice. @cshilt Now wait a minute ... @Peeps40836 Wow, Michael. @MicrosoftEDU Here's a gold star: ⭐ @Hot_Wheels 🏎️💨 RT @MS_Ignite: New this year: Experience the #MSIgnite Keynote in mixed reality through AltspaceVR! Join Satya Nadella and Alex Kipman duri… 📢 We're just a few days away from our free, all-digital #MSIgnite event with live keynotes from CEO @satyanadella and CVP @MitraAzizirad. \n\nTune in here on Twitter, starting at 8:30AM PT on March 2, and register at: https://t.co/kEKwVCt95o “Did you get my email?” @MicrosoftTeams @CocaCola Let's chill, @MicrosoftTeams MirrorHR uses #AI to capture, process, and monitor telltale data for potential seizures.\n\nDiscover what this team has accomplished during their Residency with @MSFTGarage: https://t.co/fPgio7PJwi RT @MSEurope: “My daughter asks me if I could take care of her sometimes, and I would love to, but it’s a little bit tough.” Thobo-Carlsen,… @tomwarren 👀 @SC1_Sam 😂🤐 @KateCarrollCB ❤ @rwmorris *aggressively sends praise* @LakeEffectBro Accurate. @SharonMacks Amazing! @StewartTaylor92 😍 @cyberantiquity 🤘 @threddyrex Well isn't this a surprise? 😂 @XboxGamePassPC @XboxGamePass A coordinated effort. @TooLate2Call Don't worry, it's still in our top 5. @Flipgrid ❤ @ibrahimtecha Same. 💾 @Xbox No 🎮? @OMBHOJWANI_ 🥴 is very underrated. @ejgarajau One down, two more to go. @ShehanThamel You've given us a lot to unpack here, Shehan. @TonyArt95 Well done. @MSFSofficial 👏 @loredo Ah, yes. The three moods. @XPS 👀 @annefleurdd Great choices, Anne. @itsn0g00d It's important to be constantly curious. @licorone We love your commitment to crustaceans. @Emojipedia ❤❤❤ @MicrosoftEdge We would expect nothing less. @a_button117 🙌 @Webroot A truly chaotic combination. RT @jeffsand: Join me for our virtual #MSIgnite conference on March 2-4. \n\n📢 Hear from industry innovators.\n😲 Get to know the engineers and… @MeenooRami 📢 Black History is being made every day.\n\nAfrofuturist illustrator &amp; author, Tim Fielder, climate justice advocate &amp; educator, Kari Fulton, and Microsoft employee &amp; creator of diverse dolls, Khulile Vilakasi-Ofosu, are using technology to empower change. #BlackHistoryMonth https://t.co/opTysdhSrM These are ours: 🎮🙌 💾 What are your top three emojis? Reply with them below. RT @SpecialOlympics: To better show their community what people with intellectual disabilities can do, Kiné &amp; Khady teamed up in the kitche… RT @MSFTIssues: Inclusive hiring programs empower candidates and employees with disabilities and leads to a more inclusive workplace cultur… @Schfooge Hello, hello 🎶 @JayDeeDaz @Harveyadam 👀 @ravontay 😂 @Headspace ❤ @TrumanShoe Impressive. @ruthvelah 🙌 @lauriepottmeyer We feel seen, Laurie. @sbisson 🤔 @JosefTrull Don't *just* say hello. @julierliu Now we're getting somewhere. @HANOFF We'll allow it. @EXCEL *waits patiently for a follow up ping* @_s_hari You're welcome. @Kerrigannn Okay, maybe. @clarkedanny Exactly. 🙌 @JakeAJakeA *waves* @JudeSa69 🤐 @darren_mg Wowwwwwww. @MauroBattellini Was that the plan all along? 👀 @jaydestro 😑 @Halo Appreciate that. @hollidaymode Thank you. @Starboysagi Ok, we're friends now. @TheRegister Wow. @NerdPyle She deserves ALL the walkies. 🐾 RT @satyanadella: This morning, we shared what’s next for our approach to industry, as well as the principles that underlie it. Here are hi… Please don’t just say hello in chat. One Canadian educator encourages his students to use Minecraft survival mode as a tool for writing fiction. ✍️\n\nHere's how Minecraft is helping teachers and students get creative in the classroom: https://t.co/OpDuvNWVZ7 Join us on March 17 for #Include2021, a free, all-digital event focused on diversity &amp; inclusion. https://t.co/CMtQ2e0XT8 Being an ally is not a person's identity, it's a lifelong commitment and practice. https://t.co/7EAgfAOPLs @sandylocks 🤝 Advocate\n✅ Nationally recognized expert\n\n@ChaseStrangio is the Deputy Director for Trans Justice with the ACLU’s LGBT &amp; HIV Project, and he’ll be joining us at #Include2021. https://t.co/3eDT7QOCIi https://t.co/k4v08SjQNR @DivyeshArdeshan Same to you, Divyesh. @Lishanw Been there. @Bravolebrity10 Thanks, Patti! @_Politico45_ 👀 @divinetechygirl ❤ @arminthedoor And the stripy tail was definitely the star of said meeting. @KeepUpWhitMe Not all heroes wear capes. @JoJoTrainers Rookie mistake. 🐱 @jcfallas09 ❤ @Marek209SK Happy birthday! 🥳 @King_Mbaku_ Ouch. @therexlchxndler Brb, going to stare at this GIF all day. @livelovegeek @MSFTImagine 🌟 @ayrotyno 👏👏👏 @trishskee @JenMsft Accurate. @ThePrinceHilmi Sounds like a perfect day. @alistairl We are doing great, Alistair, thanks for asking. @OIMFA Keep up the good work, Omar! @salborkar More coffee always helps. @JoshMLugo *unmutes*\n\n\"Glad to hear it!\"\n\n*mutes* @MubashirAkhtar @MicrosoftTeams So true, Mubashir. RT @satyanadella: Announcing new Microsoft Clouds for financial services, manufacturing, and nonprofits – as we expand our investments to h… @jennaezarik How early is too early to take a nap? 😴 @jaydestro @LearnTV You've got this! @CityofKent Same, tbh. ☕ @adicrazy Word. Stop 🛑, collaborate 💻, and listen🔊.\n\nCheck out these tips on how to stay safe, secure, and collaborative with Microsoft Teams: https://t.co/psDXxpi1cE How are you doing today? Create a better tomorrow, today. \n\nBuild resilience and drive innovation with Microsoft Cloud industry solutions: https://t.co/flqzVhsWPl #MSCloud RT @MS_Ignite: 📅 You can now schedule sessions for #MSIgnite. Check out the full lineup by registering here: https://t.co/xKwggDq3LP @msWordExpert We are all Josephine. @heyalexxx She should absolutely join every 8AM Teams call as your sleeping shoulder parrot/potato-dog. RT @MSFTIssues: How time flies! One year ago we kicked off our #sustainability commitments as a company. Read @BradSmi’s update on:\n\nCarbon… @ChloeCondon @MicrosoftTeams @MicrosoftLife @TheMuppets Can we be Kermit? As remote and hybrid learning continue to be part of daily life, we've learned just how crucial it is to have access to technology. 💻\n\nDiscover why it's important to make technology accessible, safe, and engaging for students: https://t.co/QjWeh13mTu RT @Xbox: Command in comfort. Hear the shots then call them with the Xbox Wireless Headset. https://t.co/r5ExdXsH3O @KristinRaworth What's your favorite? @pineapplepleas 😂❤ @carolksun We fully agree. @SkyquakeLive We vote yes. RT @MSFTIssues: In 10 years we might need to find another source of water.\n\nData scientists at Microsoft have helped develop an algorithm t… @rustyjellybaby With a very special guest. @michmuzz 😳 @MorpheusNI 👑 @MegFutej At this point it's a reflex. 👋 @DrAlexHerron 💾🙏 @Falloutt You're welcome, Jon. @PKXLIVE 🙄 @Idontthinkyous1 Many save. Much floppy. @BhaskaranDijin Woah woah woah. @lounecl It's technically both. @rahulrdas11 Touché. @BenThePCGuy 😂 @Headspace 👏👏👏 @thekarachikid Accurate. @a_button117 Did they ever truly leave? 🤔 @tejuabiolaart 😂 Josephine with an OG setup. https://t.co/PvVjkU6Zll We're on a journey to empower every frontline worker in every organization to achieve more.\n\nHere are 8️⃣ new Microsoft Teams features designed to do just that: https://t.co/QbguihB9y2 RT @MSFTAdvertising: ✔️ In 2020, #MSFTAds and syndication partner @Ecosia planted over 275,000 trees—more than our goal of 250,000—on behal… Do you call it a floppy disk or the save button? Project Origin aims to create a chain of trust between media publishers and consumers. ALT: The future from an alternative perspective.\n\nLearn more at https://t.co/QbnwLrLqgs https://t.co/fxYigWVksC 🎙Podcast host\n⚖ Law professor\n🏛 Cofounder and executive director \n\nKimberlé Crenshaw (@sandylocks) is joining us at #Include2021 as we explore topics like intersectionality, race, and the law. At #Include2021, we're bringing together some of the top experts in academia, law, and social change. \n\nMeet this year's speakers, who will address topics like allyship, covering, intersectionality, and privilege. 👇 RT @Lindsay_Rae_M: Last week, I shared @Microsoft will host #Include2021 to support continuous learning about diversity and inclusion. Buil… @mohamedamineakk ❤ @Breaking70Bars It certainly does. @frozenhispanic_ Mood. @Fledi_ You're welcome. @CrankyOldDad Then we'll consider this a success. @Alan01001011 Thank you, Alan. @DogeLiftOff Wow. @BenThePCGuy Thank you, Ben. We're doing great. @SailorsBen Thank you, it does. @LanceUlanoff That's a start. @brennadactyl Thank you for your honesty, Brenna. @c0mic_sans 👍 RT @Xbox: Let's keep shining a light on amazing Black content creators. \n\nTune into https://t.co/MZRRVcN5jg this week for takeovers by @Gli… The only constant is change, especially in retail. 🛒\n\nDiscover how retailers can unleash the benefits of #AI and machine learning to help transform their business: https://t.co/L63jlmGRtk RT @MicrosoftLife: Akosua Boadi-Agyemang relied on @LinkedIn to share early career struggles. Since then, she’s built a thriving online com… Hope this tweet finds you well. RT @MSFTGameStack: #GameStackLive is back. Join us April 20–21 for two digital days of all things game dev. Pull up for\n• Deep technical di… @vocomotion This is amazing! 🤩 Can you send us a DM using the link below? https://t.co/2zGa6v7GNK @juliahsings Love this! Can you send us a DM using the link below? https://t.co/2zGa6v7GNK @xtina1229 A very important assistant. @livthompson_9 😂 @CraigUntlNytTym It really took things to the next level. RT @chriscapossela: Finding new ways to reach your customers where they are is key to #innovation. Here's how @Hasbro is changing how it de… @AsmaSafi11 Impressed. @Karan_Bale You definitely won. @clarebear73 ☕☕ @TVBadBoy Please elaborate. @00Annnnne 🤐 @JoyOfSharePoint There are two types of people. @Heisenberg369 😂🙌 @TweetsfromSara 👀 @bdsams Sorry, Brad. The sky's the limit. ✈️\n\nDiscover how one company is working to reduce aviation’s climate impact with #AI: https://t.co/VMt2dIaYvK You: I’m going to set my alarm for 6:30AM, 6:35AM, and 6:40AM, eat breakfast, and start my day refreshed.\n\nAlso you: still sleeping at 8:30AM @XboxGamePassPC Or a house. https://t.co/N9YSNMNsNG @Xbox Why are you so trendy? We're envisioning a future where all students have the opportunity to be creative, confident, and optimistic learners, realizing their full potential.\n\nCheck out how we're making this a reality: https://t.co/FX3DlppzIG @JenMsft ❤ @nigelcantweet We would never. @thekarachikid 😳 @Xbox This is art. @amichaelcreiter Saag paneer with naan. 😎 @MSFTImagine 10/10 🌟 @rebafan12345 The best possible reason. @DaCoPilot This reminds me of my coworker. 😁/10 @hannahbaugh Looks like that 5PM/10 feeling. @Karuana We understand. 11/10 @brandonleblanc @Karuana Our new brake pads are really cool, you're not even going to believe it. 100/10 @Flipgrid @annkozma723 13/10 RT @MicrosoftLife: Some of Quita Barnett’s earliest memories include preparing catfish and polenta at her grandmother’s house in Chicago, I… Let’s all take a moment to appreciate this beautiful dish from Microsoft Dining. 😩 https://t.co/t2LSYMBve7 While training for ‘v-shesh’ used to take place in physical classrooms, the company has adapted to remote learning with Microsoft Teams.\n\nDiscover how the #accessibility features are supporting their mission: https://t.co/PTtrHalN0u @Purplepanic13 https://t.co/QCIwBZPVCX @TomKerkhove @GlennColpaert Did a full 180/10 @wedoAzure Self-fives all around. 10/10 @apzyx 🕺🏀 34/10 @pax8 Come for the help, stay for the eyebrows. 12/10 @quirkypsyche We won't! 8/10 @tomtomdegif Us when we see how many of you replied to this. 11/10 @asavioli \"La-zer\" 12/10 @petrdu Thank you for your patience. 9/10 @jaydestro 10/10, capisce? @ThisIsPappi254 Coffee from campus? Always a 10/10 ☕ @thegamebabbler My spinach puffs! 15/10 @VanessaW CLIPPPPAYYYY 150/10 @sarmistha09 Too real. 9/10 @nigelcantweet 🎶 \"Allll byyy myyysellfff\" 🎶 @Alejandromp66 ???/10. Don't ask us why. @MeenooRami We ❤ Dolly. 100/10 @JTKingpin Vote for Pedro. 10/10 @PandaSpacey 15/10 for the round panda. @shiraz 👁 👄 👁 12/10 @jkline120 360/10 @CohenAustyn 10/10 easy. @akr0n1m Been there. 9/10 @EPavlic 10/10 for cuteness alone. @UryensW Ten out of ten cups of coffee. @Graphoniac .@SchittsCreek never misses. 13/10 @TylerChess 10/10 for when meetings get scheduled at 4PM on a Friday. @InvestorSpanish *Nods in agreement* 9/10 @OsmanKareem 10/10. 👀 @AyaanBari We love a nostalgic moment. 12/10 @RickVanover She's a star. 10/10 @yssYSMNyss Much type. Very words. 10/10 @VerheijenRob Lettuce give this a 9/10. @EnidNova A fantastic hop. 12/10 @a_button117 Docking points because this will haunt us forever. 7/10 @St0rmTrper Us to us sending this tweet. 10/10 @Glimjii And party on, dudes. 12/10 @Rubenia_Borge Friday mood. 10/10 @red_on_tour A versatile classic. 9/10 @InvolvedInIt 11/10 for floppiness. @shash_____ It looks like you're feeling nostalgic. Would you like some help with that? @sword_sea Woah. 🤯 @emandfilsworld Fil knows he deserves the spotlight. @MicrosoftIndia 🤐🔇 @BoomBoomBetty Are you saying that spreadsheets aren't exciting? 😱 @saratoning Too real. What’s your favorite GIF? Reply with it below and we’ll rate it on a scale of 1 to 10. The Legacy Project is a virtual gallery honoring Black American changemakers shaping the future with their contributions in business, education, science, sports, entertainment, and more. #BlackHistoryMonth\n\nClick to enter: https://t.co/D9bzKAmBV2 https://t.co/YkEQdx6WEU RT @MicrosoftAU: From nests being totally wiped out &gt; 20,000 baby turtles 🐢 now hatching each season. ❤️ to reveal how. https://t.co/okaIzT… Real progress on diversity &amp; inclusion doesn't happen without real work. We're gathering some of the top experts in D&amp;I for #Include2021, a free, global livestream event.\n \nRegister now: https://t.co/FXSmY82GfT Collaboration, creativity, and Minecraft. \n\nDiscover how teachers and students across Canada came together for a storytelling challenge: \nhttps://t.co/70IC3Hvm9I @haleigh_23b We support this. @ericlaw We'll take it. @beach5girl 🚀 RT @BradSmi: Going carbon negative by 2030 requires us (and other companies) to reduce our scope 3 emissions – which includes the emissions… @aloalabs So true. 😂 @Jay33825898 Same. @el_booogi But at least you'll be having fun. *unmutes mic*\n\n*waits 10 seconds to say something*\n\n*decides not to say anything*\n\n*mutes mic* @Windows @Twitter @Xbox 😬 Approvals in Microsoft Teams. ✅\n\nCheck out what the new feature means for you: https://t.co/IOvNYRgsrz @Twitter If Clippy isn’t available, we’re taking @Xbox. @Underscordd @Xbox Perhaps. @NanoPolymath When will they learn? @LinkedInUK @Xbox Check your email. @__BalbuenaJuan @Xbox Sounds about right. @EspressoHere 😂 @nellafarmsmelon 👀 @MathieuRegan17 🐔 @__llain Snuggles &gt; meetings. @kuns_dimples What's the mood? @MicrosoftDE @Xbox 👀 @Xbox @Xbox @XboxGamePass A likely story. RT @panos_panay: Today Surface Duo is available in more countries worldwide! Excited to see what our friends in Canada, UK, France, and Ger… .@Xbox was late to the meeting today. @triyanshujena Thank you for registering! The event will be live on the event website https://t.co/pPQH4CPEnW and you will receive updates via the email that was provided when you registered. RT @Lindsay_Rae_M: On March 17, @Microsoft will host #Include2021, a free, global, digital event focused on diversity &amp; inclusion. 1/4 http… Understanding builds empathy. \n\nJoin us on March 17 for #Include2021, a free, all-digital event focused on diversity &amp; inclusion.🤝\n\nRegister now: https://t.co/SxVmLA7bic @ahuSidiaZ Hey, we love your tweet! Can you send us a DM using the link below? https://t.co/2zGa6v7GNK @abigailweinberg LOL, Abigail. @XboxGamePass So groovy. @lattefan Tuffy's World. ❤ @matvelloso Too real, Mat. @magbart0n We believe in you, Magy. ✨ @storybysam Looking good! @chey_boogs 💔 @Wendy_Met They deserve all the treats. 🐾 @creepeffect What kind? @Peeps40836 Coming to a disk drive near you. @MassacreMan101 Track one: Save As\nTrack two: Floppy Discos @sqlcheesecake Exactly. @_KeyKoki The floppiest vibes. 💾 @thekarachikid 😂👏 @BevoBexley That's a yikes. @IntelBusiness @intel Away message game 💯 @MicrosoftDE Hallo! 👋 @courtsushi Incredible. 👏 Believing that you can make a difference makes all the difference.\n\nLearn why Ranjitsinh Disale has been awarded the Global Teacher Prize for “transforming the life chances” of girls at Zilla Parishad Primary School in Paritewadi: https://t.co/NR6srzA5md This could be an album cover. https://t.co/1AWJVeC6YX @Avanade 👋 @onelaureldane It'll be great. @ATTBusiness Hi AT&amp;T Business, \nWe're doing well! Hope you are, too. \nBest, Microsoft @SC_1287 Rude. @iamsk1nny 🎨 @megankorosy_ @cschillig @AHSAviatorBand 😂🙌 @courtsushi Did it work? 👀 @CllrNickCook Your dog said it's time for some pets. @TaraMilliken The right GIF is worth a thousand emails. @AliElfilali01 Doing well! How are you? @DiptarshiC You're welcome. @Tazzeat92 That depends. What's the topic? @bkgthekat Hey bestie. @mimistic02 ❤ @paulfabretti You're someone's reason to smile, Paul. @Underscordd Good, thanks! How about you? @yourboysaf As you should. @brandonleblanc 👋 @jeffsand Brb. @bing I was wondering if after all these years you'd like to meet History, made.\n\nLearn more about the first-ever holographically navigated spinal surgery performed at Balgrist University Hospital: https://t.co/FggB42PfSU\n\n#HoloLens2 @jaydestro Absolutely. Hbu? @Headspace Just trying to find our daily zen. Have you seen it? @a_button117 Sup. @calm ❤❤❤\n\n-Our social media manager Hi. RT @CNET: You don't need to have separate Word, Excel and PowerPoint apps on your tablet any more. https://t.co/yeb7pWpBV7 @_CryptoCurator Throwbackkkk. @r_giaquinto 😂 @bookmobility ~Priorities~ @sw_calum FIN. 😍 @Oryxan What's the book of the month? 📖 @Katziotho Same. @heymarynicole It's the thought that counts. RT @Xbox: We're teaming up with some of our favorite streamers to bring you a full week of great gaming action as part of our #BlackHistory… @crazybangles112 Beautiful work. @ArtDecider @bdsams 🙌 @ChloeCondon 👀🎨 @livelovegeek @TheClippy We'll have Clippy's people call your people. @Dylan1Kenobi We see what you did there. @denwilliams_ We approve. Giving is a superpower. \n\nCheck out how @Xbox and Gamers Outreach are sharing the gift of \"wonder\" with children's hospitals: https://t.co/3gsaAzRMOy #WW84 The Art                           The Artist https://t.co/Gli23HTgev RT @MicrosoftLife: A passion that led to purpose, representation and mentorship. Jerome Collins is succeeding. \n\nRead more and listen to Je… A red team and a blue team. \n\nName a more iconic duo for cybersecurity: https://t.co/Cf1kxeYXiI @ShanePage_ We only use one space now. @MillenniumFalck 😂 @veqasbws *crickets* @skinnyloverica Nailed it. @denwilliams_ What flavor though? @StPauliGrrrl We've all been there, Christy. @RuthElleson Happy #PancakeDay. 🥞 @Xbox @MSFSofficial ✈ @chioke_io A fantastic idea. @Underscordd Wowwwww. @EshuMarneedi Give it another two hours. @Laura_Jane_02 You've got plenty of time. 📝 @itsPikakshi You're welcome, we think. @t_nav_ Exactly. @ch9 @nanaabaturkson @mtholyoke @drguthals @msyeseniac Congrats! 👏 Us: Here we go. Let’s do this. Very important paper. Feeling motivated.\n\nAlso us: https://t.co/r9pt6ulSQD The cutest passive aggressive email reminder you’ve ever received. https://t.co/pUIZW0HOyF https://t.co/IKgK9VNmLt https://t.co/MqvrVQ9JoM https://t.co/chd1QggJuD https://t.co/Va7jMqHBmf https://t.co/cGIwBkvzvM Valentine’s Day cards from Microsoft, a thread. *finishes PowerPoint* \n\nTo me, you are perfect. 💕 To: Our Twitter followers\nCc: All of their friends\nSubject: Happy Valentine’s Day 💘 https://t.co/FWiNU8YF4Y Not sure who needs this today, but the most important person to love is yourself. What's one of the best ways to support employees’ mental wellbeing and an inclusive workspace? By accelerating investments in digital skills. \n\nLearn more about the value of up-skilling: https://t.co/Ia04sOVAl4 @dltmurphy 🤘 @jvq_txt ☕ + ☕ 😎 https://t.co/YiA8IuKMt7 Workin’ hard or hardly workin’? https://t.co/kiotQsjZ3A Nurses are heroes. ⚕\n\nDiscover how technology is helping care for those who care for others: https://t.co/DHq5ceylMN @Cannibal 👀 @Fayazansari_ ☕ Would anyone like some tea or coffee? @BrittaniWarrick Please show Dionne. @kteamarsden 🔊🐱 @lukejostins 🤯 @hinadirah ❤🙏 @ChloeCondon 🤗 @ShavonnAlicia Thank you. - young folk @lenchinski Sometimes it's like that. @13minuteslate ❤ @ishverduzco ❤❤❤ @kyranleahy Sounds pretty cute tbh. @PrivacyTutor_ @KELLYROWLAND @msexcel A legend. 🙌 @salmazaghloull You're welcome. 🖤 @AuroraMakesArt @Prickly_Alpaca Beautiful. 😍 @Jesse32306440 😂 @TLeeOnTV What a moment. @thekarachikid 😂 @donasarkar 🔥 The games you want to play that you can't play anywhere else. 🎮\n\nCheck out the exclusives coming to @Xbox in 2021: https://t.co/p7NkJI6PH3 *Mutes mic*\n\nNope, nothing from me.\n\n*Unmutes mic*\n\nNope, nothing from me.\n\n*Mutes mic* Microsoft’s #Airband Initiative, which aims to extend internet access, is connecting people in more ways than one. 🌐\n\nDiscover how it's changing lives for those in rural areas: https://t.co/3MKhXiLRJd @Outlook \"All my best\" @getnorthern 😂 @Claire_Crowley_ A very important distinction. @ltackmann 😂👻 @yvonnenobis 😬 @Caledonia_PS 💕 @DrGRZLY 🙌 @farhanahyasmin ❤ @FalseStream @KELLYROWLAND @msexcel Thank you. @WapoEngineering WHY ARE YOU YELLING? @martian_dru @KELLYROWLAND @msexcel We're literally wishing her a happy birthday and calling her a trendsetter. 👑 To: @KELLYROWLAND\nCc: @msexcel https://t.co/QBepCJzvDO “Atlanta is going to be well-positioned in the next 10 to 15 years to be a tech giant in the U.S. That’s huge.” - Kevin Gooch\n\nLearn more about the expansion of Microsoft's presence in Atlanta: https://t.co/qkiYDkz9Z5 https://t.co/UbfolnMapy @chelsiaworks We believe in you. ✨ @JordanCJanssen You're welcome. @Dajimoto Sometimes. @EvanGriffith__ 👋 @Danlo_24 We see what you did there. @Becky_E_Morris Your cat really said 🤫 @timmarkatos Spooky. 👻 @TweetsfromSara 👀 @count_sudooku_ New day, new you. @meetdux 🍝 What will the world be like in the future, and what role will technology play?\n\nThose are two of the big questions Microsoft researchers aim to solve: https://t.co/FbMJLGpFra RT @msPartner: This past year, the #MSPartner ecosystem continued to reinvent itself and find growth opportunities in a constantly changing… It's okay to decline a meeting. https://t.co/i9WMTAHKDS @MissS_Buck ❤ @moc_rettiwf 😂 @Crazygamer360 ☕☕☕ @mrmiller1972 Sounds familiar. 🤔 @TheFirstGeist What kind of pizza? 🍕 @loverme_justin Of course. 🌮 @garius 😂 @lachaeim ✨ @jaredlouw Time for a snack. @pathogenomenick ~Me~ time. @__HollyPop 😱 @ccarella Meow. Check out these five great features on the free version of Microsoft Teams: https://t.co/lyB2Jdi7cO What's on the menu today? @Serenil Not all heroes wear capes. @LDMurrdawg96 ❤ @ElrondGaming We would have to agree. @KCCKGraphics \"Paid attention\" 👀 @mikeybeeetch This is next-level. @akirakuruwu A mood. All of your favorite #MicrosoftTeams features, now available in breakout rooms.\n\nFrom using Together mode to the Microsoft Whiteboard, check out these tips for the best meetings: \nhttps://t.co/uyjaeIetCg Today’s energy: https://t.co/xWfuTx5RTh The In Culture podcast explores the influence of Conceptual artist Sol LeWitt across the worlds of food, fashion, music &amp; fine art, with guests including Eleven Madison Park chef and owner Daniel Humm and the fashion designers behind @proenzaschouler. \n\nListen now: https://t.co/edslPUTXli @jacysmith 🐔 @moneyrumble *✋* @ComLinkReid LENNOX. ❤ @samstuesser Thank you, Sam. @EXCEL You're too kind. @xboxse Tack. ❤ @Emojipedia ❤😊 RT @MSFTIssues: On #SaferInternetDay take our Digital Civility Challenge:\n \nLive the Golden Rule ☝️\nRespect differences 🤝\nPause before repl… Tech-oriented jobs are expected to increase nearly five-fold by 2025.\n\nLearn more about how our skilling initiative prepares people for the jobs of tomorrow: https://t.co/GX28lW3iGY RT @MSEurope: Mixed reality is augmenting how medicine teaches, practices, and achieves positive patient outcomes. Explore how: https://t.c… https://t.co/thpY6IvG6z “I really think mixed reality will be used in the operating room for so many things in the future,” says Dr. Bruno Gobbato. \n\nSee how doctors are using HoloLens to revolutionize surgery: https://t.co/KmeMeRThH3 13 surgeons from 13 countries will perform operations with #HoloLens2 during this 24-hour #HolographicSurgery event. \n\nHappening now: https://t.co/VH9dC1KNac https://t.co/WMLeWJPC95 @MarkPlant Excellent photo quality for someone making the jump to hyperspace. @hekili808 Brilliant. @rohithasrk SMH. @ethan_planet Sometimes it's like that. @baran_jeff 😂 Families who game together make memories together. 🎮\n\nCheck out all the reasons to play as a team: https://t.co/WyOJpMpoAn @sims4vampire True friendship. 🙂 Your favorite WordArt says a lot about your personality, or so they say. https://t.co/z6F94SrjLa Tired: *interrupting*\n\nWired: *🤚* @hannah_Digi17 The ghosts of meetings past. 👻 @jigsha @MicrosoftTeams Love that for you. Today is #WorldEpilepsyDay. \n\nDiscover how technology is helping patients receive diagnosis and treatment faster: https://t.co/aFMn13kge0 You control your time. https://t.co/GVqhcYPrEw RT @MicrosoftLife: At a time when most learning has transitioned online, Shy Averett, Community Program and Events Manager, wanted to creat… “Employee experience should have always been a priority, but when you're remote in particular, you want to be staying engaged with your business and your company and its sense of purpose and mission.”\n\nMore on Microsoft Viva from Bloomberg @business: https://t.co/IRzVvBJXbR 💚💚 https://t.co/qSdFnWw8Cj @NerdPyle 😂 @patrick_tmc *mutes chat* RT @Microsoft365: Introducing Breakout rooms and Approvals in Microsoft Teams. Ready to learn more? Get the latest on the Microsoft 365 blo… RT @satyanadella: Today, we announced new capabilities to ensure every organization has the tools to help employees thrive in a new era of… Keep your home (office, school, gym, and sanctuary) a little more organized with these tips and tools from Microsoft 365: https://t.co/Gaz0mYe5OK @Mr_R_PE The real MVP. 🌟 @XboxGamePassPC @XboxGamePass 🙄 @ethanexp_ Microsoft @dom_inthecloud Us being quietly cc'd: 👀 @kevalways Incredible. TFW you miss the \"Join the Meeting\" notification by a millisecond and have to open your calendar to join. Working from home has its ups and downs. Microsoft Viva gives companies new ways to help employees do their best work — and stress less. \n\nhttps://t.co/4qtGCr4pti #MSFTViva #EmployeeExperience Have you ever gone from “Just following up” to “As per my last email”? CEO @satyanadella joins our chief people officer, Kathleen Hogan, to discuss how the new Microsoft Viva platform reimagines the employee experience designed for a digital era. https://t.co/GPkmuBd9sk https://t.co/IgKGQMadXS RT @satyanadella: Announcing Microsoft Viva, a new employee experience platform bringing together everything an employee needs to be succes… RT @Microsoft365: Introducing Microsoft Viva. The new employee experience platform built to help organizations empower people and teams to… Introducing Microsoft Viva.\n\nhttps://t.co/KV62S2FTtA\n#MSFTViva #EmployeeExperience https://t.co/HxlpugixjF Watch Microsoft leaders @satyanadella and @jared_spataro introduce Microsoft Viva, a new employee experience platform: https://t.co/B7S2zo5xTN\n\n#MSFTViva #EmployeeExperience RT @MSFTIssues: .@microsoft #SeeingAI is helping people who are blind or have low vision by augmenting the world around them through audio… @jordannovet @ChloeCondon No, Clippy did this. Very impressed by this, Scott. https://t.co/wO51gIfV8i The pandemic showed us just how \"essential\" essential workers truly are. \n\nDiscover how Microsoft Teams supports those working on the frontlines: https://t.co/nSZ0CU5cA3 @phoenixphanrise He's been working on his artistic side. @JenMsft Incredible. @amazingalooman Potato @DancingRyuu 😂 wow. @AlQadhafy 📎 @mashalyaseen_ Bring your kid to work day, everyday! RT @HoloLens: ⏱ On February 9, attend the 24-hour #HolographicSurgery! Watch 13 surgeons from 13 countries as they perform holographic oper… Feeling inspired by Van Gogh's Starry Night.\n\nThe Art                           The Artist https://t.co/FAGqs6XVmf Discover how we’re working with @CSIRO to transform our world. https://t.co/3JKCCVX8ny We know the answer to this one. Here's how @CSIRO is using #AI to stop plastics from entering the ocean. https://t.co/v4vgX79qJ0 https://t.co/NU80rRRgXQ “Let’s offline about that” is just two people on one call agreeing to skip it for now, and forget about it later. @sfrnfzl_ Our type of artist! 🖌👏 Soar to new heights with Microsoft Flight Simulator, now available on your favorite VR headset for PC.\n\nGet ready for takeoff: https://t.co/7g9B5Rmq83 ✈️ @vpikula 👀😂 @JohnGibbon979 A flying cat? @sbisson Kittens should be able to mew mew mew all they want. @AndrewArruda Thank you for this TED talk. @nyanpyon 🌈 But if you do need the silence, here's how to reduce background noise in Microsoft Teams: https://t.co/QZzUqbBN8K Please stop apologizing for the dogs barking in the background of your Microsoft Teams calls. Let them speak. 🐶 What’s up, doc? 🥕\n\nAzure AI is bringing Bugs Bunny, Progressive’s Flo, and Duolingo characters to life with Custom Neural Voice: https://t.co/3D02vOFp43 https://t.co/OsN2klwPe8 @Ignis621 Just the right amount of awkward. @TerenceJSweeney To each their own. @LURIE_MSFT 😂 @W4rriorPr1nc3ss 💨 @sglerner @kjbeavers 👆 @Lucky7sCyber Valuable advice. We like it. @paulfabretti Classic Pisces. Vibes from the 70s. 😎 https://t.co/vF8n1y8wpT Data and cloud computing are paving a new way for electric vehicles to thrive in India.🔋\n\nFind out how: https://t.co/wdV8bvyjev RT @Xbox: This February and beyond, we're celebrating Black voices and shining a light on the contributions of both creators and players.… @mythical_server Glad it's not just us. @bdsams Oh no ... @tanzeelalalaa 💓 @AllisonAngel_ You sure? @LURIE_MSFT Don't mess with us, pork chop. Do you say goodbye before leaving a Microsoft Teams call or are you an Aquarius? Stay ready so you don't have to get ready.\n\nHere's your plan for increasing security and resilience: https://t.co/RLUC4GwK3k Yeah, it feels like Groundhog Day. https://t.co/3ON8h5auJq Is it just us, or does today feel like Groundhog Day? @euronewsliving .@Outlook, looks like spinach is stealing your look. 👀 @kevinroose That photo would make an excellent desktop background. @windycitycassie Sometimes it's like that. @RobertofStruan Those. EYES. You better have had a treat ready. 🦴 @MissMarleyPE Happy birthday, Miss Marley! 🎉 @ZamoraO Ngl, we save anyway. @alvinashcraft 😧😅 @WordsfromJebs You never know. @Borman18 @Windows Perfection. RT @satyanadella: We’re celebrating the legacy and strength of the Black community by honoring changemakers who are making history today. O… CTRL + S\nCTRL + S\nCTRL + S\n🤔\nCTRL + S Talkative toddler? Noisy neighbors? Barking man's best friend? 🐶\n\nHave no fear, noise suppression on Microsoft Teams is here: https://t.co/I5PQDxCok8 @Fdruid Don't worry, we've made a note of this. @missmishaharris *unmutes*\n\n\"What type of chips are you eating?\"\n\n*mutes* @venzann We get it. Setting the mood. 🐟 @Jenny_Coff Oh. My. 🥺 RT @JP_Courtois: Autonomous systems are making what was previously impossible, possible. @BellFlight is using Microsoft autonomous systems… We’re proud to support these @SpecialOlympics global youth leaders who are channeling their own experiences into projects that help other athletes with intellectual disabilities connect and thrive. \n\nLearn more about their projects at https://t.co/Qk9j0Ze1eR. https://t.co/NWJgHGAaQt While waiting for others to join the Microsoft Teams call, do you prefer: Proudly, we amplify the voices of those whose experiences motivated their present actions to build a better future for generations to come. We do this – not just because this is #BlackHistoryMonth but because change is happening, and Black History is now. https://t.co/aPcsfhRcys https://t.co/qrqauzWOtX @hannahbethbell That calendar &gt; @thekarachikid Stay tuned, Khaver. Windows 1.0 will be released in 1985. 😎 @Scobleizer Kids these days. @1Signus Truly. @darrenmk 🟦\n\nWelcome! @Hannah_YD We'd give this an A+. 🍎 Attention #teachers 🍎\n\nBreakout Rooms are now available in Microsoft Teams for Education.\n\nHere's what it means for your classroom: https://t.co/IGkp7QyLMV Windows 1.0. \n\nFeeling nostalgic. https://t.co/cnDb1SJdv6 You wear a helmet when riding a bike to protect yourself. \n\nConsider this like that, but for your business: https://t.co/Pou6Sr3Z1c @Bubs2611 We get it. @craigrich *checks posture* @ccare_ccr1 Sorry not sorry. @Cloud9 Smh. @jennaezarik Just trying to help with back pain. 💓 @sfdesigner Clever. You: I'm getting a weird echo, can everyone please go on mute?\n\nAlso you: Am I the echo? Imagine a world tour of surgeries assisted by mixed reality with surgeons from 13 countries.\n\nTake a look: https://t.co/rRrcjBZLp0 https://t.co/CrYByT1GMx Reminder: stop slouching. @GetFlexSeal Looks like you have an *artist* over there at Flex Seal. 🎨 @joshmcconnell We've had this on repeat all day. 🔊 @The_PopcornMan @MayTree78 Two with extra butter, please. @MicrosoftTeams A corgi of many talents. “I’m not saying advocate 'for.' It’s not a badge or cape. It’s a practice that we’re trying to embed so people can engage in conversation to learn from one another how to support and help one another.” “So much around allyship is putting the growth mindset into action, learning how to empathize with and advocate with someone else,\" says chief diversity officer Lindsay-Rae McIntyre. The Microsoft Allyship Program shows how everyone has an opportunity to be an ally.\n\nLearn more: https://t.co/1MtFxdaQGT @davidspudic Who says he isn't already? 🤔 @mkashman Updates coming soon! 🐕 @f_artdirector ❤ @JenMsft A masterpiece. @MrDuko Thank you, Seduko! @sethjuarez \"Oh, no, you go - I was going to change the subject.\" This is aca-mazing.\n\ncc: @MayTree78 https://t.co/AGz7THm6BV The Art                           The Artist https://t.co/ZOPS3fCXmX RT @MS_Ignite: #MSIgnite? In March?? That's right. There's a second Microsoft Ignite this year. Except the second is coming first.\n\nJoin us… 🎮 Discover how #gaming can help bridge gaps between generations and fight loneliness: https://t.co/6KfitzABo2 Learn more: https://t.co/jXWdGSP54m What if there was a system that could work with different functions to identify, plan and act on changing variables? \n\nALT: The future from an alternative perspective. https://t.co/qaQawE4vef @rashydahmed A favorite. @the_random_dev @code Can never be too safe. @dannybalezy You do you. @that_wei We love you too. @Meredium1 There are two types of people. @arcticdba @_caseywatson 🥺 @BrokawInc Never the other way around. @nemerevermore Lol. @TraceyBleakley @NHSEngland @hospiceuk Great job, Percy! 🐶 It’s CTRL + C, CTRL + C, CTRL + C, CTRL + C, and then CTRL + V. We’re one year into our 10-year plan to be carbon negative: https://t.co/HRr0GEHKqD\n\nHow it started            How it’s going https://t.co/x3BURqQZJd RT @satyanadella: As a company, we’ve set ambitious climate goals to be carbon negative, zero waste, and water positive by 2030, and we’re… RT @MSFTIssues: How time flies! One year ago we kicked off our #sustainability commitments as a company. Read @BradSmi’s update on:\n\nCarbon… RT @BradSmi: A year ago, we pledged to go carbon negative by 2030. While this “moonshot” is a daunting challenge, our recent steps make us… RT @satyanadella: We’re committed to doing our part and supporting the global community with technology and tools to accelerate the secure,… @Headspace Try it and get back to us. @ChrisCotsack 😂 @steinbroeder @steinekin You too, Stein. Educators believe the pandemic has accelerated the evolution of virtual #education by ten years.\n\nCheck out some of the most important takeaways for hybrid learning: https://t.co/0v7zsDMwPu RT @MSCustomerTalks: Let's talk about tech! \n\nCTT is looking for new customers to feature in our upcoming segments and events! Visit https:… In 2020, more than 30 billion email threats were blocked by Defender for Office 365. 🤯 More on Microsoft’s Zero Trust mindset and the future of security: https://t.co/zc56dDCl3C https://t.co/qNgD1Ho6nW Have you tried unplugging it and plugging it back in? Microsoft and @JohnsonControls, the leader in smart and sustainable buildings, are working with the National University of Singapore to create a more #sustainable campus.\n\nDiscover how they're using digital twins technology to innovate: https://t.co/LmK3VWZDlh @hayeslissack Lighting is key. @shahdhvani99 Any GIFs, in particular? @_franrodrigo 🙃 @phichithamster That's what besties are for. 💞 @Breadisnice98 At least you're honest. @f_fakhrusy T. H. E. @ByteRisc Nice one. @TooLate2Call It looks like you're procrastinating. Do you need help with that? @itsnotselest Anytime! @bienbwryan 😂 @CodingwithChloe 🙄 @steinekin Back to work, Stein. @threddyrex Amazing. @justinthrelkeld You're welcome. Together with our partners, we’re delivering vaccine management solutions to support public health systems and help them focus on getting the vaccines, resources, and services when and where they need them. \n\nLearn more: https://t.co/9XhkvR8YDg You’re procrastinating. https://t.co/os5a5xkvXs Nunavut – which means “Our land” in Inuktitut, one of the Inuit languages – has been home to an indigenous population for more than 4,000 years. \n\nSee how Microsoft Teams is helping to bring this community together during the pandemic: https://t.co/AjR2P71qsA https://t.co/GadNXAa26y @DrSbaitso Not. At. All. @bisynerd 😶 @f_fakhrusy Always in the back pocket. @tomwarren Oh, Tom. @Price412 😂 @SoonerLatios 👀 @dxd_ang 😂 RT @MSFTIssues: .@microsoft is working with @LinkedIn to help students, job seekers and employees gain the skills they need to be successfu… From teachers to students to parents, everyone deserves an A+ for resilience in 2020. 🏫\n\nCheck out these highlights from Microsoft Education: https://t.co/tRHlv9SVHm Microsoft Teams: you have poor network quality.\n\nYou: I'm going to use this as an excuse to not turn my camera on today. 💻 Business Highlights: More Personal Computing 🎮 \nWindows OEM revenue ⬆️ 1% \nWindows commercial products and cloud services revenue ⬆️ 10% \nXbox content and services revenue ⬆ ️40% \nSurface revenue ⬆️ 3% \nSearch advertising revenue ⬆️ 2% 🌩 Business Highlights: Intelligent Cloud 🌩 \nServer products and cloud services revenue ⬆️ 26% \nAzure revenue growth ⬆️ 50% ✈️ Business Highlights: Productivity &amp; Business Processes ✈️ \nOffice commercial revenue ⬆️ 11% \nOffice consumer revenue ⬆️ 7% \nLinkedIn revenue ⬆️ 23% \nDynamics products and cloud services revenue ⬆️ 21% Q2 FY20 revenue by segment \n\n✈️ Productivity &amp; Business Processes: $13.4 billion ⬆️ 13% \n🌩️ Intelligent Cloud: $14.6 billion ⬆️ 23% \n💻 More Personal Computing: $15.1 billion ⬆️ 14% Commercial Cloud Revenue: $16.7 billion ⬆️ 34% THREAD: $MSFT Q2 EARNINGS \n\nJust announced - Microsoft Q2 Earnings  \nRevenue: $43.1 billion ⬆️ 17% \nOperating income: $17.9 billion ⬆️ 29% \nNet Income: $15.5 billion ⬆️ 33%  \nEPS: $2.03 ⬆ 34% Read the full Microsoft’s Q2 Earnings Release here: https://t.co/Hhgj6eKJpZ  \n\nNote about Forward-Looking Statements in earnings tweets: https://t.co/4wiTg498Mc @chriis_bebe We'd like to be wherever this is. @enedictmonteiro More like an unexpected gift. 🎁 @helonastick 🥺 @jasminecrowe 🙌 RT @MitraAzizirad: The team at @BellFlight chose @Microsoft #AutonomousSystems to help them innovate in autonomous flight to transform thei… @WelshGasDoc Let. Him. Squeak. \"Espresso\" your appreciation for coworkers with the @Starbucks app in Microsoft Teams. ☕\n\nLearn how you can give it a shot: https://t.co/iE6zfzYKDw CommentRetweetLike.jpeg https://t.co/PaKIUhhrnF Jasmine Crowe, CEO of @TheGoodrCo, is on a mission to reduce food waste and feed millions. Find out how she’s changing the way to approach hunger—through smart technology and community engagement. \n\nLearn more: https://t.co/5eabnzQ8os https://t.co/8hlZ8b7CC0 The consensus is clear: the future of work is hybrid.\n\nDiscover how Microsoft’s latest Work Reworked research can help you make the most of company culture: https://t.co/lb9RKAEkPx NSW Health Pathology is using cloud technology and #AI to support faster diagnosis and care for patients – no matter where they are. \n\nLearn more about the initiative: https://t.co/ZP30YknvVl ⚕️ Around 82% of electrical equipment ends up being sent to landfills, incinerated, or illegally traded, instead of responsibly recycled.\n\nCheck out how one app is planting a more #sustainable future, one recycled device and tree at a time: https://t.co/0ZcbzEr9Kz 🌲 RT @MsftSecIntel: This comprehensive guide for security admins has details for increasing resilience against sophisticated attacks like Sol… The UK now has 48 Microsoft Showcase Schools - more than any other country in Europe. 🏫\n\nDiscover how the schools are using technology like Microsoft Teams to up-level education: https://t.co/zQ13Yo7qca No, that wasn't thunder. It was just someone typing while unmuted on a Microsoft Teams call. It’s “Pie” day, not “Pi” day.\n\n#PieDay https://t.co/AD5lyHFEQk Here’s to work/life balance with a little more life. ✨ RT @satyanadella: By bringing together the power of Azure and Teams with @SAP’s solutions, we will help more organizations harness the powe… Tell us you're proficient in Excel without telling us you're proficient in Excel. RT @MSEurope: .@WHO has designated 2021 the International Year of Health and Care Workers. We are committed to empower those heroes with to… @tomwarren Proud of you, Tom. @Axcient Coming right up. @Professor_Erik @MicrosoftTeams @MIEE_Flopsie @MicrosoftEDU Amazing. @XboxGamePassPC 👀☕ @Katie_Popple A classic. 👏 @CatamyKX Be careful, it's very hot. 🍵 .@microsoftfrance is organizing a 24-hour #HolographicSurgery event in collaboration with Professor @tms_gregory, Evolutis Numérique, @univ_spn, and @APHP. The challenge? 24 hours to change healthcare collaboration. Learn more: https://t.co/pfTIeBx5bc https://t.co/35soYwcV92 @XPS ☕ *dashes oat milk* @moment Excellent choice. @ID_Xbox ☑ @Wawa Always. ☕ @LilMoisty_ ☕ @PhoenixWrites15 ☕☕ @TylerChess 🧊☕ @JasonWRocco Nice. @isablle_viger ☕ \"Think of this as a gaming mixtape of hope and optimism.\" Sounds pretty good to us. 🎮 https://t.co/2efoZuJLAe @graemeknows ☕ @gareth Our specialty. 📎☕ @ElfNendes ☕ @Spatacoli ☕ @jennaezarik Coming right up!\n\n☕🥛 @StarbucksNews ☕ = ❤️ @MichaelGillett Medium Roast. @MattLockmon You got it. @heyhadleysmom 🍵☕ @CreeseWorks How much sugar? @PhilCrawley ☕ We'll do better on the latte art next time. @EshuMarneedi Got you. 🥤 @apewee13 ☕ @TinaRajan_ ☕ Would anyone like some coffee or tea? @vincenovoa ❤️ https://t.co/i5TgIcEYh3 @vastshipwreck Maybe we should just wave? @stevenson3529 @WindAesthetic Beautiful. @Real6rnu Trust us, it's plugged in. @louiewein The nerve. @GeekTrainer 😂 @joedurand ✍ Save early save often. ✍ @ket_overkill We support this decision, Ket. 🐟 @matvelloso CTRL + S\nCTRL + S\nCTRL + S\n🤔\nCTRL + S @MatterSec_ @UK_Daniel_Card 😂 RT @MSFTnews: .@Cruise and @GM have entered a long-term strategic relationship with @Microsoft to accelerate the commercialization of self-… RT @satyanadella: Announcing new devices and tools to help keep students engaged and improve outcomes, anytime and anywhere learning happen… Is this you? 👀 https://t.co/mW7P1VugI7 @townshed55 @AorusOfficial Brb gonna go beat our high score. @AorusOfficial 🚩 @TooLate2Call 👀 @Underscordd Hours. @NorthantsChief @colleenrattigan This looks like a very im-paw-tent Teams meeting! 🐾 @originalsunbeam The perfect coworker doesn't exi- @r_coombes Very proper. @Cruise Thought we'd hop in for a ride. 🚗👋 Plans for the day. https://t.co/rZIyYNHdS7 RT @Lindsay_Rae_M: #MLK stood for peace but also spoke truth to power. We can honor his memory by learning about what he stood for and how… RT @satyanadella: At a time of so many challenges, we honor Dr. King’s legacy of service and commitment to take meaningful action and press… During the pandemic, Microsoft customers discovered that the cloud didn’t just have a silver lining – it was the silver lining.☁️\n\nSee how #Azure is helping companies stay resilient: https://t.co/B77EYR1d3Z @BarinCommandos 😂 @SyedTechA Let that voice shine, Syed. 💓 @Sean_Oliver Nm, hbu? @MeenooRami 😊 @JoanneCKlein Making the tough choices. 📌 @toadswiback Please notify us when this is available. @bdsams Wow, Brad. @CDCinRaleigh SAY IT LOUDER *unmutes mic* \n\n“Are we still doing these ice breakers? I have two dogs and enjoy long walks on the beach.” \n\n*mutes mic* @Tired_Dad_of_2 Excellent. Can you send us a DM using the link below? https://t.co/2zGa6v7GNK @bdsams Oh, Brad. @MODPizza 🥗 @pdtit You too, Peter! @JoshErenberg 💞 @PradeepAnanth_ Where are you going? @baxiabhishek @MichaelGillett 🖖 @BeardedTechDude 😛 @thekenyeung 🤔 @burhankuvvetli Who's Mike? @DarrellaaS Yes. Yes it is. @MS_eduIRL 🌈 @1_4M_M3 01001000 01100101 01101100 01101100 01101111 00101110 Blind Citizens Australia’s mission is to inform, connect, and empower the 450,000 people in Australia who are blind or vision impaired.\n\nCheck out how the organization is living its values internally with #accessible technology: https://t.co/n9tzvokimQ @ThatTechieGirl Hello! @jonnychipz *tips hat* @JenMsft Simply amazing. @panattoni_ 😍 @patrickandrews_ I must've called a thousand times @PKs_Flowers 👋🌎 @MiriRod 💖 @XboxAmbassadors Hey! @MODPizza 🍕 Hi. RT @MSEurope: Understanding and improving nurses and midwives’ experiences are crucial to @Microsoft. ⚕️\n\nDiscover how we partner with fron… @MindcrimeDan 👀 @MSH_Dave 😂 @peteskomoroch Don't cut costs on chairs ✍ @Vyaeria Excellent. @danicquinn Every. Day. There is no better PowerPoint deck than the PowerPoint deck made by you. It looks like you're trying to talk while muted. Would you like help? https://t.co/h7Ssh0HvUE As the move to remote work has blurred the lines between work and home time, empathy has become all the more important.\n\nLearn more: https://t.co/ra7eeGOT8Y Dear office swivel chair with excellent lumbar support: we miss you. Teachers, you're our heroes. 👩‍🏫\n\nDiscover the latest updates available now to help you make the most of distance and hybrid learning with Microsoft Teams for Education: https://t.co/ZM4s9GgWuk RT @satyanadella: Professional and citizen developers have been key to business continuity over the last year. As @amandaksilver shares, we… @KTX_games Hey, hey, HEY. @LuLaRoe 😍 @JensenGregory 😂 @MichiSRS What a wonderful life you must live. The works, please. When is pretzel day? Asking for a friend. Thanks to cloud technology, doctors are able to safely monitor isolated patients in the community, ensuring hospital resources remain available for the most critical patients. \n\nLearn more: https://t.co/Y3fc7h6D2t @AndiEwington Those transitions &gt;&gt; @THDMMerkel Is he just hopping off his last call? 🐇 @ktomasko Hi Kristy, this is WAY too cute. Can you send us a DM using the link below? https://t.co/2zGa6v7GNK Couldn't have said it better ourselves. https://t.co/iKeWzXC2su The Windows XP start-up sound. Can you hear it? Technology is helping Africa's farmers reap major benefits. 🌱🌾\n\nCheck out how their crop yields have increased by 300%, multiplying the income of smallholder farmers by ten times: https://t.co/DlsepKMTOE Us: https://t.co/pdZIszgt9L https://t.co/2GglfN2Lg1 RT @MSFTIssues: Watch Microsoft President @BradSmi’s @CES keynote on why we need to learn from the past, imagine the future and come togeth… @petr_hartmann One of the best replies here. @JenMsft Sorry, but you have to decide. @BenThePCGuy @Office 🤯 @simonallison_ ...\n...\n... @JtFinlay \"Just sending a friendly ping.\" ✨ @RizzEditions Wow. @JenMsft 😂 @JustMoMbles Absolutely. @theexpertkid06 Love to see it. @rosantos_ecu CTRL + V @XboxGamePassPC 4:59: Ctrl + I\n5:00: Win + G @IsaacAttuah Ctrl+Y? Favorite shortcut combos. What's yours? CTRL + ALT + DEL More than 149 million new technology jobs are expected to be created worldwide in the next five years.\n\nDiscover how we're partnering with UK universities to prepare students: https://t.co/ohO0b1HF9b You read our Teams chat three hours ago. We’re still waiting for a reply. ✅ Embedding resilience\n✅ Integrating new products\n✅ Getting to know customers better\n\nCheck out how retailers in Central and Eastern Europe are innovating: https://t.co/0MuITEwI0X 🛒 @fahaad_abbadi Hello, Fahaad and friends 👋 @shanselman 👀 @threddyrex We'll allow it. @optional87 👀 @memorycard_J In Durham, NC expect a high of 53° F and sunshine. @sharkybait We thought you were our friend, Steven. In case you didn’t know, this account isn’t managed by AI. We’re real people, just like you. \n\nUnless you’re a robot. 👀 With school back in session, teachers around the world are adapting to new ways of instructing and engaging with students during the pandemic. 🍎\n\nLearn how they're innovating with Microsoft technology: https://t.co/OtJyjV9exd @CompletingTheC A prime example. 👏 @KeaginMurphy You should. @ClareDurrett All the love. @TeganG_ A valid reason. @DenziltheCocker Your time will come, Denzil! 🎥✨ Inspiration can make all the difference in the work you pursue. With 2021 upon us, chief people officer Kathleen Hogan connects with experts as they share stories of optimism for the year ahead. More from Kathleen: https://t.co/Cu5pZOCTSx https://t.co/AEL2VpHKk5 Opening your PowerPoint deck with a funny GIF is something all of us appreciate. More of this, please. RT @MSFTnews: .@Microsoft is partnering with @broadinstitute and @verilylifesci to advance the @TerraBioApp and help researchers tackle som… Learn how: https://t.co/oIMcX6fKrT Did you know you can now use polls in Microsoft Teams meetings? RT @Windows: Welcome to CES 2021! Get a sneak peek at this year’s latest innovations here: https://t.co/6KEEaIcZjK https://t.co/8vZeEKeZoz Happy birthday to all of you Capricorns. May your January be filled with pristine spreadsheets and relentless ambition. You could say we Excel at it. https://t.co/uKAxHOolDv RT @panos_panay: As people continue to work and learn from home and other hybrid locations, devices have become our connection points to on… @TylerChess Excel-lent. @benardzulu96 Start &gt; Settings &gt; Game Mode Roughly 7,200 tons of e-waste lands in India’s capital city from across the country and abroad every day. \n\nLearn how grassroots startup @karosambhav is taking on the challenge of responsible #recycling: https://t.co/3LqF0Jz41I ♻ @meh50187 Arguably, the best start. Drop your best Microsoft pun in our replies below. ⬇️ It’s now safe to turn off your computer. Connection is calling. 📞\n\nNew enhancements to #MicrosoftTeams Calling are here to help you collaborate better: https://t.co/OUMikjDsR9 How every #MicrosoftTeams meeting will start through the end of February: \"Happy New Year, everyone. We made it.\" Imperial College London is using Microsoft #HoloLens to help medical students get the vital experience of treating real patients in hospitals despite pandemic restrictions. 🩺\n\nLearn how: https://t.co/mZk0JPmyWr @Holy_Shadows @Xbox 👀 @ket_overkill 😍 @kngbell 😂 @MissMFrost 🎁 @wsdot_traffic @DaneCreekPhoto @wsdot Very impressive, WSDOT. Set status: appear away\n\nSet status message: bRb pLaYiNg @Xbox We've wrapped up a two-year experiment testing the sustainability of underwater data centers. And the results suggest our data could lie under the sea in the not too distant future. 🌊\n\nMore from @CNET: https://t.co/wG9JffWVrx @TheFoodieSavant Happens to the best of us. @sofiacqa Accurate. 😂 @AubreyChampion You're right. That is love. 💘 @jbwardrop Dash looks so ready to learn PowerPoint. RT @MSFTIssues: Fasten your seat belts. 💺 Microsoft has partnered with @AlaskaAir to reduce its employee’s in-flight carbon impact. \n\nHere’… @franamooney 😂 @NaynishBL 🙃 @panattoni_ Here's your reminder to unmute today. @horrocks_simon Sorry, gotta hop off this call. 🐇 @BEAMBZ_ That smile gets us every time. @SAITServices Powerful points. @optional87 ❤ @CtrlAltClay *hugs* @mwdarab We're just happy that you're happy. @Eli_Weitz 👍 @JenMsft Relatable. Me: *settling back in after the holiday trying to remember how to do my job* Sharing the world of \n#ComputerScience with your students is now easier (and more fun!) than ever.  💻\n\nDiscover the latest Computer Science Subject Kit with more than 150 hours of learning content: https://t.co/fz1RSpNowx First week of the New Year and we wanted to check in. How are you doing? That little paper clip is Clippy, and Clippy is waiting. https://t.co/Gs7f5AWWfP Did you forget your password again? @primaevitas ❤ RT @MSEurope: .@Microsoft demonstrates how to increase green energy in Ireland one rooftop at a time. Read more: https://t.co/KVrpQ4V65k @xboxBG Which is which? @LuLaRoe 😂 @thejonlewis 🧊 Things to bring into the New Year: love, positivity, and leaving those who deserve it on read. @fishingparty Three dogs barking and a lawn mower. @IWannaBeAMem3 😬 @anonymouskrypto We notice you. @ms_garcia88 @stpetersmilton @mswyprzal 👏 @ErinWrites93 Totally understand, just have her send the deck over as soon as she can. They say teamwork makes the dream work, but what if teamwork isn't working so well? 🤔\n\nCheck out these tips on how to capture team attention: https://t.co/yJZr43OxHg @justplainjenn One treat per every minute of the dog park delay. We don't make the rules. You: It’s now 2021 and I have zero excuse to still be muted.\n\nAlso you: Sorry, I was muted. Real super heroes code. ⌨🦸‍♀\n \nJoin the @WonderWomanFilm Game Idea Challenge for a chance to win an Xbox Series X, a #WW84 Xbox controller, and a Surface Book 3 13.5”.\n \nThe details: https://t.co/m63HsKTMsL\n\nNoPurchReq. Open to residents of 50 US (+D.C.), 18+, Ends 1/25/21 PT. https://t.co/XCrkFj7cYS @m_konopacki The image is intended to represent the braille conversion of \"World Braille Day.\" A user with a refreshable braille display would be able to read this in braille. Today we celebrate #WorldBrailleDay – Braille is key for achieving equality and social inclusion for millions of people who are blind or have low vision. https://t.co/cHGXVrcrAC Us: Anyone have anything else before we wrap this up?\n\n2020: Actually, I do have one more …\n\nUs: *ends call* In 2020, we took exploration to new heights. ✈️\n\nTake a look back at the launch of Microsoft Flight Simulator: https://t.co/rlEtXgAsvG WFH in 2020 summarized in three words: You’re on mute. https://t.co/e6AWX8Qrif This year, we reached new depths of possibility for our underwater datacenter, #ProjectNatick.\n\nLearn more about how it supported pandemic research efforts: https://t.co/ytIcLT7jah *Sends email*\n\n*Waits 10 minutes*\n\n*Starts Microsoft Teams chat*\n\n“Hey! Did you get my email?\" @backlon 😂 rude. @pbrigmanHR Just trying to keep it real with you. @jakemeyers2015 That's the joke, Jake. @souljaboy Yooooooooo 👀 *Joins meeting*\n\n*Unmutes mic*\n\nTo your pet: I love you so much. Thank you for making me happy literally all of the time.\n\n*Mutes mic*\n\nCoworker: I should get a pet. This year, we announced our commitment to become carbon negative and water positive by 2030.\n\nDiscover more about our #sustainability initiatives: https://t.co/qKcFbxIjEW @Xbox 👋\n\n🎮! @bdsams 📎 @KerithBurke Yes. Just wanted to say hi. @bdsams Hello, Brad. @Emojipedia 🤝 @iam_abdulloh Never too early. @techrankin 😂 @matink You're on mute. @NateIngraham sup Hi. A next-generation console was released this year. 🎮\n\nCheck out how we powered #gaming dreams in 2020: https://t.co/WSc11hncjc Our followers live all over the world. Tell us where you’re typing from. ⬇️ Join the @WonderWomanFilm Game Idea Challenge for a chance to win an Xbox Series X, a #WW84 inspired Xbox controller, and a Surface Book 3 13.5”. 🎮\n \nShare your game ideas: https://t.co/I2cF1WSGuc\n \nNoPurchReq. Open to residents of 50 US (+D.C.), 18+, Ends 1/25/21 PT. https://t.co/dwxZeUYXVU Microsoft Teams: It looks like you’re available\n\nYou: Oh, does it now? This year, we unveiled a new way to browse the web on @MicrosoftEdge. \n\nTake a look back at the milestone: https://t.co/mwbMyBvuY7 https://t.co/SxMnKtTBYm Australian students got the chance to discover and explore their local Indigenous cultures with the first NAIDOC Minecraft Education Challenge. \n\nCheck out what they learned: https://t.co/uMQxvm0wI2 There's no place like Home. #WallpaperWednesday. https://t.co/YheJYP9v1g With Microsoft Custom Translator, you can help globalize your business and improve customer interactions.\n\nCheck out the updates to our translation solution: https://t.co/jkXLbF4i4N You can “work” and snack at the same time. From tracking your spending to simple photo sharing, #Microsoft365 is here to help you live your best, most organized life.\n\nCheck out the newest features: https://t.co/cen7Dvha0Z You can only have one. https://t.co/yJXstLzdmE Looking for a holiday adventure like Rufus’s? You can now select and fly Rufus and Sam's planes in Flight Simulator!\n\nWe’ve also decked out 12 iconic landmarks around the world with festive holiday lights, ready for you to discover: https://t.co/cRUxpxjKZT https://t.co/h4lunvpTxq With hackers working faster than ever, #cybersecurity is more critical than ever.\n\nDiscover how machine learning is boosting the ability for organizations to do cyber detective work in real-time: https://t.co/Cq071BkRaX 🕵️ Tip: Replace “WHYYYYYYY?” with “Okay, great.” RT @satyanadella: In every community, in every country, and across every industry we’ve seen people step up to help keep the world moving f… The Student Forum is where higher education students can connect with each other and Microsoft Education experts.\n\nCheck out how three students are getting creative and staying productive during remote and hybrid learning: https://t.co/uButiqaukY The year is 1997.\n\nYou: *struggling to write a letter*\n\nClippy: Would you like some assistance with that? The switch to remote work has made implementing a Zero Trust security model even more important. \n\nHere's how you can get your company's #cybersecurity on lock: https://t.co/kffTQr3jz7 🔒 @AwsmSpaceMonkey 🥧 @JenMsft Close. @MsLeeTeacher That is correct! @Rubenia_Borge Good guess. Main ingredients: \n\n- Dried fruits\n- Sugar \n- Cinnamon\n- Nutmeg\n- Cloves\n- Maybe even some Brandy?\n\nWhat are we making? 🤔 RT @Windows: Thanks to all your 💙, this year’s #WindowsUglySweaters went fast — and @GirlsWhoCode felt your support! What’ll we knit up nex… @kristan_kenney 😂 From hybrid to remote learning, teachers have had to juggle a lot this year. \n\nCheck out how new technology from Microsoft 365 can help #teachers, #students, and administrators get organized: https://t.co/ATV2MklbW6 Which is your favorite? Here are some punny holiday cards for you to share with friends. https://t.co/Ns4UtODPdj RT @BradSmi: The latest nation state attack is not espionage as usual, even in the digital age. Instead, it’s an act of recklessness that h… What's up, doc? 🐰🥕\n\nWe've joined forces with @KingJames and @spacejammovie to create learn-to-code lessons for all ages. \n\nCheck out the game challenge from \n@Xbox \n@MicrosoftStore\n@MicrosoftLearn \n\nMore: https://t.co/rVAOt1qRl4 https://t.co/gPU9RX04Am RT @Xbox: Gaming has the power to strengthen connections, across age and distance.\n\nWatch how it rekindles the relationship between Dhillon… @NoradSanta ✨ @sbj24 Happens to the best of us. @CalexStreams 🙃 @AshikaG_ Ours too. @MicrosoftEDU *bliss* @rishiraj824 ❄ *writes note*\n\n*edits note*\n\n*reads note*\n\n*sends note*\n\n*feels better*\n\n*feels worse*\n\n*reads note again*\n\n*finds spelling mistake* Wellbeing has never been more important. \n\nCheck out these 5️⃣ tips to support your employees with stress management and more: https://t.co/kO7dHJKt3a Makin’ it snow. https://t.co/TF2uHriQ2P RT @MSFTIssues: Many of us are heading into our 10th month of shutdowns and restrictions.\n\nToday, @BradSmi is announcing new commitments fr… Look at all that cheesy goodness. 😍\n \nHere's how we're helping @PepsiCo create perfect Cheetos: https://t.co/cLyVvzWPup https://t.co/ARmE9Np4fF The holidays won't be quite the same this year, but NORAD will deliver a treasured tradition you can count on: https://t.co/DLsKkESwVa @COOLSISTech 👋 Cheers to innovation.\n\nCheck out how one of the world’s best-loved premium gin brands, Silent Pool, is diving into #cloud technology: https://t.co/ORnflOuZb5 We’re collaborating with @FedEx to support the safe and efficient distribution of the COVID-19 vaccine.\n\nLearn more: https://t.co/v6ConiIS5j https://t.co/2ITziZUKPT Where would you fly to? 🛫 The year is 1986, and we know what we’re getting you for the holidays. https://t.co/Eo8gHiaQLJ Tis the season to slow down and savor the holidays. ✨\n\nTake a break from the hustle and bustle with these tips: https://t.co/NMM3aBPFwc 'Tis the season. Today's #WallpaperWednesday is brought to you by the #WindowsUglySweater. https://t.co/ScIXbz0fAz RT @MicrosoftTeams: This holiday season, a new way to show your appreciation. You can now send @Starbucks gift cards through Microsoft Team… @jennaezarik @MicrosoftStore @ijustine 💘 Ring in the season with Microsoft Holiday Hits – timeless classics.\n\ncc: Reply All Records, Inc. https://t.co/GDCc9rOAjs As the fall semester winds down, here are 7️⃣ ways to create a seamless distance learning experience—this semester and beyond: https://t.co/Jkwg7pFh4p 🧑‍🏫 @yeohbraddy 🙌 @CharlesTStella @LittleDebbie Essential. @steffclef13 Amazing. 😍 RT @Lindsay_Rae_M: We’re all about innovation—even in the way we approach diversity &amp; inclusion through a growth mindset lens. We encourage… Kolaczki, krumkake, gingerbread. What’s your favorite holiday dessert? Our Nonprofit Tech Acceleration for Black and African American Communities program is designed to empower nonprofits with technology solutions.\n\nLearn more about our commitment: https://t.co/x665muc84t #Cybersecurity isn't just for computer science students, it's for everyone.\n\nLearn more about the job opportunities spurred by digital transformation: https://t.co/7No2biaaqr @WhiteFoxSG ❄ Coworker: *requests read receipt*\n\nYou: Ehhhhhhhhhhhhhhhhhhh. @IntelGaming 🐶 Tuuuune Squad 🎯\n\nWe've joined forces with @KingJames and @spacejammovie to create learn-to-code lessons for all ages. https://t.co/qxopQ1pEh6 https://t.co/KBDYxybTXu *Unmutes mic*\n\n“How’s the weather by you?”\n\n*Mutes mic* More than 2 billion people don't have access to safe, nutritious, and sufficient food, but the actions we take today can impact tomorrow for the better.\n\nDiscover how #AI is planting opportunities for a food-secure future: https://t.co/ttsSUeaNgb “Hello, hope this email finds you well.” \n\nHow the email found you: https://t.co/EtlFNbMYoP RT @MSFTEnable: As 2020 comes to a close, we are sharing a few of our favorite tips and tricks to help us all work more inclusively in Wind… At the start of the pandemic, @Crocs realized they had an opportunity to offer a little kindness and comfort to overwhelmed frontline workers.\n\nWith the “Free Pair for Healthcare” initiative, Crocs donated over 860,000 pairs of shoes: https://t.co/yIJAtOZbWo RT @satyanadella: We’re thrilled to be teaming up with @KingJames, Bugs Bunny, and @SpaceJamMovie to promote computer education and empower… RT @IPROMISESchool: This STEM lesson is going to be out of this world! 🚀🌍 @spacejammovie @KingJames Our kids are going to have Mr. LeBron… .@Xbox 🤝 @KingJames\n\nWe're teaming up with @spacejammovie. 🎮👀\n\nJoin in on the fun: https://t.co/uevOz9pL5d https://t.co/Zg1cr2afZO @verge Yes, we did. *Joins meeting*\n\n*Mutes mic*\n\n*Unmutes mic*\n\n*Mutes mic*\n\n*Unmutes mic*\n\n“This was great. Thanks, everyone!” @asajohnson Love it. @chriscapossela It's the perfect way to embrace this joyous time of year. ❄️ @stevecla *also available on 4 long-play cassettes* RT @MicrosoftTeams: Picture it—the office holiday party has gone virtual. Thankfully, #MicrosoftTeams has dropped some brand-new holiday ba… RT @BradSmi: Recent cyberattacks on hospitals and vaccine developments make it clear: a multilateral approach is critical to global cyber c… Today's students are going to change the world tomorrow.🌎 \n\nWe’ve created five new lessons for #Minecraft: Education Edition to help students take their first steps into this exciting realm of #AI: https://t.co/z6LwO6DLPY @Xbox Could've guessed. 😂 @MxdRealityDev 😂 @BenThePCGuy We're taking this as a compliment. @DanielHeithorn Knew we would. @Nick_Viviani Welcome to 2020-era Microsoft, Nick. @film_girl 😎 @XboxGamePassPC We can't comment any further. @rparker6112 Never said it wasn't. @panattoni_ 😳 @misstoiletslave It's a yay from us. @colleenrose15 Teenagers. 🙄 @Frances80306737 🤐 @matthafenbrack 💙 @ClarissaGillin2 Every morning with this paperclip. @ChloeCondon We're already working on the '21 release. Can we call you in? @Eli_Weitz Any favorite tracks? @LittleJoe2005_1 We will literally not take your money. @AnthonyParryUK We recommend just playing this tweet over and over again. @tomwarren You know it's funny, Tom. @bocatadelomo 😂 @bdsams Oh, we did. @Margaret_S07 📎 Yes, Margaret. Reply All Records presents: Microsoft Holiday Hits. The great selection of holiday songs EVER assembled. 🔈📺 https://t.co/Ml0lIqGeEt Like many companies, insurance company Youi had to quickly pivot to remote work during the pandemic.\n\nDiscover how their #DigitalTransformation is revealing new opportunities: https://t.co/sH8BqA4wBX Does Clippy run this account?\n\nThat's one secret we'll never tell. 💫 As part of our ongoing commitment to provide relief during the COVID-19 pandemic, we’re actively working with our partners and customers to deploy vaccine management solutions. Read more about our plans to help distribute vaccines safely and equitably: https://t.co/dMmJQyLFpO RT @Xbox: This is just the beginning. \n\nPerfect Dark is back: https://t.co/Hc9OGefdZz \n\n#TheGameAwards https://t.co/Y6hiYZt9jT @Misabr0penguin 😂 @jbernie ... 3 @MrCoinOp We could use the ... assistance. @SicSkeptic14 Thank you, planning on it. @Oh_Hi_Riley 😂 @anguyen216 He's a good writer. @ukiyo__san Us 🤝 You succeeding @kararust You've got this. 💙 @TheCandaceLowry Solid choice. @djjewelz We love you for this. @hollynorth_ Probably not. @Chris21598148 Considering this a compliment. 😄 @me1grehg 😍 @TheBeehammer Essential. A solid 2 and a half hours of work. https://t.co/joJTM2jxQc @Flipgrid This is gorgeous. You don't have to be in the same room to share the cooking traditions you love. 🥧\n\nGet a taste of how technology can help you celebrate the holidays safely: https://t.co/f55jyRaQgW @StephenSobchuk Grandma's kutya 🙌 @Meamp64 🙌 @BlaineThePainTV Always. @rethink_patel 👏 @derra_nic Whoa. *waves but doesn’t unmute* @MichelleKirkla4 9/10 During a challenging year, South Africa's winemakers have found a way to keep the wine, and creativity, flowing. 🍷\n\nCheck out how they're raising a glass to innovation - virtually: https://t.co/9FdrUInjGP Kheer, dumplings, figgy pudding, latkes, Risgrynsgröt, barbecue. \n\nWhat’s your favorite holiday dish? RT @satyanadella: Expanding our partnership with @DeutscheTelekom, bringing together their telco expertise with our cloud capabilities to h… @mattsdl The more you know. 💫 @msexcel Word. @SpartanSHATTER On the second cup of coffee ☕ @bakakuramaa A great day. @thekarachikid *unmutes*\n\n...\n\n*mutes* @khushbooverma_ If only ... @DJ_EddieL We'll leave you to it. @BlackFrankFTM2X Fantastic! @sunnydelight @Xbox @LuLaRoe Coffee, coffee, coffee! @RaphJV 9/10 @DuskyCreeper 10/10 @JordanSpore 9/10 @TheCouzens96 9/10 @MichaelJMohsen 9/10 @VDandavate 10/10 @TylerChess 10/10 @VarunJilla 9/10 @judicael_andria 9/10 @Umangpamol 8/10 @Telixion 10/10 @stroker 8/10 @DigitalMarkLane 8/10 @rparker6112 10/10 @arborbytes 9/10 @ryan4gaming 10/10 @MonsterManuel12 9/10 @HikariYamaoka 10/10 @rethink_patel 9/10 @WAlmario224 10/10 @mistymadonna 8/10 @William24070136 9/10 @Errolbjrr 9/10 @Petmorr 9/10 @SingingNakShtrA 10/10 @StarboyHsp 10/10 @p3traxy 10/10 @LiteraryAthlete Beth! We've talked about this. @libreOfficeLock 🙃 @TheRichWoods 😂 @onedayajedi Love what you did there. @datamattsson Take a deep breath, you've got this. @robertgh33 Excel-lent. How are you doing today? @MohuaBose13 9/10 @MrCoachK15 10/10 💙 @FakeMartha957 8/10 @TheHeathernaut 9/10 @The_DunkFodder 10/10 @faridah_haliru ❤ @derra_nic Same. 10/10 @taejoonutopia 💕 @BradChuck 😂 @intel Dancin'. 10/10 The 80s were wild. ⚡ https://t.co/sbAuHOW2BO @bdsams Alright everyone, he's gone. @bdsams WOWWWWW, Brad. @k_tinathealien 10/10 @enteriosoft 10/10 @zoovu 10/10 @OscarMR_98 ❤ 8/10 @AmalQazi2 10/10 @ThatTechieGirl 9/10 @m3rtyeter 9/10 @ulissesomito 9/10 @KJOFineArt 10/10 As a part of our global skilling initiative, close to 900,000 learners have engaged with one of the ten learning paths in the Middle East and Africa alone.\n\nLet's give a round of applause to our learners: https://t.co/pj8PtF1MRn 👏 @aviraj111 Awww. 10/10 @ChristosMatskas 9/10 @BenThePCGuy 10/10 @ShineyCheese Oh, Brad. @DatAviation How many times has this actually happened? 😂 RT @MSFTIssues: At Microsoft, we have made ambitious commitments on sustainability. 🌄\n\nBy signing the #ClimatePledge, we are lending our vo… @marthalobrien It's the double check mark for us. Brad: Hey everyone, I need to jump to another call.\n\nYou: Wow, Brad. @TheNarratorCody 10/10 @nathanc @KamiKarras 9/10 @mollyiscontent 10/10 @manbirmarwah That aesthetic. 10/10 With the help of the cloud, Indian startup iMocha came up with an online solution for traditional whiteboard coding interviews.\n\nLearn how they accelerated their launch to meet the needs of the pandemic: https://t.co/hGTYIe9fDW @Average_Gaz More of this please. 10/10 @Halo 😶 10/10 @Brokenvegetable Always a 10/10. @IamRahulMitra Yessssss, for the corgies. 10/10 @FallenCptJack 😂 8/10 @ProjectAkturum A little more to the right. 9/10 @elsamareyy Yes. 9/10 @julybug17 One of our favorites. @panattoni_ It's a 10 out of 10. @ajohnsocyber Could use a few times throughout the day. 9/10 @VegaNovus Also us when our coworkers spill the tea over Teams chat. 8/10 @IkeRuaro 9/10 @A_regularJeff 10/10 @speku19 10/10 @MervynCunningha 10/10 @aNtnfny 9/10 @refreshmyjawn 9/10 @maikelson 8/10 @james_scott273 10/10 @Trollgamer63488 10/10 @Spartans5499 10/10 @_defc0n_ 👏 10/10 @Sandforged 10/10 @TweetsfromSara 10/10 @Jaakkim0 :( 7/10 @thedefiantjuan 9/10 @PradeepAnanth_ 10/10 @ErikMoreau 10/10 @sachinbahal Noice. 10/10. @onlytruejames 9/10 @sambu_40 10/10 @nicolesteinbok 8/10 @Nonelistening 10/10 💖 @Xbox 13/10 no question. @VirpiHeikkila 💭10/10 @immi_beresford 10/10 for the turtles. @tomwarren 10/10. Excellent, Tom. @stevekovach 10/10 @JenMsft How we feel right now. 10/10 Reply to us with your favorite GIF and we’ll rate it on a scale of 1 to 10. @maddy_hs :) RT @satyanadella: To more evenly spread economic opportunity and resilience, we must democratize tech intensity by empowering citizen devel… In honor of the power to play, we went ahead and freshened up your background for you. #WallpaperWednesday https://t.co/zYqk8OVeDR Nonprofit organizations face ballooning needs, dwindling donations, and canceled events as the pandemic continues.\n\nSee how Microsoft's Common Data Model for Nonprofits is helping to bridge those gaps: https://t.co/V5DysqPqN3 RT @MicrosoftTeams: 🌨 Wintry Together mode scenes\n🎁 Holiday-themed custom backgrounds\n🥳 Virtual holiday party tips\n\nAll part of celebrating… @MicrosoftTeams 😱 @DrVortx We've got you. ❤ @ScottieN0 It's just to save your inbox. @asalisbury We'll fill you in on the details later. RT @ToniTWhitley: The COVID-19 pandemic drove significant transformation in government operations. Learn how agencies turned to technology… @FridaysOVPyro Could be. @HarmanManchanda Exactly what we needed. Thank you! @anguyen216 😂 @tiredlefty 😬 Moving you to Bcc. Insights in Microsoft Teams for Education are here to help your students achieve their learning goals.\n\nCheck out six ways to help your students shine: https://t.co/YAPvsXcCpz 🌟 You: Does anyone have any questions before we move on?\n\nUs: Yeah, what day is it? RT @Xbox: When we say Power Your Dreams, we mean it.\n\nThis film by @TaikaWaititi was inspired by real dreams @MoonLiteWolfPro had after pla… @JoshuaBurroug19 Staplers. @panattoni_ Didn't you get the memo? @stopit_topit Crispy. @BuildWood Usually it's just silence after that question. @samvardhansingh Thanks @BinZeglam Yes, but not anymore. @BuckWoodyMSFT https://t.co/yeW7c1cQVS Sketch 360 is one example of how you can create pretty much anything you put your mind to. ✏️\n\nCheck out how the project went from Microsoft Garage to Microsoft Store: https://t.co/PCDc0PkRW2 *Unmutes mic*\n\n“That’d be greeeeaaaatt.\"\n\n*Mutes mic* With live, in-person concerts impossible due to the pandemic, @MosesSumney  relied on technology like Azure Kinect to make his recent music video feel more impactful and inclusive.\n\nDive in: https://t.co/ZKzgxcc8Jj @jongallant @MicrosoftTeams 👏 We are the first company to respond to the European Data Protection Board's guidance with new commitments that defend our customers’ data.\n\nCheck out the next steps we're taking: https://t.co/V5weLUdtER @cashifyer Could be. 🤔 @JadeEJF We're here for it. @jocraul Good question. @boringfileclerk Prove it. @_ABOwens Sammy is everything. 💘 @AllisonAngel_ \"Alright, let's get started.\" RT @satyanadella: This year in particular has shown why the public sector is so important to every facet of our society and economy, and we… 12/7/1978 📸 https://t.co/nUARU8aSml You: I seem to be having some WiFi issues, just get started without me.\n\nEveryone else: We’ll wait. Make your list and check it twice. ✨\n\nNew features from Microsoft Edge and Bing are here to make your holiday shopping extra nice: \nhttps://t.co/Yn9GR0qTie @Rick_Kingery 😅 @EditsSaturn You too! 🌼 @MtbServpro Can't confirm or deny that this has happened. @DigitalManiak3k RT 😂 @b3qa_ 🧯 @auhrian 💓 Them: *marks email as urgent* \n\nYou: Relax. Everything will be okay. Update: https://t.co/5cn7Zzlwt1 A treat for every decision that yields a desired result. \n\nLearn more about Microsoft Personalizer, which uses a more cutting-edge approach to machine learning called #ReinforcementLearning: https://t.co/fxUdKea8MR https://t.co/O4F67ARePy @TheMysticFez ❤ @Zvyozdochka Truth. @rayd_250592 Thanks, Raymond! @shanselman Is it me you're looking for? @Dana_cinnamon Staying hydrated is 🔑 @igrir You're too kind. @paulfabretti @trishskee Team work makes the dream work. We hope you both have a great weekend! 💘 @shanselman Can you hear me? @realfemboy I hope tomorrow's better! @BooyakaFN Amazing! @buttercup_chara Very eventful. Have a great weekend, Chara! @baconisalluneed Hope it gets better! Tomorrow is a new day. ❤ @coilvision Excellent. Checking in again, hope you had a great day. 💘\n\nAll my best, \nPerson who runs the Microsoft account @panattoni_ Sorry! Sending the link now. @Windows Even though they're flat and made of plastic? As educators continue to navigate a new landscape, we're helping them track their students' engagement and progress over time and across classes. 👩‍🏫\n\nLearn more about the updates to Insights in Microsoft Teams for Education: https://t.co/Eui6bRIb1q @RossUKRFC There's always one. @itsayushpathak Kibble or chow. @KeKaTwi 👀 @Meganisrad Excellent choice. RT @MSFTIssues: 2020 has been a roller coaster. 🎢\n\nWhat happened at Microsoft this year? Breaking down our CSR report in a thread. ⬇️ https… @OsmanBhatti Thanks for the offer. We are looking for at least 1.5Mb. @JustineHMathews It's third, Justine. @JoshH520 Meeting. Free. Fridays. @XboxGamePass Mom. @Ajmal_30 It's the most important meal of the day. @CheeringXBoxer Very true. @lorena_msft ❤ @666beerguy It's a yes from us. *sigh*\n\nA Microsoft Teams call we'd love to join. https://t.co/FX1F4VfWoz Here’s a @powerpoint on how to win an ugly sweater contest, with talking points below.\n\n- Make it ugly, but cute. \n- Nostalgia, nostalgia, nostalgia.\n- Pay attention to the details. https://t.co/hIdDDpYyYL In this free @MicrosoftLearn Module, discover the principles of sustainable software engineering and how to maximize carbon efficiency. 💡🌱\n\nGet started: https://t.co/OyPJ89Kzsg https://t.co/Qa1jClasGq Did you eat your lunch for breakfast again? RT @satyanadella: Today, we announced new capabilities to help every organization harness the full power of their data. Here are highlights… @Crazygamer360 Coffee time, all the time. ☕ @SLJeffrey3128 Tessie looks very sorry. 🥺❤ @SheelMajumdar They could all be best friends. 🥰 @DaTruthofMikeP 😍 @ShaneCarrollMay Cooper is always ready to strike a pose. 🌟 @Carike_B 😍☀ @ShanesCows @PowerApps911 Chewy deserves all the treats. 🦴 @AnthroMetal Hello Samson, Daisy Mae, and Miss Scruff! @TobyBaratta Working very hard over there. 😍 @logicwinsalways What a cutie. ❣ @toomuchnoise 🤔 @BarinCommandos We love your Outlook. @GAYFORGOJO 💖 Does anyone have a floppy disk or two? https://t.co/0IyI5YWTBn RT @MSFTEnable: Together we have the collective power to create a path toward an inclusive recovery. \n\nIn honor of #IDPD, learn about stori… More than 1,000 Indigenous students around Australia took part in the first National NAIDOC Minecraft Education Challenge.\n\nDiscover how they took inspiration from Indigenous knowledge to look forward to a sustainable future: https://t.co/2hLkdBQIuY RT @bing: Today is International Day of Persons with Disabilities. Join Microsoft Rewards &amp; start Giving with Bing to help @SpecialOlympics… You: I’m going to be so productive today.\n\n10 minutes into the workday: Welp, it’s about time for a snack. Word. https://t.co/LHQbdptyVf Rufus had himself an adventure, didn't he? This feels like a great opportunity to ask you to share pictures of your pets in our replies. https://t.co/FClliU6cy1 Have any more tips? Share them ⬇️ #IDPD Tip #3: Avoid using many emojis in a row or special font. Click into the video and listen to how a screen reader renders the text included in this post. #IDPD https://t.co/2lqwhH6JZx Tip #2: Whenever possible, place hashtags at the end of your tweets and don’t forget to capitalize each word. #IDPD https://t.co/erSkYmlS0k Tip #1: Add descriptive alt text to images. #IDPD https://t.co/y0sEqB3COP With more than 1 billion people with disabilities in the world, it’s important to implement social media practices that are accessible. \n\nBelow are a few of the tips we’ve learned on how to make content more inclusive when posting on Twitter. #IDPD @BigDawgMills Thank you for your submission. What is this floof's name? 🐶 @k_wolfkill @Halo Ditto. 💚🐶 @muhname_Jeff @Minecraft @MicrosoftTeams @Halo What's the status of Master Chief, @Xbox? @Caboose_V2 @Minecraft @MicrosoftTeams @Halo Exactly what we told him. 💭 @siralysson @Minecraft @MicrosoftTeams @Halo 😂 @kieranmgarvey @Minecraft @MicrosoftTeams @Halo 😂 Please send photos! @emmart9 @Minecraft @MicrosoftTeams @Halo THE EXCITEMENT @Tillablefix1 @Minecraft @MicrosoftTeams @Halo ❤ @ChrisCovent @Minecraft @MicrosoftTeams @Halo Who wouldn't want this doggo? https://t.co/uoC6zzR4RM @stickerboy @ske7ch @Minecraft @MicrosoftTeams @Halo @FreddieLeCat Freddie deserves all the attention. @Xbox Master Chief was like ... 😶 Microsoft 🤝 @FedEx\n\nFedEx Surround, a new platform using Azure ecosystem products including Azure Synapse, helps customers digitize supply chains and use data to manage and track inventory in real-time. \n\nLearn more: https://t.co/ZQMWvqpLEf https://t.co/319GtA8Ysz Enjoy this video with descriptive audio here: https://t.co/dzSOZfZIri @sightlessKombat @Minecraft @MicrosoftTeams @Halo @zentertainment @aarongreenberg @Xbox @jennylayfluffy @hgeller30 Enjoy this video with descriptive audio here: https://t.co/dzSOZfZIri RT @jennylayfluffy: Theme of International Day of Persons with Disabilities is “Building Back Better”, - a disability-inclusive, accessible… This holiday, we’re all yearning to get out there. Follow the story of Rufus, a pup whose dream helps him find joy and adventure in Microsoft worlds like @Minecraft, @MicrosoftTeams, and @Halo. #FindYourJoy https://t.co/rYHsjPhbGy @SEBIBIIIII We replied because we care. ❤ @EditsSaturn 🥰 @Capnhoppy 😂 @PrimeFLytrap You're welcome. @Anes69477096 Right? @MikeUptonPhoto Seriously. @mustanghope08 29 more days. 29. Next slide, please. @MrSimilii Exactly. @tinytigermedia He knows how to get a point across. 😂 @cshilt 😂 @VincentArnett *5 hours later* @IWannaBeAMem3 Never good. 😅 @KarArnett Truly. 😂 RT @satyanadella: Thank you to all of the teachers who have shown so much creativity and ingenuity in the face of challenges this year to h… More than 115 million people use #MicrosoftTeams every day, and everyone has different needs.\n\nThat's why we're introducing new apps to customize your workflow: https://t.co/A7MdqrfWJ0 RT @BradSmi: How do you store 10 million tons of sugar beets headed for production &amp; prevent millions in potential losses for farmers? A li… @OKDecent Please take care of Clippy. @Chris21598148 😶 @SmolKodzuken ty @panattoni_ *unmutes mic*\n\nThis is Nova, my fluffy butterscotch that I love so much. @SEBIBIIIII 😂 @MercedesAMGF1 @GeorgeRussell63 Possibly the best Powerpoint we have ever seen. 😨 @ajohnsocyber 🤫 @notDanielBruns 😂 @kathwilsey This made our day. ❤ It's been a year. Share all that apply. https://t.co/yxCO0YT1uX Even if we can't physically be together, we can still spend the holidays with the ones who matter most.\n\nLearn how to celebrate together, virtually: https://t.co/68YPFs2SHe Caption this\nhttps://t.co/QWgdmlVcWb Today's #WallpaperWednesday theme: holiday Clippy https://t.co/a3Y9ZaX9Yy RT @MicrosoftEDU: One of the best things you’ll read today. ❤️\n \nWe're highlighting the stories of educators around the world who are spear… @btpclarkson 😅 “Creativity is believing in yourself. It’s believing in your idea. It’s keeping on going, and it’s not giving up.”\n\nGet to know four media and entertainment industry professionals with the film Creativity in the Digital Age, presented by Microsoft: https://t.co/6H5QKqK21g *Joins meeting*\n\n*Oh, my. Someone else is already here. I’ve never met them before. Do I say hi?*\n\n\"Hello.\"\n\n\"Hello.\"\n\n*mutes mic* @ATTBusiness Always has to go down like this. Adventure time! Come back tomorrow to watch this good boy dream up an epic holiday journey filled with joy. 🏡 🐕 🎮 ✈ #FindYourJoy https://t.co/b4F80TDHfv RT @MSFTIssues: It's vital that #COVID19 doesn't become an excuse to neglect ongoing education 📚\n\nThat's why @microsoft is continuing to in… @EmilyTimbol This is how all meetings should end. @mrdang @TashasEv 💞 @Ladewig @expta Hi Scott &amp; Jeff! @BarretBlake 😅 @FloorDrees @jansche Hey there! 👋 @thealohateacher @KamaliiSchool Hello to all the heroes at Kamalii! Charles Sturt University is using Microsoft Dynamics 365 to streamline student engagement and uncover insights.\n\nLearn more about their #DigitalTransformation: https://t.co/WcCZuQnxyS RT @satyanadella: This Thursday, I’m looking forward to sharing our vision for the future of data and analytics, along with @Kevin_Johnson,… You: Today is the day I take myself off mute and contribute to every conversation.\n\nYour dog: My time has come. RT @BradSmi: It’s crucial that future developers think critically about the ethical and social impacts of AI. @codeorg's new #AI curriculum… India has roughly 1.5 million engineer graduates each year, but less than 30% of them are women.\n\nLearn how CyberShikshaa is leveling the playing field for India's women in engineering: https://t.co/HFrqmH6eYy @ladyfaith @CoachValbo We appreciate the hustle. Hey Coach. @dcRecruit @Big_B_78 @MicrosoftLife Hey Tiffany &amp; Basim. 💗 @adoptmovement @khalidburke Hi aDopt! 🐶 @Xbox_TechJunky @kolbepayne @TheNobleGrunt 💚 hey fam @IsidoraKatanic @adamj89 Hello Adam 👋 @Dragonlord941 hi dragonlord94 @_w_x_1_ @3blue1brown Hey Grant! @astronautvinyls @Dream Hi Em Hi Dream @bambkb @the_chart_life 💕 @sharaaau @ibrahim_riyash @jumino28 Love the love here. @noah_emeric Right back at you. ❤️ @porpscito @TheJulibean @TheJulianSierra Hey, hello, hi! @AdamKnights04 @MDerrick1992 Hey Matthew! @uLessonApp @e_c_stan 💓👋 @pfornac @JenMsft We'd be lost without them. Hi Jen! 👋 @PJJ191 @MKBHD We all appreciate @MKBHD. @___holo @fereeeeeeeeee @krystalmaths 🥰 hi. @FaimiFai @BTS_twt Hi @BTS_twt! 💜 @Jeyshalee_ 👏 Hi Jasmine!", "bag_of_tweets": ["RT @MSFTEnable: #Include2021 was a global event that brought together external experts and allowed us to explore insights from some of the…", "*Unmutes mic*\n\n*waits 10 seconds to say something*\n\n*decides not to say anything*\n\n*mutes mic*\n\n*types in the chat instead*", "RT @MSFTIssues: Did you know water stores carbon? The more it stores, the more acidic it becomes, affecting ecosystems and global oxygen. 💧…", "St Cuthbert’s is a great example of a school that’s gone from embracing devices in classrooms to innovating with Microsoft Teams. 💻\n\nDiscover the creative ways teachers and students are staying connected through tech: https://t.co/ZV5Pt56M7y", "RT @Xbox: The Women's History Month celebration continues! Tune in this week as we're joined by different women in game development.\n\nSee y…", "@erhangazi For a fully immersive XP-rience.", "@Lehbot82 🙌", "@Mohammad_Dawod_ Facts.", "@stemong 🥺", "@serialtoon Yes? ☁", "@AleksaRakic19 Indeed.", "@KayreeTV 😂", "@steve_trow 😂", "@itsrohanvj 🎶", "@JenMsft You're living in the future, Jen.", "@sarahbeattiee 👋", "@Ryan_Deem Not all heroes wear capes.", "RT @satyanadella: Over the past year, no area has undergone more rapid transformation than the way we work, and as the world recovers, ther…", "RT @MSFTIssues: A healthy democracy requires healthy journalism, but the news today is not alive and well. (1/2) https://t.co/2oPL0UrMm1", "Could this be your next Microsoft Teams background? ☁ https://t.co/2kqFlqhgIa", "60% of people living in the Middle East and North Africa have little or no access to drinkable water. 💧\n\nDiscover how #AI and IoT are helping to reduce avoidable water loss: https://t.co/GPT2k3NgAa", "Today we shared how we’re evolving our hybrid work strategy for 160,000+ employees around the world. Our approach is data-driven and research-backed. Learn more about our research in the 2021 Work Trend Index: https://t.co/Wyu5lCEYvb #WorkTrends #FutureOfWork", "#Include2021 was a global event that brought together external experts and allowed us to explore insights from some of the brightest minds in diversity &amp; inclusion. \n\nIf you missed any of the key sessions, register, sign in, and catch up on-demand: https://t.co/QonDoBua9R", "ICYMI: We hosted #Include2021 and brought together external experts and scholars in diversity &amp; inclusion.\n\nRegister, sign in, and get your favorite sessions on-demand: https://t.co/cEulsh2Keq https://t.co/lc2iBmMhBs", "\"While we don’t believe a single event will provide all the answers, our hope is that the conversations started during Include 2021 will continue long afterward.\" \n\nMore from our CVP and Chief Diversity Officer @Lindsay_Rae_M: https://t.co/U76d9jSEes #Include2021", "Prof. Binna Kandola, Senior Partner and Co-Founder of Pearn Kandola, studies unconscious bias, inclusion, and exclusion. Join him now at #Include2021: https://t.co/mxxdfq0GLO https://t.co/yamQHS59tc", "Dr. Ken Dychtwald, psychologist, gerontologist, author, and Founder and CEO of Age Wave, explores the tensions put on inclusion by the increasing number of generations in the workplace: https://t.co/s14TSh8sQa #Include2021 https://t.co/YcFyeWGr16", "Discussing faith as part of the diversity &amp; inclusion conversation can strengthen overall workplace culture. Join Rev. Mark Fowler, CEO for Tanenbaum, &amp; Dalia Mogahed, Director of Research at the Institute for Social Policy and Understanding: https://t.co/mT2smkpxV3 #Include2021 https://t.co/sW8VRc0SwH", "Did you join any of the sessions at Include 2021? Share what you enjoyed most about your experience using #Include2021.", "A growth mindset is an important foundation for diversity &amp; inclusion as it emphasizes building understanding over time through intentional effort, making mistakes, and then applying learnings. Join Eduardo Briceño of Wiring Growth now at #Include2021: https://t.co/JtFVE2f2fS https://t.co/p9JA5Q1JvZ", "@2AccessAbility 👏", "Join Charlotte McClain-Nhlapo, Global Disability Advisor for the World Bank Group, to gain better awareness of the spectrum of identities within the disability community: https://t.co/WPt75jkMJS #Include2021 https://t.co/DrgOL72x87", "Brad Smith is joined by General John R. Allen, President, The Brookings Institution, and Dr. Camille M. Busette, Senior Fellow, as they share how Brookings is using their research approach &amp; insights to inform their focus on race and inequity: https://t.co/1PUjW33rq3 #Include2021 https://t.co/iSuBMZQDzl", "Dr. Stephanie Creary, from the Wharton School of the Univ. of Pennsylvania, addresses the need to explore privilege &amp; marginalization in the context of identity, &amp; the importance of understanding our own identity as we work to include others: https://t.co/r4zvv5ybXx #Include2021 https://t.co/xaOzPVWhc6", "Chief Human Resource Officers at Microsoft, Accenture, Johnson &amp; Johnson, and Chevron discuss what it means to lead diversity &amp; inclusion work with empathy, accountability, and sustainability now at #Include2021: https://t.co/Rt5V5Cp3LW https://t.co/P6MQjgFwOT", "@JazzGirl68 😂", "@1971genx Same.", "@suedeyloh @SesameWorkshop ❤", "@mrlacey Us too.", "Alphonso B. David, civil rights lawyer &amp; President of the Human Rights Campaign, is a leading advocate for LGBTQI+ equality. Alphonso will explore how a nuanced understanding of this diverse community can lead to a more inclusive culture: https://t.co/ryJlti5Ndg #Include2021 https://t.co/ZJ7EYkv2yw", "RT @Lindsay_Rae_M: When we stop making interpersonal assumptions we can build workplaces that are “not only inclusive but also transformati…", "Dr. Jeffrey Lieberman, Professor &amp; Chair of Psychiatry at Columbia University, is joining us now at #Include2021 to discuss the stigmatization of people with mental health conditions with a focus on how organizations can provide greater support: https://t.co/1UDn7Ib7RE https://t.co/CacGmrZh8F", "@jennylayfluffy @clarebarclay 😻", "@merrie_mcgaw @chasestrangio ❤", "@tidwelljackie @chasestrangio 🙌", "@DeRiikka ❤", "RT @Lindsay_Rae_M: \"Inequality is a problem that we need to redouble our efforts to solve. That might mean being honest that we're not all…", "@marianaatencio 👏", "Microsoft CMO Chris Capossela hosts Sesame Workshop President Sherrie Westin and Creative &amp; Production EVP Kay Wilson Stallings to explore how storytelling can help kids everywhere grow smarter, stronger, and kinder: https://t.co/KC5kV0J1vh #Include2021 https://t.co/ZeE8CIOBoV", "RT @Lindsay_Rae_M: \"Bear witnesses to the trauma, learn, and then take action.\" What a powerful message. In order to drive change with impa…", "Chase Strangio, Deputy Director for Transgender Justice with the ACLU LGBT &amp; HIV Project, joins us at #Include2021 to discuss the evolution of how we think and talk about gender in the workplace: https://t.co/LnYwGSJliZ https://t.co/Et6YeBjz1C", "@ClaudiaMRamirez ❤", "@bosemanator @MichaelEDyson 🙌", "@therealmarcusb Thank you for this. ❤", "Lindsay-Rae McIntyre, Microsoft Corporate Vice President &amp; Chief Diversity Officer, shares more about Microsoft’s growth mindset approach to diversity &amp; inclusion now at #Include2021: https://t.co/l5DzIT0cPM https://t.co/YcDAgvTEDQ", "@BTTBBrack 3 for 3. 👏", "@MaiOui77 ❤", "@eeinalem ❤", "@burdettchris Thanks for joining us. 🙂", "@be_shikha 👏", "@k_tnca Us, too. ✨", "@krisbienforreal Haven't stopped watching.", "@TomGlanz_UXR 🙌", "@DigInclusionNYC 👏", "@hearherhere 🥰", "Join Kenji Yoshino, NYU School of Law prof &amp; Director of the Center for Diversity, Inclusion &amp; Belonging, as he explores the ways we cover in the workplace, &amp; how covering demands can put undue pressure on those from marginalized communities: https://t.co/CiKvH6okUd #Include2021 https://t.co/2PdVg3oqhw", "@RobSemsey ♥", "Dr. Michael Eric Dyson, Dr. Adrienne J. Keene, and Dr. Balmurli Natrajan provide perspectives on the global nature of the conversation about race in the workplace, happening now at #Include2021: https://t.co/lE7yL7wq5Q https://t.co/oNjCdv8Ulb", "@taracdennehy US TOO", "@therealmarcusb 👀👏", "@katscorps Thank you ❤", "@clinty Thanks for joining us today.", "UCLA &amp; Columbia Law School Professor Kimberlé Crenshaw coined the term intersectionality to describe overlapping social identities. Learn how different types of inequities can compound, and the ways that they fuel bias and discrimination at #Include2021: https://t.co/Zs9PIRiYv8 https://t.co/zf2b8vtoZw", "@reneebsanchez1 A great takeaway.", "@RostiResetEra ❤", "RT @Lindsay_Rae_M: Today, we’re engaging in #diversity &amp; #inclusion with intention. #Include2021 brings together global experts on topics l…", "Being an effective ally is more than just having good intentions. Award-winning NYU Stern School of Business Professor Dolly Chugh joins us now at #Include2021: https://t.co/HNTH5NvniE https://t.co/eYFYjwp2bA", "To listen, learn, or engage? Tell us why you're joining Include 2021 with #Include2021.", ".@FredHum, Microsoft CVP, US Government Affairs, on the digital stage at #Include2021. 👇 https://t.co/cgfGzqqJgg", "Thank you to our #MSPartner Network for making #Include2021 possible. We appreciate your commitment to diversity and inclusion: https://t.co/IoEAmDvmWQ", "\"At Microsoft, we believe inclusion is a choice we each must make, both on the individual and organizational level. We know real progress doesn’t happen without real work.\" More from @Lindsay_Rae_M on #Include2021: https://t.co/51tNb8zmAb https://t.co/51tNb8zmAb", "Nick Parker from the digital stage. 👇 #Include2021 https://t.co/OEwqNz6lbM", "The industry has expanded its understanding of the power of empathy-driven leadership. \n\nOn the digital #Include2021 stage, @Lindsay_Rae_M shares three steps for leading with empathy. https://t.co/Cq5KrkW7jR", "We've worked hard to turn employee insights into action for diversity &amp; inclusion.\n\nAt #Include2021, @Lindsay_Rae_M shared how we're prioritizing inclusion at Microsoft. https://t.co/rPJ47ZW4ij", "What does it mean to create a culture of inclusion? #Include2021 https://t.co/pU5SGlS0MY", "At Microsoft, we talk about the human case, the business case, and the geopolitical case for diversity &amp; inclusion. - @Lindsay_Rae_M at #Include2021 https://t.co/zbx24hXM07", "Lindsay-Rae McIntyre, Microsoft Corporate Vice President &amp; Chief Diversity Officer, is speaking now at #Include2021. \n\nJoin the session: https://t.co/LeXTTRd1ON", "“… this event is an event which, in a counterintuitive way, is about us all being at our listening best.” Microsoft CEO @SatyaNadella #Include2021", "\"D&amp;I is a business priority.\" - Microsoft CEO @SatyaNadella from the digital stage at #Include2021", ".@SatyaNadella to @DarrenWalker at #Include2021: \n\nWhen you think about business leaders making an impact in D&amp;I, what's one thing you want to see leaders actually do to move the needle faster? https://t.co/7mOjRcZfHV", "Q: What should managers and leaders be good at? \nA: Model. Coach. Care. \n\n#Include2021 https://t.co/XbUMPDpBWb", "Diversity &amp; inclusion is front and center. \n\nAccording to @DarrenWalker, what we'll see in the next year is the difference between performative acts and those engaging in the hard work in an ongoing way.  #Include2021 https://t.co/1LHmld7fbH", "If we want to empower everyone in the world, we better represent the world inside. More than that, we need to include the world that we represent inside. - @SatyaNadella, Microsoft CEO #Include2021", "What Darren said. 👇 #Include2021 https://t.co/MNuJhOxau7", "According to @DarrenWalker, D&amp;I is a win-win.\n\nDiversity will lead to: \n◾ More success\n◾ Better performance\n◾ Higher levels of satisfaction among staff\n\n #Include2021", "Register for the event to catch all the sessions: https://t.co/YTNt9b2dub #Include2021", "Tune into the livestream: CEO @SatyaNadella is joined by Ford Foundation President @DarrenWalker for #Include2021. https://t.co/pF7lYtUwB4", "#Include2021 has begun! Join the opening session, where members from the Microsoft Global Diversity &amp; Inclusion team will outline how you can make the most of your event experience, and introduce you to the diversity &amp; inclusion conversation. \n\nRegister: https://t.co/BZBl6xMVtJ", "Acts of hate and violence continue to unfold, including yesterday's horrifying attack on members of the Asian community. We're angry and saddened, and we start today more determined to bring people together across the world to accelerate the work necessary to drive change.", "Progress on diversity &amp; inclusion requires us each to examine our attitudes, decisions, and our perceptions. And then we must do the work. #Include2021 https://t.co/2iUJlpZ1HO", "RT @MSFTIssues: The main obstacle to diversity &amp; inclusion is the lack of awareness. \n\nGet ready for #Include2021 by exploring the ABCs of…", "@JvDuijvenbode That sounds familiar ...", "@Brokenvegetable 😂", "@Mercedent Can't argue with that logic.", "@early20smind Fair enough.", "@webrendyn 📝", "@jamesmcroft Impressive!", "@JenMsft Touché.", "RT @Lindsay_Rae_M: Tomorrow, @Microsoft will host #Include2021, bringing together global thought leaders for a free, digital #diversity and…", "If you miss a meeting that’s being recorded, do you actually watch the recording? Asking for a friend.", "@GlenMitchell1 You go, Glen Coco.", "@Iamakshaypillai You're on mute.", "@bhandary_chirag Wowwww.", "@raidergirlchell Whale hello to you, too. 🐳", "@ScottRGross Anytime, Scott.", "@Millicom 👋", "@samvardhansingh So far so good. 😎", "@toddjmercer Doing well, thanks! How about you?", "@nicodevitalia Ciao. 👋", "@SEProtomartyr Can neither confirm nor deny.", "@thomasjo Yes.", "@Snow90K A strong opener.", "@animalc95546667 ❤", "@film_girl Nm, hbu?", "RT @satyanadella: I’m looking forward to my conversation with @darrenwalker and learning from the many other speakers at #Include2021 Wedne…", "@WindowsFrance Bonjour! 👋", "By the end of this century, two-thirds of the snow and ice in the Hindu Kush Himalayan could be lost because of climate change. 🏔\n\nDiscover how our #AIForGood Research Lab is working to track the effects with data: https://t.co/eF3fgh3UUa", "\"The Power of We: A Sesame Street Special\" features Elmo, Abby Cadabby, and friends, as they learn how to become “upstanders” to unfair treatment based on skin—or fur—color. \n\nMore on the special: https://t.co/QCKA8yYYlD https://t.co/nqPwoKPpUv", "Sesame’s newest Muppets are twins to be featured in groundbreaking Rohingya-language content—part of Sesame “Workshop’s Play to Learn” program supporting children displaced by conflict.\n\nMeet Noor and Aziz: https://t.co/4Y3W0ZHEWc https://t.co/n4WNCLlSlj", ".@SesameCommunity support for the caring adults in children’s lives help s provide the best start in life. Browse activities and tips on tough topics like parental addiction, COVID-19, divorce, and more: https://t.co/qx4AfIWIkO https://t.co/Jx55l6uZ4Q", "Sesame Workshop - Everyone's Street. Learn more about the nonprofit behind Sesame Street—a community built on diversity, equity, and inclusion, where people come together on a mission to help kids grow smarter, stronger, and kinder. https://t.co/oRRFeQITM1 https://t.co/3bThP4qxZj", "Join Microsoft's @chriscapossela, @SesameWorkshop's President @SherrieWestin, and EVP of Creative &amp; Production Kay Wilson Stallings to explore how storytelling helps kids everywhere grow smarter, stronger, and kinder. Register now: https://t.co/xGgfyPwMiO #Include2021 https://t.co/f9yfd7XDme", "Hi.", "PBS NewsHour reports as part of their Race Matters series, featuring Nicole Turner-Lee, how the pandemic has put millions of students with limited broadband access at risk of falling behind.\n\nWatch: https://t.co/fBuU0fZq7K https://t.co/9kUvCVndxN", "In this Brookings Cafeteria podcast five-part series, John Hudak, senior fellow in Governance Studies, explores the facts and tackles the myths that underpin the immigration policy debate. Explore the episodes: https://t.co/H43Epf2G1n https://t.co/0D14e9ZRV2", "In this episode of the Brookings Cafeteria podcast, @CamilleBusette shares insights on how social networks in four American cities impact social mobility, and what that research says about social networks by race, gender, and income: https://t.co/P19AxIJEmB https://t.co/EJ6tIBE9EF", "Join Microsoft's @BradSmi, Brookings President General John R. Allen, and Senior Fellow Dr. @CamilleBusette as they share how @BrookingsInst uses research and insights to inform their work on race &amp; inequity. Register now: https://t.co/oL9BwYMJCF #Include2021 https://t.co/lQrvMRbAVp", "\"We knew we wanted our new campus to be zero-carbon in its daily operations, so we had to think outside the box.\" - Katie Ross, global sustainability lead, Microsoft real estate.\n\nCheck out the new Thermal Energy Center at Microsoft's Redmond campus: https://t.co/wWsQQ1PmKJ", "#Include2021 kicks off in just 24 hours. ⏰\n\nRegister to take part in this free, all-digital event focused on diversity &amp; inclusion: https://t.co/305GqS7Ota https://t.co/QL0PBMBcNw", "RT @Xbox: You don’t need a Vibranium shield to be a hero. Admittedly, it does help.\n\nExplore @XboxGamePass on Xbox #SeriesX and #SeriesS th…", "More than two million NHSmail mailboxes have moved to the Microsoft Azure cloud.\n\nLearn more about their vision for cloud-first healthcare: https://t.co/EvhoSE9RtH ☁️", "Real progress doesn't happen without real work.\n\nJoin us for #Include2021, a free, global, digital event focused on diversity &amp; inclusion: https://t.co/wXnFXuJFDw https://t.co/KvhVw1ZjXV", "Plastic waste contributes to 80% of marine litter. One startup is using #AI and blockchain technology to combat that fact. \n\nLearn more about the #AIForGood Challenge winner, Carbonbase: https://t.co/bO9WA1jPqn", "RT @MSFTIssues: We’ve seen the power #AI has to accelerate health research. 🖥️ 🏥 \n\nLearn more about the progress our #AIForHealth grantees…", "Join us on March 17 for #Include2021, a free, all-digital event focused on diversity &amp; inclusion: https://t.co/QnPCrH9b99", "Word of the day: https://t.co/of9E7uoJaP", "How to address the surge of anti-Asian hate crimes: https://t.co/k6ftnDA1GF", "We’ll continue this conversation by opening our doors to the public next week in a company-wide diversity &amp; inclusion event where we’ll learn from external experts in the field. We invite everyone to join us on our journey: https://t.co/Woi19nRsOf", "Learning Together during Challenging Times: https://t.co/lA0cJrBEDS", "COVID-19 and advancing Asian American recovery: https://t.co/hJiAcZ0QaP", "A readout of the Department of Justice’s efforts to combat hate crimes against Asian American and Pacific Island communities: https://t.co/KiS4xrVZHA", "Microsoft condemns hate, racial discrimination, and violence in all forms. #StopAsianHate https://t.co/RIVsoLxiv7", "@QueenieKris Great names.", "@travis_orozco Understandable.", "@RupanjanaDutta 😂", "@slecnapancelka Where is the lie?", "@janeyalliso_co Bailey runs the home office.", "@matt40k We do. ❤", "RT @Xbox: #XboxAllAccess Is Your All-Inclusive Pass To Xbox\n\nLearn more: https://t.co/nwHXAawbfL\n\n#BethesdaJoinsXbox https://t.co/t0s8L4PdRH", "@ibmrwhite Pass this on for us: ✋", "@KazVentures Onward and upward, Holly.", "@StiggyBroChaCho ❤", "@ELLZ54348178 No. We LOVE him.", "@jadezonedd BEANS. ❤", "@ConsciYashhness 😍", "@ItsReallyMyName Aren't we all.", "@D1Strunk 😂", "@JennDavisSharp Same, Felix.", "@TAlfred12 \"Puppy\" is a state of mind.", "@jamieyates We see what you did there.", "@margot_peterson The skill.", "@thecat438 😹", "RT @judsonalthoff: .@Microsoft is collaborating with @Total to further both of our companies’ net-zero pledges. #DigitalTransformation #AI…", "@Simplyhussam 🐝", "@TheCulturePearl Pawsitivity is key.", "@_s_hari 💤", "@AbreuuMatheus Facts.", "@BrianHackney Oh, to be Amos.", "@tamstar1234 Same.", "@AasifAbdullah Wild One.", "@GlaucoDamas 😭❤", "@yuri_flexa Both. 😂", "@SGRiverDan Any dog can be a lap dog.", "@louan_visser Happy early birthday, Max!", "@saralobkovich ❤", "@AlexBlount This is amazing.", "@thatzanimefan 🐍", "@YooHoodY We're the fan.", "@Benjamin_Mateos He made us smile, too.", "@DedsAltheman 💚", "@kirsten Who could resist?", "@DrewZilm @Xbox 🐿👀", "@ekston @jhochwald @JenMsft 😂", "@LundbergBjorn A well-deserved rest.", "@Worrelpa Look at this loaf.", "@HumanVanguard Rude but also cute.", "@DamoBird365 🐔🗣", "@BertieBrink That's perfect, thank you.", "@Jess_Wicklund 😍", "@Noctury_ 💚", "@Spongeym 🙌", "@gannonbreslin 🤩", "@ArielSam924 Incredible. 😂", "@FrontlineRabbit Love to Athena. ❤", "@Bithie We love the enthusiasm.", "Understanding builds empathy. \n\nJoin us on March 17 for #Include2021, a free, all-digital event focused on diversity &amp; inclusion.\n\nRegister now: https://t.co/DZRP2diO5H https://t.co/2k9CW3qyi1", "@chrismarkham_ We understand.", "@ShawnReynolds_ Called out.", "@theMMB 🚀", "@Xbox *wipes tear*", "How it started          How it's going https://t.co/I7bZwWvwHd", "RT @XboxP3: Excited that more players around the world will be able to discover 20 beloved Bethesda games in Xbox Game Pass tomorrow. Most…", "@yinzerjay80 Looks familiar.", "@SuperpopfizzYT 💞", "@KatSphinx_ Sending love to Bella. 💜", "@zoe_bowens ❤", "@monkeypuzzle 🐔", "@MiStudent41 All the better to hear you with.", "@jcs98177 Oh, Shadow. ☕", "@leestar81 😂💤", "@hawka_flocka They are.", "@Pixelaffe 😍", "@AA_priceless Pepper said \"no more work today.\"", "@5Sweetnlo He's stolen our heart as well.", "@chri1sw4de 💕", "@LuciaMaria83 Merlin Arthur, lord of teefs.", "@hughes12364 She is an icon.", "@Estrella_31 ❤", "@ferclevs So much fluff.", "@SkyeTheWeeb 😂", "@bitsourceky Sometimes we nap under our desk, too.", "@MermaidenSea Love this action shot.", "@SQL_Gal Best WFH buddy.", "@CybernettX Chilling in a box, as one does.", "@BurstOrangeTech Hi Popcorn. 🍿", "@MissHoadley 😂", "@BrianHunt04 Doing his best!", "@Dragos2305 Noni deserves a treat, or several.", "@filesamury You win best name ever.", "@AutumnSchuman This cake. 😂", "@rossochs *mlem*", "@ActualCassandra Hello sweet Yumi.", "@yooniverse_art 😂", "@edbaker1965 👋", "@erlaxs Hi Cheeseburger! 🍔", "@krngml Lives rent-free in our hearts.", "@EmsterBuzz \"Please, no photos.\"", "@All_Mike__ The bowtie though.", "@noobsita453 We would be too, tbh.", "@paulbright7 Doug. ❤", "@mattkirbylondon 👑", "@thekarachikid Samosa is all of us.", "@Warhans_ Hi Sushi! 🍣", "@pina_me Absolutely. 🐉", "@SrHombre *derp intensifies*", "@rssingh001 🥳", "@kenji_yoshino @StephanieCreary @AlphonsoDavid @ebriceno8 🖋 Co-founder and partner\n🧠 Business psychologist\n\n@Binna Kandola studies gender bias and unconscious bias in organizations—and he'll be at the all-digital #Include2021: https://t.co/pHP5vLnmVk https://t.co/0AAPqTXA3T", "@vekzdran Lily has a very important job.", "@Jeff_Maw Ruh roh.", "@mattyboy182 Smoosh.", "@cnrdzn Relatable.", "@JoshSysAdmin So fashionable.", "@CDLHamma 10/10 adventure buddy.", "@UploadSurgery 😍", "@lisaschell_ We like turtles.", "@Hyperkin Wait a minute ...", "@Benjamin_Mateos A good boy.", "@Ginger_Graham We appreciate the time, Diesel and Lili.", "@IvanAtBaja Mood.", "@keiruuuuh Please tell us they're best friends.", "@Darthspidey117 😍", "@BeagleMaster7 Hi Max.", "@cashewshideout ❤ x 3.", "@Meganisrad *gives boop*", "@ChristianJWhite Hello, Pepper!", "@Aaron_88 ❤", "@davethegeek Angels. 😻", "@Crazygamer360 😍", "@tamstar1234 Well it is Thor's day. 😏", "@CrucialMemory 10/10 would want Royce on our team.", "@daveberning So distinguished, so refined.", "@akshattak You're best friends now. We don't make the rules.", "@TempleOfFive 😂", "@sam_mcdevitt MONTY. ❤", "@liberaotoiin We love them too.", "@jonnychipz Tell Luna we say \"woof.\"", "@the_jamilah Hello, Handsome Hank!", "@RossRichendrfer So cozy. 😍", "@DecryptedGamer Goals.", "@GillTheThrilll Nails painted?", "@rorypreddy Plants count if you say they count. 🌱", "@ZaccaryVega Balance is a 10/10.", "@dulciedarling1 Can Daisy lead every meeting please?", "@Haut3Sauc3 Taking naps between calls is self-care.", "@pelirroja_jenn Wrennie is one of a kind. 🐾", "@Xbox Thanks fur trying.", "In the first year of our commitment to becoming carbon negative by 2030, we reduced Microsoft’s carbon emissions by 6% or roughly 730,000 metric tons.\n\nCheck out our climate progress report: https://t.co/3WBNnbJaHm", "Please share pictures of your pets in our replies.", "✅ Virtual care is here to stay\n✅ Innovation will continue to shape healthcare\n✅ Balancing innovation with security, privacy, and compliance is critical\n\nLearn more about Canada's #healthcare learnings for 2021: https://t.co/wvIcDZMHOW", "@implicitazhar 🤯", "@jaydestro You hear what I said, Ton?", "@sxmchxng 🙌", "@honorcow \"The latter.\"", "@jkline120 You're welcome.", "@Wezzer1993 *sigh*", "@PrivacyTutor_ We've come a long way.", "@JoeBeernink 🔮", "Breakout rooms, Tasks publishing, Approvals, and more. ✅\n\nNew features in Microsoft Teams are making it easy for everyone to engage and connect. \n\nHere's how: https://t.co/bw3BTiiSP2", "@jacksinboston Now that we're all gathered ...", "@RubyCorgi 😍😂", "@roguebogey *swoon*", "@JenMsft Exactly.", "@RmTux Thank you, Rami. ☺", "@msWordExpert Very precise.", "@talktodarrell ❤", "@sethjuarez Always embrace the awkward.", "@BadonkaDoge CLICK", "@cathusmax Did it work?", "@miabollandx It's called \"fashionably late.\"", "@SatelliteTracy What did the cat do?", "@Purple_Jas_x Yes.", "@Quntry_mouse It's a power move.", "@clarkesince91 You're doing great, Lauren. ✨", "A free look into the future. https://t.co/whLb4iDXTv", "@golden_daylight \"Duckies\" ❤", "@bebunchful 🙌", "@JAYCVM Works every time.", "@msajolliffe @coreyhughesICT 💨", "@sarrahghazal Oops.", "@m3sweatt Good point. 😂", "@annie_parker It's the polite thing to do. 👋", "@rkaur526 Life moves fast.", "@Y2SHAF Every day.", "@WrightDW There can only be one.", "@Windows 👋", "RT @MSFTIssues: Supporting nonprofits that serve Black and African American people. Helping people get broadband access. Bringing in more B…", "\"During my hour-long meeting in Microsoft Mesh, I constantly felt like this could be a far-future version of Microsoft Teams.\"\n\nCheck out @verge's take on our latest announcement, Microsoft Mesh: https://t.co/p4B1Lu42nE #MSIgnite", "That moment between when you say goodbye and actually click the “leave” button. 😬", "Kriti Sharma created a solution using #MicrosoftAI to support women at risk of domestic violence. \n\nRead more about how AI can empower the next generation of women who want to make the world a better place: https://t.co/UASV74HZd5 https://t.co/MTfsPqMEm3", "We’re listening, learning — and more committed than ever to our efforts to foster racial equity, both at Microsoft and in the communities we live in.\n\nLearn more about the progress we’re making in this journey: https://t.co/4KsOy4cHOy", "@threddyrex Yes. ❤ Thank you for checking in.", "@sixnfive @surface 😍", "@kidnoble 😂", "@loverme_justin Agreed.", "@JoshH520 Always. 🐾", "@funkstitch Sometimes we need a change of scenery.", "@LunchWithALens It's *stays on floor* for us. 😂", "@ThisIsIlse The best possible kind of plot twist.", "@stevelatta1701 ❤🙌", "@heygarrett Sometimes it's like that.", "@Meganisrad We appreciate it, Megan.", "RT @Xbox: You know how many game releases you’d miss if you didn’t exist for 5 years? A lot.\n\nDive into 100+ games with @XboxGamePass on Xb…", "@lillydancyger 😂", "@Sirlam_ ❤", "@NickErebia We're honored.", "@BrettAndrewW 😎", "@aiddya It's too real, Ashanka.", "@MayoAHernandez2 Ruff call today?", "@jaydestro Thank you, Jay. 🥺", "@FlashFerret 👀", "@BrewingTalent We would never.", "Join us on March 17 for #Include2021, a free, all-digital event focused on diversity &amp; inclusion: https://t.co/YeKnzqnkzF", "Word of the day: https://t.co/E5bTRaLsiw", "RT @satyanadella: Welcome to the team, Bethesda! Looking forward to how together we will further our ambition to empower the more than thre…", "RT @MSEurope: Reimagining business: an interview with @Microsoft CEO Satya Nadella https://t.co/Gx1iHQxouT via @FinancialTimes https://t.co…", "@BagelBites 👀", "@redbox We see you, Redbox.", "@NickErebia ❤🙌", "@chrislongview 😂", "@ImJattala Beautiful. ❤", "@jonnysun Now I'm falling asleep ...", "@Xbox 🥳", "@aebyeg Bold move.", "@ergosteur One can dream.", "@sinclairinat0r 👋", "@BagelBites Exactly. 😂", "@derekmross 👀", "@Emojipedia 🗣🙌🤖👀💾", "@yallstari 😂🤫", "@_laurenkellyy Facts.", "@hinx 🐱🗣", "@blakedailey It's the GIF that keeps on GIFing.", "@camrynmorrow @UCStudentGov @UCWomensCenter @ucAACRC @UC_Global @UC_EPS @UC_LGBTQcenter @Holla4Chawla @jan4sal @hicksforsenate @BFA_UC 🤩", "@NsovoNHappiness Don't be shy, share with the class.", "@adamfergusonart @thisislux 🎨🙌", "@anthonypjshaw @shanselman 👀", "@GirlSecurity_ 👏", "RT @Xbox: We've always been fans, but now we're family.\n\nWelcome to Team Xbox, @bethesda 💚: https://t.co/wzgWm20Ndp https://t.co/4f6MprUeXn", "*unmutes mic*\n\n“Thanks, everyone.”\n\n*mutes mic*\n\n*signs off*\n\n*lays on floor*", "Let's hear it for our incredible educators who are using technology to make school feel as “normal” as possible, under very abnormal circumstances. 👏\n\nHere's how they're doing it: https://t.co/spanq9c4mQ", "@kenji_yoshino @StephanieCreary @AlphonsoDavid 🔊 Global speaker\n🤝 Workshop facilitator\n🧠 Growth mindset leader\n\nEduardo Briceño (@ebriceno8) is joining us at #Include2021, an all-digital event: https://t.co/oljOG8BmS8 https://t.co/68zhDouw2w", "We’re honored to be highlighted in a new @wef + @scuethics case study series focused on how companies incorporate ethical thinking into the development of technology. \n\nExplore the case study and learn more about our #ResponsibleAI efforts: https://t.co/fRcAfpSrhO", "When you notice that you’re listed as “optional” for the afternoon Teams meeting. 👀", "RT @MicrosoftEDU: Happy #WomensHistoryMonth! This year, we’re celebrating with a new series tracing the legacy of female firsts across a va…", "You can now see Microsoft’s Annual Sustainability Report come to life in a #Minecraft town. \n\nDiscover the free Sustainability City Map designed to encourage environmental stewardship: https://t.co/sEQp1nGIDn 🌲", "RT @MSFTIssues: It's crucial that those who can, do. \n\nLearn more about @Microsoft's mission to become carbon negative by 2030 &amp; its $1 bil…", "RT @satyanadella: It’s fantastic to see how businesses in every industry are using Azure Arc to simplify hybrid management and run Azure se…", "RT @PlayCraftLearn: It's #InternationalWomensDay! Celebrate with two new lessons for #MinecraftEdu. Travel to Pakistan to help Malala rebui…", "📍 Shanghai https://t.co/HUybBWcOM2", "@liliasjillian 🗣🙌", "@katzmandu 😳", "@neko_designer 😂", "@WizardIF 👀", "@totitolvukall We've come a long way. 🐱", "@GuidoKerkhof 🙌", "@astriaren We understand.", "RT @Xbox: Xbox is honoring International Women’s Day and Women’s History Month with a continued commitment to empower women in the gaming i…", "\"Microsoft's new cloud-based AR/VR platform will beam people into your world, and vice versa.\"\n\nGet a deep-dive look into Microsoft Mesh with @CNET: https://t.co/ODNtFPvfNk #MSIgnite", "You had to be there. https://t.co/9oip3OIOKT", "Learn more about the women who inspire us: https://t.co/lOEVPPJse5", "When women achieve more, we all achieve more. This International Women’s Day, we’re sharing the stories of women who are shaping society for the greater good. When it’s her, it’s us. #InternationalWomensDay https://t.co/aQhLI15o9V", "New Microsoft Teams for Education features are here to help you and your students \"spring\" forward. 💻\n\nLearn more: https://t.co/0II3sTpEfe", "@AFu_ 😂", "@LuiseFreese @Grammarly Thank you. ❤", "@crrystalvisions Uh oh.", "@shanselman Whoops.", "@CB_1878 😂", "@jelli__123 @BeccyWoodTV *mlem*", "@JohnELandry A budding professional.", "RT @MSFTEnable: Exciting capabilities are coming to @MicrosoftTeams — more flexibility in how you participate in meetings, voice commands,…", "@ryanrross Don't forget the popcorn. 🍿", "@LuiseFreese @Grammarly ☺", "@quantumudit The future is now.", "@jkline120 It comes in handy.", "@dcschuitemaker Well done, Dirk.", "@luckyokko 👑", "@Dkamps18 Very clever, Danny.", "@the_jamilah 😂", "@_JoshuaTimothy 🙌", "@windowsinsider 👀", "Register now for #Include2021, a free, all-digital event focused on diversity &amp; inclusion: https://t.co/2bsxn8Ne1A", "@ComputerScience Our thoughts exactly.", "Are you registered for #Include2021?\n\nYes           No          I am now!\n 👇             👇                👇", "Do your best work - no matter how you work. \n\nCheck out how we designed #Windows10 in cloud configuration to help: https://t.co/UJtiglQhaX ☁️", "Ctrl+Shift+Esc", "@fettwalp Thank you.", "@rakeshsatyal 😱😱😱", "RT @gavriels1: Inclusion is about all of us. But how do we accelerate the work necessary to drive meaningful change?\n\nJoin us for @Microsof…", "@LucasEduardoMe7 Chaos ✨", "@Norman748 Wow, Norman.", "@JasonJonesLives 👋", "@Grammarly Surprise surprise. ❤", "The newest Microsoft India Development Center, inspired by the Taj Mahal. 🤩 https://t.co/ujLeQBd5Xw", "Does this bother you? https://t.co/wAo6ZvPIst", "RT @Microsoft365: Over the last year, the way we work has drastically changed. We continue to be inspired by how our customers have grown a…", "@matink No. ❤", "@Awritesinger Happy #WorldBookDay. 📚", "@CatStolar 🤩", "@radiatorcat 🐱👒", "@UtdEddie You're a ⭐", "@SuperMarielle_2 😂", "@Beauchampssch Nailed it.", "@garetheve @Minecraft This is amazing! 👏", "@doctorrah 😳", "@EarlTheFlamingo Inbox zero &gt;&gt;&gt;&gt;", "@SSantos26680416 👀", "@c_howard_91 It was worth a try.", "@deltanr1 @_achu @lauriepottmeyer @alliewiz13 @stephenlrose ❤", "@DxnLFC_ Word.", "RT @MSFTIssues: Hook, line, and sinker. How can you stay safe from a potential #phishing scam? 🎣\n\nLearn from our step-by-step guide below…", "@bdsams 😏", "Jackie Robinson was a powerful force of positive change, altering the landscape of sports and the world forever. ⚾\n\nCheck out the cover of MLB The Show 21: Collector’s Editions honoring him: https://t.co/CsqWsTCZxO", "📢 Coming soon: collaborative mixed reality meetings from anywhere. \n\nLearn more about Microsoft Mesh: https://t.co/XuPnB7CHF8 via @TechCrunch #MSIgnite", "“Just bumping this to the top of your inbox.\"", "@steinekin @EthanRothamel 👀", "@BentleySystems @CollinsEngrInc @MnDOT 👏", "@GetFlexSeal Much appreciated, FlexSeal.", "@RyanHamze 🙌", "Technology should help you stay focused and productive, not distracted.\n\nCheck out how #Microsoft365 mobile apps and services are evolving to help you live and work better: https://t.co/J7R3Wl0TVJ", "RT @Lindsay_Rae_M: Later this month, @Microsoft will host #Include2021, an extension of our investment in #allyship. As this article points…", "@francesdonald Whoops.", "@ElliePursey 😂✈", "@acast_94 😂", "RT @Microsoft365: From learning about advanced calling capabilities in Microsoft Teams to empowering your frontline workers, don't miss all…", "@mim_s_b 😂", "@akipman 🤩", "@jaimevelez @MicrosoftTeams 🙌", "@reddit So long as the vibe check was passed.", "@joshisasoftie We're here for you, Josh.", "@MayoAHernandez2 This is a mood.", "@kurtiscorrect We needed that.", "@jonnychipz Doing well, thank you for asking.", "@Dajimoto Said the office chair.", "@miggyp123 It's us.", "@BlutRegnet We have questions.", "@tcmoysak 🙌", "@ClementSharleen 😂", "@jenkuntzGP Thanks, Jen.", "@rparker6112 A classic mixup.", "@seyitaylor ❤ x 3000", "@XboxAmbassadors We've got you.", "@tomwarren Exactly, Tom.", "@wingstop Anytime, Wingstop.", "@legsidelizzy Trying to un-slump.", "@htcvive You're welcome.", "@BagelBites 🍤", "@ComputerScience Proud of you.", "@annefleurdd ❤", "@Reichental Thank you, Jonathan. ❤", "Your Microsoft Teams starter pack. https://t.co/nkxttx9eGh", "@kenji_yoshino @StephanieCreary ⚖ Civil rights lawyer\n🤝 LGBTQI+ advocate\n🏛 President of the Human Rights Campaign\n\n@AlphonsoDavid will be joining us as a speaker at #Include2021: https://t.co/cKEkHuABAt https://t.co/TD1W1hbCxc", "Join us on March 17 for #Include2021, a free, all-digital event focused on diversity &amp; inclusion: https://t.co/vSdJG2ID74", "Word of the day: https://t.co/i61O9fG6q2", ".@akipman describes the making of the #MSIgnite mixed reality keynote and launch of Microsoft Mesh. ⬇️ https://t.co/6LA8Tnabek", "Posture check.", "RT @MicrosoftTeams: New features in Microsoft Teams make presentations more dynamic and meetings more engaging: https://t.co/IsPC2errTS #MS…", "@_JonDouglas You're welcome.", "@MISSDXCN The perfect day! 🙌", "@VirtualisedReal 👏", "@dr_katon @LisaCallegari @andsbossi Meetings will never be the same. 😂", "@MikevZ @akipman Glad you enjoyed it, Mike!", "@vbandi @akipman You're welcome. 🤩", "@Lady___Lovelace ❤", "@mkashman @satyanadella @akipman @HoloLens You never know what will happen at #MSIgnite.", "https://t.co/OAH6B0gJ4A", "RT @satyanadella: Introducing Microsoft Mesh, which enables people to interact holographically with others, with true presence and in a nat…", "For #AI to benefit everyone, it must be developed and used in ways that warrant people’s trust. \n\nCheck out how we're putting our principles into practice: https://t.co/24KZuqE3VE", "RT @ToniTWhitley: Thank you, @MalaAnand_ for sharing your story of leadership and empowerment - reminding us that we each have a part to pl…", "RT @satyanadella: A cloud built for the next decade https://t.co/JAMiZvq5pM", "RT @ramonlaguarta: As we work to digitalize @PepsiCo end-to-end, we've partnered with @Microsoft to leverage #AI in pursuit of even more co…", "RT @azuread: With the general availability of #passwordless authentication in Azure AD, employees will no longer need to use a password to…", "@holgermu 🐟", "@holgermu @satyanadella 👀", "@JoannaStern 😂", "@anoushk77 😎", "@MichaelGillett We won't tell. 🤐", "@seahawkin So comfy!", "@74type181 🏆 #MSIgnite unlocked ⭐", "@harnoor__ We'll let everyone know you said so.", "@bpcs_tech ❤🐶", "Normalize giving time back.", "@theguyonstage 🎶", "@maddiexcampbell ✨", "@Mostafa_fareed You are most welcome.", "@ArmaniMikel Thank you, Bobby.", "@Makovsky2 You get it.", "@walkology A true Piscean.", "RT @NianticLabs: We’re thrilled to collaborate with @microsoft &amp; @hololens on new experiences that will weave together the digital and phys…", "RT @MS_Ignite: #AutonomousSystems are no longer science fiction or expensive moonshots. Customers like @PepsiCo + @Bellflight are driving b…", "RT @satyanadella: As the world recovers, it will require much more from the cloud to address our most pressing challenges, and ensure nobod…", "Thank you for attending the Envisioning Tomorrow keynote from @MitraAzizirad at #MSIgnite. We are excited to learn where your 'what if' takes you: https://t.co/aysHLqLn51 https://t.co/v5v6B6ynhi", "The latest AI breakthroughs in algorithms and computing enable development of massive scale models that will jump start a new breed of applications. #MSPartner and customers like @AvePoint use this technology to create engaging experiences. #MSIgnite https://t.co/8aHi4Xjguj", "What if you could use AI to identify which patients are at risk of stopping their HIV treatment? Meet Dr. Sargent and Dr. Darkoh who have dedicated their lives to transform healthcare systems with AI: https://t.co/jy1HgGBLSs #MSIgnite https://t.co/ulEou1vDW6", "With #AI, we have the ability to simulate and scale interactions, enabling us to do what was inconceivable before. #MSIgnite https://t.co/nHb6NXRuod", "At 5 years old, Emily Whitehead was diagnosed with acute leukemia and her doctors tried everything. She was the first in the world to receive an innovative cancer treatment called CAR T-cell therapy: https://t.co/1uPaSVSiAe #MSIgnite https://t.co/qlgjRZ74Fu", "Advanced technology has made the spread of disinformation easier. Project Origin aims to create a chain of trust for end-to-end authenticated news: https://t.co/LkKGcopotq #MSIgnite https://t.co/PGwiKSvqa6", "AI creates amazing opportunities to augment our capabilities, but it must be used responsibly. We're pioneering frameworks, tools, and tech to enhance digital responsibility: https://t.co/dIAUuVP5yY #MSIgnite https://t.co/uFsLtgqHeB", "Using low-code AI development tools and simulation services on @Azure, any company can create their own #AutonomousSystems. \n\nHere's how @BellFlight uses these platforms to help create autonomous aircraft: https://t.co/KiBxhXqKDb #MSIgnite https://t.co/66dAaMupNx", "The latest AI breakthroughs in algorithms and computing enable development of massive scale models that will jump-start a new breed of applications. #MSPartner and customers like @AvePoint use this technology to create engaging experiences. #MSIgnite https://t.co/ti3rbwjabn", "We're envisioning AI that not only frees us up from repetitive tasks but also augments our own capabilities. Imagine the possibilities of this - any field where human reasoning can be taken to a whole new level. #MSIgnite https://t.co/dj4M28aV5X https://t.co/mlu1lNIYJZ", "All we need to spark imagination is a new perspective – a willingness to break boundaries and look between the lines. \n\nThe most powerful vision of all is how we can use machines to amplify our own human ingenuity: https://t.co/AoHEADksqY #MSIgnite https://t.co/1o8MpkyArc", "Innovation hinges on our ability to see the world differently. \n\nTune in to this #MSIgnite session with Microsoft CVP @MitraAzizirad to explore how we approach innovation.\n\n⬇️ https://t.co/cLnrh78fd2", "@waller_ariana Us too. ♥", "@Victorebukaezea 🤯", "@diepavan Thank you 😊", "@DnsPersson 😂", "@okonkwo_odera 👍", "@Kenn_Kaii 💪🤖", "You weren't expecting trippy music around the bonfire, were you? #MSIgnite https://t.co/PBJpmW692v", "RT @satyanadella: Announcing exciting updates to Microsoft Teams, ensuring people can collaborate inside and outside the organization, lear…", "RT @TommyLee: Cynicals: I wish Microsoft would do something different and not the same old keynote...\n\nMicrosoft: Hold your breath...\n\n#MSI…", "We're committed to enabling IT developers, implementors, and leaders with the platform and tools they need to be ready for the next disruption.\n\nLearn more about the steps we’re making toward that vision today: https://t.co/bnzBpbNzlb #MSIgnite", "Learn more about Microsoft Mesh: https://t.co/es68fQMHx0", "Introducing Microsoft Mesh. \n\nIt enables presence and shared experiences from anywhere – across devices – through mixed reality applications. #MSIgnite https://t.co/xbyO6trHdS", "We can't wait to see the world we create together. #MSIgnite https://t.co/OZL4P5JUNq", "We want to ensure everyone can be seen and be heard and fully participate, whether they are at home, in a meeting room, at the office or in the factory floor. #MSIgnite https://t.co/40cRXQQBf6", "We’re building @MicrosoftTeams as an organizing layer for all the ways we work. #MSIgnite https://t.co/CE0nTQv3qZ", "This is what the @MSCloud delivers, and it underlies everything we will show you this week. The Microsoft Cloud is built to accelerate your transformation today and going forward. #MSIgnite https://t.co/kL5jYwmfET", "Fundamentally, a technology provider should succeed only when it helps the world around it succeed. No one wants to build technology that rapidly scales, but breaks the world around us. #MSIgnite https://t.co/j2aMcA1RCO", "We need to create continuous feedback loops between the work, skills, learning, and credentials required both for the jobs of today and tomorrow. #MSIgnite https://t.co/goRT8i9ebM", "We believe the next decade will require technology advances that radically democratize creation. We'll need to expand access to skills, tools, and platforms, as well as connections and collaboration across communities so that everyone can create. #MSIgnite https://t.co/bpr0O8pAjE", "In this world, data will be more private, more sovereign. Data governance and providence will take on new importance. #MSIgnite https://t.co/zqvzjYNgSk", "Every organization – small or large, in every industry, in every country – will require more ubiquitous and more decentralized compute power. #MSIgnite https://t.co/ekQxtUbDXe", "Over a decade ago, we declared we were all-in on the cloud because we understood its transformational promise and the opportunity it would create for every organization. #MSIgnite https://t.co/YX2jKskMax", "Your hard work, combined with today’s digital technology, is helping fuel our global economy and society in one of its greatest moments of need. #MSIgnite https://t.co/ZAZvlHS05H", "Take a front-row seat to our vision for the future. 🔮\n\nWe're kicking off #MSIgnite with a keynote featuring Microsoft's @SatyaNadella and @AKipman.\n\n⬇️ https://t.co/yVvYyEcsnR", "RT @betsyweber: Counting down the minutes until #MSIgnite  starts with my watch buddy, Rosie. Can’t wait to learn about new releases and mo…", "🚨 #MSIgnite is about to begin 🚨\n\nOur all-digital event kicks off in just 3️⃣0️⃣ minutes with a one-of-a-kind keynote showcasing our vision for the future.\n\nTune in here on Twitter to watch the livestream featuring CEO @satyanadella. https://t.co/i8SPCDjxac", "Ever wonder who’s shaping society today? It’s her.\nCreating, innovating, leading.\nAnd bringing the world forward with her.  Because where women rise, everyone benefits.  And when it’s her, it’s all of us.\n#WomensHistoryMonth\nhttps://t.co/UtpwYpbYpT", "Real talk. 🎙️\n\nNew settings for voice clips are here to give customers more control over whether their voice data is used to improve products: https://t.co/tcQP0STtTQ", "RT @msftsecurity: Lies we tell ourselves: “Just one more Ignite session…”\n\nJoin us March 2-4 to learn about our approach to security, compl…", "Welcome to Pisces season, where Microsoft Paint &gt; Microsoft Excel.", "@kenji_yoshino 🎓 Identity and diversity scholar\n🔎 Field researcher\n🏫 Assistant professor\n\nDr. @StephanieCreary is joining us at #Include2021: https://t.co/qlC6thXnbx https://t.co/5o9qGrpx6M", "⏰ T-24 hours until we're live here on Twitter with #MSIgnite keynotes from Microsoft's @satyanadella and @MitraAzizirad. \n\nLearn more about the event at: https://t.co/4AoKDbYf0s", "RT @satyanadella: Thank you, @MalaAnand_ for sharing this important reflection to start off our celebration of Women’s History Month, remin…", "@CazWilliams_ Passion. Definitely passion.", "@BFLouSarah 🙌", "@gillybee66 😂", "@sonddyyyy GLENN. ❤", "@JessBuildsTech Let Winston IN.", "@thomashaynes_ This is brilliant. 📚", "@Adam_StJacques Beautiful.", "@StegaNetworks Lies we tell ourselves ...", "@the_jamilah 🙌", "@UryensW 😂", "@pagerwho One down, 149 to go.", "@VersaVejo *takes note*\n\nUnread emails are nobody's business.", "@KaninDesigns 👀", "@nanotek7 Well done.", "RT @MS_Ignite: Wait… you haven’t registered for #MSIgnite⁉️ There’s still time. ⏱️ \n\nRegister today and fill your event schedule with Keyno…", "@ErdemErkul The energy we need in 2021. 👏", "@XboxGamePassPC Second breakfast is not to be skipped.", "@jaydestro We do this because we care.", "How are you feeling? You've hardly touched your 150 unread emails.", "RT @Lindsay_Rae_M: No one should have to fear for their safety or face discrimination because of who they are. We are united together in su…", "Fly a drone, make it snow, or challenge an AI model. \n\nExplore how innovation will empower you to transform the world around us in one of our most interactive keynotes ever, Envisioning Tomorrow with @MitraAzizirad: https://t.co/acXh1hGs54 #MSIgnite", "Fuel targets. Space Warp Rollover. Gravity Well. Hyperspace Kickout. The ultimate Pinball. #RetroDay https://t.co/zSE73llFZY", "RT @MSFTDynamics365: #MSIgnite is coming. We'll be there, along with Microsoft #PowerPlatform, and we hope you'll join us. Wondering what's…", "@ArtistModro You're asking a lot from us.", "@eclecticbones Please share with the class.", "@butwhyt68749305 Thank you.\n\n-Humans", "@TechnoCannon Bueller? ...", "@JasonJonesLives 🦗", "@moewinner How about 3?", "@NicoGallegos 👏", "@pcttons That look in the last photo. 😂", "@ElJefeDSecurIT 😂👋", "RT @JP_Courtois: On March 17, @Microsoft will host #Include2021, a free, global, digital event to gain new perspectives and engage in impor…", "@paulfabretti You've got it down to a science, Paul.", "@brandonleblanc An excellent movie reference, Brandon. 😂", "📚 Author and professor\n⚖ Specialist in constitutional and anti-discrimination law\n\n@kenji_yoshino, Chief Justice Earl Warren Professor of Constitutional Law at NYU School of Law, is joining us at #Include2021: https://t.co/q4zfi483jo https://t.co/M9dKNnVknd", "\"Does anyone have any questions?\" followed by the longest 7 seconds of awkward silence. \n\n\"IS ANYONE THERE?\"", "\"Every company has become a software company, and will be soon becoming an AI company.\"\n\nDive into the new AI Business School podcast with host David Carmona, general manager for #AI and innovation at Microsoft: https://t.co/rGzEfnb5zB", "@SarahSmallwood Jenny is a mood.", "@GabbyAHarrison 😂", "@IgniteCountdown ✋", "@adamboxer1 Did anyone bring hamentaschen?", "@robin_jb @CEBeaton_SJA Are they best friends now? Please say yes.", "@thekatrinabean Works every time.", "RT @satyanadella: Our partnership with @AmadeusITGroup will apply the power of Azure and its AI capabilities to create new frictionless exp…", "@MayoAHernandez2 Yes. ❤", "@nbd33 So handsome, so fashionable!", "@KarinaGonzlezS9 No, not one bit.", "@MicrosoftTeams *unmutes*\n\nUs: Please put the dog on camera.\n\n*mutes*", "@JasonJonesLives Your dog should lead every meeting.", "@vogueandcode It's literally all we want.", "@andrewlydiard Who could resist? 😍", "@CarlosAFrancoS 🐱😍", "@Avanade 😂", "RT @MicrosoftLife: As the first Microsoft engineer in Atlanta, Cornelius Parker taps into his Southern hospitality and longtime local roots…", "The Uncovering Talent model presents a new alternative to inclusion efforts within the workforce. \n\nExplore the report from Dr. Christine Smith and #Include2021 speaker Prof. Kenji Yoshino: \nhttps://t.co/wQpcX8emeM", "You: I’m going to pay attention to every word mentioned in this Microsoft Teams meeting.\n\nAlso you: Wow, look at how cute my dog is.", "RT @MicrosoftEDU: Our friends at @MicrosoftStore are hosting a new series based on feedback about what you want! You’ll learn tips to super…", "@matvelloso Those aren't emojis, Mat, but we understand.", "@siddhartha_c @Twitter You're too kind, Siddhartha.", "@fjreed13 Looking now.", "@oh_auntie Rinse &amp; repeat.", "@MattLockmon We'll never tell. 🤐", "@NickDiLo The rubber duck. 🦆", "@steinekin 😱", "@atlcanadiangmr Wowwwww.", "@Cubsfan122112 8?", "@itsrohanvj Very nice.", "@cshilt Now wait a minute ...", "@Peeps40836 Wow, Michael.", "@MicrosoftEDU Here's a gold star: ⭐", "@Hot_Wheels 🏎️💨", "RT @MS_Ignite: New this year: Experience the #MSIgnite Keynote in mixed reality through AltspaceVR! Join Satya Nadella and Alex Kipman duri…", "📢 We're just a few days away from our free, all-digital #MSIgnite event with live keynotes from CEO @satyanadella and CVP @MitraAzizirad. \n\nTune in here on Twitter, starting at 8:30AM PT on March 2, and register at: https://t.co/kEKwVCt95o", "“Did you get my email?”", "@MicrosoftTeams @CocaCola Let's chill, @MicrosoftTeams", "MirrorHR uses #AI to capture, process, and monitor telltale data for potential seizures.\n\nDiscover what this team has accomplished during their Residency with @MSFTGarage: https://t.co/fPgio7PJwi", "RT @MSEurope: “My daughter asks me if I could take care of her sometimes, and I would love to, but it’s a little bit tough.” Thobo-Carlsen,…", "@tomwarren 👀", "@SC1_Sam 😂🤐", "@KateCarrollCB ❤", "@rwmorris *aggressively sends praise*", "@LakeEffectBro Accurate.", "@SharonMacks Amazing!", "@StewartTaylor92 😍", "@cyberantiquity 🤘", "@threddyrex Well isn't this a surprise? 😂", "@XboxGamePassPC @XboxGamePass A coordinated effort.", "@TooLate2Call Don't worry, it's still in our top 5.", "@Flipgrid ❤", "@ibrahimtecha Same. 💾", "@Xbox No 🎮?", "@OMBHOJWANI_ 🥴 is very underrated.", "@ejgarajau One down, two more to go.", "@ShehanThamel You've given us a lot to unpack here, Shehan.", "@TonyArt95 Well done.", "@MSFSofficial 👏", "@loredo Ah, yes. The three moods.", "@XPS 👀", "@annefleurdd Great choices, Anne.", "@itsn0g00d It's important to be constantly curious.", "@licorone We love your commitment to crustaceans.", "@Emojipedia ❤❤❤", "@MicrosoftEdge We would expect nothing less.", "@a_button117 🙌", "@Webroot A truly chaotic combination.", "RT @jeffsand: Join me for our virtual #MSIgnite conference on March 2-4. \n\n📢 Hear from industry innovators.\n😲 Get to know the engineers and…", "@MeenooRami 📢", "Black History is being made every day.\n\nAfrofuturist illustrator &amp; author, Tim Fielder, climate justice advocate &amp; educator, Kari Fulton, and Microsoft employee &amp; creator of diverse dolls, Khulile Vilakasi-Ofosu, are using technology to empower change. #BlackHistoryMonth https://t.co/opTysdhSrM", "These are ours: 🎮🙌 💾", "What are your top three emojis? Reply with them below.", "RT @SpecialOlympics: To better show their community what people with intellectual disabilities can do, Kiné &amp; Khady teamed up in the kitche…", "RT @MSFTIssues: Inclusive hiring programs empower candidates and employees with disabilities and leads to a more inclusive workplace cultur…", "@Schfooge Hello, hello 🎶", "@JayDeeDaz @Harveyadam 👀", "@ravontay 😂", "@Headspace ❤", "@TrumanShoe Impressive.", "@ruthvelah 🙌", "@lauriepottmeyer We feel seen, Laurie.", "@sbisson 🤔", "@JosefTrull Don't *just* say hello.", "@julierliu Now we're getting somewhere.", "@HANOFF We'll allow it.", "@EXCEL *waits patiently for a follow up ping*", "@_s_hari You're welcome.", "@Kerrigannn Okay, maybe.", "@clarkedanny Exactly. 🙌", "@JakeAJakeA *waves*", "@JudeSa69 🤐", "@darren_mg Wowwwwwww.", "@MauroBattellini Was that the plan all along? 👀", "@jaydestro 😑", "@Halo Appreciate that.", "@hollidaymode Thank you.", "@Starboysagi Ok, we're friends now.", "@TheRegister Wow.", "@NerdPyle She deserves ALL the walkies. 🐾", "RT @satyanadella: This morning, we shared what’s next for our approach to industry, as well as the principles that underlie it. Here are hi…", "Please don’t just say hello in chat.", "One Canadian educator encourages his students to use Minecraft survival mode as a tool for writing fiction. ✍️\n\nHere's how Minecraft is helping teachers and students get creative in the classroom: https://t.co/OpDuvNWVZ7", "Join us on March 17 for #Include2021, a free, all-digital event focused on diversity &amp; inclusion. https://t.co/CMtQ2e0XT8", "Being an ally is not a person's identity, it's a lifelong commitment and practice. https://t.co/7EAgfAOPLs", "@sandylocks 🤝 Advocate\n✅ Nationally recognized expert\n\n@ChaseStrangio is the Deputy Director for Trans Justice with the ACLU’s LGBT &amp; HIV Project, and he’ll be joining us at #Include2021. https://t.co/3eDT7QOCIi https://t.co/k4v08SjQNR", "@DivyeshArdeshan Same to you, Divyesh.", "@Lishanw Been there.", "@Bravolebrity10 Thanks, Patti!", "@_Politico45_ 👀", "@divinetechygirl ❤", "@arminthedoor And the stripy tail was definitely the star of said meeting.", "@KeepUpWhitMe Not all heroes wear capes.", "@JoJoTrainers Rookie mistake. 🐱", "@jcfallas09 ❤", "@Marek209SK Happy birthday! 🥳", "@King_Mbaku_ Ouch.", "@therexlchxndler Brb, going to stare at this GIF all day.", "@livelovegeek @MSFTImagine 🌟", "@ayrotyno 👏👏👏", "@trishskee @JenMsft Accurate.", "@ThePrinceHilmi Sounds like a perfect day.", "@alistairl We are doing great, Alistair, thanks for asking.", "@OIMFA Keep up the good work, Omar!", "@salborkar More coffee always helps.", "@JoshMLugo *unmutes*\n\n\"Glad to hear it!\"\n\n*mutes*", "@MubashirAkhtar @MicrosoftTeams So true, Mubashir.", "RT @satyanadella: Announcing new Microsoft Clouds for financial services, manufacturing, and nonprofits – as we expand our investments to h…", "@jennaezarik How early is too early to take a nap? 😴", "@jaydestro @LearnTV You've got this!", "@CityofKent Same, tbh. ☕", "@adicrazy Word.", "Stop 🛑, collaborate 💻, and listen🔊.\n\nCheck out these tips on how to stay safe, secure, and collaborative with Microsoft Teams: https://t.co/psDXxpi1cE", "How are you doing today?", "Create a better tomorrow, today. \n\nBuild resilience and drive innovation with Microsoft Cloud industry solutions: https://t.co/flqzVhsWPl #MSCloud", "RT @MS_Ignite: 📅 You can now schedule sessions for #MSIgnite. Check out the full lineup by registering here: https://t.co/xKwggDq3LP", "@msWordExpert We are all Josephine.", "@heyalexxx She should absolutely join every 8AM Teams call as your sleeping shoulder parrot/potato-dog.", "RT @MSFTIssues: How time flies! One year ago we kicked off our #sustainability commitments as a company. Read @BradSmi’s update on:\n\nCarbon…", "@ChloeCondon @MicrosoftTeams @MicrosoftLife @TheMuppets Can we be Kermit?", "As remote and hybrid learning continue to be part of daily life, we've learned just how crucial it is to have access to technology. 💻\n\nDiscover why it's important to make technology accessible, safe, and engaging for students: https://t.co/QjWeh13mTu", "RT @Xbox: Command in comfort. Hear the shots then call them with the Xbox Wireless Headset. https://t.co/r5ExdXsH3O", "@KristinRaworth What's your favorite?", "@pineapplepleas 😂❤", "@carolksun We fully agree.", "@SkyquakeLive We vote yes.", "RT @MSFTIssues: In 10 years we might need to find another source of water.\n\nData scientists at Microsoft have helped develop an algorithm t…", "@rustyjellybaby With a very special guest.", "@michmuzz 😳", "@MorpheusNI 👑", "@MegFutej At this point it's a reflex. 👋", "@DrAlexHerron 💾🙏", "@Falloutt You're welcome, Jon.", "@PKXLIVE 🙄", "@Idontthinkyous1 Many save. Much floppy.", "@BhaskaranDijin Woah woah woah.", "@lounecl It's technically both.", "@rahulrdas11 Touché.", "@BenThePCGuy 😂", "@Headspace 👏👏👏", "@thekarachikid Accurate.", "@a_button117 Did they ever truly leave? 🤔", "@tejuabiolaart 😂", "Josephine with an OG setup. https://t.co/PvVjkU6Zll", "We're on a journey to empower every frontline worker in every organization to achieve more.\n\nHere are 8️⃣ new Microsoft Teams features designed to do just that: https://t.co/QbguihB9y2", "RT @MSFTAdvertising: ✔️ In 2020, #MSFTAds and syndication partner @Ecosia planted over 275,000 trees—more than our goal of 250,000—on behal…", "Do you call it a floppy disk or the save button?", "Project Origin aims to create a chain of trust between media publishers and consumers. ALT: The future from an alternative perspective.\n\nLearn more at https://t.co/QbnwLrLqgs https://t.co/fxYigWVksC", "🎙Podcast host\n⚖ Law professor\n🏛 Cofounder and executive director \n\nKimberlé Crenshaw (@sandylocks) is joining us at #Include2021 as we explore topics like intersectionality, race, and the law.", "At #Include2021, we're bringing together some of the top experts in academia, law, and social change. \n\nMeet this year's speakers, who will address topics like allyship, covering, intersectionality, and privilege. 👇", "RT @Lindsay_Rae_M: Last week, I shared @Microsoft will host #Include2021 to support continuous learning about diversity and inclusion. Buil…", "@mohamedamineakk ❤", "@Breaking70Bars It certainly does.", "@frozenhispanic_ Mood.", "@Fledi_ You're welcome.", "@CrankyOldDad Then we'll consider this a success.", "@Alan01001011 Thank you, Alan.", "@DogeLiftOff Wow.", "@BenThePCGuy Thank you, Ben. We're doing great.", "@SailorsBen Thank you, it does.", "@LanceUlanoff That's a start.", "@brennadactyl Thank you for your honesty, Brenna.", "@c0mic_sans 👍", "RT @Xbox: Let's keep shining a light on amazing Black content creators. \n\nTune into https://t.co/MZRRVcN5jg this week for takeovers by @Gli…", "The only constant is change, especially in retail. 🛒\n\nDiscover how retailers can unleash the benefits of #AI and machine learning to help transform their business: https://t.co/L63jlmGRtk", "RT @MicrosoftLife: Akosua Boadi-Agyemang relied on @LinkedIn to share early career struggles. Since then, she’s built a thriving online com…", "Hope this tweet finds you well.", "RT @MSFTGameStack: #GameStackLive is back. Join us April 20–21 for two digital days of all things game dev. Pull up for\n• Deep technical di…", "@vocomotion This is amazing! 🤩 Can you send us a DM using the link below? https://t.co/2zGa6v7GNK", "@juliahsings Love this! Can you send us a DM using the link below? https://t.co/2zGa6v7GNK", "@xtina1229 A very important assistant.", "@livthompson_9 😂", "@CraigUntlNytTym It really took things to the next level.", "RT @chriscapossela: Finding new ways to reach your customers where they are is key to #innovation. Here's how @Hasbro is changing how it de…", "@AsmaSafi11 Impressed.", "@Karan_Bale You definitely won.", "@clarebear73 ☕☕", "@TVBadBoy Please elaborate.", "@00Annnnne 🤐", "@JoyOfSharePoint There are two types of people.", "@Heisenberg369 😂🙌", "@TweetsfromSara 👀", "@bdsams Sorry, Brad.", "The sky's the limit. ✈️\n\nDiscover how one company is working to reduce aviation’s climate impact with #AI: https://t.co/VMt2dIaYvK", "You: I’m going to set my alarm for 6:30AM, 6:35AM, and 6:40AM, eat breakfast, and start my day refreshed.\n\nAlso you: still sleeping at 8:30AM", "@XboxGamePassPC Or a house. https://t.co/N9YSNMNsNG", "@Xbox Why are you so trendy?", "We're envisioning a future where all students have the opportunity to be creative, confident, and optimistic learners, realizing their full potential.\n\nCheck out how we're making this a reality: https://t.co/FX3DlppzIG", "@JenMsft ❤", "@nigelcantweet We would never.", "@thekarachikid 😳", "@Xbox This is art.", "@amichaelcreiter Saag paneer with naan. 😎", "@MSFTImagine 10/10 🌟", "@rebafan12345 The best possible reason.", "@DaCoPilot This reminds me of my coworker. 😁/10", "@hannahbaugh Looks like that 5PM/10 feeling.", "@Karuana We understand. 11/10", "@brandonleblanc @Karuana Our new brake pads are really cool, you're not even going to believe it. 100/10", "@Flipgrid @annkozma723 13/10", "RT @MicrosoftLife: Some of Quita Barnett’s earliest memories include preparing catfish and polenta at her grandmother’s house in Chicago, I…", "Let’s all take a moment to appreciate this beautiful dish from Microsoft Dining. 😩 https://t.co/t2LSYMBve7", "While training for ‘v-shesh’ used to take place in physical classrooms, the company has adapted to remote learning with Microsoft Teams.\n\nDiscover how the #accessibility features are supporting their mission: https://t.co/PTtrHalN0u", "@Purplepanic13 https://t.co/QCIwBZPVCX", "@TomKerkhove @GlennColpaert Did a full 180/10", "@wedoAzure Self-fives all around. 10/10", "@apzyx 🕺🏀 34/10", "@pax8 Come for the help, stay for the eyebrows. 12/10", "@quirkypsyche We won't! 8/10", "@tomtomdegif Us when we see how many of you replied to this. 11/10", "@asavioli \"La-zer\" 12/10", "@petrdu Thank you for your patience. 9/10", "@jaydestro 10/10, capisce?", "@ThisIsPappi254 Coffee from campus? Always a 10/10 ☕", "@thegamebabbler My spinach puffs! 15/10", "@VanessaW CLIPPPPAYYYY 150/10", "@sarmistha09 Too real. 9/10", "@nigelcantweet 🎶 \"Allll byyy myyysellfff\" 🎶", "@Alejandromp66 ???/10. Don't ask us why.", "@MeenooRami We ❤ Dolly. 100/10", "@JTKingpin Vote for Pedro. 10/10", "@PandaSpacey 15/10 for the round panda.", "@shiraz 👁 👄 👁 12/10", "@jkline120 360/10", "@CohenAustyn 10/10 easy.", "@akr0n1m Been there. 9/10", "@EPavlic 10/10 for cuteness alone.", "@UryensW Ten out of ten cups of coffee.", "@Graphoniac .@SchittsCreek never misses. 13/10", "@TylerChess 10/10 for when meetings get scheduled at 4PM on a Friday.", "@InvestorSpanish *Nods in agreement* 9/10", "@OsmanKareem 10/10. 👀", "@AyaanBari We love a nostalgic moment. 12/10", "@RickVanover She's a star. 10/10", "@yssYSMNyss Much type. Very words. 10/10", "@VerheijenRob Lettuce give this a 9/10.", "@EnidNova A fantastic hop. 12/10", "@a_button117 Docking points because this will haunt us forever. 7/10", "@St0rmTrper Us to us sending this tweet. 10/10", "@Glimjii And party on, dudes. 12/10", "@Rubenia_Borge Friday mood. 10/10", "@red_on_tour A versatile classic. 9/10", "@InvolvedInIt 11/10 for floppiness.", "@shash_____ It looks like you're feeling nostalgic. Would you like some help with that?", "@sword_sea Woah. 🤯", "@emandfilsworld Fil knows he deserves the spotlight.", "@MicrosoftIndia 🤐🔇", "@BoomBoomBetty Are you saying that spreadsheets aren't exciting? 😱", "@saratoning Too real.", "What’s your favorite GIF? Reply with it below and we’ll rate it on a scale of 1 to 10.", "The Legacy Project is a virtual gallery honoring Black American changemakers shaping the future with their contributions in business, education, science, sports, entertainment, and more. #BlackHistoryMonth\n\nClick to enter: https://t.co/D9bzKAmBV2 https://t.co/YkEQdx6WEU", "RT @MicrosoftAU: From nests being totally wiped out &gt; 20,000 baby turtles 🐢 now hatching each season. ❤️ to reveal how. https://t.co/okaIzT…", "Real progress on diversity &amp; inclusion doesn't happen without real work. We're gathering some of the top experts in D&amp;I for #Include2021, a free, global livestream event.\n \nRegister now: https://t.co/FXSmY82GfT", "Collaboration, creativity, and Minecraft. \n\nDiscover how teachers and students across Canada came together for a storytelling challenge: \nhttps://t.co/70IC3Hvm9I", "@haleigh_23b We support this.", "@ericlaw We'll take it.", "@beach5girl 🚀", "RT @BradSmi: Going carbon negative by 2030 requires us (and other companies) to reduce our scope 3 emissions – which includes the emissions…", "@aloalabs So true. 😂", "@Jay33825898 Same.", "@el_booogi But at least you'll be having fun.", "*unmutes mic*\n\n*waits 10 seconds to say something*\n\n*decides not to say anything*\n\n*mutes mic*", "@Windows @Twitter @Xbox 😬", "Approvals in Microsoft Teams. ✅\n\nCheck out what the new feature means for you: https://t.co/IOvNYRgsrz", "@Twitter If Clippy isn’t available, we’re taking @Xbox.", "@Underscordd @Xbox Perhaps.", "@NanoPolymath When will they learn?", "@LinkedInUK @Xbox Check your email.", "@__BalbuenaJuan @Xbox Sounds about right.", "@EspressoHere 😂", "@nellafarmsmelon 👀", "@MathieuRegan17 🐔", "@__llain Snuggles &gt; meetings.", "@kuns_dimples What's the mood?", "@MicrosoftDE @Xbox 👀 @Xbox", "@Xbox @XboxGamePass A likely story.", "RT @panos_panay: Today Surface Duo is available in more countries worldwide! Excited to see what our friends in Canada, UK, France, and Ger…", ".@Xbox was late to the meeting today.", "@triyanshujena Thank you for registering! The event will be live on the event website https://t.co/pPQH4CPEnW and you will receive updates via the email that was provided when you registered.", "RT @Lindsay_Rae_M: On March 17, @Microsoft will host #Include2021, a free, global, digital event focused on diversity &amp; inclusion. 1/4 http…", "Understanding builds empathy. \n\nJoin us on March 17 for #Include2021, a free, all-digital event focused on diversity &amp; inclusion.🤝\n\nRegister now: https://t.co/SxVmLA7bic", "@ahuSidiaZ Hey, we love your tweet! Can you send us a DM using the link below? https://t.co/2zGa6v7GNK", "@abigailweinberg LOL, Abigail.", "@XboxGamePass So groovy.", "@lattefan Tuffy's World. ❤", "@matvelloso Too real, Mat.", "@magbart0n We believe in you, Magy. ✨", "@storybysam Looking good!", "@chey_boogs 💔", "@Wendy_Met They deserve all the treats. 🐾", "@creepeffect What kind?", "@Peeps40836 Coming to a disk drive near you.", "@MassacreMan101 Track one: Save As\nTrack two: Floppy Discos", "@sqlcheesecake Exactly.", "@_KeyKoki The floppiest vibes. 💾", "@thekarachikid 😂👏", "@BevoBexley That's a yikes.", "@IntelBusiness @intel Away message game 💯", "@MicrosoftDE Hallo! 👋", "@courtsushi Incredible. 👏", "Believing that you can make a difference makes all the difference.\n\nLearn why Ranjitsinh Disale has been awarded the Global Teacher Prize for “transforming the life chances” of girls at Zilla Parishad Primary School in Paritewadi: https://t.co/NR6srzA5md", "This could be an album cover. https://t.co/1AWJVeC6YX", "@Avanade 👋", "@onelaureldane It'll be great.", "@ATTBusiness Hi AT&amp;T Business, \nWe're doing well! Hope you are, too. \nBest, Microsoft", "@SC_1287 Rude.", "@iamsk1nny 🎨", "@megankorosy_ @cschillig @AHSAviatorBand 😂🙌", "@courtsushi Did it work? 👀", "@CllrNickCook Your dog said it's time for some pets.", "@TaraMilliken The right GIF is worth a thousand emails.", "@AliElfilali01 Doing well! How are you?", "@DiptarshiC You're welcome.", "@Tazzeat92 That depends. What's the topic?", "@bkgthekat Hey bestie.", "@mimistic02 ❤", "@paulfabretti You're someone's reason to smile, Paul.", "@Underscordd Good, thanks! How about you?", "@yourboysaf As you should.", "@brandonleblanc 👋", "@jeffsand Brb.", "@bing I was wondering if after all these years you'd like to meet", "History, made.\n\nLearn more about the first-ever holographically navigated spinal surgery performed at Balgrist University Hospital: https://t.co/FggB42PfSU\n\n#HoloLens2", "@jaydestro Absolutely. Hbu?", "@Headspace Just trying to find our daily zen. Have you seen it?", "@a_button117 Sup.", "@calm ❤❤❤\n\n-Our social media manager", "Hi.", "RT @CNET: You don't need to have separate Word, Excel and PowerPoint apps on your tablet any more. https://t.co/yeb7pWpBV7", "@_CryptoCurator Throwbackkkk.", "@r_giaquinto 😂", "@bookmobility ~Priorities~", "@sw_calum FIN. 😍", "@Oryxan What's the book of the month? 📖", "@Katziotho Same.", "@heymarynicole It's the thought that counts.", "RT @Xbox: We're teaming up with some of our favorite streamers to bring you a full week of great gaming action as part of our #BlackHistory…", "@crazybangles112 Beautiful work.", "@ArtDecider @bdsams 🙌", "@ChloeCondon 👀🎨", "@livelovegeek @TheClippy We'll have Clippy's people call your people.", "@Dylan1Kenobi We see what you did there.", "@denwilliams_ We approve.", "Giving is a superpower. \n\nCheck out how @Xbox and Gamers Outreach are sharing the gift of \"wonder\" with children's hospitals: https://t.co/3gsaAzRMOy #WW84", "The Art                           The Artist https://t.co/Gli23HTgev", "RT @MicrosoftLife: A passion that led to purpose, representation and mentorship. Jerome Collins is succeeding. \n\nRead more and listen to Je…", "A red team and a blue team. \n\nName a more iconic duo for cybersecurity: https://t.co/Cf1kxeYXiI", "@ShanePage_ We only use one space now.", "@MillenniumFalck 😂", "@veqasbws *crickets*", "@skinnyloverica Nailed it.", "@denwilliams_ What flavor though?", "@StPauliGrrrl We've all been there, Christy.", "@RuthElleson Happy #PancakeDay. 🥞", "@Xbox @MSFSofficial ✈", "@chioke_io A fantastic idea.", "@Underscordd Wowwwww.", "@EshuMarneedi Give it another two hours.", "@Laura_Jane_02 You've got plenty of time. 📝", "@itsPikakshi You're welcome, we think.", "@t_nav_ Exactly.", "@ch9 @nanaabaturkson @mtholyoke @drguthals @msyeseniac Congrats! 👏", "Us: Here we go. Let’s do this. Very important paper. Feeling motivated.\n\nAlso us: https://t.co/r9pt6ulSQD", "The cutest passive aggressive email reminder you’ve ever received. https://t.co/pUIZW0HOyF", "https://t.co/IKgK9VNmLt", "https://t.co/MqvrVQ9JoM", "https://t.co/chd1QggJuD", "https://t.co/Va7jMqHBmf", "https://t.co/cGIwBkvzvM", "Valentine’s Day cards from Microsoft, a thread.", "*finishes PowerPoint* \n\nTo me, you are perfect. 💕", "To: Our Twitter followers\nCc: All of their friends\nSubject: Happy Valentine’s Day 💘 https://t.co/FWiNU8YF4Y", "Not sure who needs this today, but the most important person to love is yourself.", "What's one of the best ways to support employees’ mental wellbeing and an inclusive workspace? By accelerating investments in digital skills. \n\nLearn more about the value of up-skilling: https://t.co/Ia04sOVAl4", "@dltmurphy 🤘", "@jvq_txt ☕ + ☕", "😎 https://t.co/YiA8IuKMt7", "Workin’ hard or hardly workin’? https://t.co/kiotQsjZ3A", "Nurses are heroes. ⚕\n\nDiscover how technology is helping care for those who care for others: https://t.co/DHq5ceylMN", "@Cannibal 👀", "@Fayazansari_ ☕", "Would anyone like some tea or coffee?", "@BrittaniWarrick Please show Dionne.", "@kteamarsden 🔊🐱", "@lukejostins 🤯", "@hinadirah ❤🙏", "@ChloeCondon 🤗", "@ShavonnAlicia Thank you. - young folk", "@lenchinski Sometimes it's like that.", "@13minuteslate ❤", "@ishverduzco ❤❤❤", "@kyranleahy Sounds pretty cute tbh.", "@PrivacyTutor_ @KELLYROWLAND @msexcel A legend. 🙌", "@salmazaghloull You're welcome. 🖤", "@AuroraMakesArt @Prickly_Alpaca Beautiful. 😍", "@Jesse32306440 😂", "@TLeeOnTV What a moment.", "@thekarachikid 😂", "@donasarkar 🔥", "The games you want to play that you can't play anywhere else. 🎮\n\nCheck out the exclusives coming to @Xbox in 2021: https://t.co/p7NkJI6PH3", "*Mutes mic*\n\nNope, nothing from me.\n\n*Unmutes mic*\n\nNope, nothing from me.\n\n*Mutes mic*", "Microsoft’s #Airband Initiative, which aims to extend internet access, is connecting people in more ways than one. 🌐\n\nDiscover how it's changing lives for those in rural areas: https://t.co/3MKhXiLRJd", "@Outlook \"All my best\"", "@getnorthern 😂", "@Claire_Crowley_ A very important distinction.", "@ltackmann 😂👻", "@yvonnenobis 😬", "@Caledonia_PS 💕", "@DrGRZLY 🙌", "@farhanahyasmin ❤", "@FalseStream @KELLYROWLAND @msexcel Thank you.", "@WapoEngineering WHY ARE YOU YELLING?", "@martian_dru @KELLYROWLAND @msexcel We're literally wishing her a happy birthday and calling her a trendsetter. 👑", "To: @KELLYROWLAND\nCc: @msexcel https://t.co/QBepCJzvDO", "“Atlanta is going to be well-positioned in the next 10 to 15 years to be a tech giant in the U.S. That’s huge.” - Kevin Gooch\n\nLearn more about the expansion of Microsoft's presence in Atlanta: https://t.co/qkiYDkz9Z5 https://t.co/UbfolnMapy", "@chelsiaworks We believe in you. ✨", "@JordanCJanssen You're welcome.", "@Dajimoto Sometimes.", "@EvanGriffith__ 👋", "@Danlo_24 We see what you did there.", "@Becky_E_Morris Your cat really said 🤫", "@timmarkatos Spooky. 👻", "@TweetsfromSara 👀", "@count_sudooku_ New day, new you.", "@meetdux 🍝", "What will the world be like in the future, and what role will technology play?\n\nThose are two of the big questions Microsoft researchers aim to solve: https://t.co/FbMJLGpFra", "RT @msPartner: This past year, the #MSPartner ecosystem continued to reinvent itself and find growth opportunities in a constantly changing…", "It's okay to decline a meeting. https://t.co/i9WMTAHKDS", "@MissS_Buck ❤", "@moc_rettiwf 😂", "@Crazygamer360 ☕☕☕", "@mrmiller1972 Sounds familiar. 🤔", "@TheFirstGeist What kind of pizza? 🍕", "@loverme_justin Of course. 🌮", "@garius 😂", "@lachaeim ✨", "@jaredlouw Time for a snack.", "@pathogenomenick ~Me~ time.", "@__HollyPop 😱", "@ccarella Meow.", "Check out these five great features on the free version of Microsoft Teams: https://t.co/lyB2Jdi7cO", "What's on the menu today?", "@Serenil Not all heroes wear capes.", "@LDMurrdawg96 ❤", "@ElrondGaming We would have to agree.", "@KCCKGraphics \"Paid attention\" 👀", "@mikeybeeetch This is next-level.", "@akirakuruwu A mood.", "All of your favorite #MicrosoftTeams features, now available in breakout rooms.\n\nFrom using Together mode to the Microsoft Whiteboard, check out these tips for the best meetings: \nhttps://t.co/uyjaeIetCg", "Today’s energy: https://t.co/xWfuTx5RTh", "The In Culture podcast explores the influence of Conceptual artist Sol LeWitt across the worlds of food, fashion, music &amp; fine art, with guests including Eleven Madison Park chef and owner Daniel Humm and the fashion designers behind @proenzaschouler. \n\nListen now: https://t.co/edslPUTXli", "@jacysmith 🐔", "@moneyrumble *✋*", "@ComLinkReid LENNOX. ❤", "@samstuesser Thank you, Sam.", "@EXCEL You're too kind.", "@xboxse Tack. ❤", "@Emojipedia ❤😊", "RT @MSFTIssues: On #SaferInternetDay take our Digital Civility Challenge:\n \nLive the Golden Rule ☝️\nRespect differences 🤝\nPause before repl…", "Tech-oriented jobs are expected to increase nearly five-fold by 2025.\n\nLearn more about how our skilling initiative prepares people for the jobs of tomorrow: https://t.co/GX28lW3iGY", "RT @MSEurope: Mixed reality is augmenting how medicine teaches, practices, and achieves positive patient outcomes. Explore how: https://t.c…", "https://t.co/thpY6IvG6z", "“I really think mixed reality will be used in the operating room for so many things in the future,” says Dr. Bruno Gobbato. \n\nSee how doctors are using HoloLens to revolutionize surgery: https://t.co/KmeMeRThH3", "13 surgeons from 13 countries will perform operations with #HoloLens2 during this 24-hour #HolographicSurgery event. \n\nHappening now: https://t.co/VH9dC1KNac https://t.co/WMLeWJPC95", "@MarkPlant Excellent photo quality for someone making the jump to hyperspace.", "@hekili808 Brilliant.", "@rohithasrk SMH.", "@ethan_planet Sometimes it's like that.", "@baran_jeff 😂", "Families who game together make memories together. 🎮\n\nCheck out all the reasons to play as a team: https://t.co/WyOJpMpoAn", "@sims4vampire True friendship. 🙂", "Your favorite WordArt says a lot about your personality, or so they say. https://t.co/z6F94SrjLa", "Tired: *interrupting*\n\nWired: *🤚*", "@hannah_Digi17 The ghosts of meetings past. 👻", "@jigsha @MicrosoftTeams Love that for you.", "Today is #WorldEpilepsyDay. \n\nDiscover how technology is helping patients receive diagnosis and treatment faster: https://t.co/aFMn13kge0", "You control your time. https://t.co/GVqhcYPrEw", "RT @MicrosoftLife: At a time when most learning has transitioned online, Shy Averett, Community Program and Events Manager, wanted to creat…", "“Employee experience should have always been a priority, but when you're remote in particular, you want to be staying engaged with your business and your company and its sense of purpose and mission.”\n\nMore on Microsoft Viva from Bloomberg @business: https://t.co/IRzVvBJXbR", "💚💚 https://t.co/qSdFnWw8Cj", "@NerdPyle 😂", "@patrick_tmc *mutes chat*", "RT @Microsoft365: Introducing Breakout rooms and Approvals in Microsoft Teams. Ready to learn more? Get the latest on the Microsoft 365 blo…", "RT @satyanadella: Today, we announced new capabilities to ensure every organization has the tools to help employees thrive in a new era of…", "Keep your home (office, school, gym, and sanctuary) a little more organized with these tips and tools from Microsoft 365: https://t.co/Gaz0mYe5OK", "@Mr_R_PE The real MVP. 🌟", "@XboxGamePassPC @XboxGamePass 🙄", "@ethanexp_ Microsoft", "@dom_inthecloud Us being quietly cc'd: 👀", "@kevalways Incredible.", "TFW you miss the \"Join the Meeting\" notification by a millisecond and have to open your calendar to join.", "Working from home has its ups and downs. Microsoft Viva gives companies new ways to help employees do their best work — and stress less. \n\nhttps://t.co/4qtGCr4pti #MSFTViva #EmployeeExperience", "Have you ever gone from “Just following up” to “As per my last email”?", "CEO @satyanadella joins our chief people officer, Kathleen Hogan, to discuss how the new Microsoft Viva platform reimagines the employee experience designed for a digital era. https://t.co/GPkmuBd9sk https://t.co/IgKGQMadXS", "RT @satyanadella: Announcing Microsoft Viva, a new employee experience platform bringing together everything an employee needs to be succes…", "RT @Microsoft365: Introducing Microsoft Viva. The new employee experience platform built to help organizations empower people and teams to…", "Introducing Microsoft Viva.\n\nhttps://t.co/KV62S2FTtA\n#MSFTViva #EmployeeExperience https://t.co/HxlpugixjF", "Watch Microsoft leaders @satyanadella and @jared_spataro introduce Microsoft Viva, a new employee experience platform: https://t.co/B7S2zo5xTN\n\n#MSFTViva #EmployeeExperience", "RT @MSFTIssues: .@microsoft #SeeingAI is helping people who are blind or have low vision by augmenting the world around them through audio…", "@jordannovet @ChloeCondon No, Clippy did this.", "Very impressed by this, Scott. https://t.co/wO51gIfV8i", "The pandemic showed us just how \"essential\" essential workers truly are. \n\nDiscover how Microsoft Teams supports those working on the frontlines: https://t.co/nSZ0CU5cA3", "@phoenixphanrise He's been working on his artistic side.", "@JenMsft Incredible.", "@amazingalooman Potato", "@DancingRyuu 😂 wow.", "@AlQadhafy 📎", "@mashalyaseen_ Bring your kid to work day, everyday!", "RT @HoloLens: ⏱ On February 9, attend the 24-hour #HolographicSurgery! Watch 13 surgeons from 13 countries as they perform holographic oper…", "Feeling inspired by Van Gogh's Starry Night.\n\nThe Art                           The Artist https://t.co/FAGqs6XVmf", "Discover how we’re working with @CSIRO to transform our world. https://t.co/3JKCCVX8ny", "We know the answer to this one. Here's how @CSIRO is using #AI to stop plastics from entering the ocean. https://t.co/v4vgX79qJ0 https://t.co/NU80rRRgXQ", "“Let’s offline about that” is just two people on one call agreeing to skip it for now, and forget about it later.", "@sfrnfzl_ Our type of artist! 🖌👏", "Soar to new heights with Microsoft Flight Simulator, now available on your favorite VR headset for PC.\n\nGet ready for takeoff: https://t.co/7g9B5Rmq83 ✈️", "@vpikula 👀😂", "@JohnGibbon979 A flying cat?", "@sbisson Kittens should be able to mew mew mew all they want.", "@AndrewArruda Thank you for this TED talk.", "@nyanpyon 🌈", "But if you do need the silence, here's how to reduce background noise in Microsoft Teams: https://t.co/QZzUqbBN8K", "Please stop apologizing for the dogs barking in the background of your Microsoft Teams calls. Let them speak. 🐶", "What’s up, doc? 🥕\n\nAzure AI is bringing Bugs Bunny, Progressive’s Flo, and Duolingo characters to life with Custom Neural Voice: https://t.co/3D02vOFp43 https://t.co/OsN2klwPe8", "@Ignis621 Just the right amount of awkward.", "@TerenceJSweeney To each their own.", "@LURIE_MSFT 😂", "@W4rriorPr1nc3ss 💨", "@sglerner @kjbeavers 👆", "@Lucky7sCyber Valuable advice. We like it.", "@paulfabretti Classic Pisces.", "Vibes from the 70s. 😎 https://t.co/vF8n1y8wpT", "Data and cloud computing are paving a new way for electric vehicles to thrive in India.🔋\n\nFind out how: https://t.co/wdV8bvyjev", "RT @Xbox: This February and beyond, we're celebrating Black voices and shining a light on the contributions of both creators and players.…", "@mythical_server Glad it's not just us.", "@bdsams Oh no ...", "@tanzeelalalaa 💓", "@AllisonAngel_ You sure?", "@LURIE_MSFT Don't mess with us, pork chop.", "Do you say goodbye before leaving a Microsoft Teams call or are you an Aquarius?", "Stay ready so you don't have to get ready.\n\nHere's your plan for increasing security and resilience: https://t.co/RLUC4GwK3k", "Yeah, it feels like Groundhog Day. https://t.co/3ON8h5auJq", "Is it just us, or does today feel like Groundhog Day?", "@euronewsliving .@Outlook, looks like spinach is stealing your look. 👀", "@kevinroose That photo would make an excellent desktop background.", "@windycitycassie Sometimes it's like that.", "@RobertofStruan Those. EYES. You better have had a treat ready. 🦴", "@MissMarleyPE Happy birthday, Miss Marley! 🎉", "@ZamoraO Ngl, we save anyway.", "@alvinashcraft 😧😅", "@WordsfromJebs You never know.", "@Borman18 @Windows Perfection.", "RT @satyanadella: We’re celebrating the legacy and strength of the Black community by honoring changemakers who are making history today. O…", "CTRL + S\nCTRL + S\nCTRL + S\n🤔\nCTRL + S", "Talkative toddler? Noisy neighbors? Barking man's best friend? 🐶\n\nHave no fear, noise suppression on Microsoft Teams is here: https://t.co/I5PQDxCok8", "@Fdruid Don't worry, we've made a note of this.", "@missmishaharris *unmutes*\n\n\"What type of chips are you eating?\"\n\n*mutes*", "@venzann We get it. Setting the mood. 🐟", "@Jenny_Coff Oh. My. 🥺", "RT @JP_Courtois: Autonomous systems are making what was previously impossible, possible. @BellFlight is using Microsoft autonomous systems…", "We’re proud to support these @SpecialOlympics global youth leaders who are channeling their own experiences into projects that help other athletes with intellectual disabilities connect and thrive. \n\nLearn more about their projects at https://t.co/Qk9j0Ze1eR. https://t.co/NWJgHGAaQt", "While waiting for others to join the Microsoft Teams call, do you prefer:", "Proudly, we amplify the voices of those whose experiences motivated their present actions to build a better future for generations to come. We do this – not just because this is #BlackHistoryMonth but because change is happening, and Black History is now. https://t.co/aPcsfhRcys https://t.co/qrqauzWOtX", "@hannahbethbell That calendar &gt;", "@thekarachikid Stay tuned, Khaver. Windows 1.0 will be released in 1985. 😎", "@Scobleizer Kids these days.", "@1Signus Truly.", "@darrenmk 🟦\n\nWelcome!", "@Hannah_YD We'd give this an A+.", "🍎 Attention #teachers 🍎\n\nBreakout Rooms are now available in Microsoft Teams for Education.\n\nHere's what it means for your classroom: https://t.co/IGkp7QyLMV", "Windows 1.0. \n\nFeeling nostalgic. https://t.co/cnDb1SJdv6", "You wear a helmet when riding a bike to protect yourself. \n\nConsider this like that, but for your business: https://t.co/Pou6Sr3Z1c", "@Bubs2611 We get it.", "@craigrich *checks posture*", "@ccare_ccr1 Sorry not sorry.", "@Cloud9 Smh.", "@jennaezarik Just trying to help with back pain. 💓", "@sfdesigner Clever.", "You: I'm getting a weird echo, can everyone please go on mute?\n\nAlso you: Am I the echo?", "Imagine a world tour of surgeries assisted by mixed reality with surgeons from 13 countries.\n\nTake a look: https://t.co/rRrcjBZLp0 https://t.co/CrYByT1GMx", "Reminder: stop slouching.", "@GetFlexSeal Looks like you have an *artist* over there at Flex Seal. 🎨", "@joshmcconnell We've had this on repeat all day. 🔊", "@The_PopcornMan @MayTree78 Two with extra butter, please.", "@MicrosoftTeams A corgi of many talents.", "“I’m not saying advocate 'for.' It’s not a badge or cape. It’s a practice that we’re trying to embed so people can engage in conversation to learn from one another how to support and help one another.”", "“So much around allyship is putting the growth mindset into action, learning how to empathize with and advocate with someone else,\" says chief diversity officer Lindsay-Rae McIntyre.", "The Microsoft Allyship Program shows how everyone has an opportunity to be an ally.\n\nLearn more: https://t.co/1MtFxdaQGT", "@davidspudic Who says he isn't already? 🤔", "@mkashman Updates coming soon! 🐕", "@f_artdirector ❤", "@JenMsft A masterpiece.", "@MrDuko Thank you, Seduko!", "@sethjuarez \"Oh, no, you go - I was going to change the subject.\"", "This is aca-mazing.\n\ncc: @MayTree78 https://t.co/AGz7THm6BV", "The Art                           The Artist https://t.co/ZOPS3fCXmX", "RT @MS_Ignite: #MSIgnite? In March?? That's right. There's a second Microsoft Ignite this year. Except the second is coming first.\n\nJoin us…", "🎮 Discover how #gaming can help bridge gaps between generations and fight loneliness: https://t.co/6KfitzABo2", "Learn more: https://t.co/jXWdGSP54m", "What if there was a system that could work with different functions to identify, plan and act on changing variables? \n\nALT: The future from an alternative perspective. https://t.co/qaQawE4vef", "@rashydahmed A favorite.", "@the_random_dev @code Can never be too safe.", "@dannybalezy You do you.", "@that_wei We love you too.", "@Meredium1 There are two types of people.", "@arcticdba @_caseywatson 🥺", "@BrokawInc Never the other way around.", "@nemerevermore Lol.", "@TraceyBleakley @NHSEngland @hospiceuk Great job, Percy! 🐶", "It’s CTRL + C, CTRL + C, CTRL + C, CTRL + C, and then CTRL + V.", "We’re one year into our 10-year plan to be carbon negative: https://t.co/HRr0GEHKqD\n\nHow it started            How it’s going https://t.co/x3BURqQZJd", "RT @satyanadella: As a company, we’ve set ambitious climate goals to be carbon negative, zero waste, and water positive by 2030, and we’re…", "RT @MSFTIssues: How time flies! One year ago we kicked off our #sustainability commitments as a company. Read @BradSmi’s update on:\n\nCarbon…", "RT @BradSmi: A year ago, we pledged to go carbon negative by 2030. While this “moonshot” is a daunting challenge, our recent steps make us…", "RT @satyanadella: We’re committed to doing our part and supporting the global community with technology and tools to accelerate the secure,…", "@Headspace Try it and get back to us.", "@ChrisCotsack 😂", "@steinbroeder @steinekin You too, Stein.", "Educators believe the pandemic has accelerated the evolution of virtual #education by ten years.\n\nCheck out some of the most important takeaways for hybrid learning: https://t.co/0v7zsDMwPu", "RT @MSCustomerTalks: Let's talk about tech! \n\nCTT is looking for new customers to feature in our upcoming segments and events! Visit https:…", "In 2020, more than 30 billion email threats were blocked by Defender for Office 365. 🤯 More on Microsoft’s Zero Trust mindset and the future of security: https://t.co/zc56dDCl3C https://t.co/qNgD1Ho6nW", "Have you tried unplugging it and plugging it back in?", "Microsoft and @JohnsonControls, the leader in smart and sustainable buildings, are working with the National University of Singapore to create a more #sustainable campus.\n\nDiscover how they're using digital twins technology to innovate: https://t.co/LmK3VWZDlh", "@hayeslissack Lighting is key.", "@shahdhvani99 Any GIFs, in particular?", "@_franrodrigo 🙃", "@phichithamster That's what besties are for. 💞", "@Breadisnice98 At least you're honest.", "@f_fakhrusy T. H. E.", "@ByteRisc Nice one.", "@TooLate2Call It looks like you're procrastinating. Do you need help with that?", "@itsnotselest Anytime!", "@bienbwryan 😂", "@CodingwithChloe 🙄", "@steinekin Back to work, Stein.", "@threddyrex Amazing.", "@justinthrelkeld You're welcome.", "Together with our partners, we’re delivering vaccine management solutions to support public health systems and help them focus on getting the vaccines, resources, and services when and where they need them. \n\nLearn more: https://t.co/9XhkvR8YDg", "You’re procrastinating. https://t.co/os5a5xkvXs", "Nunavut – which means “Our land” in Inuktitut, one of the Inuit languages – has been home to an indigenous population for more than 4,000 years. \n\nSee how Microsoft Teams is helping to bring this community together during the pandemic: https://t.co/AjR2P71qsA https://t.co/GadNXAa26y", "@DrSbaitso Not. At. All.", "@bisynerd 😶", "@f_fakhrusy Always in the back pocket.", "@tomwarren Oh, Tom.", "@Price412 😂", "@SoonerLatios 👀", "@dxd_ang 😂", "RT @MSFTIssues: .@microsoft is working with @LinkedIn to help students, job seekers and employees gain the skills they need to be successfu…", "From teachers to students to parents, everyone deserves an A+ for resilience in 2020. 🏫\n\nCheck out these highlights from Microsoft Education: https://t.co/tRHlv9SVHm", "Microsoft Teams: you have poor network quality.\n\nYou: I'm going to use this as an excuse to not turn my camera on today.", "💻 Business Highlights: More Personal Computing 🎮 \nWindows OEM revenue ⬆️ 1% \nWindows commercial products and cloud services revenue ⬆️ 10% \nXbox content and services revenue ⬆ ️40% \nSurface revenue ⬆️ 3% \nSearch advertising revenue ⬆️ 2%", "🌩 Business Highlights: Intelligent Cloud 🌩 \nServer products and cloud services revenue ⬆️ 26% \nAzure revenue growth ⬆️ 50%", "✈️ Business Highlights: Productivity &amp; Business Processes ✈️ \nOffice commercial revenue ⬆️ 11% \nOffice consumer revenue ⬆️ 7% \nLinkedIn revenue ⬆️ 23% \nDynamics products and cloud services revenue ⬆️ 21%", "Q2 FY20 revenue by segment \n\n✈️ Productivity &amp; Business Processes: $13.4 billion ⬆️ 13% \n🌩️ Intelligent Cloud: $14.6 billion ⬆️ 23% \n💻 More Personal Computing: $15.1 billion ⬆️ 14%", "Commercial Cloud Revenue: $16.7 billion ⬆️ 34%", "THREAD: $MSFT Q2 EARNINGS \n\nJust announced - Microsoft Q2 Earnings  \nRevenue: $43.1 billion ⬆️ 17% \nOperating income: $17.9 billion ⬆️ 29% \nNet Income: $15.5 billion ⬆️ 33%  \nEPS: $2.03 ⬆ 34%", "Read the full Microsoft’s Q2 Earnings Release here: https://t.co/Hhgj6eKJpZ  \n\nNote about Forward-Looking Statements in earnings tweets: https://t.co/4wiTg498Mc", "@chriis_bebe We'd like to be wherever this is.", "@enedictmonteiro More like an unexpected gift. 🎁", "@helonastick 🥺", "@jasminecrowe 🙌", "RT @MitraAzizirad: The team at @BellFlight chose @Microsoft #AutonomousSystems to help them innovate in autonomous flight to transform thei…", "@WelshGasDoc Let. Him. Squeak.", "\"Espresso\" your appreciation for coworkers with the @Starbucks app in Microsoft Teams. ☕\n\nLearn how you can give it a shot: https://t.co/iE6zfzYKDw", "CommentRetweetLike.jpeg https://t.co/PaKIUhhrnF", "Jasmine Crowe, CEO of @TheGoodrCo, is on a mission to reduce food waste and feed millions. Find out how she’s changing the way to approach hunger—through smart technology and community engagement. \n\nLearn more: https://t.co/5eabnzQ8os https://t.co/8hlZ8b7CC0", "The consensus is clear: the future of work is hybrid.\n\nDiscover how Microsoft’s latest Work Reworked research can help you make the most of company culture: https://t.co/lb9RKAEkPx", "NSW Health Pathology is using cloud technology and #AI to support faster diagnosis and care for patients – no matter where they are. \n\nLearn more about the initiative: https://t.co/ZP30YknvVl ⚕️", "Around 82% of electrical equipment ends up being sent to landfills, incinerated, or illegally traded, instead of responsibly recycled.\n\nCheck out how one app is planting a more #sustainable future, one recycled device and tree at a time: https://t.co/0ZcbzEr9Kz 🌲", "RT @MsftSecIntel: This comprehensive guide for security admins has details for increasing resilience against sophisticated attacks like Sol…", "The UK now has 48 Microsoft Showcase Schools - more than any other country in Europe. 🏫\n\nDiscover how the schools are using technology like Microsoft Teams to up-level education: https://t.co/zQ13Yo7qca", "No, that wasn't thunder. It was just someone typing while unmuted on a Microsoft Teams call.", "It’s “Pie” day, not “Pi” day.\n\n#PieDay https://t.co/AD5lyHFEQk", "Here’s to work/life balance with a little more life. ✨", "RT @satyanadella: By bringing together the power of Azure and Teams with @SAP’s solutions, we will help more organizations harness the powe…", "Tell us you're proficient in Excel without telling us you're proficient in Excel.", "RT @MSEurope: .@WHO has designated 2021 the International Year of Health and Care Workers. We are committed to empower those heroes with to…", "@tomwarren Proud of you, Tom.", "@Axcient Coming right up.", "@Professor_Erik @MicrosoftTeams @MIEE_Flopsie @MicrosoftEDU Amazing.", "@XboxGamePassPC 👀☕", "@Katie_Popple A classic. 👏", "@CatamyKX Be careful, it's very hot. 🍵", ".@microsoftfrance is organizing a 24-hour #HolographicSurgery event in collaboration with Professor @tms_gregory, Evolutis Numérique, @univ_spn, and @APHP. The challenge? 24 hours to change healthcare collaboration. Learn more: https://t.co/pfTIeBx5bc https://t.co/35soYwcV92", "@XPS ☕ *dashes oat milk*", "@moment Excellent choice.", "@ID_Xbox ☑", "@Wawa Always. ☕", "@LilMoisty_ ☕", "@PhoenixWrites15 ☕☕", "@TylerChess 🧊☕", "@JasonWRocco Nice.", "@isablle_viger ☕", "\"Think of this as a gaming mixtape of hope and optimism.\" Sounds pretty good to us. 🎮 https://t.co/2efoZuJLAe", "@graemeknows ☕", "@gareth Our specialty. 📎☕", "@ElfNendes ☕", "@Spatacoli ☕", "@jennaezarik Coming right up!\n\n☕🥛", "@StarbucksNews ☕ = ❤️", "@MichaelGillett Medium Roast.", "@MattLockmon You got it.", "@heyhadleysmom 🍵☕", "@CreeseWorks How much sugar?", "@PhilCrawley ☕ We'll do better on the latte art next time.", "@EshuMarneedi Got you. 🥤", "@apewee13 ☕", "@TinaRajan_ ☕", "Would anyone like some coffee or tea?", "@vincenovoa ❤️", "https://t.co/i5TgIcEYh3", "@vastshipwreck Maybe we should just wave?", "@stevenson3529 @WindAesthetic Beautiful.", "@Real6rnu Trust us, it's plugged in.", "@louiewein The nerve.", "@GeekTrainer 😂", "@joedurand ✍ Save early save often. ✍", "@ket_overkill We support this decision, Ket. 🐟", "@matvelloso CTRL + S\nCTRL + S\nCTRL + S\n🤔\nCTRL + S", "@MatterSec_ @UK_Daniel_Card 😂", "RT @MSFTnews: .@Cruise and @GM have entered a long-term strategic relationship with @Microsoft to accelerate the commercialization of self-…", "RT @satyanadella: Announcing new devices and tools to help keep students engaged and improve outcomes, anytime and anywhere learning happen…", "Is this you? 👀 https://t.co/mW7P1VugI7", "@townshed55 @AorusOfficial Brb gonna go beat our high score.", "@AorusOfficial 🚩", "@TooLate2Call 👀", "@Underscordd Hours.", "@NorthantsChief @colleenrattigan This looks like a very im-paw-tent Teams meeting! 🐾", "@originalsunbeam The perfect coworker doesn't exi-", "@r_coombes Very proper.", "@Cruise Thought we'd hop in for a ride. 🚗👋", "Plans for the day. https://t.co/rZIyYNHdS7", "RT @Lindsay_Rae_M: #MLK stood for peace but also spoke truth to power. We can honor his memory by learning about what he stood for and how…", "RT @satyanadella: At a time of so many challenges, we honor Dr. King’s legacy of service and commitment to take meaningful action and press…", "During the pandemic, Microsoft customers discovered that the cloud didn’t just have a silver lining – it was the silver lining.☁️\n\nSee how #Azure is helping companies stay resilient: https://t.co/B77EYR1d3Z", "@BarinCommandos 😂", "@SyedTechA Let that voice shine, Syed. 💓", "@Sean_Oliver Nm, hbu?", "@MeenooRami 😊", "@JoanneCKlein Making the tough choices. 📌", "@toadswiback Please notify us when this is available.", "@bdsams Wow, Brad.", "@CDCinRaleigh SAY IT LOUDER", "*unmutes mic* \n\n“Are we still doing these ice breakers? I have two dogs and enjoy long walks on the beach.” \n\n*mutes mic*", "@Tired_Dad_of_2 Excellent. Can you send us a DM using the link below? https://t.co/2zGa6v7GNK", "@bdsams Oh, Brad.", "@MODPizza 🥗", "@pdtit You too, Peter!", "@JoshErenberg 💞", "@PradeepAnanth_ Where are you going?", "@baxiabhishek @MichaelGillett 🖖", "@BeardedTechDude 😛", "@thekenyeung 🤔", "@burhankuvvetli Who's Mike?", "@DarrellaaS Yes. Yes it is.", "@MS_eduIRL 🌈", "@1_4M_M3 01001000 01100101 01101100 01101100 01101111 00101110", "Blind Citizens Australia’s mission is to inform, connect, and empower the 450,000 people in Australia who are blind or vision impaired.\n\nCheck out how the organization is living its values internally with #accessible technology: https://t.co/n9tzvokimQ", "@ThatTechieGirl Hello!", "@jonnychipz *tips hat*", "@JenMsft Simply amazing.", "@panattoni_ 😍", "@patrickandrews_ I must've called a thousand times", "@PKs_Flowers 👋🌎", "@MiriRod 💖", "@XboxAmbassadors Hey!", "@MODPizza 🍕", "Hi.", "RT @MSEurope: Understanding and improving nurses and midwives’ experiences are crucial to @Microsoft. ⚕️\n\nDiscover how we partner with fron…", "@MindcrimeDan 👀", "@MSH_Dave 😂", "@peteskomoroch Don't cut costs on chairs ✍", "@Vyaeria Excellent.", "@danicquinn Every. Day.", "There is no better PowerPoint deck than the PowerPoint deck made by you.", "It looks like you're trying to talk while muted. Would you like help? https://t.co/h7Ssh0HvUE", "As the move to remote work has blurred the lines between work and home time, empathy has become all the more important.\n\nLearn more: https://t.co/ra7eeGOT8Y", "Dear office swivel chair with excellent lumbar support: we miss you.", "Teachers, you're our heroes. 👩‍🏫\n\nDiscover the latest updates available now to help you make the most of distance and hybrid learning with Microsoft Teams for Education: https://t.co/ZM4s9GgWuk", "RT @satyanadella: Professional and citizen developers have been key to business continuity over the last year. As @amandaksilver shares, we…", "@KTX_games Hey, hey, HEY.", "@LuLaRoe 😍", "@JensenGregory 😂", "@MichiSRS What a wonderful life you must live.", "The works, please.", "When is pretzel day? Asking for a friend.", "Thanks to cloud technology, doctors are able to safely monitor isolated patients in the community, ensuring hospital resources remain available for the most critical patients. \n\nLearn more: https://t.co/Y3fc7h6D2t", "@AndiEwington Those transitions &gt;&gt;", "@THDMMerkel Is he just hopping off his last call? 🐇", "@ktomasko Hi Kristy, this is WAY too cute. Can you send us a DM using the link below? https://t.co/2zGa6v7GNK", "Couldn't have said it better ourselves. https://t.co/iKeWzXC2su", "The Windows XP start-up sound. Can you hear it?", "Technology is helping Africa's farmers reap major benefits. 🌱🌾\n\nCheck out how their crop yields have increased by 300%, multiplying the income of smallholder farmers by ten times: https://t.co/DlsepKMTOE", "Us: https://t.co/pdZIszgt9L https://t.co/2GglfN2Lg1", "RT @MSFTIssues: Watch Microsoft President @BradSmi’s @CES keynote on why we need to learn from the past, imagine the future and come togeth…", "@petr_hartmann One of the best replies here.", "@JenMsft Sorry, but you have to decide.", "@BenThePCGuy @Office 🤯", "@simonallison_ ...\n...\n...", "@JtFinlay \"Just sending a friendly ping.\" ✨", "@RizzEditions Wow.", "@JenMsft 😂", "@JustMoMbles Absolutely.", "@theexpertkid06 Love to see it.", "@rosantos_ecu CTRL + V", "@XboxGamePassPC 4:59: Ctrl + I\n5:00: Win + G", "@IsaacAttuah Ctrl+Y?", "Favorite shortcut combos. What's yours?", "CTRL + ALT + DEL", "More than 149 million new technology jobs are expected to be created worldwide in the next five years.\n\nDiscover how we're partnering with UK universities to prepare students: https://t.co/ohO0b1HF9b", "You read our Teams chat three hours ago. We’re still waiting for a reply.", "✅ Embedding resilience\n✅ Integrating new products\n✅ Getting to know customers better\n\nCheck out how retailers in Central and Eastern Europe are innovating: https://t.co/0MuITEwI0X 🛒", "@fahaad_abbadi Hello, Fahaad and friends 👋", "@shanselman 👀", "@threddyrex We'll allow it.", "@optional87 👀", "@memorycard_J In Durham, NC expect a high of 53° F and sunshine.", "@sharkybait We thought you were our friend, Steven.", "In case you didn’t know, this account isn’t managed by AI. We’re real people, just like you. \n\nUnless you’re a robot. 👀", "With school back in session, teachers around the world are adapting to new ways of instructing and engaging with students during the pandemic. 🍎\n\nLearn how they're innovating with Microsoft technology: https://t.co/OtJyjV9exd", "@CompletingTheC A prime example. 👏", "@KeaginMurphy You should.", "@ClareDurrett All the love.", "@TeganG_ A valid reason.", "@DenziltheCocker Your time will come, Denzil! 🎥✨", "Inspiration can make all the difference in the work you pursue. With 2021 upon us, chief people officer Kathleen Hogan connects with experts as they share stories of optimism for the year ahead. More from Kathleen: https://t.co/Cu5pZOCTSx https://t.co/AEL2VpHKk5", "Opening your PowerPoint deck with a funny GIF is something all of us appreciate. More of this, please.", "RT @MSFTnews: .@Microsoft is partnering with @broadinstitute and @verilylifesci to advance the @TerraBioApp and help researchers tackle som…", "Learn how: https://t.co/oIMcX6fKrT", "Did you know you can now use polls in Microsoft Teams meetings?", "RT @Windows: Welcome to CES 2021! Get a sneak peek at this year’s latest innovations here: https://t.co/6KEEaIcZjK https://t.co/8vZeEKeZoz", "Happy birthday to all of you Capricorns. May your January be filled with pristine spreadsheets and relentless ambition.", "You could say we Excel at it. https://t.co/uKAxHOolDv", "RT @panos_panay: As people continue to work and learn from home and other hybrid locations, devices have become our connection points to on…", "@TylerChess Excel-lent.", "@benardzulu96 Start &gt; Settings &gt; Game Mode", "Roughly 7,200 tons of e-waste lands in India’s capital city from across the country and abroad every day. \n\nLearn how grassroots startup @karosambhav is taking on the challenge of responsible #recycling: https://t.co/3LqF0Jz41I ♻", "@meh50187 Arguably, the best start.", "Drop your best Microsoft pun in our replies below. ⬇️", "It’s now safe to turn off your computer.", "Connection is calling. 📞\n\nNew enhancements to #MicrosoftTeams Calling are here to help you collaborate better: https://t.co/OUMikjDsR9", "How every #MicrosoftTeams meeting will start through the end of February: \"Happy New Year, everyone. We made it.\"", "Imperial College London is using Microsoft #HoloLens to help medical students get the vital experience of treating real patients in hospitals despite pandemic restrictions. 🩺\n\nLearn how: https://t.co/mZk0JPmyWr", "@Holy_Shadows @Xbox 👀", "@ket_overkill 😍", "@kngbell 😂", "@MissMFrost 🎁", "@wsdot_traffic @DaneCreekPhoto @wsdot Very impressive, WSDOT.", "Set status: appear away\n\nSet status message: bRb pLaYiNg @Xbox", "We've wrapped up a two-year experiment testing the sustainability of underwater data centers. And the results suggest our data could lie under the sea in the not too distant future. 🌊\n\nMore from @CNET: https://t.co/wG9JffWVrx", "@TheFoodieSavant Happens to the best of us.", "@sofiacqa Accurate. 😂", "@AubreyChampion You're right. That is love. 💘", "@jbwardrop Dash looks so ready to learn PowerPoint.", "RT @MSFTIssues: Fasten your seat belts. 💺 Microsoft has partnered with @AlaskaAir to reduce its employee’s in-flight carbon impact. \n\nHere’…", "@franamooney 😂", "@NaynishBL 🙃", "@panattoni_ Here's your reminder to unmute today.", "@horrocks_simon Sorry, gotta hop off this call. 🐇", "@BEAMBZ_ That smile gets us every time.", "@SAITServices Powerful points.", "@optional87 ❤", "@CtrlAltClay *hugs*", "@mwdarab We're just happy that you're happy.", "@Eli_Weitz 👍", "@JenMsft Relatable.", "Me: *settling back in after the holiday trying to remember how to do my job*", "Sharing the world of \n#ComputerScience with your students is now easier (and more fun!) than ever.  💻\n\nDiscover the latest Computer Science Subject Kit with more than 150 hours of learning content: https://t.co/fz1RSpNowx", "First week of the New Year and we wanted to check in. How are you doing?", "That little paper clip is Clippy, and Clippy is waiting. https://t.co/Gs7f5AWWfP", "Did you forget your password again?", "@primaevitas ❤", "RT @MSEurope: .@Microsoft demonstrates how to increase green energy in Ireland one rooftop at a time. Read more: https://t.co/KVrpQ4V65k", "@xboxBG Which is which?", "@LuLaRoe 😂", "@thejonlewis 🧊", "Things to bring into the New Year: love, positivity, and leaving those who deserve it on read.", "@fishingparty Three dogs barking and a lawn mower.", "@IWannaBeAMem3 😬", "@anonymouskrypto We notice you.", "@ms_garcia88 @stpetersmilton @mswyprzal 👏", "@ErinWrites93 Totally understand, just have her send the deck over as soon as she can.", "They say teamwork makes the dream work, but what if teamwork isn't working so well? 🤔\n\nCheck out these tips on how to capture team attention: https://t.co/yJZr43OxHg", "@justplainjenn One treat per every minute of the dog park delay. We don't make the rules.", "You: It’s now 2021 and I have zero excuse to still be muted.\n\nAlso you: Sorry, I was muted.", "Real super heroes code. ⌨🦸‍♀\n \nJoin the @WonderWomanFilm Game Idea Challenge for a chance to win an Xbox Series X, a #WW84 Xbox controller, and a Surface Book 3 13.5”.\n \nThe details: https://t.co/m63HsKTMsL\n\nNoPurchReq. Open to residents of 50 US (+D.C.), 18+, Ends 1/25/21 PT. https://t.co/XCrkFj7cYS", "@m_konopacki The image is intended to represent the braille conversion of \"World Braille Day.\" A user with a refreshable braille display would be able to read this in braille.", "Today we celebrate #WorldBrailleDay – Braille is key for achieving equality and social inclusion for millions of people who are blind or have low vision. https://t.co/cHGXVrcrAC", "Us: Anyone have anything else before we wrap this up?\n\n2020: Actually, I do have one more …\n\nUs: *ends call*", "In 2020, we took exploration to new heights. ✈️\n\nTake a look back at the launch of Microsoft Flight Simulator: https://t.co/rlEtXgAsvG", "WFH in 2020 summarized in three words: You’re on mute.", "https://t.co/e6AWX8Qrif", "This year, we reached new depths of possibility for our underwater datacenter, #ProjectNatick.\n\nLearn more about how it supported pandemic research efforts: https://t.co/ytIcLT7jah", "*Sends email*\n\n*Waits 10 minutes*\n\n*Starts Microsoft Teams chat*\n\n“Hey! Did you get my email?\"", "@backlon 😂 rude.", "@pbrigmanHR Just trying to keep it real with you.", "@jakemeyers2015 That's the joke, Jake.", "@souljaboy Yooooooooo 👀", "*Joins meeting*\n\n*Unmutes mic*\n\nTo your pet: I love you so much. Thank you for making me happy literally all of the time.\n\n*Mutes mic*\n\nCoworker: I should get a pet.", "This year, we announced our commitment to become carbon negative and water positive by 2030.\n\nDiscover more about our #sustainability initiatives: https://t.co/qKcFbxIjEW", "@Xbox 👋\n\n🎮!", "@bdsams 📎", "@KerithBurke Yes. Just wanted to say hi.", "@bdsams Hello, Brad.", "@Emojipedia 🤝", "@iam_abdulloh Never too early.", "@techrankin 😂", "@matink You're on mute.", "@NateIngraham sup", "Hi.", "A next-generation console was released this year. 🎮\n\nCheck out how we powered #gaming dreams in 2020: https://t.co/WSc11hncjc", "Our followers live all over the world. Tell us where you’re typing from. ⬇️", "Join the @WonderWomanFilm Game Idea Challenge for a chance to win an Xbox Series X, a #WW84 inspired Xbox controller, and a Surface Book 3 13.5”. 🎮\n \nShare your game ideas: https://t.co/I2cF1WSGuc\n \nNoPurchReq. Open to residents of 50 US (+D.C.), 18+, Ends 1/25/21 PT. https://t.co/dwxZeUYXVU", "Microsoft Teams: It looks like you’re available\n\nYou: Oh, does it now?", "This year, we unveiled a new way to browse the web on @MicrosoftEdge. \n\nTake a look back at the milestone: https://t.co/mwbMyBvuY7", "https://t.co/SxMnKtTBYm", "Australian students got the chance to discover and explore their local Indigenous cultures with the first NAIDOC Minecraft Education Challenge. \n\nCheck out what they learned: https://t.co/uMQxvm0wI2", "There's no place like Home. #WallpaperWednesday. https://t.co/YheJYP9v1g", "With Microsoft Custom Translator, you can help globalize your business and improve customer interactions.\n\nCheck out the updates to our translation solution: https://t.co/jkXLbF4i4N", "You can “work” and snack at the same time.", "From tracking your spending to simple photo sharing, #Microsoft365 is here to help you live your best, most organized life.\n\nCheck out the newest features: https://t.co/cen7Dvha0Z", "You can only have one. https://t.co/yJXstLzdmE", "Looking for a holiday adventure like Rufus’s? You can now select and fly Rufus and Sam's planes in Flight Simulator!\n\nWe’ve also decked out 12 iconic landmarks around the world with festive holiday lights, ready for you to discover: https://t.co/cRUxpxjKZT https://t.co/h4lunvpTxq", "With hackers working faster than ever, #cybersecurity is more critical than ever.\n\nDiscover how machine learning is boosting the ability for organizations to do cyber detective work in real-time: https://t.co/Cq071BkRaX 🕵️", "Tip: Replace “WHYYYYYYY?” with “Okay, great.”", "RT @satyanadella: In every community, in every country, and across every industry we’ve seen people step up to help keep the world moving f…", "The Student Forum is where higher education students can connect with each other and Microsoft Education experts.\n\nCheck out how three students are getting creative and staying productive during remote and hybrid learning: https://t.co/uButiqaukY", "The year is 1997.\n\nYou: *struggling to write a letter*\n\nClippy: Would you like some assistance with that?", "The switch to remote work has made implementing a Zero Trust security model even more important. \n\nHere's how you can get your company's #cybersecurity on lock: https://t.co/kffTQr3jz7 🔒", "@AwsmSpaceMonkey 🥧", "@JenMsft Close.", "@MsLeeTeacher That is correct!", "@Rubenia_Borge Good guess.", "Main ingredients: \n\n- Dried fruits\n- Sugar \n- Cinnamon\n- Nutmeg\n- Cloves\n- Maybe even some Brandy?\n\nWhat are we making? 🤔", "RT @Windows: Thanks to all your 💙, this year’s #WindowsUglySweaters went fast — and @GirlsWhoCode felt your support! What’ll we knit up nex…", "@kristan_kenney 😂", "From hybrid to remote learning, teachers have had to juggle a lot this year. \n\nCheck out how new technology from Microsoft 365 can help #teachers, #students, and administrators get organized: https://t.co/ATV2MklbW6", "Which is your favorite?", "Here are some punny holiday cards for you to share with friends. https://t.co/Ns4UtODPdj", "RT @BradSmi: The latest nation state attack is not espionage as usual, even in the digital age. Instead, it’s an act of recklessness that h…", "What's up, doc? 🐰🥕\n\nWe've joined forces with @KingJames and @spacejammovie to create learn-to-code lessons for all ages. \n\nCheck out the game challenge from \n@Xbox \n@MicrosoftStore\n@MicrosoftLearn \n\nMore: https://t.co/rVAOt1qRl4 https://t.co/gPU9RX04Am", "RT @Xbox: Gaming has the power to strengthen connections, across age and distance.\n\nWatch how it rekindles the relationship between Dhillon…", "@NoradSanta ✨", "@sbj24 Happens to the best of us.", "@CalexStreams 🙃", "@AshikaG_ Ours too.", "@MicrosoftEDU *bliss*", "@rishiraj824 ❄", "*writes note*\n\n*edits note*\n\n*reads note*\n\n*sends note*\n\n*feels better*\n\n*feels worse*\n\n*reads note again*\n\n*finds spelling mistake*", "Wellbeing has never been more important. \n\nCheck out these 5️⃣ tips to support your employees with stress management and more: https://t.co/kO7dHJKt3a", "Makin’ it snow. https://t.co/TF2uHriQ2P", "RT @MSFTIssues: Many of us are heading into our 10th month of shutdowns and restrictions.\n\nToday, @BradSmi is announcing new commitments fr…", "Look at all that cheesy goodness. 😍\n \nHere's how we're helping @PepsiCo create perfect Cheetos: https://t.co/cLyVvzWPup https://t.co/ARmE9Np4fF", "The holidays won't be quite the same this year, but NORAD will deliver a treasured tradition you can count on: https://t.co/DLsKkESwVa", "@COOLSISTech 👋", "Cheers to innovation.\n\nCheck out how one of the world’s best-loved premium gin brands, Silent Pool, is diving into #cloud technology: https://t.co/ORnflOuZb5", "We’re collaborating with @FedEx to support the safe and efficient distribution of the COVID-19 vaccine.\n\nLearn more: https://t.co/v6ConiIS5j https://t.co/2ITziZUKPT", "Where would you fly to? 🛫", "The year is 1986, and we know what we’re getting you for the holidays. https://t.co/Eo8gHiaQLJ", "Tis the season to slow down and savor the holidays. ✨\n\nTake a break from the hustle and bustle with these tips: https://t.co/NMM3aBPFwc", "'Tis the season. Today's #WallpaperWednesday is brought to you by the #WindowsUglySweater. https://t.co/ScIXbz0fAz", "RT @MicrosoftTeams: This holiday season, a new way to show your appreciation. You can now send @Starbucks gift cards through Microsoft Team…", "@jennaezarik @MicrosoftStore @ijustine 💘", "Ring in the season with Microsoft Holiday Hits – timeless classics.\n\ncc: Reply All Records, Inc. https://t.co/GDCc9rOAjs", "As the fall semester winds down, here are 7️⃣ ways to create a seamless distance learning experience—this semester and beyond: https://t.co/Jkwg7pFh4p 🧑‍🏫", "@yeohbraddy 🙌", "@CharlesTStella @LittleDebbie Essential.", "@steffclef13 Amazing. 😍", "RT @Lindsay_Rae_M: We’re all about innovation—even in the way we approach diversity &amp; inclusion through a growth mindset lens. We encourage…", "Kolaczki, krumkake, gingerbread. What’s your favorite holiday dessert?", "Our Nonprofit Tech Acceleration for Black and African American Communities program is designed to empower nonprofits with technology solutions.\n\nLearn more about our commitment: https://t.co/x665muc84t", "#Cybersecurity isn't just for computer science students, it's for everyone.\n\nLearn more about the job opportunities spurred by digital transformation: https://t.co/7No2biaaqr", "@WhiteFoxSG ❄", "Coworker: *requests read receipt*\n\nYou: Ehhhhhhhhhhhhhhhhhhh.", "@IntelGaming 🐶", "Tuuuune Squad 🎯\n\nWe've joined forces with @KingJames and @spacejammovie to create learn-to-code lessons for all ages. https://t.co/qxopQ1pEh6 https://t.co/KBDYxybTXu", "*Unmutes mic*\n\n“How’s the weather by you?”\n\n*Mutes mic*", "More than 2 billion people don't have access to safe, nutritious, and sufficient food, but the actions we take today can impact tomorrow for the better.\n\nDiscover how #AI is planting opportunities for a food-secure future: https://t.co/ttsSUeaNgb", "“Hello, hope this email finds you well.” \n\nHow the email found you: https://t.co/EtlFNbMYoP", "RT @MSFTEnable: As 2020 comes to a close, we are sharing a few of our favorite tips and tricks to help us all work more inclusively in Wind…", "At the start of the pandemic, @Crocs realized they had an opportunity to offer a little kindness and comfort to overwhelmed frontline workers.\n\nWith the “Free Pair for Healthcare” initiative, Crocs donated over 860,000 pairs of shoes: https://t.co/yIJAtOZbWo", "RT @satyanadella: We’re thrilled to be teaming up with @KingJames, Bugs Bunny, and @SpaceJamMovie to promote computer education and empower…", "RT @IPROMISESchool: This STEM lesson is going to be out of this world! 🚀🌍 @spacejammovie @KingJames Our kids are going to have Mr. LeBron…", ".@Xbox 🤝 @KingJames\n\nWe're teaming up with @spacejammovie. 🎮👀\n\nJoin in on the fun: https://t.co/uevOz9pL5d https://t.co/Zg1cr2afZO", "@verge Yes, we did.", "*Joins meeting*\n\n*Mutes mic*\n\n*Unmutes mic*\n\n*Mutes mic*\n\n*Unmutes mic*\n\n“This was great. Thanks, everyone!”", "@asajohnson Love it.", "@chriscapossela It's the perfect way to embrace this joyous time of year. ❄️", "@stevecla *also available on 4 long-play cassettes*", "RT @MicrosoftTeams: Picture it—the office holiday party has gone virtual. Thankfully, #MicrosoftTeams has dropped some brand-new holiday ba…", "RT @BradSmi: Recent cyberattacks on hospitals and vaccine developments make it clear: a multilateral approach is critical to global cyber c…", "Today's students are going to change the world tomorrow.🌎 \n\nWe’ve created five new lessons for #Minecraft: Education Edition to help students take their first steps into this exciting realm of #AI: https://t.co/z6LwO6DLPY", "@Xbox Could've guessed. 😂", "@MxdRealityDev 😂", "@BenThePCGuy We're taking this as a compliment.", "@DanielHeithorn Knew we would.", "@Nick_Viviani Welcome to 2020-era Microsoft, Nick.", "@film_girl 😎", "@XboxGamePassPC We can't comment any further.", "@rparker6112 Never said it wasn't.", "@panattoni_ 😳", "@misstoiletslave It's a yay from us.", "@colleenrose15 Teenagers. 🙄", "@Frances80306737 🤐", "@matthafenbrack 💙", "@ClarissaGillin2 Every morning with this paperclip.", "@ChloeCondon We're already working on the '21 release. Can we call you in?", "@Eli_Weitz Any favorite tracks?", "@LittleJoe2005_1 We will literally not take your money.", "@AnthonyParryUK We recommend just playing this tweet over and over again.", "@tomwarren You know it's funny, Tom.", "@bocatadelomo 😂", "@bdsams Oh, we did.", "@Margaret_S07 📎 Yes, Margaret.", "Reply All Records presents: Microsoft Holiday Hits. The great selection of holiday songs EVER assembled. 🔈📺 https://t.co/Ml0lIqGeEt", "Like many companies, insurance company Youi had to quickly pivot to remote work during the pandemic.\n\nDiscover how their #DigitalTransformation is revealing new opportunities: https://t.co/sH8BqA4wBX", "Does Clippy run this account?\n\nThat's one secret we'll never tell. 💫", "As part of our ongoing commitment to provide relief during the COVID-19 pandemic, we’re actively working with our partners and customers to deploy vaccine management solutions. Read more about our plans to help distribute vaccines safely and equitably: https://t.co/dMmJQyLFpO", "RT @Xbox: This is just the beginning. \n\nPerfect Dark is back: https://t.co/Hc9OGefdZz \n\n#TheGameAwards https://t.co/Y6hiYZt9jT", "@Misabr0penguin 😂", "@jbernie ... 3", "@MrCoinOp We could use the ... assistance.", "@SicSkeptic14 Thank you, planning on it.", "@Oh_Hi_Riley 😂", "@anguyen216 He's a good writer.", "@ukiyo__san Us 🤝 You succeeding", "@kararust You've got this. 💙", "@TheCandaceLowry Solid choice.", "@djjewelz We love you for this.", "@hollynorth_ Probably not.", "@Chris21598148 Considering this a compliment. 😄", "@me1grehg 😍", "@TheBeehammer Essential.", "A solid 2 and a half hours of work. https://t.co/joJTM2jxQc", "@Flipgrid This is gorgeous.", "You don't have to be in the same room to share the cooking traditions you love. 🥧\n\nGet a taste of how technology can help you celebrate the holidays safely: https://t.co/f55jyRaQgW", "@StephenSobchuk Grandma's kutya 🙌", "@Meamp64 🙌", "@BlaineThePainTV Always.", "@rethink_patel 👏", "@derra_nic Whoa.", "*waves but doesn’t unmute*", "@MichelleKirkla4 9/10", "During a challenging year, South Africa's winemakers have found a way to keep the wine, and creativity, flowing. 🍷\n\nCheck out how they're raising a glass to innovation - virtually: https://t.co/9FdrUInjGP", "Kheer, dumplings, figgy pudding, latkes, Risgrynsgröt, barbecue. \n\nWhat’s your favorite holiday dish?", "RT @satyanadella: Expanding our partnership with @DeutscheTelekom, bringing together their telco expertise with our cloud capabilities to h…", "@mattsdl The more you know. 💫", "@msexcel Word.", "@SpartanSHATTER On the second cup of coffee ☕", "@bakakuramaa A great day.", "@thekarachikid *unmutes*\n\n...\n\n*mutes*", "@khushbooverma_ If only ...", "@DJ_EddieL We'll leave you to it.", "@BlackFrankFTM2X Fantastic!", "@sunnydelight @Xbox", "@LuLaRoe Coffee, coffee, coffee!", "@RaphJV 9/10", "@DuskyCreeper 10/10", "@JordanSpore 9/10", "@TheCouzens96 9/10", "@MichaelJMohsen 9/10", "@VDandavate 10/10", "@TylerChess 10/10", "@VarunJilla 9/10", "@judicael_andria 9/10", "@Umangpamol 8/10", "@Telixion 10/10", "@stroker 8/10", "@DigitalMarkLane 8/10", "@rparker6112 10/10", "@arborbytes 9/10", "@ryan4gaming 10/10", "@MonsterManuel12 9/10", "@HikariYamaoka 10/10", "@rethink_patel 9/10", "@WAlmario224 10/10", "@mistymadonna 8/10", "@William24070136 9/10", "@Errolbjrr 9/10", "@Petmorr 9/10", "@SingingNakShtrA 10/10", "@StarboyHsp 10/10", "@p3traxy 10/10", "@LiteraryAthlete Beth! We've talked about this.", "@libreOfficeLock 🙃", "@TheRichWoods 😂", "@onedayajedi Love what you did there.", "@datamattsson Take a deep breath, you've got this.", "@robertgh33 Excel-lent.", "How are you doing today?", "@MohuaBose13 9/10", "@MrCoachK15 10/10 💙", "@FakeMartha957 8/10", "@TheHeathernaut 9/10", "@The_DunkFodder 10/10", "@faridah_haliru ❤", "@derra_nic Same. 10/10", "@taejoonutopia 💕", "@BradChuck 😂", "@intel Dancin'. 10/10", "The 80s were wild. ⚡ https://t.co/sbAuHOW2BO", "@bdsams Alright everyone, he's gone.", "@bdsams WOWWWWW, Brad.", "@k_tinathealien 10/10", "@enteriosoft 10/10", "@zoovu 10/10", "@OscarMR_98 ❤ 8/10", "@AmalQazi2 10/10", "@ThatTechieGirl 9/10", "@m3rtyeter 9/10", "@ulissesomito 9/10", "@KJOFineArt 10/10", "As a part of our global skilling initiative, close to 900,000 learners have engaged with one of the ten learning paths in the Middle East and Africa alone.\n\nLet's give a round of applause to our learners: https://t.co/pj8PtF1MRn 👏", "@aviraj111 Awww. 10/10", "@ChristosMatskas 9/10", "@BenThePCGuy 10/10", "@ShineyCheese Oh, Brad.", "@DatAviation How many times has this actually happened? 😂", "RT @MSFTIssues: At Microsoft, we have made ambitious commitments on sustainability. 🌄\n\nBy signing the #ClimatePledge, we are lending our vo…", "@marthalobrien It's the double check mark for us.", "Brad: Hey everyone, I need to jump to another call.\n\nYou: Wow, Brad.", "@TheNarratorCody 10/10", "@nathanc @KamiKarras 9/10", "@mollyiscontent 10/10", "@manbirmarwah That aesthetic. 10/10", "With the help of the cloud, Indian startup iMocha came up with an online solution for traditional whiteboard coding interviews.\n\nLearn how they accelerated their launch to meet the needs of the pandemic: https://t.co/hGTYIe9fDW", "@Average_Gaz More of this please. 10/10", "@Halo 😶 10/10", "@Brokenvegetable Always a 10/10.", "@IamRahulMitra Yessssss, for the corgies. 10/10", "@FallenCptJack 😂 8/10", "@ProjectAkturum A little more to the right. 9/10", "@elsamareyy Yes. 9/10", "@julybug17 One of our favorites.", "@panattoni_ It's a 10 out of 10.", "@ajohnsocyber Could use a few times throughout the day. 9/10", "@VegaNovus Also us when our coworkers spill the tea over Teams chat. 8/10", "@IkeRuaro 9/10", "@A_regularJeff 10/10", "@speku19 10/10", "@MervynCunningha 10/10", "@aNtnfny 9/10", "@refreshmyjawn 9/10", "@maikelson 8/10", "@james_scott273 10/10", "@Trollgamer63488 10/10", "@Spartans5499 10/10", "@_defc0n_ 👏 10/10", "@Sandforged 10/10", "@TweetsfromSara 10/10", "@Jaakkim0 :( 7/10", "@thedefiantjuan 9/10", "@PradeepAnanth_ 10/10", "@ErikMoreau 10/10", "@sachinbahal Noice. 10/10.", "@onlytruejames 9/10", "@sambu_40 10/10", "@nicolesteinbok 8/10", "@Nonelistening 10/10 💖", "@Xbox 13/10 no question.", "@VirpiHeikkila 💭10/10", "@immi_beresford 10/10 for the turtles.", "@tomwarren 10/10. Excellent, Tom.", "@stevekovach 10/10", "@JenMsft How we feel right now. 10/10", "Reply to us with your favorite GIF and we’ll rate it on a scale of 1 to 10.", "@maddy_hs :)", "RT @satyanadella: To more evenly spread economic opportunity and resilience, we must democratize tech intensity by empowering citizen devel…", "In honor of the power to play, we went ahead and freshened up your background for you. #WallpaperWednesday https://t.co/zYqk8OVeDR", "Nonprofit organizations face ballooning needs, dwindling donations, and canceled events as the pandemic continues.\n\nSee how Microsoft's Common Data Model for Nonprofits is helping to bridge those gaps: https://t.co/V5DysqPqN3", "RT @MicrosoftTeams: 🌨 Wintry Together mode scenes\n🎁 Holiday-themed custom backgrounds\n🥳 Virtual holiday party tips\n\nAll part of celebrating…", "@MicrosoftTeams 😱", "@DrVortx We've got you. ❤", "@ScottieN0 It's just to save your inbox.", "@asalisbury We'll fill you in on the details later.", "RT @ToniTWhitley: The COVID-19 pandemic drove significant transformation in government operations. Learn how agencies turned to technology…", "@FridaysOVPyro Could be.", "@HarmanManchanda Exactly what we needed. Thank you!", "@anguyen216 😂", "@tiredlefty 😬", "Moving you to Bcc.", "Insights in Microsoft Teams for Education are here to help your students achieve their learning goals.\n\nCheck out six ways to help your students shine: https://t.co/YAPvsXcCpz 🌟", "You: Does anyone have any questions before we move on?\n\nUs: Yeah, what day is it?", "RT @Xbox: When we say Power Your Dreams, we mean it.\n\nThis film by @TaikaWaititi was inspired by real dreams @MoonLiteWolfPro had after pla…", "@JoshuaBurroug19 Staplers.", "@panattoni_ Didn't you get the memo?", "@stopit_topit Crispy.", "@BuildWood Usually it's just silence after that question.", "@samvardhansingh Thanks", "@BinZeglam Yes, but not anymore.", "@BuckWoodyMSFT https://t.co/yeW7c1cQVS", "Sketch 360 is one example of how you can create pretty much anything you put your mind to. ✏️\n\nCheck out how the project went from Microsoft Garage to Microsoft Store: https://t.co/PCDc0PkRW2", "*Unmutes mic*\n\n“That’d be greeeeaaaatt.\"\n\n*Mutes mic*", "With live, in-person concerts impossible due to the pandemic, @MosesSumney  relied on technology like Azure Kinect to make his recent music video feel more impactful and inclusive.\n\nDive in: https://t.co/ZKzgxcc8Jj", "@jongallant @MicrosoftTeams 👏", "We are the first company to respond to the European Data Protection Board's guidance with new commitments that defend our customers’ data.\n\nCheck out the next steps we're taking: https://t.co/V5weLUdtER", "@cashifyer Could be. 🤔", "@JadeEJF We're here for it.", "@jocraul Good question.", "@boringfileclerk Prove it.", "@_ABOwens Sammy is everything. 💘", "@AllisonAngel_ \"Alright, let's get started.\"", "RT @satyanadella: This year in particular has shown why the public sector is so important to every facet of our society and economy, and we…", "12/7/1978 📸 https://t.co/nUARU8aSml", "You: I seem to be having some WiFi issues, just get started without me.\n\nEveryone else: We’ll wait.", "Make your list and check it twice. ✨\n\nNew features from Microsoft Edge and Bing are here to make your holiday shopping extra nice: \nhttps://t.co/Yn9GR0qTie", "@Rick_Kingery 😅", "@EditsSaturn You too! 🌼", "@MtbServpro Can't confirm or deny that this has happened.", "@DigitalManiak3k RT 😂", "@b3qa_ 🧯", "@auhrian 💓", "Them: *marks email as urgent* \n\nYou: Relax. Everything will be okay.", "Update: https://t.co/5cn7Zzlwt1", "A treat for every decision that yields a desired result. \n\nLearn more about Microsoft Personalizer, which uses a more cutting-edge approach to machine learning called #ReinforcementLearning: https://t.co/fxUdKea8MR https://t.co/O4F67ARePy", "@TheMysticFez ❤", "@Zvyozdochka Truth.", "@rayd_250592 Thanks, Raymond!", "@shanselman Is it me you're looking for?", "@Dana_cinnamon Staying hydrated is 🔑", "@igrir You're too kind.", "@paulfabretti @trishskee Team work makes the dream work. We hope you both have a great weekend! 💘", "@shanselman Can you hear me?", "@realfemboy I hope tomorrow's better!", "@BooyakaFN Amazing!", "@buttercup_chara Very eventful. Have a great weekend, Chara!", "@baconisalluneed Hope it gets better! Tomorrow is a new day. ❤", "@coilvision Excellent.", "Checking in again, hope you had a great day. 💘\n\nAll my best, \nPerson who runs the Microsoft account", "@panattoni_ Sorry! Sending the link now.", "@Windows Even though they're flat and made of plastic?", "As educators continue to navigate a new landscape, we're helping them track their students' engagement and progress over time and across classes. 👩‍🏫\n\nLearn more about the updates to Insights in Microsoft Teams for Education: https://t.co/Eui6bRIb1q", "@RossUKRFC There's always one.", "@itsayushpathak Kibble or chow.", "@KeKaTwi 👀", "@Meganisrad Excellent choice.", "RT @MSFTIssues: 2020 has been a roller coaster. 🎢\n\nWhat happened at Microsoft this year? Breaking down our CSR report in a thread. ⬇️ https…", "@OsmanBhatti Thanks for the offer. We are looking for at least 1.5Mb.", "@JustineHMathews It's third, Justine.", "@JoshH520 Meeting. Free. Fridays.", "@XboxGamePass Mom.", "@Ajmal_30 It's the most important meal of the day.", "@CheeringXBoxer Very true.", "@lorena_msft ❤", "@666beerguy It's a yes from us.", "*sigh*\n\nA Microsoft Teams call we'd love to join. https://t.co/FX1F4VfWoz", "Here’s a @powerpoint on how to win an ugly sweater contest, with talking points below.\n\n- Make it ugly, but cute. \n- Nostalgia, nostalgia, nostalgia.\n- Pay attention to the details. https://t.co/hIdDDpYyYL", "In this free @MicrosoftLearn Module, discover the principles of sustainable software engineering and how to maximize carbon efficiency. 💡🌱\n\nGet started: https://t.co/OyPJ89Kzsg https://t.co/Qa1jClasGq", "Did you eat your lunch for breakfast again?", "RT @satyanadella: Today, we announced new capabilities to help every organization harness the full power of their data. Here are highlights…", "@Crazygamer360 Coffee time, all the time. ☕", "@SLJeffrey3128 Tessie looks very sorry. 🥺❤", "@SheelMajumdar They could all be best friends. 🥰", "@DaTruthofMikeP 😍", "@ShaneCarrollMay Cooper is always ready to strike a pose. 🌟", "@Carike_B 😍☀", "@ShanesCows @PowerApps911 Chewy deserves all the treats. 🦴", "@AnthroMetal Hello Samson, Daisy Mae, and Miss Scruff!", "@TobyBaratta Working very hard over there. 😍", "@logicwinsalways What a cutie. ❣", "@toomuchnoise 🤔", "@BarinCommandos We love your Outlook.", "@GAYFORGOJO 💖", "Does anyone have a floppy disk or two? https://t.co/0IyI5YWTBn", "RT @MSFTEnable: Together we have the collective power to create a path toward an inclusive recovery. \n\nIn honor of #IDPD, learn about stori…", "More than 1,000 Indigenous students around Australia took part in the first National NAIDOC Minecraft Education Challenge.\n\nDiscover how they took inspiration from Indigenous knowledge to look forward to a sustainable future: https://t.co/2hLkdBQIuY", "RT @bing: Today is International Day of Persons with Disabilities. Join Microsoft Rewards &amp; start Giving with Bing to help @SpecialOlympics…", "You: I’m going to be so productive today.\n\n10 minutes into the workday: Welp, it’s about time for a snack.", "Word. https://t.co/LHQbdptyVf", "Rufus had himself an adventure, didn't he? This feels like a great opportunity to ask you to share pictures of your pets in our replies. https://t.co/FClliU6cy1", "Have any more tips? Share them ⬇️ #IDPD", "Tip #3: Avoid using many emojis in a row or special font. Click into the video and listen to how a screen reader renders the text included in this post. #IDPD https://t.co/2lqwhH6JZx", "Tip #2: Whenever possible, place hashtags at the end of your tweets and don’t forget to capitalize each word. #IDPD https://t.co/erSkYmlS0k", "Tip #1: Add descriptive alt text to images. #IDPD https://t.co/y0sEqB3COP", "With more than 1 billion people with disabilities in the world, it’s important to implement social media practices that are accessible. \n\nBelow are a few of the tips we’ve learned on how to make content more inclusive when posting on Twitter. #IDPD", "@BigDawgMills Thank you for your submission. What is this floof's name? 🐶", "@k_wolfkill @Halo Ditto. 💚🐶", "@muhname_Jeff @Minecraft @MicrosoftTeams @Halo What's the status of Master Chief, @Xbox?", "@Caboose_V2 @Minecraft @MicrosoftTeams @Halo Exactly what we told him. 💭", "@siralysson @Minecraft @MicrosoftTeams @Halo 😂", "@kieranmgarvey @Minecraft @MicrosoftTeams @Halo 😂 Please send photos!", "@emmart9 @Minecraft @MicrosoftTeams @Halo THE EXCITEMENT", "@Tillablefix1 @Minecraft @MicrosoftTeams @Halo ❤", "@ChrisCovent @Minecraft @MicrosoftTeams @Halo Who wouldn't want this doggo? https://t.co/uoC6zzR4RM", "@stickerboy @ske7ch @Minecraft @MicrosoftTeams @Halo @FreddieLeCat Freddie deserves all the attention.", "@Xbox Master Chief was like ... 😶", "Microsoft 🤝 @FedEx\n\nFedEx Surround, a new platform using Azure ecosystem products including Azure Synapse, helps customers digitize supply chains and use data to manage and track inventory in real-time. \n\nLearn more: https://t.co/ZQMWvqpLEf https://t.co/319GtA8Ysz", "Enjoy this video with descriptive audio here: https://t.co/dzSOZfZIri", "@sightlessKombat @Minecraft @MicrosoftTeams @Halo @zentertainment @aarongreenberg @Xbox @jennylayfluffy @hgeller30 Enjoy this video with descriptive audio here: https://t.co/dzSOZfZIri", "RT @jennylayfluffy: Theme of International Day of Persons with Disabilities is “Building Back Better”, - a disability-inclusive, accessible…", "This holiday, we’re all yearning to get out there. Follow the story of Rufus, a pup whose dream helps him find joy and adventure in Microsoft worlds like @Minecraft, @MicrosoftTeams, and @Halo. #FindYourJoy https://t.co/rYHsjPhbGy", "@SEBIBIIIII We replied because we care. ❤", "@EditsSaturn 🥰", "@Capnhoppy 😂", "@PrimeFLytrap You're welcome.", "@Anes69477096 Right?", "@MikeUptonPhoto Seriously.", "@mustanghope08 29 more days. 29.", "Next slide, please.", "@MrSimilii Exactly.", "@tinytigermedia He knows how to get a point across. 😂", "@cshilt 😂", "@VincentArnett *5 hours later*", "@IWannaBeAMem3 Never good. 😅", "@KarArnett Truly. 😂", "RT @satyanadella: Thank you to all of the teachers who have shown so much creativity and ingenuity in the face of challenges this year to h…", "More than 115 million people use #MicrosoftTeams every day, and everyone has different needs.\n\nThat's why we're introducing new apps to customize your workflow: https://t.co/A7MdqrfWJ0", "RT @BradSmi: How do you store 10 million tons of sugar beets headed for production &amp; prevent millions in potential losses for farmers? A li…", "@OKDecent Please take care of Clippy.", "@Chris21598148 😶", "@SmolKodzuken ty", "@panattoni_ *unmutes mic*\n\nThis is Nova, my fluffy butterscotch that I love so much.", "@SEBIBIIIII 😂", "@MercedesAMGF1 @GeorgeRussell63 Possibly the best Powerpoint we have ever seen. 😨", "@ajohnsocyber 🤫", "@notDanielBruns 😂", "@kathwilsey This made our day. ❤", "It's been a year. Share all that apply. https://t.co/yxCO0YT1uX", "Even if we can't physically be together, we can still spend the holidays with the ones who matter most.\n\nLearn how to celebrate together, virtually: https://t.co/68YPFs2SHe", "Caption this\nhttps://t.co/QWgdmlVcWb", "Today's #WallpaperWednesday theme: holiday Clippy https://t.co/a3Y9ZaX9Yy", "RT @MicrosoftEDU: One of the best things you’ll read today. ❤️\n \nWe're highlighting the stories of educators around the world who are spear…", "@btpclarkson 😅", "“Creativity is believing in yourself. It’s believing in your idea. It’s keeping on going, and it’s not giving up.”\n\nGet to know four media and entertainment industry professionals with the film Creativity in the Digital Age, presented by Microsoft: https://t.co/6H5QKqK21g", "*Joins meeting*\n\n*Oh, my. Someone else is already here. I’ve never met them before. Do I say hi?*\n\n\"Hello.\"\n\n\"Hello.\"\n\n*mutes mic*", "@ATTBusiness Always has to go down like this.", "Adventure time! Come back tomorrow to watch this good boy dream up an epic holiday journey filled with joy. 🏡 🐕 🎮 ✈ #FindYourJoy https://t.co/b4F80TDHfv", "RT @MSFTIssues: It's vital that #COVID19 doesn't become an excuse to neglect ongoing education 📚\n\nThat's why @microsoft is continuing to in…", "@EmilyTimbol This is how all meetings should end.", "@mrdang @TashasEv 💞", "@Ladewig @expta Hi Scott &amp; Jeff!", "@BarretBlake 😅", "@FloorDrees @jansche Hey there! 👋", "@thealohateacher @KamaliiSchool Hello to all the heroes at Kamalii!", "Charles Sturt University is using Microsoft Dynamics 365 to streamline student engagement and uncover insights.\n\nLearn more about their #DigitalTransformation: https://t.co/WcCZuQnxyS", "RT @satyanadella: This Thursday, I’m looking forward to sharing our vision for the future of data and analytics, along with @Kevin_Johnson,…", "You: Today is the day I take myself off mute and contribute to every conversation.\n\nYour dog: My time has come.", "RT @BradSmi: It’s crucial that future developers think critically about the ethical and social impacts of AI. @codeorg's new #AI curriculum…", "India has roughly 1.5 million engineer graduates each year, but less than 30% of them are women.\n\nLearn how CyberShikshaa is leveling the playing field for India's women in engineering: https://t.co/HFrqmH6eYy", "@ladyfaith @CoachValbo We appreciate the hustle. Hey Coach.", "@dcRecruit @Big_B_78 @MicrosoftLife Hey Tiffany &amp; Basim. 💗", "@adoptmovement @khalidburke Hi aDopt! 🐶", "@Xbox_TechJunky @kolbepayne @TheNobleGrunt 💚 hey fam", "@IsidoraKatanic @adamj89 Hello Adam 👋", "@Dragonlord941 hi dragonlord94", "@_w_x_1_ @3blue1brown Hey Grant!", "@astronautvinyls @Dream Hi Em Hi Dream", "@bambkb @the_chart_life 💕", "@sharaaau @ibrahim_riyash @jumino28 Love the love here.", "@noah_emeric Right back at you. ❤️", "@porpscito @TheJulibean @TheJulianSierra Hey, hello, hi!", "@AdamKnights04 @MDerrick1992 Hey Matthew!", "@uLessonApp @e_c_stan 💓👋", "@pfornac @JenMsft We'd be lost without them. Hi Jen! 👋", "@PJJ191 @MKBHD We all appreciate @MKBHD.", "@___holo @fereeeeeeeeee @krystalmaths 🥰 hi.", "@FaimiFai @BTS_twt Hi @BTS_twt! 💜", "@Jeyshalee_ 👏 Hi Jasmine!"]}