{"tweets": "Tune in for a briefing with Press Secretary Jen Psaki, Cecilia Rouse, and Heather Boushey. https://t.co/6Y27s5Mt3Y RT @VP: Last month I spoke with Astronauts Dr. Shannon Walker and Dr. Kate Rubins aboard the International Space Station. They are setting… RT @WHCOVIDResponse: In total, 84 million people -- about 1 in 3 adults -- have received at least one dose of the vaccine and more than 45… RT @WHCOVIDResponse: Our team is partnering with @usedgov for the National Safe School Reopening Summit.\n\n@CDCDirector will share best prac… “When I ran for president, I promised to build on the foundation of the Affordable Care Act. And just 50 days into my Administration, we delivered on that promise with the American Rescue Plan. Help is here.” — President Biden marking the anniversary of the Affordable Care Act https://t.co/7QtDqziPIS Big news: President Biden just announced we’re extending the special enrollment period for health insurance until August 15. Head to https://t.co/Z1ZSzQNxNn to get covered. Overall, the American Rescue Plan is expanding coverage and lowering costs for countless Americans — giving people the peace of mind that comes with access to quality, affordable care. It gives states the opportunity to extend coverage for a year to low-income women who have recently given birth, as well as cover community-based crisis intervention services for people experiencing a behavioral health crisis with additional Medicaid funding. The bill incentivizes states to expand coverage to an additional 4 million people with low incomes. It provides additional Medicaid funding to states to help strengthen their home and community-based services programs, which will help older adults and people with disabilities get the care they need in their homes during this critical time. The bill establishes more generous tax credits to the nearly 9 million Americans receiving financial assistance to purchase Marketplace coverage. The American Rescue Plan ensures no one will pay more than 8.5% of their income on their premium. For example, a family of four making $90,000 will see their premiums decrease by $200/ month. President Biden believes every single American deserves access to quality, affordable health care. Here’s a breakdown of how the American Rescue Plan helps make that a reality: Tune in as President Biden delivers remarks on the anniversary of the Affordable Care Act being signed into law. https://t.co/Do8SRE2bjR Tune in as President Biden delivers remarks on the shooting in Boulder, Colorado. https://t.co/ZsZlTX8FJh Big news: The Biden-Harris Administration set a new record this weekend with 6 million shots reported administered. We’re ramping up vaccination efforts every day to get America vaccinated quickly and equitably. Tune in for a briefing with Press Secretary Jen Psaki. https://t.co/OGs03VmiD9 RT @WHCOVIDResponse: Over the weekend we set a new record with 6 million shots reported administered across the country. We’ve now got 81 m… President Biden’s American Rescue Plan is delivering direct relief to the American people, rescuing the American economy, and starting to beat the virus. Learn more: https://t.co/gebK83Hcu2 Spring is in the air at the White House. https://t.co/AFsDJw1taP Before President Biden took office, the U.S. was administering an average of 900,000 COVID-19 vaccine doses a day.\n\nLast week, we averaged 2.5 million per day. https://t.co/fpDreVmwSn Spring is an eternal symbol of renewal and rebirth, with light and hope filling the hearts of people around the world—that’s the message and the joy of Nowruz that we're honoring with a Haft-Sin table in the White House.\n\nFrom President Biden and our Administration, happy Nowruz! https://t.co/xGu7OroLrY Jocelyn is a hardworking mother, grandmother, and wife — and like many Americans, the pandemic has greatly impacted her family. This week, President Biden gave her a call to discuss how the American Rescue Plan is here to help. https://t.co/OSSYEmY50M Today, President Biden and Vice President Harris met with Asian American leaders in Atlanta to discuss Tuesday’s attacks and the ongoing violence against the community. Our Administration is committed to building a future where everyone can live with safety, dignity, and respect. https://t.co/IEdz4aJiXY “We have to speak out. We have to act.” — President Biden on the rise in violence against Asian Americans https://t.co/EwPUl7UM24 Tune in as President Biden delivers remarks from Atlanta, Georgia. https://t.co/kM81qtjrDK Today, President Biden urged Congress to swiftly pass the COVID-19 Hate Crimes Act. The law will expedite the government’s response to the rise of hate crimes exacerbated during the pandemic. https://t.co/VdvXRcIR04 Big News: President Biden announced that tomorrow, our Administration will hit 100 million COVID-19 shots administered. \n\nThat’s after just 58 days in office — and 42 days ahead of schedule. Altogether, the American Rescue Plan provides over $40 billion in relief to help Americans keep a roof over their head during the pandemic. Help is here. It provides help for rural communities with $100 million in rental assistance through the USDA — and $39 million for USDA Section 502 and 504 home loans to help low and very-low income borrowers purchase, repair, and rehabilitate housing in rural areas. The bill includes $750 million in support for Native Americans and Native Hawaiians to help reduce housing-related health risks during the pandemic. It provides $5 billion for emergency housing vouchers for people experiencing or at risk of homelessness — as well as $5 billion for the HOME Investment Partnerships Program to help create housing and services for people experiencing or at risk of homelessness. The bill includes $10 billion to help homeowners behind on their mortgage and utility payments — helping avoid foreclosures. The American Rescue Plan provides more than $21.5 billion in emergency rental assistance to help millions of families keep up on their rent and remain in their homes. Across the country, millions of Americans are struggling to keep a roof over their head. Here’s a breakdown of how the American Rescue Plan will help: Tune in as President Biden delivers remarks on the state of vaccinations. https://t.co/nQeEKk8uk3 Tune in for a briefing with Press Secretary Jen Psaki and Secretary of Housing and Urban Development Marcia L. Fudge. https://t.co/GhansX94m1 Our Administration is working hard to put shots in arms and money in pockets of the American people. Help is here. https://t.co/Tx6Qfd26iD Tonight, the White House was illuminated green to celebrate St. Patrick’s Day and the rich bond between the United States and Ireland. https://t.co/tldvbriMyF Today, Ireland Prime Minister Micheál Martin presented a bowl of shamrocks to President Biden — a tradition that dates back to 1952 with President Truman. Although they were physically apart, the President and the Taoiseach renewed the close friendship between our two nations. https://t.co/lHXdy9pYkX How will the American Rescue Plan help you? Watch as White House Communications Director Kate Bedingfield explains: https://t.co/eKGcg3bqt0 Tune in for a briefing with Press Secretary Jen Psaki and Secretary of Education Miguel Cardona. https://t.co/yojJc3MP9h White House. Green fountain. Happy St. Patrick’s Day! 🍀 https://t.co/udHYr7PAtk Happy St. Patrick’s Day from the Biden-Harris White House! https://t.co/dOVrhKFm5K Altogether, the American Rescue Plan will invest over $60 billion in our small businesses to ensure they have the resources necessary to make it through this pandemic. Our Administration will invest $10 billion in successful state, local, and tribal small business financing programs to help small businesses innovate, create and maintain jobs, and provide the essential goods and services that communities depend on. We’re going to bolster the Paycheck Protection Program with an additional $7.25 billion in funding to support small businesses and non-profits that were previously excluded. The bill provides $28 billion for a new grant program to support hard-hit small restaurants and other food and drinking establishments. The American Rescue Plan allocates $15 billion in flexible grants to help the smallest, most severely impacted businesses persevere through the pandemic. Across the country, millions of small businesses are struggling to keep their doors open. Here’s a breakdown of how the American Rescue Plan will help: The American Rescue Plan is ramping up vaccinations and sending direct payments to 85% of American households — putting shots in arms and money in pockets. https://t.co/6fzm5PXxXi Today, President Biden announced we are days away from 100 million shots in people’s arms and 100 million checks in people’s pockets — delivering on his promise that help is on the way. https://t.co/MdAGNdt7Bh Today, President Biden announced Gene Sperling will oversee the implementation of the American Rescue Plan — ensuring the benefits of the bill go out quickly, equitably, and directly to the American people. https://t.co/BEKAMA4lFs RT @WHCOVIDResponse: Over the weekend, we administered nearly 6 million doses of the COVID-19 vaccine. \n\nToday, for the first time on a Mon… Tune in as President Biden delivers remarks on the implementation of the American Rescue Plan. https://t.co/u03Gg7WobL Tune in for a briefing with Press Secretary Jen Psaki. https://t.co/xuLSKRTJGl Four presidents.\nTwo political parties.\nOne clear message: Get vaccinated when it’s available to you. https://t.co/nXOCsqKOGF President Biden’s American Rescue Plan includes direct checks for 85% of American households. Wondering how much you’ll receive and when you should expect it? Check out our guide: https://t.co/2e3F66YrVk The Biden-Harris Administration has been working around the clock to get America vaccinated. We’ve doubled daily vaccinations, secured enough doses for every American, and opened hundreds of sites across the country. Here’s a breakdown of our progress: https://t.co/q6V8mnZRpK On Thursday, President Biden signed the American Rescue Plan — a historic legislative package that will tackle the crises we face and give hardworking Americans a fighting chance. Help is here. https://t.co/owz7RhpLM0 This week, President Biden stopped by W.S. Jenks &amp; Son — a historic hardware store in Washington, D.C. Check out his visit in the latest weekly conversation: https://t.co/0MAdMTixE2 President Biden’s American Rescue Plan will deliver $1,400 checks to help Americans get through this crisis. Watch as people share how they plan to use theirs: https://t.co/o8DT801fAr This morning, President Biden hosted his first multilateral summit as president. During the meeting with the Quad, the President and leaders of Japan, India, and Australia recommitted to working together to secure a free and open Indo-Pacific region. https://t.co/Fa2d6T9oPS Tune in as President Biden and Vice President Harris deliver remarks on the American Rescue Plan. https://t.co/5NUiFT8Wxu Tune in for a briefing with Press Secretary Jen Psaki and National Security Advisor Jake Sullivan. https://t.co/jR6k3k87Li Tune in as President Biden addresses the nation on the anniversary of the COVID-19 shutdown. https://t.co/EYhEaYRdzN How will the American Rescue Plan impact you? Share your story with us: https://t.co/vzKBKUMUaC Tune in for a briefing with Press Secretary Jen Psaki. https://t.co/RMdbkxxljk Tune in as President Biden signs the American Rescue Plan. https://t.co/ZfpKjSkA8w Congress has officially passed President Biden’s American Rescue Plan. How will this help you and your family? Head to https://t.co/80skBjycjD to learn more. https://t.co/l4LsCA4UGx Today, President Biden announced our Administration will purchase 100 million additional doses of the Johnson &amp; Johnson vaccine. This move will ensure we have more than enough vaccines for every American and prepare our nation for unexpected challenges. https://t.co/Bvgsi7etw9 President Biden’s American Rescue Plan has officially been passed by Congress — and that means $1,400 checks are on the way. https://t.co/dKh2t3uOG3 Tune in as President Biden hosts an event with the CEOs of Johnson &amp; Johnson and Merck. https://t.co/GSrYk9wLqh From $1,400 checks and unemployment relief to vaccines for every American — help is here. https://t.co/R0AYaTbkTV Big news: Congress just passed President Biden’s American Rescue Plan – a historic legislative package that will turn the page on this pandemic, deliver direct relief to Americans, and jumpstart our economy. Tune in for a briefing with Press Secretary Jen Psaki and Ambassador Roberta Jacobson. https://t.co/2JqJd0Ft5a RT @WHCOVIDResponse: We're leading the world in vaccinations.\n\nOn January 20th, the 7-day average was 890,000 shots per day. \n\nToday we're… Last month, W.S. Jenks &amp; Son applied for a Paycheck Protection Program loan during the exclusive two-week window President Biden established for small businesses. Yesterday, the President stopped by to see firsthand how it’s helped them get through these crises. https://t.co/jnI8kbdGWF The American Rescue Plan will help fuel a national vaccination program to quickly and equitably vaccinate America. https://t.co/qKFpHtA5f7 RT @WHNSC: Historic: This is the first meeting of the #Quad at the leader level. @POTUS and this administration are committed to working wi… President Biden is urging Congress to pass the American Rescue Plan and provide financial assistance to prevent homeowners, renters, and small landlords from falling behind on payments. Tune in for a briefing with Press Secretary Jen Psaki and Bharat Ramamurti. https://t.co/xAdfyOP7NL “Let us recommit to the principle that our nation, and the world, is at its best when the possibilities for all of our women and girls are limitless.” — President Biden marking #InternationalWomensDay https://t.co/vxMme0O677 “For our Administration, honoring women means investing in them each and every day.” — President Biden marking #WomensHistoryMonth https://t.co/FYKkQFaSGg Tune in as President Biden, Vice President Harris, and Defense Secretary Austin deliver remarks with two Combatant Commander nominees on International Women’s Day. https://t.co/1xSsQ67Jka Today, President Biden signed two executive orders to establish the White House Gender Policy Council and ensure education free from sexual violence. Learn more: https://t.co/Bnh0o4Oq1z We cannot rebuild our economy until we control the virus. President Biden is urging Congress to pass the American Rescue Plan which will create 100,000 new public health jobs to help vaccinate, test, and beat COVID. RT @CDCgov: #COVID19 vaccines are effective at protecting you from getting sick. Based on what we know, people who have been fully vaccinat… Tune in for a briefing with Press Secretary Jen Psaki, Julissa Reynoso, and Jennifer Klein. https://t.co/cYvTn7E7pq Last week, the Biden-Harris Administration: \n\n- Began administering the single-dose Johnson &amp; Johnson vaccine\n- Secured enough vaccines for every American by the end of May\n- Increased weekly vaccine shipments to 18 million doses\n\nWe’re working hard to quickly vaccinate America. Today, to mark the 56th anniversary of Selma with actions and not just words, President Biden signed an Executive Order to promote voting access and allow all eligible Americans to participate in our democracy. “Let’s remember those who came before us as a bridge to our history so we don’t forget its pain, and as a bridge to our future so we never lose hope.” — President Biden marking the 56th anniversary of Bloody Sunday https://t.co/oVDXFb2jlD Tune in as President Biden delivers remarks on the Senate’s passage of the American Rescue Plan. https://t.co/ldqhB23Wuk Tammy is a health care professional and single mother of four children — and like countless other Americans, she’s struggling to get through this crisis. President Biden called to discuss the American Rescue Plan and how it will provide direct relief to families like hers. https://t.co/lGmTw5fPUO President Biden knows there’s no time to waste. He’s urging the Senate to quickly pass the American Rescue Plan to provide Americans the direct relief they need. https://t.co/sHMo5cZtA9 “This moment is unique – and we are mandated by our oath of office to meet this moment.” – Senator @ChrisMurphyCT on the urgent need to pass the American Rescue Plan https://t.co/YlvD0EULQ8 Tune in as President Biden participates in a roundtable on the American Rescue Plan. https://t.co/KsfOjREF3p Tune in for a briefing with @PressSec Jen Psaki. https://t.co/8PUUfvFJHF Today’s jobs report shows welcome growth, but there is a long road ahead. If job growth continues at February’s pace, it will take more than two years just to get back to pre-pandemic levels. \n\nCheck out this thread for a full picture on today’s numbers: https://t.co/bXrCHmkdpO Today's report shows the economy added 379,000 jobs in February. It’s welcome growth, but we remain down 9.5 million jobs from pre-pandemic levels. \n\nIt's time for the Senate to pass the American Rescue Plan to give our economy the jumpstart it needs. https://t.co/WevgXUYqqk President Biden is calling on the Senate to pass the American Rescue Plan and finish the job of delivering $2,000 in direct relief to those who need it. Press Secretary Jen Psaki is back again to answer your questions. This week, she’s discussing everything from our vaccination progress to her favorite part of the job. Check it out: https://t.co/TbIqg9XM3v RT @WHCOVIDResponse: This week, team @OSUWexMed administered some of the first Johnson &amp; Johnson COVID-19 vaccines -- the only single-dose… Tune in for a briefing with Press Secretary Jen Psaki and Secretary of Veterans Affairs Denis McDonough. https://t.co/ksexOf8U4k Because of President Biden’s historic action, we’ll have enough vaccines for every American two months earlier than expected. https://t.co/ktuSIwbaTB A new poll from Morning Consult shows that 77% of Americans support the American Rescue Plan — including 59% of Republican voters. \n \nThat’s unity. In the two weeks since the Biden-Harris Administration opened a special enrollment period for health insurance, over 200,000 Americans have gotten covered. Join them and head to https://t.co/Z1ZSzQNxNn to sign up today. Tune in for a briefing with @PressSec Jen Psaki. https://t.co/uyfCWfSSNC RT @WHCOVIDResponse: WATCH NOW: This morning Dr. Fauci and Dr. Walensky are back for another COVID-19 briefing, joined by response team sen… Our nation is facing two major crises — an economic crisis brought on by a public health crisis. President Biden is calling on the Senate to address both by passing the American Rescue Plan immediately. Across the country, over thirty states have taken steps to prioritize educators for vaccination. Today, President Biden is directing remaining states to do the same — with the goal of every educator receiving at least one shot by the end of March. Today, President Biden announced a breakthrough collaboration between Johnson &amp; Johnson, Merck, and the federal government to ramp up vaccine production. Because of these efforts, we will have enough vaccines for every American by the end of May–two months earlier than expected. Tune in as President Biden announces a new partnership between Johnson &amp; Johnson and Merck and gives an update on our efforts to defeat COVID-19. https://t.co/qOB7tvf7O0 It's time to finally get COVID-19 under control and give families the bridge they need to get through this economic crisis. Here’s how the American Rescue Plan will get it done: https://t.co/Em6MOulirJ RT @WHCOVIDResponse: We've shared with governors that we’re increasing weekly supply of Pfizer and Moderna vaccines to 15.2 million doses p… Tune in for a briefing with @PressSec Jen Psaki. https://t.co/2eiZJvpShh This afternoon, President Biden hosted Mexican President Andrés Manuel López Obrador for a virtual bilateral meeting. Both leaders committed to working together to address migration, combat COVID-19, reinvigorate economic cooperation, and deepen U.S.-Mexico security cooperation. https://t.co/fcBVolo6gb The American Rescue Plan will launch community vaccination centers and deploy mobile vaccination units in hard to reach areas — making sure everyone who wants one has access to vaccines. “In five weeks, America has administered the most shots of any country in the world — any country in the world — with among the highest percentage of population fully vaccinated. That’s progress we promised.” — President Biden while marking 50 million shots since he took office https://t.co/UzfEopKPGN Tune in for a briefing with Press Secretary Jen Psaki and Secretary of Homeland Security Alejandro Mayorkas. https://t.co/dZvroiKm1q RT @WHCOVIDResponse: WATCH: Today, our public health experts are joined by COVID-19 response team coordinator Jeff Zients to talk through a… To celebrate Black History Month, the St. Augustine Gospel Choir was invited to the White House for a special performance. Watch here: https://t.co/dLc6JpWBVo Last week, the Biden-Harris Administration:\n\n- Reached 50 million vaccinations\n- Announced the shipment of 25 million masks\n- Increased weekly vaccine supply to 14.5 million doses\n- Opened vaccination sites across the country\n\nWe’re working hard to beat COVID-19. RT @WHCOVIDResponse: The Food and Drug Administration has issued an emergency use authorization for a third safe and effective vaccine to h… RT @VP: I spoke with @NASA Astronaut and @USNavy Commander Victor J. Glover aboard the International Space Station. @AstroVicGlover is maki… Tune in as President Biden delivers remarks on the American Rescue Plan. https://t.co/EjnSg2zDSD Erica is a nurse in New York City and runs COVID-19 testing at one of the hardest-hit hospitals in the country. President Biden called her to check in and discuss what the federal government can do to help. Take a look: https://t.co/YVVV45EETy Tune in as the President, First Lady, Vice President, and Second Gentleman host a White House Black History Month Celebration. https://t.co/r059eDt4qQ Tonight, the President, First Lady, Vice President, and Second Gentleman are coming together to host a virtual Black History Month Celebration. Make sure to tune in at 8 PM ET to watch. https://t.co/N7w4yKFTkb Tune in as President Biden delivers remarks at the FEMA COVID-19 vaccination facility at NRG Stadium. https://t.co/RbcsLhGvJz Since taking office, the Biden-Harris Administration has:\n\n- Administered over 50 million vaccine shots\n- Nearly doubled the pace of vaccinations\n- Increased distribution to states by 70%\n\nWe’re working hard to get America vaccinated as quickly as possible. .@POTUS spoke with President Kenyatta yesterday and applauded Kenya’s leadership and commitment to democracy, human rights, economic growth, and sustainable development. The U.S.-Kenya relationship is strong and is critical to addressing issues in the Horn of Africa. RT @WHCOVIDResponse: TUNE IN: This morning our public health experts are joined by senior advisor Andy Slavitt to deliver updates on vaccin… The bottom line is American families, workers, states, and schools are struggling and deserve immediate relief. The risk isn’t that we do too much — it’s that we don’t do enough. Countless small businesses across the country are on the brink of closing their doors. The American Rescue Plan will provide grants to struggling businesses — helping them stay open and emerge stronger from this pandemic. The American Rescue Plan will incentivize companies to provide paid sick leave to their employees — because no one should have to choose between their health and a paycheck. The American Rescue Plan will triple the number of community health jobs — helping to contain the virus by scaling tracing capacity and ensuring every American who wants a COVID-19 test will be able to get one. The American Rescue Plan will launch a bold national vaccination program to make vaccines free and accessible for every American, end supply shortages, set up community vaccination sites, and distribute vaccines equitably. The American Rescue Plan will help safely reopen our nation’s K-8 schools by reducing class sizes and modifying spaces to create safe learning environments. It’ll provide the resources needed to get children back in school and parents back to work. The American Rescue Plan will provide a much-needed emergency financial boost for parents. That means if you’re a parent with a kid over six you’ll get an additional $1,000. If your kid is under six, you’ll get an additional $1,600. Across the country, millions of Americans are struggling to keep a roof over their head. The American Rescue Plan will provide $40 billion in housing assistance to ensure no one loses their home in the middle of this pandemic. Right now, over 10 million children don’t have enough to eat. The American Rescue Plan will supplement existing food programs like SNAP to help ensure no child in America goes hungry. If Congress fails to act, more than 11 million people will start to lose unemployment insurance benefits on March 14. The American Rescue Plan will extend and expand unemployment insurance and provide a weekly $400 supplement. 1 in 3 households are struggling to pay for usual household expenses through no fault of their own. The American Rescue Plan will complete the $2,000 stimulus checks with direct $1,400 payments — delivering much-needed relief to people across the country. President Biden’s American Rescue Plan is a bold, comprehensive legislative package that will provide direct relief to Americans, contain COVID-19, and rescue the economy. Check out the thread below for a breakdown of what’s in the bill. RT @SecMayorkas: Sixty years ago, my parents brought my sister and me to the United States to build a new home for our family. Today, I am… Tune in as President Biden delivers remarks on America administering its 50 millionth COVID-19 vaccine shot since he took office. https://t.co/jc5vHqb4Lp Right now in America, around 10 million children live in poverty. Watch as Deputy Director of the NEC Bharat Ramamurti explains how the American Rescue Plan will cut that number in half: https://t.co/IUVFpEkXc8 Tune in for a briefing with @PressSec Jen Psaki. https://t.co/nRYc1jKTnE Yesterday, @POTUS and @AmbRice46 hosted a virtual roundtable to listen to the experiences of Black essential workers during the pandemic. Watch here as Jeff Carter shares his story: https://t.co/bgQeve8aju On Friday, President Biden toured a Pfizer manufacturing plant in Michigan to see the vaccine production process firsthand and encourage Americans to get vaccinated when it’s their turn. Take a look: https://t.co/JZeCebn9ZC Big news: The Biden-Harris Administration is delivering more than 25 million masks to community health centers, food pantries, and soup kitchens across the country — reaching some of the nation’s most vulnerable populations. https://t.co/hkGHnJmCPr Tune in as President Biden signs an executive order to secure America’s critical supply chains. https://t.co/G9G2EtGbHz How it started.            How it’s going. https://t.co/3zYLLt4a1X Tune in for a briefing with Press Secretary Jen Psaki, Deputy Director of the NEC Sameera Fazili, and Senior Director for International Economics and Competitiveness Peter Harrell. https://t.co/ScD2izNnNr RT @WHCOVIDResponse: WATCH: Jeff Zients will share an update on our public health and vaccination efforts followed by a state of the pandem… Starting today, the Biden-Harris Administration is opening an exclusive 14-day PPP loan application period for companies and nonprofits with fewer than 20 employees. Head to https://t.co/slFWiCx2W0 to learn more. https://t.co/zVzm0xNn1q Tune in as President Biden and Prime Minister Trudeau give statements on their first bilateral meeting. https://t.co/Nd4v6LsfNt RT @WHCOVIDResponse: This afternoon, we announced that we’re increasing the weekly vaccine supply to states to 14.5 million doses starting… Tune in for a roundtable discussion with President Biden, Domestic Policy Advisor @AmbRice46, and Black essential workers. https://t.co/1dBDBwSGTL Tune in for a briefing with @PressSec Jen Psaki. https://t.co/tfFaxHO5JW Watch as @CDCDirector Dr. Walensky answers some of today’s most pressing questions on COVID-19. https://t.co/NYEeA5bQND “Today, I ask all Americans to remember — remember those we lost and those who are left behind.” — President Biden on the more than 500,000 lives lost to COVID-19 https://t.co/KtABRcpLHH Tune in as President Biden delivers remarks and observes a moment of silence for the lives lost to COVID-19. https://t.co/5oNg5jahuS RT @WHCOVIDResponse: WATCH NOW: Today’s COVID-19 briefing features a science update from Dr. Fauci, a state of the pandemic update from Dr.… The Biden-Harris Administration has made delivering equitable relief to the hardest-hit small businesses a top priority. Today, we’re announcing additional steps to help small businesses survive, reopen, and rebuild. https://t.co/ZThQ1CpgI9 Tune in for a briefing with @PressSec Jen Psaki. https://t.co/I0BLp4ZLAd Tune in as President Biden makes an announcement related to small businesses. https://t.co/tMxf2r8ybi “If there’s one message to cut through to everyone in this country, it’s this: The vaccines are safe.” — President Biden after touring a Pfizer manufacturing site on Friday https://t.co/U3y2WAP3fO ICYMI: A special enrollment period for health insurance is open through May 15! Head to https://t.co/Z1ZSzQNxNn and get covered today. https://t.co/FscOAqpB58 Today marks one month since President Biden and Vice President Harris took office. And during that month they’ve worked tirelessly to turn the page on the pandemic, jumpstart our economy, and tackle the crises we face. https://t.co/0QL3axgXFK Yesterday, President Biden took additional action to support Texas’ recovery by approving a disaster declaration — making federal funding available to affected individuals in counties across the state. https://t.co/1wAM0cVLIV RT @WHCOVIDResponse: Every single day, we are working to increase vaccine supply, increase places to get vaccinated, and increase the numbe… On Thursday, the Perseverance Rover landed on the surface of Mars — a historic moment in United States space exploration. President Biden called acting @NASA Administrator Steve Jurczyk to congratulate him and the team on their successful landing. https://t.co/ZUMahvYBeq 53 million people provide unpaid care to family members and most also have full-time jobs — yet the vast majority don’t have access to paid family and medical leave. We need to support caregiving and our caregivers. We need national paid family and medical leave. #CaregiversDay You asked, and President Biden answered. Watch as he discusses stimulus checks, vaccine production, and more. https://t.co/AODx7y8rUZ Tune in as President Biden delivers remarks at a Pfizer manufacturing site in Kalamazoo, Michigan. https://t.co/U1CxlTDM55 RT @WHCOVIDResponse: President Biden joined members of this team to talk frankly about how we change the course of this pandemic and answer… President Biden took action on his first day in office to rejoin the Paris Climate Agreement. Today, it officially goes into effect. https://t.co/OXR9HpuGZq RT @WHCOVIDResponse: WATCH NOW: Dr. Fauci is providing an update on vaccine science, Dr. Walensky is sharing the state of the pandemic, and… Tune in as President Biden delivers remarks at a special event hosted by the Munich Security Conference. https://t.co/yRIO0v7wGo Texas — Carbon monoxide poisoning is a major risk. If you’re struggling to stay warm, please do not:\n\n- Run generators indoors\n- Use gas appliances like stoves for heat\n- Sit in your car in the garage to stay warm\n\nVisit https://t.co/5WhFEK6B8u to find a warming shelter near you. Texas — If you’re without heat, head to https://t.co/5WhFEK6B8u to find a warming shelter near you or call 211 for additional assistance. Yesterday, President Biden approved the Oklahoma Emergency Declaration and ordered the federal government to provide state, tribal, and local governments the support they need.  https://t.co/oxYNCjmSmw Tune in for a briefing with @PressSec Jen Psaki. https://t.co/Aa2IKvnEqA In response to the ongoing situation in Texas, the President approved FEMA to send generators, diesel, blankets, and water to affected areas. We continue to monitor the region closely and are prepared to quickly process additional requests for assistance. https://t.co/jgKGoFcD7S As part of his National Strategy for the COVID-19 Response and Pandemic Preparedness, President Biden announced today a series of new actions to expand COVID-19 testing, improve the availability of tests, and better prepare for the threat of variants. https://t.co/EsRUAUvIx7 Right now, as many as 11 million children don’t have enough food to eat. The American Rescue Plan will help change that by extending and investing in critical food programs. https://t.co/WkMe1Se8wh RT @ENERGY: Extreme cold weather has left millions without power in Texas and surrounding areas. Watch @DOEelectricity’s Acting Assistant S… RT @WHCOVIDResponse: Our 7-day daily average of 1.7 million doses administered compares to an average of 892k the week before President Bid… Tune in for a briefing with Press Secretary Jen Psaki and Deputy National Security Advisor for Cyber and Emerging Technology Anne Neuberger. https://t.co/oEoaqbJ8tN The Biden-Harris Administration opened a special enrollment period to ensure every American has the opportunity to sign up for health insurance. Head to https://t.co/Z1ZSzQNxNn to find the plan that works best for you. https://t.co/Pfy8dsW1Yv RT @WHCOVIDResponse: WATCH NOW: Dr. Fauci, Dr. Nunez-Smith and Dr. Walensky are joined this morning by COVID-19 Response Team coordinator J… Tonight, President Biden will answer Americans’ questions at a CNN Town Hall. Tune in at 9 PM ET / 8 PM CT to watch live. https://t.co/AVEHcuKDn7 Big news: The Biden-Harris Administration is now sending 13.5 million vaccine doses to states each week — a 57% increase since President Biden took office. And starting this week, we’re doubling our direct shipments to local pharmacies to two million doses. We’re live on @Snapchat! Follow us for a look into what’s happening at the White House and updates on the work we’re doing.\n \nFind us on Snapchat by adding \"WhiteHouse\" as a friend or scanning the snapcode below: https://t.co/GOc6D2z31Q Press Secretary Jen Psaki is back for round two. Watch as she answers your questions on everything from the American Rescue Plan to pineapple on pizza: https://t.co/mGoKhCa7LU As millions of Americans struggle to make rent and mortgage payments, President Biden is continuing to take action to keep people in their homes. Today’s extension of forbearance and foreclosure protections will provide homeowners urgently needed relief. https://t.co/dZEgN6Q97e Over the weekend, President Biden approved the Texas Emergency Declaration and is working closely with state and local governments to provide the support they need.  https://t.co/QDUQkn7PU1 RT @WHCOVIDResponse: Weekly vaccine doses delivered to states when President Biden first took office: 8.6 million doses\n\nWeekly vaccine dos… Tune in for a briefing with @PressSec Jen Psaki. https://t.co/H0F9yqwTLl Watch as White House Senior Advisor @Richmond46 discusses racial equity and the American Rescue Plan. https://t.co/1oOl10jnPS Open enrollment is back! Starting today and running through May 15, the Biden-Harris Administration is opening a special health insurance enrollment period to ensure every American has the opportunity to get covered. Head to https://t.co/Z1ZSzQNxNn and sign up today. “The American story isn’t a story of presidents, it’s a story of the American people — a story of courage, character, strength, and resilience.” — President Biden’s message on this Presidents’ Day https://t.co/VbmEO7u2ns Last week, our Administration:\n\n- Purchased enough vaccines for all Americans\n- Launched a Health Equity Task Force\n- Increased weekly vaccine shipments\n- Announced a community health center vaccination program\n\nWe’re committed to vaccinating America quickly and equitably. Countless small businesses across the country are struggling because of COVID-19 — businesses like NaanStop in Atlanta, Georgia. President Biden called owners Samir and Neal to discuss how his American Rescue Plan will help them get through the pandemic. https://t.co/xXyPBQMGak Today, the Centers for Disease Control and Prevention released new scientific guidelines on how to safely reopen America’s schools.\n\nRead President Biden’s full statement on the news: https://t.co/ofTfV3zygh The Biden-Harris Administration is working with state and local partners across the country to scale up vaccination efforts and get more shots into arms. This week, President Biden and Vice President Harris virtually toured one of those partnership sites in Arizona. Take a look: https://t.co/oWImhubNEY Tune in for a briefing with Press Secretary Jen Psaki, Detroit Mayor Mike Duggan, and Miami Mayor Francis Suarez. https://t.co/qlu3oYCiZz Across the country, 1 in 3 households are struggling to pay for usual household expenses. President Biden’s American Rescue Plan will finish the job of delivering $2,000 in direct relief and extend and expand unemployment insurance — helping those who are struggling the most. https://t.co/BmPWCjN8XM We don’t have to wait until 2025 to return to full employment. If passed, the American Rescue Plan will get the job done next year. https://t.co/QyP2xVtfcF 1 in 6 children in the United States live in poverty. If passed, the American Rescue Plan will expand the child tax credit and cut the child poverty rate in half. https://t.co/firxhvvUky Tune in as President Biden delivers remarks to National Institutes of Health staff. https://t.co/Exv4n1fwbP How will the American Rescue Plan help vaccinate more Americans? Watch as Dr. Dara Kass explains: https://t.co/swhYpGcbbq Tune in for a briefing with @PressSec Jen Psaki. https://t.co/fQ1nY5gi8y “I’ve said for many years, less than one percent of Americans do what you do: put yourself on the line for the rest of the 99 percent of the Americans you represent. The 99 percent of us owe you.” — President Biden addresses Department of Defense personnel https://t.co/7HkP10QX9C President Biden believes now is the time for big, bold action. He’s calling on Congress to pass the American Rescue Plan to change the course of the pandemic and jumpstart our economy. https://t.co/vJ13DioTni RT @WHCOVIDResponse: The @VP set a blueprint for equity in our pandemic response during her time in the Senate and today, that vision for a… Tune in as @POTUS, @VP, and @SecDef deliver remarks to Department of Defense personnel. https://t.co/D9e4yVEIM8 What is the American Rescue Plan and how will it help you and your family? Watch to find out: https://t.co/T0FKlg1aF6 Tune in as President Biden delivers remarks on the Administration’s response to the coup in Burma. https://t.co/Kn5j3KFegL Tune in for a briefing with @PressSec Jen Psaki. https://t.co/KA8IRaNyMH RT @WHCOVIDResponse: WATCH NOW: At this morning's briefing we'll hear from Jeff Zients and Dr. Nunez-Smith on our progress, as well as get… Across the country, millions of Americans are struggling to keep a roof over their head. The American Rescue Plan will extend the moratorium on evictions and foreclosures to ensure no one loses their home in the middle of this pandemic. https://t.co/Ijz6t8pKVU 1 in 7 households are struggling to purchase the food they need. The American Rescue Plan will extend and invest in critical food programs to help ensure no one in America goes hungry. https://t.co/tOx4jq6SQX Unity. https://t.co/cqF8ilyMBC Tune in for a briefing with @PressSec Jen Psaki. https://t.co/hH8EcpslmM RT @WHCOVIDResponse: WATCH: Dr. Marcella Nunez-Smith, chair of the COVID-19 Health Equity Task Force, and Jeff Zients, coordinator for the… Current vaccination efforts are not working fast enough. The American Rescue Plan will mount a national vaccination program to quickly and equitably vaccinate America. https://t.co/Inen2jaZjN The American Rescue Plan will ensure every American who wants a vaccine can get one free of charge. https://t.co/jalGIA0Hup Tune in as President Biden and Vice President Harris virtually tour a vaccination site in Glendale, Arizona. https://t.co/QK3Z1FFyYx The American Rescue Plan includes a historic investment in the public health workforce, funding 100,000 public health workers that will help contain the virus and vaccinate America. https://t.co/XNwTNyzb6I Tune in for a briefing with @PressSec Jen Psaki. https://t.co/a5aVjnZa5V RT @WHCOVIDResponse: WATCH: Our public health experts are giving an update on the science behind vaccines, the state of the pandemic, and n… “As mayors, we’re on the ground with our constituents every day and see firsthand how horrific our situation is. Our people need help.”\n\nTwo Florida mayors share why they want Congress to immediately pass President Biden’s American Rescue Plan: https://t.co/gksgTeG77H Your actions can save lives. https://t.co/GR1az2SjtE When President Biden thinks about climate change, he thinks about good-paying, union jobs.\n\nWhite House National Climate Advisor @Gina_McCarthy breaks down how we’ll tackle the climate crisis and create jobs in the process: https://t.co/s3UGP5F5cs ICYMI: This week, a bipartisan group of over 400 Mayors called on Congress to pass President Biden’s American Rescue Plan. https://t.co/xTy2PO1SFn Millions of Americans like Michele have been laid off due to COVID and are in need of direct relief. She wrote a letter to President Biden to share her story. He called to check in. https://t.co/mBuhmWltml After a busy week, President Biden departed Washington, D.C. on Air Force One for the first time as president. https://t.co/kWUPGekLIe Tune in for a briefing with @PressSec Jen Psaki and Council of Economic Advisers Member @econjared46. https://t.co/Z9BnaFOlju Today’s jobs report is yet another reminder of the need for urgent action. The American Rescue Plan will control the virus, get vaccine shots in arms, and finally launch a robust, equitable and racially inclusive recovery. https://t.co/KXZYvJyq8c The crises we face don’t only affect Democrats or Republicans, they impact us all — and we need a comprehensive plan to solve them. That’s why Americans across the aisle are coming together to support President Biden’s American Rescue Plan. https://t.co/a12XqP3IXa The Biden-Harris Administration is committed to working with the African Union to advance our shared vision of a better future.\n\nWatch President Biden’s Message to African Union Summit Participants: https://t.co/tXFX4Tp9PD Wondering about Dr. Fauci’s morning routine or how we can vaccinate 100 million people in 100 days? Watch to find out: https://t.co/P7rcsEa8FQ As we mark #BlackHistoryMonth, tune in for a conversation with White House Senior Advisor @Richmond46 and @BlackPressUSA on today’s most pressing issues. https://t.co/69VeJ6nK3H No one should have to worry about keeping a roof over their head. President Biden is urging Congress to pass the American Rescue Plan to extend the moratorium on foreclosures and evictions for countless Americans. https://t.co/hh48v3vK62 Tune in for a briefing with @PressSec Jen Psaki. https://t.co/6qIKax2npi RT @WHCOVIDResponse: 8% of the U.S. population has received at least one dose of the COVID-19 vaccine, up 2 percentage points from last wee… Let’s be clear: Working families need more than the $600 that Congress passed in December. The American Rescue Plan will finish the job of delivering $2,000 in direct relief to those who need it most. https://t.co/VrbY8lT2qC Across the nation, one in five renters and one in ten homeowners are behind on payments. That’s why President Biden is calling on Congress to pass the American Rescue Plan and ensure that families hit hard by the economic crisis won’t face eviction. Across the country, millions of Americans are out of work through no fault of their own. The American Rescue Plan will help them get through these crises by providing an additional $400 a week. https://t.co/q8c7iNLWeA RT @WHCOVIDResponse: If you're enjoying our COVID-19 briefings, here's a chance to ask our experts your own questions directly! Tomorrow, D… Tune in for a briefing with @PressSec Jen Psaki. https://t.co/Gkig6IvvXj Our strategy in response to this pandemic-induced economic crisis is centered around the belief that the costs of inaction are far higher than the costs of acting too aggressively.\n\nRead more about the economics of the American Rescue Plan: https://t.co/gzkV6IQtnQ RT @WHCOVIDResponse: WATCH NOW: Dr. Fauci, and @CDCDirector Dr. Walensky deliver updates our progress fighting COVID-19. https://t.co/eeMBx… President Biden believes the scale of our response needs to reflect the severity of the crises we’re facing as a nation. The American Rescue Plan is needed to change the course of the pandemic and start our economic recovery. Our Administration is committed to addressing the awful harms that were inflicted on families coming to America seeking safety. Today, President Biden formed a Family Reunification Task Force to reunite families and ensure such tragedies never occur again. https://t.co/8HD69GNBzi President Biden has wasted no time working to rebuild and strengthen our immigration system. https://t.co/j8XmUAtjUL America is a nation of immigrants and Indigenous peoples — and we are stronger because of it. https://t.co/IgTtaQ0WzS It’s been less than two weeks since President Biden took office, but he has wasted no time taking historic action and delivering on his promises to the American people. https://t.co/aQjGzFWQ1z President Biden believes our country is safer, stronger, and more prosperous when we welcome immigrants. This afternoon, he’ll build on previous actions and take steps to rebuild and strengthen our immigration system. https://t.co/w9JjkuCKnA We join the United Kingdom and the world in honoring the memory of Captain Sir Tom Moore, who inspired millions through his life and his actions. https://t.co/b2zUsZkHo3 Tune in for a briefing with @PressSec Jen Psaki. https://t.co/fowKj1L5Vh RT @WHCOVIDResponse: WATCH: Jeff Zients, COVID-19 Response Team coordinator is giving updates on steps we’re taking today to enact Presiden… Remember to:\n\n- Wear a mask\n- Wash your hands\n- Practice social distancing\n\nYour actions can save lives and change the course of this pandemic. RT @VP: As Black History Month begins today, we remember and honor those who have come before, and we work to build a brighter future for a… From big cities to rural America, too many Americans are barely scraping by, or not scraping by at all. That’s why President Biden is calling on Congress to pass the American Rescue Plan and deliver immediate, direct relief to Americans bearing the brunt of this crisis. We cannot rescue our economy without containing this virus. President Biden’s American Rescue Plan will take immediate action to change the course of this pandemic and build a bridge toward economic recovery. Tune in for a briefing with @PressSec Jen Psaki. https://t.co/WdPuSmDzYX We are committed to reopening the majority of America’s schools in the first 100 days. The American Rescue Plan provides the necessary funding to meet that goal and ensure our nation’s schools can reopen and operate safely. President Biden is committed to getting America vaccinated as quickly as possible. His American Rescue Plan will mount a national vaccination program to quickly and equitably vaccinate the vast majority of the U.S. population. President Biden is calling on Congress to immediately pass his American Rescue Plan and finish the job of getting $2,000 in direct relief to those who need it most. He’s committed to ensuring hardworking Americans get the relief they need. Marine One departs the White House South Lawn as President Biden takes his first trip to Walter Reed on Friday afternoon. https://t.co/gXYS3sPy2e We are in the midst of an economic crisis, and the millions of Americans out of work are relying on unemployment insurance to make it through. The American Rescue Plan will extend and expand unemployment insurance benefits so American workers can pay their bills. Climate change is an intersectional issue. Watch National Climate Advisor @Gina_McCarthy explain why: https://t.co/ZJ3LR0CWg5 The Cabinet is coming together. https://t.co/qZlqBOsvfp From COVID-19 and the economy to climate change and racial equity — President Biden has wasted no time tackling the toughest challenges we face as a nation. RT @VP: Get vaccinated. Save lives. https://t.co/5ZNXerlmIJ RT @WHCOVIDResponse: Tune in now for a COVID-19 briefing with Dr. Fauci and @CDCDirector Dr. Walensky. They're updating us on the latest sc… Tune in for a briefing with @PressSec Jen Psaki. https://t.co/kb1cnMrQgx We’re in the midst of a global pandemic, and access to health care is more important than ever. Today’s actions by President Biden will help ensure everyone receives the care they need. https://t.co/Lvl4OIOUf7 Yesterday, President Biden took historic action to combat the climate crisis. Watch Deputy National Climate Advisor @alizaidi46 break things down: https://t.co/q2pAtWbQrG Today, President Biden furthered his commitment to protecting women’s health care by issuing a Presidential Memorandum. The memorandum immediately rescinds the global gag rule and takes steps to protect and expand access to reproductive health care. https://t.co/vmJfg4ywkY Tune in for a briefing with @PressSec Jen Psaki. https://t.co/wP3xGtAexO Today, President Biden will take action to strengthen Americans’ access to quality, affordable health care. The Biden-Harris Administration is committed to ensuring every American has access to the care they need. https://t.co/Q4NTiZx9fi Because of the action President Biden took today, every federal infrastructure investment will reduce climate pollution and clean energy projects will be accelerated — creating countless jobs in the process. https://t.co/Sd8zzlb5cs To combat the climate crisis and power a clean energy revolution, President Biden will:\n\n- Tap into the power of American workers\n- Conserve and leverage our natural resources\n- Create good-paying, union jobs\n- Deliver environmental justice Yesterday, President Biden announced big news: the United States will have enough COVID-19 vaccines for 300 million Americans by the end of summer. RT @nowthisnews: JOHN KERRY ON CLIMATE: In his first interview since President Biden's recent executive actions, @ClimateEnvoy @JohnKerry t… Tune in as President Biden delivers remarks and takes action to combat the climate crisis, create good-paying union jobs, and restore scientific integrity. https://t.co/4xnilrbgSl Tune in for a briefing with Press Secretary Jen Psaki, Special Presidential @ClimateEnvoy John Kerry, and National Climate Advisor @Gina_McCarthy. https://t.co/K9ulTy1XTc RT @WHCOVIDResponse: Tune in as the COVID-19 Response Team hosts the first of regular briefings featuring our public health experts: Dr. An… We’re in the midst of a climate emergency, and President Biden knows we have no time to lose. Today, he’s taking action to address the climate crisis, create good-paying union jobs, and build an equitable clean energy future. https://t.co/IhdZMfh2uo Last week, President Biden announced a whole-of-government initiative to address racial equity and support underserved communities. Today’s executive actions build on that announcement.\n\nOur Administration is committed to tackling these issues head-on. Readout of President Biden’s call with NATO Secretary General @JensStoltenberg. https://t.co/fZrp1BKEmz Tune in as President Biden delivers remarks on the fight to contain the COVID-19 pandemic. https://t.co/19L8jb17Gu Today, President Biden signed executive actions that provide a down payment on advancing racial equity. https://t.co/i6KYrkoksf Tune in as President Biden delivers remarks and signs executive actions to advance racial equity. https://t.co/zxKk9ycnzi Tune in for a briefing with @PressSec Jen Psaki and Domestic Policy Advisor @AmbassadorRice. https://t.co/r2MXiv1FoZ RT @WHCOVIDResponse: This afternoon, President Biden will deliver remarks on our COVID-19 fight and how we’re working to change the course… Today, President Biden will take bold action to advance racial equity and support communities of color and other underserved communities. President Biden’s action today will deliver relief for American businesses and make investments in manufacturing and technology. Our Administration is committed to giving American workers and companies the tools they need to compete for decades to come. https://t.co/BOS2I72oV8 Because of the action President Biden took today, Shawn Skelly and countless other transgender service members will be able to serve our nation openly and free from discrimination. https://t.co/miSHxQrbXK #BuildBarkBetter https://t.co/qL7aILjHEH Today, President Biden took bold action to support American businesses, invest in the future of American industry, and support American workers. https://t.co/Kw8BzdxLEr Tune in as President Biden delivers remarks on his plans to strengthen American manufacturing and signs the Buy American Executive Order. https://t.co/tb74k1srWi Tune in for a briefing with @PressSec Jen Psaki. https://t.co/dbxU3SVctI President Biden fulfilled another crucial pledge, repealing the transgender military ban to ensure everyone who’s qualified to serve in the military can do so openly and free from discrimination. https://t.co/b24PHI9OII RT @WHCOVIDResponse: Hear directly from the experts of our COVID-19 team on Wednesday at 8pm on CNN as Dr. Anthony Fauci, CDC Director Roch… Today, President Biden will take action to support American businesses on the brink of closure and ensure that our future is made in America by all of America’s workers. In order to reduce the spread of COVID-19, President Biden is taking action by establishing a Pandemic Testing Board, increasing treatment and testing, and protecting public health workers. https://t.co/S1sVPLqXda From our plans to deliver economic relief to an update on the First Cat — watch as White House @PressSec Jen Psaki answers your questions. https://t.co/uA5hzBMehC To get this virus under control, President Biden has launched a COVID-19 National Action Plan — an aggressive, coordinated, equitable, and professional response to the pandemic. President Biden recognizes far too many Americans are hurting during this pandemic through no fault of their own. This week, the President directed his Cabinet to do everything in their power to provide direct economic relief to those bearing the brunt of this crisis. Please wear a mask. https://t.co/aAqlmJP5RT We are currently facing four converging crises — COVID-19, the resulting economic crisis, climate change, and racial inequity. This week, President Biden took swift action to combat these challenges. We are facing an economic crisis, brought on by a public health crisis, and today our Administration took action to provide relief to those who are struggling most. Today, @POTUS signed an executive order to protect and empower federal employees, who are essential to our country. The action: \n\n- Restores collective bargaining power and worker protections \n- Eliminates Schedule F\n- Promotes a $15 minimum wage We’re facing an economic crisis brought on by a public health crisis. And today, the Biden-Harris Administration took bold action to provide relief to help those who are struggling most. https://t.co/GCicFGDk3V Tune in as President Biden delivers an update on the Administration’s response to the economic crisis. https://t.co/5FJWCHcsWU Tune in for a briefing with Press Secretary Jen Psaki and National Economic Council Director Brian Deese. https://t.co/6PGCAIt0C8 Today, President Biden is taking bold action to provide critical support to struggling communities and small businesses impacted by COVID-19. https://t.co/xLWzJuyWzU President Biden will ensure equity throughout the vaccination distribution process by protecting the most at risk, increasing availability in hard-hit communities, eliminating out-of-pocket costs, and establishing the COVID-19 Health Equity Task Force. Yesterday, President Biden reversed the United States’ withdrawal from the World Health Organization. And this morning, Dr. Fauci joined his first meeting as the head of our delegation. Here’s what he said: https://t.co/yvv2ojcfXh Today, the Biden-Harris Administration took swift action — grounded in science — to get the COVID-19 pandemic under control. https://t.co/N9ejHSQR9R Our goal is 100 million shots administered in our first 100 days. Here is how we plan to get it done. https://t.co/9H8dilhSxp Today’s executive actions represent our Administration’s effort to aggressively change the course of COVID-19 by expanding testing, vaccinating more people, protecting those most at risk, and addressing racial and other disparities in COVID impact and care. https://t.co/AgWtxAyFhO Tune in for a briefing with Press Secretary Jen Psaki and Dr. Fauci. https://t.co/4GspJEUusY President Biden signed several executive orders to contain COVID-19 by expanding testing, administering vaccines, advancing an equitable response, and safely reopening schools and businesses. Follow @WHCOVIDResponse for the latest updates on the Biden-Harris Administration’s efforts to contain COVID-19. https://t.co/uqVhTSQRc1 Tune in as President Biden provides an update on the Administration’s COVID-19 response. https://t.co/xFHzMcVRti We are currently facing four converging crises — COVID-19, the resulting economic crisis, climate change, and racial inequity. Today, President Biden took actions to combat these challenges. https://t.co/091jmvCukk Today, @POTUS issued a mask mandate on federal property, launching his “100 Day Masking Challenge” as part of our efforts to flatten the COVID-19 curve. https://t.co/NLGr6JHB0h Today, President Biden rejoined the Paris Agreement on Climate Change. https://t.co/V4fVV2i2jZ Tune in for the first press briefing of the Biden-Harris Administration with Press Secretary Jen Psaki. https://t.co/psa19eCLQa President Biden assumes office at a time when our nation is facing crises that demand urgent action. Starting today, the President will take decisive actions to address these challenges, prevent other harms, and restore America's place in the world. Today, the work begins. https://t.co/OqdALNJj4A Xavier Becerra has the experience we need at HHS. He has spent his career fighting for quality, affordable health care. As Secretary of Health and Human Services, he will continue his work to lower health care costs and expand access for all Americans. https://t.co/PILLBp1eVr President-elect Biden has nominated Dr. Levine to serve as Assistant HHS Secretary. A deeply experienced public servant and public health expert, she is poised to become the first openly transgender federal official to be confirmed by the U.S. Senate.\nhttps://t.co/REmjFd98Hl As we celebrate the life and legacy of Dr. Martin Luther King, Jr., we honor his commitment to building a country that is rooted in civil rights and racial justice. #MartinLutherKingDay RT @DrNunezSmith: \"Now is the time to lift our national policy from the quicksand of racial injustice to the solid rock of human dignity.\"… RT @BeKindDreamBig: I am honored to serve alongside @teachcardona to restore our education system – putting teachers, students, and parents… Today, President-elect Biden announced a number of key administration posts. These experienced public servants will lead with compassion, integrity, and character to make our government work for all Americans.\nhttps://t.co/rrHKrjHur2 Vice President-elect Harris bids farewell to her Senate seat today. But as she says, it’s not goodbye—it’s hello as Vice President of the United States. https://t.co/mU8whoxsUe The principles of homeland and security have shaped the life of Alejandro Mayorkas, who was brought to the U.S. as a child from Cuba. He’s endorsed by dozens of groups from law enforcement to advocacy who want a Department of Homeland Security that is fair and humane. https://t.co/sQWh7wT4Tt RT @jakejsullivan: Mr. Navalny should be immediately released, and the perpetrators of the outrageous attack on his life must be held accou… President-elect Biden and Vice President-elect Harris are committed to making sure communities of color, our rural neighbors, those living with disabilities, and seniors are not left behind in our vaccination plans. https://t.co/HTnS6YfnEX This week, Dr. Jill Biden announced additional members of the Office of the First Lady, including the new incoming Executive Director of Joining Forces. These dedicated public servants are committed to building an administration that lifts up all Americans.https://t.co/YzvBBfwfAj President-elect Biden’s $1.9 trillion American Rescue Plan will contain the virus, rescue the American economy and put money directly into the pockets of working families, communities, and small businesses impacted by the pandemic. President-elect Biden and Vice President-elect Harris announced additional staff members of the Office of the Vice President. These accomplished individuals will hit the ground running on day one and will serve our country with honor and integrity.\nhttps://t.co/zsfzwQCAec Statement from President-elect Biden on Religious Freedom Day:\n\nhttps://t.co/biyJUKiUsl https://t.co/tDnyHx8j0O RT @DouglasEmhoff: I'm so incredibly honored and humbled to be the first @SecondGentleman of the United States. As we countdown to Inaugura… Equity is central to our COVID-19 response. And, our administration will ensure that vaccinations are distributed equitably and to hard-to-reach, marginalized and medically-underserved communities. The President-elect has set a goal of 100 million shots administered in the first 100 days. Here’s how we make that happen: https://t.co/O92tCiRRSZ Tune in as President-elect Biden announces key members of his White House Science Team.\n\nThese diverse, deeply respected and eminently qualified scientists will marshal the force of science to drive meaningful progress in the lives of people https://t.co/JFHTfyOLoQ RT @eric_lander: Humbled and excited to serve as WH science advisor for President-elect @JoeBiden. He has assembled a diverse team of brill… Small businesses are the engines of our economy, and they have struggled during the pandemic. President-elect Biden’s plan will help provide them with funding to reopen, recover, and rebuild. https://t.co/zuIu1Hh4Ap This accomplished team will work closely with Secretary of State-designate @ABlinken to rebuild our institutions, renew and reimagine American leadership to keep Americans safe at home and abroad, and address the defining challenges of our time. https://t.co/Fd8YDzSqvc Our White House staff will represent diverse and varied communities, putting service to the American people at the forefront of their work. \n \nThese are the qualified, tested and skilled individuals who were announced today:\nhttps://t.co/t7bA47EAOr RT @alondra: Sound science will touch every aspect of what the Biden Administration does–from new policy, to addressing social inequality,… Effectively and equitably vaccinating the vast majority of the U.S. population will happen through stronger partnerships with tribes, states, and communities, increased supply, more vaccination sites, and more vaccinators. Our plan is as clear as it is bold:\n\n- Allow more people to get vaccinated.\n- Create more places for them to get vaccinated.\n- Mobilize more medical teams to get shots in arms.\n- Increase supply and get it out the door as soon as possible.\n\nhttps://t.co/IbT5dNw0AL This team will help our administration confront some of the biggest crises and challenges of our time, from climate change and the impact of technology on society to pandemics, racial inequity, and the current historic economic downturn. \nhttps://t.co/MCjjQnKo7K Join our press briefing as members of the Biden-Harris Transition team share the latest updates ahead of the inauguration of President-elect Biden and Vice President-elect Harris: https://t.co/weetSMEbWJ President-elect Biden and Vice President-elect Harris announced additional members of the White House COVID-19 Response team. \n\nThis team will work quickly to implement a comprehensive response strategy to contain the pandemic and restore public trust.\nhttps://t.co/HjlCLJmvuG These dedicated public servants will lead with compassion, integrity, and character to make our government work for all Americans.\n\nThey will hit the ground running on day one with bold thinking to make a meaningful difference in people’s lives.\nhttps://t.co/KgPxsHIT2R Meet Pilar: A small business owner impacted by COVID-19.\n\nShe is one of the millions of Americans the President-elect is working to deliver results for with his American Rescue Plan. https://t.co/KSKxPbk1LP President-elect Biden will outline his America Rescue Plan to fund vaccinations and provide immediate, direct relief to working families and communities bearing the brunt of this crisis. https://t.co/gz80hwWoVt The President-elect's American Rescue Plan will:\n- Ramp up a national vaccine program\n- Safely reopen majority of K-8 schools in his first 100 days\n- Deliver immediate, direct relief to working families \n- Support hardest-hit communities &amp; small businesses\nhttps://t.co/8zS5KhWGtw https://t.co/yFR120juA3 President-elect Biden recognizes that millions of working families continue to bear the brunt of the pandemic. Today, he will lay out his plan to rescue our economy and control the virus. We can emerge from the most inequitable jobs crisis in modern history by building an economy that gives everyone an equal chance to get ahead.\n\nThis team will help struggling small businesses recover, and put Americans back to work by creating millions of good-paying union jobs. https://t.co/O3zQzeFzNr As USAID Administrator, @SamanthaJPower will work with our partners to confront the COVID-19 pandemic, lift up vulnerable communities, fight for the value of every human being, and advance American ideals and interests around the world. https://t.co/Y5spGtH8Ue Our National Security Council consists of crisis-tested leaders who will work relentlessly to safeguard Americans, advance our security, and defend our democratic values.\n\nThese are today’s additional members of the NSC staff: \nhttps://t.co/eFzBk29Oan These diverse, qualified, and experienced appointees will be vital in supporting day-to-day White House functions and facilitating broad engagement with the American people. They are ready to hit the ground running for American families on day one.\n\nhttps://t.co/g4otGkUvhC https://t.co/CrD2bEcsh6 President-elect Biden received his second dose of the COVID-19 vaccine because he trusts scientists.\n\nOur administration is committed to doing everything possible to ensure every American has all the information they need to get vaccinated. https://t.co/9FzLEeqwOi President-elect Biden has nominated Ambassador Samantha Power as USAID Administrator.\n\nA leading voice for humane and principled American engagement in the world, she will rally the international community and work with our partners to confront the biggest challenges of our time. https://t.co/Gv9G8CLrI5 Dr. Marcella Nunez-Smith, COVID Equity Task Force Chair-designate, will help advise President-elect Biden on a whole-of-government effort to reduce COVID-19 disparities in response, care, and treatment, including racial and ethnic disparities.\n\nhttps://t.co/nG1LR9RTEg RT @LloydAustin: I am enormously grateful for the service and the sacrifices of those who broke barriers before me—and although I may be th… This team will restore the independence and integrity of the Justice Department, renew Americans’ faith in the rule of law, and work tirelessly to build a more equitable justice system.\n\nThey understand that the Justice Department exists to serve the American people. https://t.co/nGXVwwDYeb RT @RWalensky: Studies have demonstrated the COVID-19 vaccine is safe. The vaccine gives us hope. And I urge everyone to take it once it is… Today's appointees to the Office of the White House Counsel are experienced and accomplished individuals that have a wide range of knowledge from various fields and will be ready to get to work on day one.\n\nhttps://t.co/4YQEcC3fyJ https://t.co/6EByVkVoQ0 We need a CIA Director who understands the dynamic threats we face. A CIA Director who can work with our allies and stand up to our adversaries. A CIA Director who will lead with transparency and integrity.\n\nThat is who Ambassador William Burns is.\nhttps://t.co/oAFLYmbp3j RT @CeciliaERouse: Like I told PBS, the current stimulus was a downpayment, but our communities – especially women and teachers – need addi… President-elect Biden has nominated career diplomat and crisis-tested national security expert Ambassador William Burns as Director of the CIA.\n\nAmbassador Burns has a deep understanding of the threats we face, and will tirelessly protect the American people. https://t.co/vcTyn7ejOp President-elect Biden knows this is no time to build back to the way things were before. \n\nOur administration will work to build an economy that is more vibrant and powerful because everybody will be cut in on the deal. Our jobs team will advance President-elect Biden's Build Back Better agenda.\n\nThey will help to build a stronger, more resilient, and more inclusive economy that delivers every American a fair return for their work. https://t.co/QmggJnUCCP \"Our priority will be Black, Latino, Asian, and Native American owned small businesses, women-owned businesses, and finally having equal access to resources needed to reopen and rebuild.\" — President-elect Biden https://t.co/pIyDuhf5pH RT @GinaRaimondo: I’m excited to help carry out the Build Back Better agenda.\n\nWe have a vision for an inclusive recovery that lifts up tho… “As everyone who watched [Wednesday’s] events in Washington now understands–if they did not before—the Rule of Law is not just some lawyer’s turn-of-phrase. It is the very foundation of our democracy.” — Judge Merrick Garland, Nominee for Attorney General https://t.co/9O5Rq8iWBV \"We need more direct relief flowing to families, small businesses, including finishing the job of getting people that $2,000 in relief—direct payment. $600 is simply not enough.\" — President-elect Biden https://t.co/rmNdwzBuIU RT @dgravesjr: The president-elect has always shown me how to be a public servant the right way.\n\nThat service isn't about the principals w… Our administration will work every day to deal with the growing economic inequality in our nation. And to deal with the denial of the promise of this nation—to so many.\n\nThis is our time to root out systemic racism. “Ensuring the Rule of Law and making the promise of Equal Justice Under Law real are the great principles upon which the Department of Justice was founded and for which it must always stand.” — Judge Merrick Garland, Nominee for Attorney General https://t.co/48U1XlHXnN RT @vanitaguptaCR: There are many agencies in our federal government – but only one which bears the name of a value.\n\nBy virtue of that nam… President-elect Biden's Attorney General nominee, Judge Merrick Garland, will help create a more equitable justice system for all Americans. https://t.co/AdODMA19Fe ICYMI: Readout of President-elect Biden's Calls with Speaker Nancy Pelosi &amp; Senate Democratic Leader Chuck Schumer: https://t.co/r9DYgUfKqZ RT @MartyJWalsh: We are facing hard times – but nobody’s tougher than the American worker. And going forward, we have the opportunity to pu… Statement by President-elect Biden on the 10th Anniversary of the Tucson Shooting:\n\nhttps://t.co/32XJwlWju4 https://t.co/C5gh5aFKsV RT @dgravesjr: I am so humbled to be nominated by President-elect Biden to serve as Deputy Commerce Secretary. I’ve worked alongside @JoeBi… Our transition team continues to lay the foundation for the Biden-Harris administration. Join our press briefing for the latest updates: https://t.co/Jm0t1RkINA Our jobs team will help to build a stronger, more resilient, and more inclusive economy that delivers every American a fair return for their work. Tune in as President-elect Biden and Vice President-elect Harris introduce nominees for their team: https://t.co/Qrk2MzRhFt Today, President-elect Biden and Vice President-elect Harris announced staff members for the National Security Council. These leaders will work relentlessly to safeguard Americans, defend our interests, and advance our democratic values.\n\nhttps://t.co/Jmj3JgJhwc https://t.co/9RfZWkH7FE RT @LisaMonaco: The soul of the Justice Department lives in the integrity of its career professionals, in the independence of its investiga… RT @vanitaguptaCR: I am honored to return to a Justice Department that will push every day for justice, accountability, and equality under… The Office of the Vice President will consist of experienced individuals who represent the very best of our country, and who are ready to meet the challenges we’re facing and deliver results for the American people on day one.\nhttps://t.co/YCDzAhtq68 Statement by President-elect Biden marking Orthodox Christmas: https://t.co/snG7aNPy6r \"More than anything, we need to restore the honor, the integrity, the independence of the Department of Justice in this nation.\" — President-elect Biden https://t.co/3yZH2me5qT RT @MartyJWalsh: Working people, labor unions, and those fighting every day for their shot at the middle class are the backbone of our econ… RT @GinaRaimondo: Rhode Island may be small, but our economy is mighty on the strength of our small businesses and innovative technologies.… RT @IsabelCGuzman: We have to build our economy back better from this pandemic. Small businesses and their employees will be core to our re… Our jobs team’s mission is clear: execute the Build Back Better agenda.\n\nThey will work to dig us out from the worst, most unequal jobs crisis in nearly a century by supporting small businesses and rebuilding the backbone of America — our middle class. https://t.co/bFAAcyv2D9 These leaders will renew Americans’ faith in the rule of law and work tirelessly to build a more equitable justice system. Tune in as President-elect Biden introduces key nominees for the Department of Justice. https://t.co/ZTIWMmWcpP President-elect Biden has nominated Judge Merrick Garland to serve as Attorney General.\n\nHe will work to restore the integrity and independence of the Justice Department, ensure racial equity in our justice system, and ensure we meet the evolving threat of violent extremism. https://t.co/zG8PGk7ibW RT @LisaMonaco: I’ve spent years in public service working with those who have dedicated their lives to upholding the law and keeping this… This team will work to move us closer to the American ideal of equal justice under law. \n\nThey will work to restore independence of the Justice Department, always follow facts and the law, and serve and protect the American people with integrity.\nhttps://t.co/KPV7ZKVPlB President-elect Biden addresses the nation: https://t.co/BXM3SZK25R Readout of President-elect Biden’s briefing on COVID-19 response and vaccination strategy: \n\nhttps://t.co/epetoF8NyT https://t.co/hVAnLNXU6i El equipo de transición está estableciendo los cimientos que la administración Biden-Harris utilizará para afrontar los desafíos urgentes que enfrenta nuestro país en el primer día en sus cargos.\n\nAprenda más sobre la transición:\nhttps://t.co/qq6HiZGMF9 Today’s White House appointees will play key roles in coordinating across the administration, working with state and local governments and organizations, and engaging with the public.\nhttps://t.co/zlxWRaRh3U Whenever America has had its back against the wall, we’ve come together to lay the foundation—through public investment and a strong social contract—for us to pull together and push forward. \n\nOur economic recovery plan for working families plans to do just that. RT @XavierBecerra: ¿Cómo podemos mejorar su vida? \n\nEsa es la función del Departamento de Salud y Servicios Humanos. Nuestra misión es ayud… We have an opportunity not just to go back, but to move forward in a meaningful way to address the climate crisis.\n \nOur climate team will work alongside all agencies and all sectors of government to build a future that is healthier, safer, and more prosperous. https://t.co/lOR5Z19tbB Statement by President-elect Biden on Nancy Pelosi’s reelection as Speaker of the House: https://t.co/m6u6BwFlRj Wearing a mask can save lives.\n\nOur administration will continue to call on:\n\n- Every American to wear a mask for 100 days.\n- Every governor to make that mandatory in their state. Preparation is underway to ensure the Biden-Harris administration is able to take on the historic crises our country faces. We won't just return to the way things are. We will build back better than ever before. https://t.co/3kq5F3F2Pb Statement by President-elect Biden on the passing of Floyd Little:\n\nhttps://t.co/1qLCIwzi1F https://t.co/AiiD4npJjM Our work for the next 20 days will be the infrastructure for the incoming administration, who like us, will prioritize diversity of ideology and background, address the challenges our country faces, and serve the American people.\n\nhttps://t.co/sSSxr0FV5l As we bring in the new year, we look forward to ensuring the Biden-Harris administration is ready to tackle our current crises on day one.\n\nFrom the Biden-Harris transition team—Happy New Year! \"As we end one of the most difficult years as a nation, I am optimistic about the future.\"  — President-elect Biden https://t.co/0kzteKX4ZJ RT @JanetYellen: The challenges we’re facing are unprecedented, and addressing the economic and public health crisis will require bold acti… \"We've overcome incredible challenges as a nation. And we've done it before, and we will do it again.\" — President-elect Biden https://t.co/aZ906QudGq With today’s announcement, President-elect Biden and Vice President-elect Harris surpass their goal to name over 100 members of our White House team.\n\nThis diverse and talented group not only looks like America, but will deliver results for working families on day one. https://t.co/JaHv1abVnD Vice President-elect Harris and the future Second Gentleman Doug Emhoff share the importance of getting the COVID-19 vaccine. https://t.co/BZDkaHk78M Secretary of Education nominee Dr. Miguel Cardona is a public school educator who understands the value and importance of public education.\n\nHe will use his expertise to get our nation's schools through this pandemic and beyond. https://t.co/khfgCmid6G RT @PeteButtigieg: Decades in the making, the newly renovated Moynihan Train Hall in New York City is one of the most significant passenger… These accomplished and barrier-breaking individuals will focus on implementing policies, working with Congress, and communicating with the American people about how the administration will build our nation back better than before.\n \nhttps://t.co/ELBFytBxWa https://t.co/IAAEBTusaL Our work to prepare the Biden-Harris administration continues. Join our press briefing to hear the latest updates: https://t.co/2NMJiy5mJU President-elect Biden has nominated @kath_hicks as Deputy Secretary of Defense and @ColinKahl as Under Secretary of Defense for Policy.\n\nThey know the Pentagon inside and out, and will work with Secretary-designate @LloydAustin to keep us safe and secure.\n\nhttps://t.co/FeZhLju501 Statement by President-elect Biden on the 50th anniversary of the Occupational Safety and Health Act:\n\nhttps://t.co/CIesRWzIG3 https://t.co/9lQhKZAde8 During the first 100 days of the Biden-Harris administration, the president-elect will ask the American people to wear a mask. https://t.co/fTpMpk34uP Our COVID-19 response team consists of diverse and crisis-tested individuals who will work to contain the pandemic, restore public trust, and protect all Americans.\n\nhttps://t.co/CI1yHO5anb Tune in as President-elect Biden delivers remarks on the state of the ongoing COVID-19 crisis and lays out some initial steps his administration will take to contain the virus: https://t.co/T82uSThTQC Meeting our most daunting challenges requires American engagement and leadership. But as President-elect Biden states, we can't act alone. https://t.co/Uku9IWA8i9 President-elect Biden believes this is no time to build back to the way things were before. \n\nThis is our moment to imagine and build a new American economy for our families and the next generation. \"Rebuilding the full set of our instruments of foreign policy and national security is a key challenge that the Vice President-elect Harris and I will face upon taking office—starting with our diplomacy.\" — President-elect Biden https://t.co/9qhlcZrjzq RT @DebHaalandNM: The Interior Department manages our public lands to make sure we protect them, honor them, &amp; preserve them for future gen… President-elect Biden delivers remarks following his briefing with national security and foreign policy agency review team members. Tune in: https://t.co/GhYVOPiHw8 President-elect Biden and Vice President-elect Harris announced members of the White House Office of Digital Strategy. \n\nThis talented team will reach and engage users online, and connect our administration to the American people in new &amp; innovative ways.\nhttps://t.co/AgOQFy9Ftr In this time of crises, President-elect Biden has a plan to create millions of good-paying jobs, make it easier for workers to organize unions and collectively bargain.\n\nA plan that will give America's working families the tools, choices, &amp; freedom they need to build back better. The Biden-Harris administration will always:\n\n- Listen to science\n- Ensure public health professionals inform public health decisions\n- Promote trust, transparency, common purpose, and accountability in our government RT @XavierBecerra: My faith has been my North Star throughout my career in public service. It teaches me to give back and care for others —… From the Biden-Harris Transition team, we want to send best wishes to everyone celebrating Kwanzaa. A holiday rooted in the Nguzo Saba—Kwanzaa is a time of reflection on the rich heritage of African-American culture. Kwanzaa is a time of celebration, reflection, and pride for many American families.\n\nWatch as Vice President-elect Harris shares her Kwanzaa memories and how her favorite principle Kujichagulia continues to motivate her. https://t.co/dTPfCLcrUn We know the holiday celebrations are a little different this year. From the Biden-Harris Transition team, we want to wish you a safe and Merry Christmas. Vice President-elect Harris and our future Second Gentleman Doug Emhoff remind us that while we have faced many challenges this year, Christmas is a season of hope. https://t.co/C9gyI0N0cF Christmas message from President-elect Biden and our next First Lady Jill Biden. https://t.co/f7HpiZ4NlN President-elect Biden reminded us that our darkest days of COVID-19 are ahead of us, and we must all do our part to turn this crisis around. https://t.co/yJrTG9Ts9X A very special Christmas message from Champ and Major Biden. https://t.co/lKlo5GWfR8 \"We've gotten through tough times before in this nation, and we'll get through these difficult times as well. And we'll do it by coming together, by working with another.\" — President-elect Biden https://t.co/2JeSlnXoVA RT @XavierBecerra: Las vacunas contra el COVID seguras y efectivas están siendo distribuidas, incluyendo en nuestras comunidades latinas. L… “We have to recover from the pandemic, we have to rebuild our economy, we have to deal with the climate crisis, the racial equity and racial justice crisis. And all of these things are vital to our national cohesion and strength, and our ability to lead abroad.” —@AmbassadorRice https://t.co/B7hBlYaxTQ A teacher will lead the Department of Education. Dr. Miguel Cardona will ensure that every student in the nation can get a high-quality education from pre-K to post-high school—regardless of their ZIP code, income, race, sexual orientation, gender identity, or disability. Dr. Miguel Cardona is a former public school teacher &amp; a proven leader ready to lead on day one. Tune in as President-elect Biden introduces Dr. Cardona as his Secretary of Education nominee: https://t.co/vO0cIfMLHM RT @LloydAustin: There is much more work to be done in achieving equality for all who wear our nation’s uniform. I share President-elect Bi… President-elect Biden and Vice President-elect Harris announced additional members of the Office of the White House Counsel. This qualified and talented group will help restore faith in the rule of law and the accountability of government institutions.\n\nhttps://t.co/4mFA7zRBLp Linda's story about losing her mother Sylvia to COVID-19 reminds us that many families across America are grieving.\n\nPresident-elect Biden knows that in these dark times, we must keep the faith. \n\nFor together we can heal. Together we can hope. https://t.co/yG2wfSrS4G Dr. Miguel Cardona has been nominated by the president-elect to lead the Department of Education. \n\nAs a former public school teacher, he will lead the effort to invest in all students, support educators, and make reopening schools a national priority. https://t.co/mc1eq3WpbK RT @DenisMcDonough: When you get to work with the men and women of our Armed Services day in and day out, you can’t help but believe that w… RT @mlfudge: To build back better, we first need to create a base – to build a foundation for those struggling with housing. \n\nThat means e… Tune in as President-elect Biden delivers remarks before the holiday. https://t.co/NbGO72Qoph President-elect Biden and the next First Lady Jill Biden are demonstrating how our administration will lead—by listening to the scientists, listening to the experts, and helping keep Americans safe. https://t.co/0LyN2kZl22 RT @Michael_S_Regan: We will be driven by our conviction that every person has the right to clean air, clean water, and a healthier life—no… President-elect Biden and Vice President-elect Harris continue to assemble a White House senior staff composed of diverse, experienced, and talented individuals who are day-one ready to deliver results for working families.\n\nhttps://t.co/yOaRHCAuHA RT @AmbassadorRice: El presidente electo Biden tiene una visión transformativa para establecer un sistema de inmigración justo, humano y or… On day one, the Biden-Harris administration will be ready to take on additional steps to get the virus under control and build our economy back better than it was before this crisis. \n\nThe president-elect knows there's no time to waste. RT @AmbassadorRice: President-elect Biden has a transformative vision for establishing a fair, humane, and orderly immigration system. The… RT @jakejsullivan: The work to restore safe asylum processing at the border will start right away, but it will take time. We will also begi… RT @PeteButtigieg: We will make sure that creating jobs, tackling the climate crisis, and centering equity are at the heart of our transpor… RT @ali_a_zaidi: The peril of the climate crisis is already evident. But we can also see the promise.\n\nWe will create good jobs - and lift… \"As the first Native American Cabinet Secretary in the history of the United States of America, she’ll be a true steward of our national parks, our natural resources, and all of our lands.\" — President-elect Biden on Congresswoman Deb Haaland, Secretary of the Interior Nominee https://t.co/0Kpj9iNYnZ RT @LloydAustin: I have witnessed the selflessness and patriotism of our servicemembers, civilians, and families firsthand, and couldn't be… The Biden-Harris National Economic Council will work to get Americans out of this economic crisis — and these individuals will help us build a strong, inclusive, and more resilient economy for the future.\n\nhttps://t.co/D9Bw8YUt93 Statement from President-elect Biden on bipartisan agreement on COVID-19 relief:\n\nhttps://t.co/sIC4FmXdDe https://t.co/83B8LeWiHZ President-elect Biden believes that every American has the fundamental right to breathe clean air and drink clean water. Fulfilling that right won’t be easy, but it is absolutely necessary. https://t.co/2cmI1n9lbA RT @DebHaalandNM: Let it be known:\n\nOur Interior Department will fight to address climate change and environmental injustice.\n\nWe will empo… President-elect Biden knows that climate change is one of the most important challenges of our lifetimes.\n \nThat’s why he’s building a team that will create jobs we need to build modern, sustainable infrastructure now and to deliver an equitable clean energy future for all. RT @Michael_S_Regan: Climate change is the most significant challenge humanity faces. We’ll make meaningful progress together by listening… RT @Brenda_Mallory: I grew up knowing the faces of the marginalized and experiencing the challenges of urban pollution. While the words “cl… RT @Gina_McCarthy: The President-elect has put together the strongest climate plan ever raised to this level of leadership because he knows… RT @XavierBecerra: “How can we make your life better?” \n\nThat is the role we have at HHS. Our mission is to help you stay healthy, be well,… Building Back Better means creating good-paying union jobs that will help us modernize infrastructure to withstand the impacts of climate change and build a clean energy future. https://t.co/ppyeiPWyu5 Resumen de la llamada del presidente electo Biden con el presidente Andrés Manuel López Obrador:\n\nhttps://t.co/qip5FlPOji https://t.co/vxD7yMGo8l Readout of President-elect Biden’s Call with President Andrés Manuel López Obrador:\n\nhttps://t.co/WzzNWIgaP9 https://t.co/VrVor1dk1W President-elect Biden continues to build a Cabinet that will be historic. That looks like America. That taps into the best of our country. And that is day-one ready to meet the challenges we're facing. https://t.co/OCNSsvCjAC President-elect Biden and Vice President-elect Harris know that we must tackle the urgent threat of climate change.\n\nTune in as they introduce the tested team of bold thinkers taking on this challenge: https://t.co/L4fHLMcKir It's not enough to say we have a climate crisis. We must take the right actions to confront this crisis, with leadership ready to protect this planet and create millions of good-paying jobs.\n\nThis is the team that will tackle the climate fight:\nhttps://t.co/kj73D37Ql9 Statement from President-elect Biden on FDA emergency use authorization for Moderna COVID-19 vaccine:\n\nhttps://t.co/nZ53pvxQ2Z https://t.co/EaxqawHePJ Statement by HHS, Surgeon General, and CDC nominees on record opioid deaths and spike in overdoses during pandemic: \n\nhttps://t.co/rukJgKaj2Q https://t.co/u0bY0VGq3q Statement from incoming Biden-Harris National Economic Council Director Brian Deese on providing critical economic relief to Americans: https://t.co/eltQL6SMlL Today, President-elect Biden announced additional members of the White House communications &amp; press staff.\n\nThese talented individuals demonstrate the president-elect's commitment to building an administration that looks like America &amp; is day one ready.\nhttps://t.co/p0VIVu78Q2 We are continuing to lay the groundwork for the Biden-Harris administration, which will be ready on day one, to tackle the country's current challenges. Join our press briefing to hear the latest: https://t.co/cACd2MYt19 Readout of Biden-Harris transition meeting with Rev. Dr. William J. Barber II and the Poor People’s Campaign:\n\nhttps://t.co/efiZSMXgJd https://t.co/W19pDr341e RT @ali_a_zaidi: We need a whole-of-government approach to take on the climate crisis — in a way that spurs jobs and advances justice. I wa… RT @Brenda_Mallory: I’ve dedicated my career to solving environmental challenges for communities, addressing environmental justice, and tac… RT @Gina_McCarthy: I am honored to lead the first White House Office of Domestic Climate Policy.\n\nMy goal is to marshal our entire governme… RT @JenGranholm: I’m honored that President-elect @joeBiden has placed his faith in me as his Energy Secretary nominee.  We have an opportu… RT @DebHaalandNM: A voice like mine has never been a Cabinet secretary or at the head of the Department of Interior.\n\nGrowing up in my moth… This team will play a major role in supporting the communities most affected by climate change, while empowering the young people whose futures are most at stake.\n\nWe all have a stake in this fight. And our administration will be ready to meet the moment. https://t.co/AtZzHZx09j The undeniable reality of climate change is taking a toll on lives and livelihoods across the country. \n\nThis team will listen to scientists, experts, and affected communities as we race to confront one of the most urgent challenges facing our nation.\nhttps://t.co/kj73D37Ql9 Statement by President-elect Biden on Cybersecurity: \n\nhttps://t.co/MDDOeoInal https://t.co/tdiLeSbtMi RT @PeteButtigieg: Americans shouldn't settle for less than our peers in the developed world—we should lead the way on infrastructure. And… President-elect Biden will launch a national effort to create the jobs we need to build modern, sustainable infrastructure now and deliver an equitable clean energy future. The Biden-Harris administration will ensure that—coming out of this profound public health and economic crisis, and facing the persistent climate crisis—we are never caught flat-footed again. RT @PeteButtigieg: I'm mindful of the history of this appointment, knowing this is the first time an American president has ever sent an op… Our administration will work to invest in America's infrastructure to create millions of good, union jobs to rebuild this country back better than ever. \"[He] will carry out the Department's duty to keep Americans safe on our roads &amp; railways, &amp; in our skies.\n\nPete will help us build back better with jobs &amp; hope, with vision &amp; execution.\" — President-elect Biden on Pete Buttigieg, Secretary of Transportation Nominee https://t.co/seyglmr9ID RT @vivek_murthy: While we may come from different backgrounds, #COVID19 has reminded us that when it comes to our health, we’re all deeply… President-elect Biden &amp; Vice President-elect Harris introduce Mayor Pete Buttigieg as their Sec. of Transportation nominee, who will implement the president-elect's build back better agenda. Tune in: https://t.co/RjqpRDzPvT RT @PeteButtigieg: This is a moment of tremendous opportunity—to create jobs, meet the climate challenge, and enhance equity for all.\n\nI'm… South Bend was once called one of America’s “dying cities.” Today, it’s a hub of innovation and job growth.\n\nMayor Pete Buttigieg led that resurgence, and has been nominated by the President-elect to continue that work as Transportation Secretary.\n\nhttps://t.co/dyqdH2LLk3 RT @RWalensky: Not seeing our loved ones, not being able to be together or embrace each other, is incredibly hard. I know people are frustr… \"I’ve given Denis a clear mission: fight like hell for our veterans and their families.\" — President-elect Biden on Denis McDonough, Nominee for Secretary of Veterans Affairs https://t.co/YzY1hoVg8K \"Trade is like any other tool in our domestic or foreign policy—it is not an end in itself. It is a means to create more hope and opportunity for people.\" — Katherine Tai, Nominee for United States Trade Representative https://t.co/SC52W8RbzO “The USDA will be a team player—working with our sister agencies to advance issues of shared interest: rebuilding our infrastructure, fixing a broken immigration system, and fighting the ongoing opioid crisis.” — Tom Vilsack, Secretary of Agriculture Nominee https://t.co/upL0BxLNjB Stories like Elena &amp; her daughter Xiomara's remind us of the importance of the Affordable Care Act.\n\nToday is the last day of open enrollment for health insurance through the ACA for 2021.\n\nVisit https://t.co/6ylFIJBEoY to find a plan that works for you. #GetCovered https://t.co/q3MDSF8Sl6 President-elect Biden reminds us that democracy beats deep in the hearts of the American people. https://t.co/hNGrsQGlS4 RT @DenisMcDonough: The President-elect’s marching orders to me were clear: “Fight like hell for our veterans.”\n\nI will honor that order. W… Tune in as President-elect Biden delivers remarks on the electoral college vote certification and the strength and resilience of our democracy. https://t.co/DK3fLbQQNJ Tomorrow is the last day of open enrollment for health insurance through the Affordable Care Act for 2021.\n\nVisit https://t.co/6ylFIJBEoY to #GetCovered! https://t.co/hvOlX7XEoD Statement by President-elect Biden Marking 8 Years Since the Shooting at Sandy Hook Elementary School: https://t.co/ENGNgDPVQB RT @mlfudge: This pandemic, the recession, and the plight of racial injustice has chipped away at our country's hope—and at the promise of… RT @ABlinken: Among my parents and grandparents are immigrants, refugees, a Holocaust survivor. For them and many others, America was the l… Statement by President-elect Biden on the 25th Anniversary of the Dayton Accords:\n\nhttps://t.co/5mfHwpbOze https://t.co/x8i57fR6Vt Millions of Americans can't wait for relief any longer—we must act now. https://t.co/daxPrg6kbT We set a bold and doable challenge within the first 100 days of the Biden-Harris administration: \n\n- Vaccinate 100 million Americans \n- Ask the American people to wear masks\n- Reopen most schools\n\nThe first 100 days won't end COVID-19, but meeting these goals can save lives. https://t.co/1jxAfK9mET Wearing a mask isn’t about politics—it’s science. https://t.co/InZBj4WkKj Climate change poses an existential threat—not just to our environment, but to our health, our communities, our national security, and our economic well-being.\n\nPresident-elect Biden will lead the world to address the climate crisis.\nhttps://t.co/y5aJiGl9CE Statement by President-elect Biden on the Five-Year Anniversary of the Paris Agreement:\n\nhttps://t.co/KPvsyFMNHX https://t.co/pM0c82Zqf7 Five years ago today, the world gathered to adopt the Paris Agreement on climate change. \n\nOn day one of the Biden-Harris administration, we will rejoin the Paris Agreement. https://t.co/unZ4WFInBK \"I've seen him take on HIV/AIDS, H1N1, Ebola, Zika, COVID-19, and every infectious disease in between, over his nearly forty years of service to our country.\n\nTrusted. A truth teller. A patriot.\" — President-elect Biden on Dr. Anthony Fauci https://t.co/v76B4ZmqfK President-elect Biden believes we need a major mobilization of effort and resources to advance racial equity across the American economy. \nhttps://t.co/zmFstgxdM4 Extraordinary challenges demand committed leadership. This group of individuals has the experience to get us through this moment—and fight for a government that works for everyone. https://t.co/bxz459wSZr Tune in as President-elect Biden &amp; Vice President-elect Harris announce key members of their administration who will lead with compassion &amp; integrity to make our government work for all Americans. https://t.co/h1gTIo4aJx Our transition team continues to lay the groundwork for the Biden-Harris administration. Join our press briefing for the latest updates: https://t.co/LTLtv2xTFw We have assembled a team of highly respected and qualified individuals to serve on the national security and foreign policy team.\n\nThey will put us on a path to restore our relationships abroad, and renew our safety here at home. https://t.co/4GdYeDAvqi Statement from President-elect Biden on FDA Advisory Committee Recommended Emergency Use Authorization of Pfizer-BioNTech COVID-19 Vaccine: https://t.co/rk1G5aLBP5 Happy Hanukkah to everyone who is celebrating from the Biden-Harris Transition team!\n\nWhile this year may look different for many, we hope these next eight nights are filled with light, joy, and love. Chag Sameach! https://t.co/bggSm7FrLF RT @DouglasEmhoff: Hanukkah is one of our favorite holidays -- and a reminder to spread the light at a time when we've never needed it more… RT @AmbassadorRice: I am humbled and excited by this call to serve. The scale of the challenges ahead demands a government that works for a… Katherine Tai is a dedicated public servant, with deep international trade experience.\n\nNo one is more qualified to work across labor, business, federal agencies, and Congress to pursue the President-elect’s vision of a pro-American worker trade strategy.\nhttps://t.co/Bytd4G7bkr “I come to this role now as a civilian leader—with military experience to be sure—but also with a deep appreciation and reverence for the prevailing wisdom of civilian control of our military.” — Lloyd Austin, Nominee for Secretary of Defense https://t.co/MwSRrzovsh Our nation faces a hunger crisis, farmers are reeling, &amp; rural communities are struggling with the economic fallout from the pandemic. We need steady leadership––now.\n\nAt the Department of Agriculture, Tom Vilsack will take on those challenges on Day One.\nhttps://t.co/9vkG3fxmVn RT @DenisMcDonough: When I received the call from President-elect Biden, I assured him that I will represent the voices of all veterans at… Today, President-elect Biden recognizes #HumanRightsDay and honors those who work tirelessly, often at great personal risk, to defend fundamental freedoms and fight oppression. \n\nThe President-elect's full statement: https://t.co/Qqw1YmMrSs RT @mlfudge: The President-elect has asked me to serve as Secretary of Housing and Urban Development to make sure people in every part of t… Working families, veterans, farmers and producers, and those fighting for their place in the middle class will have partners in government once again.\n\nThis experienced group will help us make it through this pandemic and thrive once the crisis is over.\nhttps://t.co/5tVM8IrmYM RT @CeciliaERouse: A central focus of the Council of Economic Advisers is to identify the very best programs and policies to put in place t… We will do everything we can to make sure everyone wears masks for 100 days under our administration. \n\nWearing a mask is not a political statement. It's a patriotic act. https://t.co/U6x6hfUt6R El presidente electo Biden anunció designaciones y nombramientos de su equipo de salud. \n\nEste es un equipo que se parece a los Estados Unidos y reúne a líderes con vasta experiencia en la salud pública, el gobierno, y el manejo de crisis.\nhttps://t.co/mVmoFRrhj7 RT @JohnKerry: Climate change is an existential crisis. Life on this planet is being threatened.\n\nBut it’s not all doom and gloom, we have… Our national security team will be relentless in keeping our country safe, with a vision on how to tackle the most pressing challenges of our time.\n\nWe will bring together allies and partners around the world to face these threats head on.\n\nAmerica is back. https://t.co/1Vz5Xwe37r Tune in as President-elect Biden and Vice President-elect Harris introduce retired four-star Army general Lloyd J. Austin III as their nominee to serve as the 28th United States Secretary of Defense.  https://t.co/YJ0B1sICKV RT @LindaT_G: I've been around long enough to know that global change relies on diplomacy and building relationships with people around the… RT @RWalensky: Government service was never part of my plans. But every doctor knows that when a patient is coding, your plans don’t matter… “In the fight against this pandemic, we must lead with science.” — Dr. Anthony Fauci https://t.co/W6c7Svy15U Readout of President-elect Biden and Vice President-elect Harris’s Meeting with Civil Rights Leaders: https://t.co/eEy8LncmbB RT @XavierBecerra: Now it's our turn to build up and to back up our health care workers battling the coronavirus.\n\nOur turn to restore fait… Through our collective pain, we will find our collective purpose —to control the pandemic, to save lives, and to heal as a nation.\n\nThat is why President-elect Biden built a team of world-class experts who will work with him to change life in America for the better. https://t.co/VywQL7Nnnz RT @vivek_murthy: The best doctor is not an authority figure who writes prescriptions, but rather a partner in healing — someone who sees p… RT @DrNunezSmith: It is our societal obligation to ensure equitable access to testing, treatments, and vaccines. Equitable support for thos… Like President-elect Biden, General Lloyd Austin believes we have the strongest military in the world—and that we must lead not with the example of our power, but the power of our example. https://t.co/6aKTyqtxkw President-elect Biden understands that we need a team ready on day one to combat the most pressing health challenges. Tune in as the president-elect announces key members of the health team. https://t.co/t517BL6iWE .@JanetYellen is a crisis-tested and experienced leader who has spent her career prioritizing working families.\n\nNo one is better prepared to deal with our economic crises than her. https://t.co/a9MmYPKftG Black and Brown communities continue to be disproportionately impacted by climate change, COVID-19, and the economic crisis due to systemic inequalities.\n\nOur administration will work every day to root out systemic racism that hinders progress for all.\nhttps://t.co/zmFstgxdM4 President-elect Biden and Vice President-elect Harris are confronting a pandemic, an economic crisis, widespread racial injustice, and climate change. The team being assembled will meet these challenges on day one.\nhttps://t.co/umtZMG8BbH RT @JanetYellen: Our mission is to restore economic prosperity and financial stability.\n\nWe’ll do that by pursuing an investment agenda to… Dr. Anthony Fauci, America's preeminent expert on infectious diseases, has been among the most trusted voices throughout the pandemic. He will continue in his role and serve as Chief Medical Adviser on COVID-19 to President-elect Biden as we work to overcome this crisis. RT @vivek_murthy: I never dreamed I’d have the honor to once again serve as Surgeon General. In this moment of crisis, I’m grateful for the… RT @DrNunezSmith: As we come back from this crisis, we need to bring everybody along. It's been my life's work to combat systemic inequitie… RT @RWalensky: I began my medical career at the height of the HIV/AIDS crisis, and I've spent my life ever since working to research, treat… RT @XavierBecerra: In Congress, I helped pass the Affordable Care Act. As California's Attorney General, I defended it. As Secretary of Hea… Our health team will be ready to combat our most pressing health challenges: containing the pandemic, tackling inequity, and ensuring every American has access to affordable, quality health care.\n\nThey will lead with science, expertise, and integrity.\nhttps://t.co/v2qAmJURjE We aren’t just going to rebuild what has worked in the past. This is our opportunity to build back better than ever.\n\nhttps://t.co/uumnEjWFcJ The Biden-Harris administration will work every day to fight for American families. It's time for us to begin the work to heal, unite, and rebuild an economy for ALL Americans. https://t.co/ztOwbdksTW We are thankful to Dr. Gilman and all the inspiring frontline workers who risk their lives to protect us during this pandemic. \n\nWe promise you this: You have a partner in the Biden-Harris administration. https://t.co/vcDDL0rOLh \"The sooner we pass the funding, the sooner we can turn the corner on COVID-19.\" — President-elect Biden https://t.co/qi7irDy7oF 46 days until 46. Americans are struggling right now.\n\nThey need our help. They can't wait. \n\nWe must come together and act to help the American people. https://t.co/2d8g8ov3Pr Statement by President-elect Joe Biden on the November Jobs Report and Continuing Economic Crisis. https://t.co/DhMawzHHMI Today's jobs report reinforces we remain in the midst of one of the worst economic and jobs crises in modern history. Tune in as President-elect Biden talks about how we can get through this.  https://t.co/NCuLlfIcmO “The President-elect understands how scary these times are, and is committed to an agenda that will ensure we address the virus and restore economic growth for every corner of this country.”  — Neera Tanden, OMB Director Nominee https://t.co/eoW0wnQI7e RT @AliMayorkas: I’m very proud of my identity, I’m very proud of my heritage, I’m very proud of my parents, and most of all I’m proud to b… The Biden-Harris presidential transition is moving full speed ahead. Join our press briefing to hear the latest updates: https://t.co/6Hw86mbEjQ Families across this country need help now.\n\nPresident-elect Biden will work tirelessly to ensure that families come out of this with the support they need to get their lives back on track. \n\nThe American people have shown their grit. It's time the government shows it. https://t.co/sWkOouI20F Statement by President-elect Joe Biden on United Nations International Day of Persons with Disabilities. https://t.co/Dr8ZtvHuE2 RT @BrianCDeese: The climate crisis, racial inequity, and our economic recovery are inextricably linked. Our government must reflect that r… If we are going to tackle the climate crisis, then solutions must be woven into every aspect of our economic policy.\n\nBrian Deese is an economic leader and climate policy expert who will bring his expertise back to the White House as Director of the National Economic Council. https://t.co/90ffmreUDf Open enrollment for health insurance through the Affordable Care Act is here until December 15.\n\nSign up to #GetCovered: https://t.co/Oppvl638BT https://t.co/OMkMdvHL4m Vice President-elect Harris continues to build a White House senior staff that not only looks like America but reflects the very best of our nation and will be ready to hit the ground running on Day One.\nhttps://t.co/qhOdF9MOxQ Statement by President-elect Joe Biden on the 50th anniversary of the Environmental Protection Agency. https://t.co/QNdJNXUkd0 .@NeeraTanden understands the struggles that millions of working Americans are facing because she has lived them.\n\nAs head of OMB, she’ll always be motivated by what she can do to help those families — and create a budget that reflects the values of America. https://t.co/o8ZR5EX5nO Esta semana el presidente electo Joe Biden anunció los miembros clave de su equipo económico.\n\nEste es el equipo que ayudará a sacar a nuestro país de la recesión económica y reconstruir mejor. https://t.co/g9yKYeT3zJ Tune in as President-elect Biden participates in a virtual roundtable with workers and small business owners impacted by the economic crisis. https://t.co/bW0TRfdAfH The Biden-Harris administration will build an economy where every American enjoys a fair return for their work and an equal chance to get ahead. An economy more vibrant and more powerful precisely because everybody will be cut in on the deal. \n\nAmerica—help is on the way. https://t.co/fH8rlImiOv RT @wallyadeyemo: America has always overcome crises as a direct result of the determination and persistence of the American people, and th… “I’m here today because of social programs. Because of budgetary choices. Because of a government that saw my mother’s dignity, and gave her a chance. Now, it’s my honor to help shape those budgets and programs to keep lifting Americans up.” — Neera Tanden, OMB Director Nominee https://t.co/NtggKHha9k This crisis-tested and experienced team of groundbreaking Americans share the President-elect's core economic vision: that given a fair shot and equal chance, there's nothing beyond the capacity of the American people. https://t.co/PIFoZPz5P1 RT @CeciliaERouse: This is a moment of urgency and opportunity unlike anything we’ve faced in modern times.\n\nThe urgency of ending a devast… RT @JanetYellen: The Treasury Department must be an institution that wakes up every morning thinking about the American people. \n\nYour jobs… Statement by President-elect Biden on the U.S. Supreme Court case on the Census. https://t.co/9sFp4pIlJt On #WorldAIDSDay 2020, President-elect Biden joins communities worldwide in remembering those we have lost and recommits the United States to the important work ahead to achieve an AIDS-free generation.\n\nThe President-elect's full statement: https://t.co/FeaAjrX7P1 50 days until President-elect @JoeBiden and Vice President-elect @KamalaHarris are inaugurated. Tune in as President-elect Biden and Vice President-elect Harris introduce their nominees and appointees for key economic posts.\n\nThis team will get to work on day one to build our economy back better. https://t.co/NewKmFcv9L President-elect Biden believes that the federal government must act aggressively to help protect and support our families, small businesses, first responders, and caregivers affected by COVID-19.\n\nThe Biden-Harris administration has a plan to do just that:\nhttps://t.co/bq3bIujJLm Today, President-elect Biden took part in separate congratulatory calls today with the leaders of Argentina, Costa Rica, and Kenya as well as with the Secretary-General of the UN.\n\nhttps://t.co/1lvJbEYFFX Joint statement by President-elect Biden and Vice President-elect Harris on the anniversary of Guru Nanak Dev Ji's birth: https://t.co/GOQXHk64pb President-elect Biden believes this is no time to build back to the way things were before—with the old economy's structural weaknesses and inequalities still in place. \n\nThis is the moment to build a new American economy that works for all.\nhttps://t.co/G86xVtLDIE RT @neeratanden: After my parents were divorced when I was young, my mother relied on public food and housing programs to get by. Now, I’m… It’s time to rebuild an American economy that works for all of our families and the next generation.\n\nIt’s time to ensure every American enjoys an equal chance to get ahead.\n\nIt’s time to build our economy back better. https://t.co/bRlXXXL3Fo RT @HBoushey: My life's work has been centered on ensuring our families and work are properly valued within our economy. \n\nI’m excited to b… RT @wallyadeyemo: Public service is about offering hope through the dark times and making sure that our economy works not just for the weal… RT @CeciliaERouse: I am focused on the task ahead. This job is about advising the President on how to rebuild and revive our economy. The p… RT @JanetYellen: We face great challenges as a country right now. To recover, we must restore the American dream—a society where each perso… This crisis-tested team will help lift America out of our current economic downturn and build back better—creating an economy that gives every single American a fair shot and an equal chance to get ahead. \nhttps://t.co/F6JMBHUgVx We all have a role to play in beating this crisis—every decision matters. Every decision we make can save lives. https://t.co/XrMZWoTaT4 President-elect Biden and Vice President-elect Harris today announced new members of the White House staff who will serve in senior communications roles.\n \nFor the first time in history, these communications roles will be filled entirely by women.\nhttps://t.co/SjWAWJg941 The Biden-Harris administration will always listen to science and ensure public health decisions are informed by public health experts.\n \nToday, we announce additional members joining the Transition COVID-19 Advisory Board: https://t.co/FR7aWzwus4 Our frontline workers are American heroes. It is not enough to just praise them, we have to listen to them and pay them.\n\nThe Biden-Harris administration will listen to frontline workers and will lead by their example to combat this pandemic. https://t.co/sCzXfJRQj2 We've fought a nearly year-long battle with COVID-19, but President-elect Biden reminds us that we're at war with a virus--not each other. \n\nWe're all in this together. https://t.co/9GxaZy3c4E Today, we honor Indigenous communities and their ancestors. This Native American Heritage Day, let us reflect &amp; celebrate their contributions &amp; rich heritage.\n\nThe Biden-Harris administration will build strong partnerships with Native communities to ensure opportunities for all. The moment has come for our country to deal with systemic racism, to deal with growing inequality, and to deal with the denial of the promise of this nation to so many.\nhttps://t.co/zmFstgxdM4 This Thanksgiving, we reflect on this past year and think about what lies ahead. We know these times are hard, but we know that we will overcome this current crisis together as a nation. We are all in this together. \n\nHappy Thanksgiving. \"This Thanksgiving —\nAnd in anticipation of all the Thanksgivings to come —\nLet's dream again.\nLet's commit ourselves to thinking not only of\nourselves but of others.\" — President-elect Joe Biden https://t.co/O5psOkW0cL \"America at its best still has a greater ability than any other country on Earth to bring others together to meet the challenges of our time.\" — Nominee for Secretary of State, @ABlinken https://t.co/SRJyazqtDV RT @AliMayorkas: For twelve years I had the privilege to stand in a federal courtroom and announce, “Alejandro Mayorkas on behalf of the Un… Tune in as President-elect Biden shares a special Thanksgiving message on the shared sacrifices Americans are making this holiday season and how we will get through the current crisis together. https://t.co/fvEPktNyrr Statement by President-elect Joe Biden on the International Day for the Elimination of Violence Against Women. https://t.co/Sm3w5ABqQ6 The presidential transition continues to move forward. \n\nJoin Jen Psaki, Advisor to the Biden-Harris Transition and our Executive Director Yohannes Abraham, for a press briefing on the latest: https://t.co/RWZ7zypOu1 \"Let’s begin that work to heal and unite America as well as the world.\" — President-elect Joe Biden https://t.co/rwDZXBu3ct \"For the first time ever, there will be a principal on the National Security Council who will make sure climate change is on the agenda in the Situation Room.\" — President-elect @JoeBiden on appointing @JohnKerry as the Presidential envoy on climate. https://t.co/chVuorXLi6 Statement by President-elect Biden on General Motors’ announcement yesterday: https://t.co/mGrBER9kA5 RT @JohnKerry: The president-elect is right to rejoin the Paris Agreement on Day One. And he is right to recognize that Paris alone is not… These public servants will restore America's global leadership and moral leadership. They will reimagine American foreign policy and national security for the next generation. \n\nAnd they will tell President-elect Biden what he needs to know, not what he wants to know. https://t.co/UXQFYippsc ICYMI: Readout of President-elect Biden's call with Prime Minister Jacinda Ardern of New Zealand earlier this week. https://t.co/Iwkwef9mi5 RT @LindaT_G: In my thirty-five years in the Foreign Service across the world, I put a Cajun spin on it. I call it Gumbo diplomacy.\n\nWherev… We have assembled a team of highly respected and qualified individuals to serve as national security and foreign policy leaders. Tune in as President-elect Biden &amp; Vice President-elect Harris introduce them. https://t.co/bQpSiT1GHY President-elect Biden took part in separate congratulatory calls yesterday with the leaders of the European Commission, European Council, Jordan, and NATO.\nhttps://t.co/YRWHGnsZ5O Statement by Biden-Harris Transition Executive Director Yohannes Abraham. https://t.co/lPflye5iTO We have gathered the most respected and qualified individuals to serve during our first National Security appointments. This group will put us on a path to restore our relationships abroad, and renew our safety here at home.\nhttps://t.co/geWIRirste RT @ABlinken: The messages from friends and colleagues that I’ve received over the past 15 hours have been humbling. \n\nHonored to announce,… RT @jakejsullivan: President-elect Biden taught me what it takes to safeguard our national security at the highest levels of our government… RT @AliMayorkas: When I was very young, the United States provided my family and me a place of refuge. Now, I have been nominated to be the… RT @JohnKerry: America will soon have a government that treats the climate crisis as the urgent national security threat it is. I'm proud t… RT @LindaT_G: My mother taught me to lead with the power of kindness and compassion to make the world a better place. I’ve carried that les… Under the Biden-Harris administration, American national security and foreign policy will be led by experienced professionals ready to restore principled leadership on the world stage and dignified leadership at home. Read more: https://t.co/ojrTxrzafV Our White House Senior staff will work with President-elect Biden and Vice President-elect Harris to implement a bold agenda that will build our nation back better than before and ensure every American has a fair shot.\nhttps://t.co/ruN2HkW4P5 It’s time to rebuild our economy better than before—so that this time everyone is in on the deal.\n\nPresident-elect Biden has a plan to ensure every American has an equal chance to get ahead.\n\nhttps://t.co/zVjm3uVCPe More than 250,000 Americans have died from COVID-19.\n\nTo the families who have lost loved ones — our thoughts are with you.\n\nPresident-elect Biden and Vice President-elect Harris will fight every day to contain COVID-19. Today, President-elect Biden and Vice President-elect Harris met with Speaker Pelosi and Democratic Leader Schumer to discuss their shared priorities to provide help to struggling working families and small businesses. https://t.co/vo2yzh5Sbj Statement by President-elect Biden on Transgender Day of Remembrance: https://t.co/CghbBwRtq5 https://t.co/P4Q1DVJfxp Tune in as we discuss the delay in ascertainment and how we are moving forward for a smooth transition. https://t.co/El8RemDBwU President-elect Biden continues to assemble a White House Senior Staff that looks like America, recognizes the challenges Americans face, and is committed to delivering working families results on Day One.\nhttps://t.co/tQ5HdhqK1w The Biden-Harris transition will listen to science, be driven by honesty, and reflect the positive character of the American people. Governors are working tirelessly to protect Americans during these unprecedented times.\n\nToday, President-elect Biden &amp; Vice President-elect Harris met with @NatlGovsAssoc. Tune in for their remarks: https://t.co/pnLu9IVhIP The Biden-Harris administration will act swiftly and aggressively to help protect and support the frontline health care workers helping us face this pandemic. Tune in as President-elect Biden participates in a virtual roundtable with frontline workers: https://t.co/mGcpbDOc9G President-elect Biden took part in separate congratulatory calls today with leaders in Chile, India, Israel, and South Africa: https://t.co/geWMmDNNYO https://t.co/rEBxMETvWM Jen O’Malley Dillon will serve in the Biden-Harris White House as Deputy Chief of Staff. https://t.co/d2BEaAjFnJ Congressman Cedric Richmond will serve in the Biden-Harris White House as Senior Advisor to the President and Director of the White House Office of Public Engagement. https://t.co/DzI24x7mVH Our White House senior staff is composed of individuals who demonstrate the President-elect's commitment to building an administration that looks like America, has expertise in governing, and will be ready deliver results for working families on Day One.\n\nhttps://t.co/MXnMExXAFp https://t.co/DaWmRI8PRk This is the moment to imagine and build a new American economy for our families and the next generation.\n\nTune in as President-elect Biden delivers remarks on how we can build back better: https://t.co/ofo7h7VxxN On today's anniversary of the Clean Air Act, the task of protecting the air we breathe has never been more urgent or more vital.\n\nOur administration will deliver on the goals of the Clean Air Act, while meeting this moment in history to address the climate crisis. We face four historic crises.\n\nThe worst pandemic in a century. The worst economic crisis since the Great Depression. The most compelling call for racial justice since the 60s. And the undeniable threat of climate change.\n\nWe're preparing to tackle these challenges on Day One. https://t.co/534ZoGNqTt The presidential transition is moving full speed ahead. Join our press briefing for updates on where we stand: https://t.co/grAzzVzDCr Readout of President-elect Biden's conversation with House Speaker Nancy Pelosi and Senate Democratic Leader Chuck Schumer: https://t.co/mfn6lGPgAc https://t.co/O388Jhlu1O President-elect Biden spoke this morning with His Holiness Pope Francis. https://t.co/om635SC3M9 https://t.co/DYuiiphOE0 President-elect Biden took part in separate congratulatory calls this evening with the leaders of Australia, Japan, and the Republic of Korea.\n\nhttps://t.co/u0wd70i1y3 https://t.co/09AqoO8875 Ronald Klain will serve President-Elect Biden as White House Chief of Staff. https://t.co/hERLdgML6n Together, as a nation, we pause to honor the service, the valor, and the commitment of all those who have worn the uniform of the Armed Forces of the United States.\n\nThose who have fought and sacrificed for our country are heroes who have earned our thanks and respect. Today, President-elect Joe Biden took part in separate congratulatory calls with the leaders of France, Germany, Ireland, and the United Kingdom. https://t.co/vCyAVVF3qw Agency review teams are an integral part of the transition process, responsible for evaluating the operations of federal agencies.\n\nOur teams are composed of diverse experts with deep policy expertise, ready to ensure we're prepared to lead on Day One.\n\nhttps://t.co/2gY1E0Ey5k It's wrong for healthcare to be made less accessible and more expensive––especially during a global pandemic.\n\nThe Biden-Harris administration will fight to protect and expand the Affordable Care Act, so every American has access to quality, affordable health care. President-elect Biden and Vice President-elect Harris deliver remarks on the stakes for families across the country in Texas v. California, the Trump administration’s lawsuit to overturn the Affordable Care Act. https://t.co/8Oc8fafdkm Right now, the most potent weapon against this virus is a mask. It is our shared duty to protect our fellow Americans as we wait for a vaccine. https://t.co/YGvdkSM08Q Today, President-elect Biden thanked Prime Minister Trudeau for his congratulations and reaffirmed the close bonds between the United States and Canada. https://t.co/DFnfdL2Qbp President-elect Biden promised to ensure public health decisions are informed by public health experts. We are making good on that promise.\n\nToday, we announced a COVID-19 advisory board to provide science-based guidance for navigating this pandemic: https://t.co/z0nuAkWPcu https://t.co/524nqj4IKJ President-elect Biden just met with his newly formed COVID-19 advisory board.\n\nTune in for a debrief:  https://t.co/fVLhCn6adH Statement by President-elect Biden on Pfizer's vaccine progress: https://t.co/eOiLZnqO8N The President-elect spoke with former President Bush this morning. https://t.co/fYx2Lux6OM The task ahead of the Biden-Harris administration is unlike any other in our history.\n\nIn preparation, our transition will be led by experts, by science, and with character—ensuring that we will be ready to lead on Day One. We are preparing to lead on Day One, ensuring the Biden-Harris administration is able to take on the most urgent challenges we face: protecting and preserving our nation's health, renewing our opportunity to succeed, advancing racial equity, and fighting the climate crisis. The work ahead in the next 73 days will be the foundation for an administration that puts the health, safety, and character of our communities first.\n\nLearn how the Biden-Harris transition will move forward at https://t.co/97NKAZksSL\n\nhttps://t.co/No1DQqI4gx We stand together as one America. We will rise stronger than we were before.\n\nhttps://t.co/97NKAZksSL https://t.co/PRvzygWxRI", "bag_of_tweets": ["Tune in for a briefing with Press Secretary Jen Psaki, Cecilia Rouse, and Heather Boushey. https://t.co/6Y27s5Mt3Y", "RT @VP: Last month I spoke with Astronauts Dr. Shannon Walker and Dr. Kate Rubins aboard the International Space Station. They are setting…", "RT @WHCOVIDResponse: In total, 84 million people -- about 1 in 3 adults -- have received at least one dose of the vaccine and more than 45…", "RT @WHCOVIDResponse: Our team is partnering with @usedgov for the National Safe School Reopening Summit.\n\n@CDCDirector will share best prac…", "“When I ran for president, I promised to build on the foundation of the Affordable Care Act. And just 50 days into my Administration, we delivered on that promise with the American Rescue Plan. Help is here.” — President Biden marking the anniversary of the Affordable Care Act https://t.co/7QtDqziPIS", "Big news: President Biden just announced we’re extending the special enrollment period for health insurance until August 15. Head to https://t.co/Z1ZSzQNxNn to get covered.", "Overall, the American Rescue Plan is expanding coverage and lowering costs for countless Americans — giving people the peace of mind that comes with access to quality, affordable care.", "It gives states the opportunity to extend coverage for a year to low-income women who have recently given birth, as well as cover community-based crisis intervention services for people experiencing a behavioral health crisis with additional Medicaid funding.", "The bill incentivizes states to expand coverage to an additional 4 million people with low incomes.", "It provides additional Medicaid funding to states to help strengthen their home and community-based services programs, which will help older adults and people with disabilities get the care they need in their homes during this critical time.", "The bill establishes more generous tax credits to the nearly 9 million Americans receiving financial assistance to purchase Marketplace coverage.", "The American Rescue Plan ensures no one will pay more than 8.5% of their income on their premium. For example, a family of four making $90,000 will see their premiums decrease by $200/ month.", "President Biden believes every single American deserves access to quality, affordable health care. Here’s a breakdown of how the American Rescue Plan helps make that a reality:", "Tune in as President Biden delivers remarks on the anniversary of the Affordable Care Act being signed into law. https://t.co/Do8SRE2bjR", "Tune in as President Biden delivers remarks on the shooting in Boulder, Colorado. https://t.co/ZsZlTX8FJh", "Big news: The Biden-Harris Administration set a new record this weekend with 6 million shots reported administered. We’re ramping up vaccination efforts every day to get America vaccinated quickly and equitably.", "Tune in for a briefing with Press Secretary Jen Psaki. https://t.co/OGs03VmiD9", "RT @WHCOVIDResponse: Over the weekend we set a new record with 6 million shots reported administered across the country. We’ve now got 81 m…", "President Biden’s American Rescue Plan is delivering direct relief to the American people, rescuing the American economy, and starting to beat the virus. Learn more: https://t.co/gebK83Hcu2", "Spring is in the air at the White House. https://t.co/AFsDJw1taP", "Before President Biden took office, the U.S. was administering an average of 900,000 COVID-19 vaccine doses a day.\n\nLast week, we averaged 2.5 million per day. https://t.co/fpDreVmwSn", "Spring is an eternal symbol of renewal and rebirth, with light and hope filling the hearts of people around the world—that’s the message and the joy of Nowruz that we're honoring with a Haft-Sin table in the White House.\n\nFrom President Biden and our Administration, happy Nowruz! https://t.co/xGu7OroLrY", "Jocelyn is a hardworking mother, grandmother, and wife — and like many Americans, the pandemic has greatly impacted her family. This week, President Biden gave her a call to discuss how the American Rescue Plan is here to help. https://t.co/OSSYEmY50M", "Today, President Biden and Vice President Harris met with Asian American leaders in Atlanta to discuss Tuesday’s attacks and the ongoing violence against the community. Our Administration is committed to building a future where everyone can live with safety, dignity, and respect. https://t.co/IEdz4aJiXY", "“We have to speak out. We have to act.” — President Biden on the rise in violence against Asian Americans https://t.co/EwPUl7UM24", "Tune in as President Biden delivers remarks from Atlanta, Georgia. https://t.co/kM81qtjrDK", "Today, President Biden urged Congress to swiftly pass the COVID-19 Hate Crimes Act. The law will expedite the government’s response to the rise of hate crimes exacerbated during the pandemic. https://t.co/VdvXRcIR04", "Big News: President Biden announced that tomorrow, our Administration will hit 100 million COVID-19 shots administered. \n\nThat’s after just 58 days in office — and 42 days ahead of schedule.", "Altogether, the American Rescue Plan provides over $40 billion in relief to help Americans keep a roof over their head during the pandemic. Help is here.", "It provides help for rural communities with $100 million in rental assistance through the USDA — and $39 million for USDA Section 502 and 504 home loans to help low and very-low income borrowers purchase, repair, and rehabilitate housing in rural areas.", "The bill includes $750 million in support for Native Americans and Native Hawaiians to help reduce housing-related health risks during the pandemic.", "It provides $5 billion for emergency housing vouchers for people experiencing or at risk of homelessness — as well as $5 billion for the HOME Investment Partnerships Program to help create housing and services for people experiencing or at risk of homelessness.", "The bill includes $10 billion to help homeowners behind on their mortgage and utility payments — helping avoid foreclosures.", "The American Rescue Plan provides more than $21.5 billion in emergency rental assistance to help millions of families keep up on their rent and remain in their homes.", "Across the country, millions of Americans are struggling to keep a roof over their head. Here’s a breakdown of how the American Rescue Plan will help:", "Tune in as President Biden delivers remarks on the state of vaccinations. https://t.co/nQeEKk8uk3", "Tune in for a briefing with Press Secretary Jen Psaki and Secretary of Housing and Urban Development Marcia L. Fudge. https://t.co/GhansX94m1", "Our Administration is working hard to put shots in arms and money in pockets of the American people. Help is here. https://t.co/Tx6Qfd26iD", "Tonight, the White House was illuminated green to celebrate St. Patrick’s Day and the rich bond between the United States and Ireland. https://t.co/tldvbriMyF", "Today, Ireland Prime Minister Micheál Martin presented a bowl of shamrocks to President Biden — a tradition that dates back to 1952 with President Truman. Although they were physically apart, the President and the Taoiseach renewed the close friendship between our two nations. https://t.co/lHXdy9pYkX", "How will the American Rescue Plan help you? Watch as White House Communications Director Kate Bedingfield explains: https://t.co/eKGcg3bqt0", "Tune in for a briefing with Press Secretary Jen Psaki and Secretary of Education Miguel Cardona. https://t.co/yojJc3MP9h", "White House. Green fountain. Happy St. Patrick’s Day! 🍀 https://t.co/udHYr7PAtk", "Happy St. Patrick’s Day from the Biden-Harris White House! https://t.co/dOVrhKFm5K", "Altogether, the American Rescue Plan will invest over $60 billion in our small businesses to ensure they have the resources necessary to make it through this pandemic.", "Our Administration will invest $10 billion in successful state, local, and tribal small business financing programs to help small businesses innovate, create and maintain jobs, and provide the essential goods and services that communities depend on.", "We’re going to bolster the Paycheck Protection Program with an additional $7.25 billion in funding to support small businesses and non-profits that were previously excluded.", "The bill provides $28 billion for a new grant program to support hard-hit small restaurants and other food and drinking establishments.", "The American Rescue Plan allocates $15 billion in flexible grants to help the smallest, most severely impacted businesses persevere through the pandemic.", "Across the country, millions of small businesses are struggling to keep their doors open. Here’s a breakdown of how the American Rescue Plan will help:", "The American Rescue Plan is ramping up vaccinations and sending direct payments to 85% of American households — putting shots in arms and money in pockets. https://t.co/6fzm5PXxXi", "Today, President Biden announced we are days away from 100 million shots in people’s arms and 100 million checks in people’s pockets — delivering on his promise that help is on the way. https://t.co/MdAGNdt7Bh", "Today, President Biden announced Gene Sperling will oversee the implementation of the American Rescue Plan — ensuring the benefits of the bill go out quickly, equitably, and directly to the American people. https://t.co/BEKAMA4lFs", "RT @WHCOVIDResponse: Over the weekend, we administered nearly 6 million doses of the COVID-19 vaccine. \n\nToday, for the first time on a Mon…", "Tune in as President Biden delivers remarks on the implementation of the American Rescue Plan. https://t.co/u03Gg7WobL", "Tune in for a briefing with Press Secretary Jen Psaki. https://t.co/xuLSKRTJGl", "Four presidents.\nTwo political parties.\nOne clear message: Get vaccinated when it’s available to you. https://t.co/nXOCsqKOGF", "President Biden’s American Rescue Plan includes direct checks for 85% of American households. Wondering how much you’ll receive and when you should expect it? Check out our guide: https://t.co/2e3F66YrVk", "The Biden-Harris Administration has been working around the clock to get America vaccinated. We’ve doubled daily vaccinations, secured enough doses for every American, and opened hundreds of sites across the country. Here’s a breakdown of our progress: https://t.co/q6V8mnZRpK", "On Thursday, President Biden signed the American Rescue Plan — a historic legislative package that will tackle the crises we face and give hardworking Americans a fighting chance. Help is here. https://t.co/owz7RhpLM0", "This week, President Biden stopped by W.S. Jenks &amp; Son — a historic hardware store in Washington, D.C. Check out his visit in the latest weekly conversation: https://t.co/0MAdMTixE2", "President Biden’s American Rescue Plan will deliver $1,400 checks to help Americans get through this crisis. Watch as people share how they plan to use theirs: https://t.co/o8DT801fAr", "This morning, President Biden hosted his first multilateral summit as president. During the meeting with the Quad, the President and leaders of Japan, India, and Australia recommitted to working together to secure a free and open Indo-Pacific region. https://t.co/Fa2d6T9oPS", "Tune in as President Biden and Vice President Harris deliver remarks on the American Rescue Plan. https://t.co/5NUiFT8Wxu", "Tune in for a briefing with Press Secretary Jen Psaki and National Security Advisor Jake Sullivan. https://t.co/jR6k3k87Li", "Tune in as President Biden addresses the nation on the anniversary of the COVID-19 shutdown. https://t.co/EYhEaYRdzN", "How will the American Rescue Plan impact you? Share your story with us: https://t.co/vzKBKUMUaC", "Tune in for a briefing with Press Secretary Jen Psaki. https://t.co/RMdbkxxljk", "Tune in as President Biden signs the American Rescue Plan. https://t.co/ZfpKjSkA8w", "Congress has officially passed President Biden’s American Rescue Plan. How will this help you and your family? Head to https://t.co/80skBjycjD to learn more. https://t.co/l4LsCA4UGx", "Today, President Biden announced our Administration will purchase 100 million additional doses of the Johnson &amp; Johnson vaccine. This move will ensure we have more than enough vaccines for every American and prepare our nation for unexpected challenges. https://t.co/Bvgsi7etw9", "President Biden’s American Rescue Plan has officially been passed by Congress — and that means $1,400 checks are on the way. https://t.co/dKh2t3uOG3", "Tune in as President Biden hosts an event with the CEOs of Johnson &amp; Johnson and Merck. https://t.co/GSrYk9wLqh", "From $1,400 checks and unemployment relief to vaccines for every American — help is here. https://t.co/R0AYaTbkTV", "Big news: Congress just passed President Biden’s American Rescue Plan – a historic legislative package that will turn the page on this pandemic, deliver direct relief to Americans, and jumpstart our economy.", "Tune in for a briefing with Press Secretary Jen Psaki and Ambassador Roberta Jacobson. https://t.co/2JqJd0Ft5a", "RT @WHCOVIDResponse: We're leading the world in vaccinations.\n\nOn January 20th, the 7-day average was 890,000 shots per day. \n\nToday we're…", "Last month, W.S. Jenks &amp; Son applied for a Paycheck Protection Program loan during the exclusive two-week window President Biden established for small businesses. Yesterday, the President stopped by to see firsthand how it’s helped them get through these crises. https://t.co/jnI8kbdGWF", "The American Rescue Plan will help fuel a national vaccination program to quickly and equitably vaccinate America. https://t.co/qKFpHtA5f7", "RT @WHNSC: Historic: This is the first meeting of the #Quad at the leader level. @POTUS and this administration are committed to working wi…", "President Biden is urging Congress to pass the American Rescue Plan and provide financial assistance to prevent homeowners, renters, and small landlords from falling behind on payments.", "Tune in for a briefing with Press Secretary Jen Psaki and Bharat Ramamurti. https://t.co/xAdfyOP7NL", "“Let us recommit to the principle that our nation, and the world, is at its best when the possibilities for all of our women and girls are limitless.” — President Biden marking #InternationalWomensDay https://t.co/vxMme0O677", "“For our Administration, honoring women means investing in them each and every day.” — President Biden marking #WomensHistoryMonth https://t.co/FYKkQFaSGg", "Tune in as President Biden, Vice President Harris, and Defense Secretary Austin deliver remarks with two Combatant Commander nominees on International Women’s Day. https://t.co/1xSsQ67Jka", "Today, President Biden signed two executive orders to establish the White House Gender Policy Council and ensure education free from sexual violence. Learn more: https://t.co/Bnh0o4Oq1z", "We cannot rebuild our economy until we control the virus. President Biden is urging Congress to pass the American Rescue Plan which will create 100,000 new public health jobs to help vaccinate, test, and beat COVID.", "RT @CDCgov: #COVID19 vaccines are effective at protecting you from getting sick. Based on what we know, people who have been fully vaccinat…", "Tune in for a briefing with Press Secretary Jen Psaki, Julissa Reynoso, and Jennifer Klein. https://t.co/cYvTn7E7pq", "Last week, the Biden-Harris Administration: \n\n- Began administering the single-dose Johnson &amp; Johnson vaccine\n- Secured enough vaccines for every American by the end of May\n- Increased weekly vaccine shipments to 18 million doses\n\nWe’re working hard to quickly vaccinate America.", "Today, to mark the 56th anniversary of Selma with actions and not just words, President Biden signed an Executive Order to promote voting access and allow all eligible Americans to participate in our democracy.", "“Let’s remember those who came before us as a bridge to our history so we don’t forget its pain, and as a bridge to our future so we never lose hope.” — President Biden marking the 56th anniversary of Bloody Sunday https://t.co/oVDXFb2jlD", "Tune in as President Biden delivers remarks on the Senate’s passage of the American Rescue Plan. https://t.co/ldqhB23Wuk", "Tammy is a health care professional and single mother of four children — and like countless other Americans, she’s struggling to get through this crisis. President Biden called to discuss the American Rescue Plan and how it will provide direct relief to families like hers. https://t.co/lGmTw5fPUO", "President Biden knows there’s no time to waste. He’s urging the Senate to quickly pass the American Rescue Plan to provide Americans the direct relief they need. https://t.co/sHMo5cZtA9", "“This moment is unique – and we are mandated by our oath of office to meet this moment.” – Senator @ChrisMurphyCT on the urgent need to pass the American Rescue Plan https://t.co/YlvD0EULQ8", "Tune in as President Biden participates in a roundtable on the American Rescue Plan. https://t.co/KsfOjREF3p", "Tune in for a briefing with @PressSec Jen Psaki. https://t.co/8PUUfvFJHF", "Today’s jobs report shows welcome growth, but there is a long road ahead. If job growth continues at February’s pace, it will take more than two years just to get back to pre-pandemic levels. \n\nCheck out this thread for a full picture on today’s numbers: https://t.co/bXrCHmkdpO", "Today's report shows the economy added 379,000 jobs in February. It’s welcome growth, but we remain down 9.5 million jobs from pre-pandemic levels. \n\nIt's time for the Senate to pass the American Rescue Plan to give our economy the jumpstart it needs. https://t.co/WevgXUYqqk", "President Biden is calling on the Senate to pass the American Rescue Plan and finish the job of delivering $2,000 in direct relief to those who need it.", "Press Secretary Jen Psaki is back again to answer your questions. This week, she’s discussing everything from our vaccination progress to her favorite part of the job. Check it out: https://t.co/TbIqg9XM3v", "RT @WHCOVIDResponse: This week, team @OSUWexMed administered some of the first Johnson &amp; Johnson COVID-19 vaccines -- the only single-dose…", "Tune in for a briefing with Press Secretary Jen Psaki and Secretary of Veterans Affairs Denis McDonough. https://t.co/ksexOf8U4k", "Because of President Biden’s historic action, we’ll have enough vaccines for every American two months earlier than expected. https://t.co/ktuSIwbaTB", "A new poll from Morning Consult shows that 77% of Americans support the American Rescue Plan — including 59% of Republican voters. \n \nThat’s unity.", "In the two weeks since the Biden-Harris Administration opened a special enrollment period for health insurance, over 200,000 Americans have gotten covered. Join them and head to https://t.co/Z1ZSzQNxNn to sign up today.", "Tune in for a briefing with @PressSec Jen Psaki. https://t.co/uyfCWfSSNC", "RT @WHCOVIDResponse: WATCH NOW: This morning Dr. Fauci and Dr. Walensky are back for another COVID-19 briefing, joined by response team sen…", "Our nation is facing two major crises — an economic crisis brought on by a public health crisis. President Biden is calling on the Senate to address both by passing the American Rescue Plan immediately.", "Across the country, over thirty states have taken steps to prioritize educators for vaccination. Today, President Biden is directing remaining states to do the same — with the goal of every educator receiving at least one shot by the end of March.", "Today, President Biden announced a breakthrough collaboration between Johnson &amp; Johnson, Merck, and the federal government to ramp up vaccine production. Because of these efforts, we will have enough vaccines for every American by the end of May–two months earlier than expected.", "Tune in as President Biden announces a new partnership between Johnson &amp; Johnson and Merck and gives an update on our efforts to defeat COVID-19. https://t.co/qOB7tvf7O0", "It's time to finally get COVID-19 under control and give families the bridge they need to get through this economic crisis. Here’s how the American Rescue Plan will get it done: https://t.co/Em6MOulirJ", "RT @WHCOVIDResponse: We've shared with governors that we’re increasing weekly supply of Pfizer and Moderna vaccines to 15.2 million doses p…", "Tune in for a briefing with @PressSec Jen Psaki. https://t.co/2eiZJvpShh", "This afternoon, President Biden hosted Mexican President Andrés Manuel López Obrador for a virtual bilateral meeting. Both leaders committed to working together to address migration, combat COVID-19, reinvigorate economic cooperation, and deepen U.S.-Mexico security cooperation. https://t.co/fcBVolo6gb", "The American Rescue Plan will launch community vaccination centers and deploy mobile vaccination units in hard to reach areas — making sure everyone who wants one has access to vaccines.", "“In five weeks, America has administered the most shots of any country in the world — any country in the world — with among the highest percentage of population fully vaccinated. That’s progress we promised.” — President Biden while marking 50 million shots since he took office https://t.co/UzfEopKPGN", "Tune in for a briefing with Press Secretary Jen Psaki and Secretary of Homeland Security Alejandro Mayorkas. https://t.co/dZvroiKm1q", "RT @WHCOVIDResponse: WATCH: Today, our public health experts are joined by COVID-19 response team coordinator Jeff Zients to talk through a…", "To celebrate Black History Month, the St. Augustine Gospel Choir was invited to the White House for a special performance. Watch here: https://t.co/dLc6JpWBVo", "Last week, the Biden-Harris Administration:\n\n- Reached 50 million vaccinations\n- Announced the shipment of 25 million masks\n- Increased weekly vaccine supply to 14.5 million doses\n- Opened vaccination sites across the country\n\nWe’re working hard to beat COVID-19.", "RT @WHCOVIDResponse: The Food and Drug Administration has issued an emergency use authorization for a third safe and effective vaccine to h…", "RT @VP: I spoke with @NASA Astronaut and @USNavy Commander Victor J. Glover aboard the International Space Station. @AstroVicGlover is maki…", "Tune in as President Biden delivers remarks on the American Rescue Plan. https://t.co/EjnSg2zDSD", "Erica is a nurse in New York City and runs COVID-19 testing at one of the hardest-hit hospitals in the country. President Biden called her to check in and discuss what the federal government can do to help. Take a look: https://t.co/YVVV45EETy", "Tune in as the President, First Lady, Vice President, and Second Gentleman host a White House Black History Month Celebration. https://t.co/r059eDt4qQ", "Tonight, the President, First Lady, Vice President, and Second Gentleman are coming together to host a virtual Black History Month Celebration. Make sure to tune in at 8 PM ET to watch. https://t.co/N7w4yKFTkb", "Tune in as President Biden delivers remarks at the FEMA COVID-19 vaccination facility at NRG Stadium. https://t.co/RbcsLhGvJz", "Since taking office, the Biden-Harris Administration has:\n\n- Administered over 50 million vaccine shots\n- Nearly doubled the pace of vaccinations\n- Increased distribution to states by 70%\n\nWe’re working hard to get America vaccinated as quickly as possible.", ".@POTUS spoke with President Kenyatta yesterday and applauded Kenya’s leadership and commitment to democracy, human rights, economic growth, and sustainable development. The U.S.-Kenya relationship is strong and is critical to addressing issues in the Horn of Africa.", "RT @WHCOVIDResponse: TUNE IN: This morning our public health experts are joined by senior advisor Andy Slavitt to deliver updates on vaccin…", "The bottom line is American families, workers, states, and schools are struggling and deserve immediate relief. The risk isn’t that we do too much — it’s that we don’t do enough.", "Countless small businesses across the country are on the brink of closing their doors. The American Rescue Plan will provide grants to struggling businesses — helping them stay open and emerge stronger from this pandemic.", "The American Rescue Plan will incentivize companies to provide paid sick leave to their employees — because no one should have to choose between their health and a paycheck.", "The American Rescue Plan will triple the number of community health jobs — helping to contain the virus by scaling tracing capacity and ensuring every American who wants a COVID-19 test will be able to get one.", "The American Rescue Plan will launch a bold national vaccination program to make vaccines free and accessible for every American, end supply shortages, set up community vaccination sites, and distribute vaccines equitably.", "The American Rescue Plan will help safely reopen our nation’s K-8 schools by reducing class sizes and modifying spaces to create safe learning environments. It’ll provide the resources needed to get children back in school and parents back to work.", "The American Rescue Plan will provide a much-needed emergency financial boost for parents. That means if you’re a parent with a kid over six you’ll get an additional $1,000. If your kid is under six, you’ll get an additional $1,600.", "Across the country, millions of Americans are struggling to keep a roof over their head. The American Rescue Plan will provide $40 billion in housing assistance to ensure no one loses their home in the middle of this pandemic.", "Right now, over 10 million children don’t have enough to eat. The American Rescue Plan will supplement existing food programs like SNAP to help ensure no child in America goes hungry.", "If Congress fails to act, more than 11 million people will start to lose unemployment insurance benefits on March 14. The American Rescue Plan will extend and expand unemployment insurance and provide a weekly $400 supplement.", "1 in 3 households are struggling to pay for usual household expenses through no fault of their own. The American Rescue Plan will complete the $2,000 stimulus checks with direct $1,400 payments — delivering much-needed relief to people across the country.", "President Biden’s American Rescue Plan is a bold, comprehensive legislative package that will provide direct relief to Americans, contain COVID-19, and rescue the economy. Check out the thread below for a breakdown of what’s in the bill.", "RT @SecMayorkas: Sixty years ago, my parents brought my sister and me to the United States to build a new home for our family. Today, I am…", "Tune in as President Biden delivers remarks on America administering its 50 millionth COVID-19 vaccine shot since he took office. https://t.co/jc5vHqb4Lp", "Right now in America, around 10 million children live in poverty. Watch as Deputy Director of the NEC Bharat Ramamurti explains how the American Rescue Plan will cut that number in half: https://t.co/IUVFpEkXc8", "Tune in for a briefing with @PressSec Jen Psaki. https://t.co/nRYc1jKTnE", "Yesterday, @POTUS and @AmbRice46 hosted a virtual roundtable to listen to the experiences of Black essential workers during the pandemic. Watch here as Jeff Carter shares his story: https://t.co/bgQeve8aju", "On Friday, President Biden toured a Pfizer manufacturing plant in Michigan to see the vaccine production process firsthand and encourage Americans to get vaccinated when it’s their turn. Take a look: https://t.co/JZeCebn9ZC", "Big news: The Biden-Harris Administration is delivering more than 25 million masks to community health centers, food pantries, and soup kitchens across the country — reaching some of the nation’s most vulnerable populations. https://t.co/hkGHnJmCPr", "Tune in as President Biden signs an executive order to secure America’s critical supply chains. https://t.co/G9G2EtGbHz", "How it started.            How it’s going. https://t.co/3zYLLt4a1X", "Tune in for a briefing with Press Secretary Jen Psaki, Deputy Director of the NEC Sameera Fazili, and Senior Director for International Economics and Competitiveness Peter Harrell. https://t.co/ScD2izNnNr", "RT @WHCOVIDResponse: WATCH: Jeff Zients will share an update on our public health and vaccination efforts followed by a state of the pandem…", "Starting today, the Biden-Harris Administration is opening an exclusive 14-day PPP loan application period for companies and nonprofits with fewer than 20 employees. Head to https://t.co/slFWiCx2W0 to learn more. https://t.co/zVzm0xNn1q", "Tune in as President Biden and Prime Minister Trudeau give statements on their first bilateral meeting. https://t.co/Nd4v6LsfNt", "RT @WHCOVIDResponse: This afternoon, we announced that we’re increasing the weekly vaccine supply to states to 14.5 million doses starting…", "Tune in for a roundtable discussion with President Biden, Domestic Policy Advisor @AmbRice46, and Black essential workers. https://t.co/1dBDBwSGTL", "Tune in for a briefing with @PressSec Jen Psaki. https://t.co/tfFaxHO5JW", "Watch as @CDCDirector Dr. Walensky answers some of today’s most pressing questions on COVID-19. https://t.co/NYEeA5bQND", "“Today, I ask all Americans to remember — remember those we lost and those who are left behind.” — President Biden on the more than 500,000 lives lost to COVID-19 https://t.co/KtABRcpLHH", "Tune in as President Biden delivers remarks and observes a moment of silence for the lives lost to COVID-19. https://t.co/5oNg5jahuS", "RT @WHCOVIDResponse: WATCH NOW: Today’s COVID-19 briefing features a science update from Dr. Fauci, a state of the pandemic update from Dr.…", "The Biden-Harris Administration has made delivering equitable relief to the hardest-hit small businesses a top priority. Today, we’re announcing additional steps to help small businesses survive, reopen, and rebuild. https://t.co/ZThQ1CpgI9", "Tune in for a briefing with @PressSec Jen Psaki. https://t.co/I0BLp4ZLAd", "Tune in as President Biden makes an announcement related to small businesses. https://t.co/tMxf2r8ybi", "“If there’s one message to cut through to everyone in this country, it’s this: The vaccines are safe.” — President Biden after touring a Pfizer manufacturing site on Friday https://t.co/U3y2WAP3fO", "ICYMI: A special enrollment period for health insurance is open through May 15! Head to https://t.co/Z1ZSzQNxNn and get covered today. https://t.co/FscOAqpB58", "Today marks one month since President Biden and Vice President Harris took office. And during that month they’ve worked tirelessly to turn the page on the pandemic, jumpstart our economy, and tackle the crises we face. https://t.co/0QL3axgXFK", "Yesterday, President Biden took additional action to support Texas’ recovery by approving a disaster declaration — making federal funding available to affected individuals in counties across the state. https://t.co/1wAM0cVLIV", "RT @WHCOVIDResponse: Every single day, we are working to increase vaccine supply, increase places to get vaccinated, and increase the numbe…", "On Thursday, the Perseverance Rover landed on the surface of Mars — a historic moment in United States space exploration. President Biden called acting @NASA Administrator Steve Jurczyk to congratulate him and the team on their successful landing. https://t.co/ZUMahvYBeq", "53 million people provide unpaid care to family members and most also have full-time jobs — yet the vast majority don’t have access to paid family and medical leave. We need to support caregiving and our caregivers. We need national paid family and medical leave. #CaregiversDay", "You asked, and President Biden answered. Watch as he discusses stimulus checks, vaccine production, and more. https://t.co/AODx7y8rUZ", "Tune in as President Biden delivers remarks at a Pfizer manufacturing site in Kalamazoo, Michigan. https://t.co/U1CxlTDM55", "RT @WHCOVIDResponse: President Biden joined members of this team to talk frankly about how we change the course of this pandemic and answer…", "President Biden took action on his first day in office to rejoin the Paris Climate Agreement. Today, it officially goes into effect. https://t.co/OXR9HpuGZq", "RT @WHCOVIDResponse: WATCH NOW: Dr. Fauci is providing an update on vaccine science, Dr. Walensky is sharing the state of the pandemic, and…", "Tune in as President Biden delivers remarks at a special event hosted by the Munich Security Conference. https://t.co/yRIO0v7wGo", "Texas — Carbon monoxide poisoning is a major risk. If you’re struggling to stay warm, please do not:\n\n- Run generators indoors\n- Use gas appliances like stoves for heat\n- Sit in your car in the garage to stay warm\n\nVisit https://t.co/5WhFEK6B8u to find a warming shelter near you.", "Texas — If you’re without heat, head to https://t.co/5WhFEK6B8u to find a warming shelter near you or call 211 for additional assistance.", "Yesterday, President Biden approved the Oklahoma Emergency Declaration and ordered the federal government to provide state, tribal, and local governments the support they need.  https://t.co/oxYNCjmSmw", "Tune in for a briefing with @PressSec Jen Psaki. https://t.co/Aa2IKvnEqA", "In response to the ongoing situation in Texas, the President approved FEMA to send generators, diesel, blankets, and water to affected areas. We continue to monitor the region closely and are prepared to quickly process additional requests for assistance. https://t.co/jgKGoFcD7S", "As part of his National Strategy for the COVID-19 Response and Pandemic Preparedness, President Biden announced today a series of new actions to expand COVID-19 testing, improve the availability of tests, and better prepare for the threat of variants. https://t.co/EsRUAUvIx7", "Right now, as many as 11 million children don’t have enough food to eat. The American Rescue Plan will help change that by extending and investing in critical food programs. https://t.co/WkMe1Se8wh", "RT @ENERGY: Extreme cold weather has left millions without power in Texas and surrounding areas. Watch @DOEelectricity’s Acting Assistant S…", "RT @WHCOVIDResponse: Our 7-day daily average of 1.7 million doses administered compares to an average of 892k the week before President Bid…", "Tune in for a briefing with Press Secretary Jen Psaki and Deputy National Security Advisor for Cyber and Emerging Technology Anne Neuberger. https://t.co/oEoaqbJ8tN", "The Biden-Harris Administration opened a special enrollment period to ensure every American has the opportunity to sign up for health insurance. Head to https://t.co/Z1ZSzQNxNn to find the plan that works best for you. https://t.co/Pfy8dsW1Yv", "RT @WHCOVIDResponse: WATCH NOW: Dr. Fauci, Dr. Nunez-Smith and Dr. Walensky are joined this morning by COVID-19 Response Team coordinator J…", "Tonight, President Biden will answer Americans’ questions at a CNN Town Hall. Tune in at 9 PM ET / 8 PM CT to watch live. https://t.co/AVEHcuKDn7", "Big news: The Biden-Harris Administration is now sending 13.5 million vaccine doses to states each week — a 57% increase since President Biden took office. And starting this week, we’re doubling our direct shipments to local pharmacies to two million doses.", "We’re live on @Snapchat! Follow us for a look into what’s happening at the White House and updates on the work we’re doing.\n \nFind us on Snapchat by adding \"WhiteHouse\" as a friend or scanning the snapcode below: https://t.co/GOc6D2z31Q", "Press Secretary Jen Psaki is back for round two. Watch as she answers your questions on everything from the American Rescue Plan to pineapple on pizza: https://t.co/mGoKhCa7LU", "As millions of Americans struggle to make rent and mortgage payments, President Biden is continuing to take action to keep people in their homes. Today’s extension of forbearance and foreclosure protections will provide homeowners urgently needed relief. https://t.co/dZEgN6Q97e", "Over the weekend, President Biden approved the Texas Emergency Declaration and is working closely with state and local governments to provide the support they need.  https://t.co/QDUQkn7PU1", "RT @WHCOVIDResponse: Weekly vaccine doses delivered to states when President Biden first took office: 8.6 million doses\n\nWeekly vaccine dos…", "Tune in for a briefing with @PressSec Jen Psaki. https://t.co/H0F9yqwTLl", "Watch as White House Senior Advisor @Richmond46 discusses racial equity and the American Rescue Plan. https://t.co/1oOl10jnPS", "Open enrollment is back! Starting today and running through May 15, the Biden-Harris Administration is opening a special health insurance enrollment period to ensure every American has the opportunity to get covered. Head to https://t.co/Z1ZSzQNxNn and sign up today.", "“The American story isn’t a story of presidents, it’s a story of the American people — a story of courage, character, strength, and resilience.” — President Biden’s message on this Presidents’ Day https://t.co/VbmEO7u2ns", "Last week, our Administration:\n\n- Purchased enough vaccines for all Americans\n- Launched a Health Equity Task Force\n- Increased weekly vaccine shipments\n- Announced a community health center vaccination program\n\nWe’re committed to vaccinating America quickly and equitably.", "Countless small businesses across the country are struggling because of COVID-19 — businesses like NaanStop in Atlanta, Georgia. President Biden called owners Samir and Neal to discuss how his American Rescue Plan will help them get through the pandemic. https://t.co/xXyPBQMGak", "Today, the Centers for Disease Control and Prevention released new scientific guidelines on how to safely reopen America’s schools.\n\nRead President Biden’s full statement on the news: https://t.co/ofTfV3zygh", "The Biden-Harris Administration is working with state and local partners across the country to scale up vaccination efforts and get more shots into arms. This week, President Biden and Vice President Harris virtually toured one of those partnership sites in Arizona. Take a look: https://t.co/oWImhubNEY", "Tune in for a briefing with Press Secretary Jen Psaki, Detroit Mayor Mike Duggan, and Miami Mayor Francis Suarez. https://t.co/qlu3oYCiZz", "Across the country, 1 in 3 households are struggling to pay for usual household expenses. President Biden’s American Rescue Plan will finish the job of delivering $2,000 in direct relief and extend and expand unemployment insurance — helping those who are struggling the most. https://t.co/BmPWCjN8XM", "We don’t have to wait until 2025 to return to full employment. If passed, the American Rescue Plan will get the job done next year. https://t.co/QyP2xVtfcF", "1 in 6 children in the United States live in poverty. If passed, the American Rescue Plan will expand the child tax credit and cut the child poverty rate in half. https://t.co/firxhvvUky", "Tune in as President Biden delivers remarks to National Institutes of Health staff. https://t.co/Exv4n1fwbP", "How will the American Rescue Plan help vaccinate more Americans? Watch as Dr. Dara Kass explains: https://t.co/swhYpGcbbq", "Tune in for a briefing with @PressSec Jen Psaki. https://t.co/fQ1nY5gi8y", "“I’ve said for many years, less than one percent of Americans do what you do: put yourself on the line for the rest of the 99 percent of the Americans you represent. The 99 percent of us owe you.” — President Biden addresses Department of Defense personnel https://t.co/7HkP10QX9C", "President Biden believes now is the time for big, bold action. He’s calling on Congress to pass the American Rescue Plan to change the course of the pandemic and jumpstart our economy. https://t.co/vJ13DioTni", "RT @WHCOVIDResponse: The @VP set a blueprint for equity in our pandemic response during her time in the Senate and today, that vision for a…", "Tune in as @POTUS, @VP, and @SecDef deliver remarks to Department of Defense personnel. https://t.co/D9e4yVEIM8", "What is the American Rescue Plan and how will it help you and your family? Watch to find out: https://t.co/T0FKlg1aF6", "Tune in as President Biden delivers remarks on the Administration’s response to the coup in Burma. https://t.co/Kn5j3KFegL", "Tune in for a briefing with @PressSec Jen Psaki. https://t.co/KA8IRaNyMH", "RT @WHCOVIDResponse: WATCH NOW: At this morning's briefing we'll hear from Jeff Zients and Dr. Nunez-Smith on our progress, as well as get…", "Across the country, millions of Americans are struggling to keep a roof over their head. The American Rescue Plan will extend the moratorium on evictions and foreclosures to ensure no one loses their home in the middle of this pandemic. https://t.co/Ijz6t8pKVU", "1 in 7 households are struggling to purchase the food they need. The American Rescue Plan will extend and invest in critical food programs to help ensure no one in America goes hungry. https://t.co/tOx4jq6SQX", "Unity. https://t.co/cqF8ilyMBC", "Tune in for a briefing with @PressSec Jen Psaki. https://t.co/hH8EcpslmM", "RT @WHCOVIDResponse: WATCH: Dr. Marcella Nunez-Smith, chair of the COVID-19 Health Equity Task Force, and Jeff Zients, coordinator for the…", "Current vaccination efforts are not working fast enough. The American Rescue Plan will mount a national vaccination program to quickly and equitably vaccinate America. https://t.co/Inen2jaZjN", "The American Rescue Plan will ensure every American who wants a vaccine can get one free of charge. https://t.co/jalGIA0Hup", "Tune in as President Biden and Vice President Harris virtually tour a vaccination site in Glendale, Arizona. https://t.co/QK3Z1FFyYx", "The American Rescue Plan includes a historic investment in the public health workforce, funding 100,000 public health workers that will help contain the virus and vaccinate America. https://t.co/XNwTNyzb6I", "Tune in for a briefing with @PressSec Jen Psaki. https://t.co/a5aVjnZa5V", "RT @WHCOVIDResponse: WATCH: Our public health experts are giving an update on the science behind vaccines, the state of the pandemic, and n…", "“As mayors, we’re on the ground with our constituents every day and see firsthand how horrific our situation is. Our people need help.”\n\nTwo Florida mayors share why they want Congress to immediately pass President Biden’s American Rescue Plan: https://t.co/gksgTeG77H", "Your actions can save lives. https://t.co/GR1az2SjtE", "When President Biden thinks about climate change, he thinks about good-paying, union jobs.\n\nWhite House National Climate Advisor @Gina_McCarthy breaks down how we’ll tackle the climate crisis and create jobs in the process: https://t.co/s3UGP5F5cs", "ICYMI: This week, a bipartisan group of over 400 Mayors called on Congress to pass President Biden’s American Rescue Plan. https://t.co/xTy2PO1SFn", "Millions of Americans like Michele have been laid off due to COVID and are in need of direct relief. She wrote a letter to President Biden to share her story. He called to check in. https://t.co/mBuhmWltml", "After a busy week, President Biden departed Washington, D.C. on Air Force One for the first time as president. https://t.co/kWUPGekLIe", "Tune in for a briefing with @PressSec Jen Psaki and Council of Economic Advisers Member @econjared46. https://t.co/Z9BnaFOlju", "Today’s jobs report is yet another reminder of the need for urgent action. The American Rescue Plan will control the virus, get vaccine shots in arms, and finally launch a robust, equitable and racially inclusive recovery. https://t.co/KXZYvJyq8c", "The crises we face don’t only affect Democrats or Republicans, they impact us all — and we need a comprehensive plan to solve them. That’s why Americans across the aisle are coming together to support President Biden’s American Rescue Plan. https://t.co/a12XqP3IXa", "The Biden-Harris Administration is committed to working with the African Union to advance our shared vision of a better future.\n\nWatch President Biden’s Message to African Union Summit Participants: https://t.co/tXFX4Tp9PD", "Wondering about Dr. Fauci’s morning routine or how we can vaccinate 100 million people in 100 days? Watch to find out: https://t.co/P7rcsEa8FQ", "As we mark #BlackHistoryMonth, tune in for a conversation with White House Senior Advisor @Richmond46 and @BlackPressUSA on today’s most pressing issues. https://t.co/69VeJ6nK3H", "No one should have to worry about keeping a roof over their head. President Biden is urging Congress to pass the American Rescue Plan to extend the moratorium on foreclosures and evictions for countless Americans. https://t.co/hh48v3vK62", "Tune in for a briefing with @PressSec Jen Psaki. https://t.co/6qIKax2npi", "RT @WHCOVIDResponse: 8% of the U.S. population has received at least one dose of the COVID-19 vaccine, up 2 percentage points from last wee…", "Let’s be clear: Working families need more than the $600 that Congress passed in December. The American Rescue Plan will finish the job of delivering $2,000 in direct relief to those who need it most. https://t.co/VrbY8lT2qC", "Across the nation, one in five renters and one in ten homeowners are behind on payments. That’s why President Biden is calling on Congress to pass the American Rescue Plan and ensure that families hit hard by the economic crisis won’t face eviction.", "Across the country, millions of Americans are out of work through no fault of their own. The American Rescue Plan will help them get through these crises by providing an additional $400 a week. https://t.co/q8c7iNLWeA", "RT @WHCOVIDResponse: If you're enjoying our COVID-19 briefings, here's a chance to ask our experts your own questions directly! Tomorrow, D…", "Tune in for a briefing with @PressSec Jen Psaki. https://t.co/Gkig6IvvXj", "Our strategy in response to this pandemic-induced economic crisis is centered around the belief that the costs of inaction are far higher than the costs of acting too aggressively.\n\nRead more about the economics of the American Rescue Plan: https://t.co/gzkV6IQtnQ", "RT @WHCOVIDResponse: WATCH NOW: Dr. Fauci, and @CDCDirector Dr. Walensky deliver updates our progress fighting COVID-19. https://t.co/eeMBx…", "President Biden believes the scale of our response needs to reflect the severity of the crises we’re facing as a nation. The American Rescue Plan is needed to change the course of the pandemic and start our economic recovery.", "Our Administration is committed to addressing the awful harms that were inflicted on families coming to America seeking safety. Today, President Biden formed a Family Reunification Task Force to reunite families and ensure such tragedies never occur again. https://t.co/8HD69GNBzi", "President Biden has wasted no time working to rebuild and strengthen our immigration system. https://t.co/j8XmUAtjUL", "America is a nation of immigrants and Indigenous peoples — and we are stronger because of it. https://t.co/IgTtaQ0WzS", "It’s been less than two weeks since President Biden took office, but he has wasted no time taking historic action and delivering on his promises to the American people. https://t.co/aQjGzFWQ1z", "President Biden believes our country is safer, stronger, and more prosperous when we welcome immigrants. This afternoon, he’ll build on previous actions and take steps to rebuild and strengthen our immigration system. https://t.co/w9JjkuCKnA", "We join the United Kingdom and the world in honoring the memory of Captain Sir Tom Moore, who inspired millions through his life and his actions. https://t.co/b2zUsZkHo3", "Tune in for a briefing with @PressSec Jen Psaki. https://t.co/fowKj1L5Vh", "RT @WHCOVIDResponse: WATCH: Jeff Zients, COVID-19 Response Team coordinator is giving updates on steps we’re taking today to enact Presiden…", "Remember to:\n\n- Wear a mask\n- Wash your hands\n- Practice social distancing\n\nYour actions can save lives and change the course of this pandemic.", "RT @VP: As Black History Month begins today, we remember and honor those who have come before, and we work to build a brighter future for a…", "From big cities to rural America, too many Americans are barely scraping by, or not scraping by at all. That’s why President Biden is calling on Congress to pass the American Rescue Plan and deliver immediate, direct relief to Americans bearing the brunt of this crisis.", "We cannot rescue our economy without containing this virus. President Biden’s American Rescue Plan will take immediate action to change the course of this pandemic and build a bridge toward economic recovery.", "Tune in for a briefing with @PressSec Jen Psaki. https://t.co/WdPuSmDzYX", "We are committed to reopening the majority of America’s schools in the first 100 days. The American Rescue Plan provides the necessary funding to meet that goal and ensure our nation’s schools can reopen and operate safely.", "President Biden is committed to getting America vaccinated as quickly as possible. His American Rescue Plan will mount a national vaccination program to quickly and equitably vaccinate the vast majority of the U.S. population.", "President Biden is calling on Congress to immediately pass his American Rescue Plan and finish the job of getting $2,000 in direct relief to those who need it most. He’s committed to ensuring hardworking Americans get the relief they need.", "Marine One departs the White House South Lawn as President Biden takes his first trip to Walter Reed on Friday afternoon. https://t.co/gXYS3sPy2e", "We are in the midst of an economic crisis, and the millions of Americans out of work are relying on unemployment insurance to make it through. The American Rescue Plan will extend and expand unemployment insurance benefits so American workers can pay their bills.", "Climate change is an intersectional issue. Watch National Climate Advisor @Gina_McCarthy explain why: https://t.co/ZJ3LR0CWg5", "The Cabinet is coming together. https://t.co/qZlqBOsvfp", "From COVID-19 and the economy to climate change and racial equity — President Biden has wasted no time tackling the toughest challenges we face as a nation.", "RT @VP: Get vaccinated. Save lives. https://t.co/5ZNXerlmIJ", "RT @WHCOVIDResponse: Tune in now for a COVID-19 briefing with Dr. Fauci and @CDCDirector Dr. Walensky. They're updating us on the latest sc…", "Tune in for a briefing with @PressSec Jen Psaki. https://t.co/kb1cnMrQgx", "We’re in the midst of a global pandemic, and access to health care is more important than ever. Today’s actions by President Biden will help ensure everyone receives the care they need. https://t.co/Lvl4OIOUf7", "Yesterday, President Biden took historic action to combat the climate crisis. Watch Deputy National Climate Advisor @alizaidi46 break things down: https://t.co/q2pAtWbQrG", "Today, President Biden furthered his commitment to protecting women’s health care by issuing a Presidential Memorandum. The memorandum immediately rescinds the global gag rule and takes steps to protect and expand access to reproductive health care. https://t.co/vmJfg4ywkY", "Tune in for a briefing with @PressSec Jen Psaki. https://t.co/wP3xGtAexO", "Today, President Biden will take action to strengthen Americans’ access to quality, affordable health care. The Biden-Harris Administration is committed to ensuring every American has access to the care they need. https://t.co/Q4NTiZx9fi", "Because of the action President Biden took today, every federal infrastructure investment will reduce climate pollution and clean energy projects will be accelerated — creating countless jobs in the process. https://t.co/Sd8zzlb5cs", "To combat the climate crisis and power a clean energy revolution, President Biden will:\n\n- Tap into the power of American workers\n- Conserve and leverage our natural resources\n- Create good-paying, union jobs\n- Deliver environmental justice", "Yesterday, President Biden announced big news: the United States will have enough COVID-19 vaccines for 300 million Americans by the end of summer.", "RT @nowthisnews: JOHN KERRY ON CLIMATE: In his first interview since President Biden's recent executive actions, @ClimateEnvoy @JohnKerry t…", "Tune in as President Biden delivers remarks and takes action to combat the climate crisis, create good-paying union jobs, and restore scientific integrity. https://t.co/4xnilrbgSl", "Tune in for a briefing with Press Secretary Jen Psaki, Special Presidential @ClimateEnvoy John Kerry, and National Climate Advisor @Gina_McCarthy. https://t.co/K9ulTy1XTc", "RT @WHCOVIDResponse: Tune in as the COVID-19 Response Team hosts the first of regular briefings featuring our public health experts: Dr. An…", "We’re in the midst of a climate emergency, and President Biden knows we have no time to lose. Today, he’s taking action to address the climate crisis, create good-paying union jobs, and build an equitable clean energy future. https://t.co/IhdZMfh2uo", "Last week, President Biden announced a whole-of-government initiative to address racial equity and support underserved communities. Today’s executive actions build on that announcement.\n\nOur Administration is committed to tackling these issues head-on.", "Readout of President Biden’s call with NATO Secretary General @JensStoltenberg. https://t.co/fZrp1BKEmz", "Tune in as President Biden delivers remarks on the fight to contain the COVID-19 pandemic. https://t.co/19L8jb17Gu", "Today, President Biden signed executive actions that provide a down payment on advancing racial equity. https://t.co/i6KYrkoksf", "Tune in as President Biden delivers remarks and signs executive actions to advance racial equity. https://t.co/zxKk9ycnzi", "Tune in for a briefing with @PressSec Jen Psaki and Domestic Policy Advisor @AmbassadorRice. https://t.co/r2MXiv1FoZ", "RT @WHCOVIDResponse: This afternoon, President Biden will deliver remarks on our COVID-19 fight and how we’re working to change the course…", "Today, President Biden will take bold action to advance racial equity and support communities of color and other underserved communities.", "President Biden’s action today will deliver relief for American businesses and make investments in manufacturing and technology. Our Administration is committed to giving American workers and companies the tools they need to compete for decades to come. https://t.co/BOS2I72oV8", "Because of the action President Biden took today, Shawn Skelly and countless other transgender service members will be able to serve our nation openly and free from discrimination. https://t.co/miSHxQrbXK", "#BuildBarkBetter https://t.co/qL7aILjHEH", "Today, President Biden took bold action to support American businesses, invest in the future of American industry, and support American workers. https://t.co/Kw8BzdxLEr", "Tune in as President Biden delivers remarks on his plans to strengthen American manufacturing and signs the Buy American Executive Order. https://t.co/tb74k1srWi", "Tune in for a briefing with @PressSec Jen Psaki. https://t.co/dbxU3SVctI", "President Biden fulfilled another crucial pledge, repealing the transgender military ban to ensure everyone who’s qualified to serve in the military can do so openly and free from discrimination. https://t.co/b24PHI9OII", "RT @WHCOVIDResponse: Hear directly from the experts of our COVID-19 team on Wednesday at 8pm on CNN as Dr. Anthony Fauci, CDC Director Roch…", "Today, President Biden will take action to support American businesses on the brink of closure and ensure that our future is made in America by all of America’s workers.", "In order to reduce the spread of COVID-19, President Biden is taking action by establishing a Pandemic Testing Board, increasing treatment and testing, and protecting public health workers. https://t.co/S1sVPLqXda", "From our plans to deliver economic relief to an update on the First Cat — watch as White House @PressSec Jen Psaki answers your questions. https://t.co/uA5hzBMehC", "To get this virus under control, President Biden has launched a COVID-19 National Action Plan — an aggressive, coordinated, equitable, and professional response to the pandemic.", "President Biden recognizes far too many Americans are hurting during this pandemic through no fault of their own. This week, the President directed his Cabinet to do everything in their power to provide direct economic relief to those bearing the brunt of this crisis.", "Please wear a mask. https://t.co/aAqlmJP5RT", "We are currently facing four converging crises — COVID-19, the resulting economic crisis, climate change, and racial inequity. This week, President Biden took swift action to combat these challenges.", "We are facing an economic crisis, brought on by a public health crisis, and today our Administration took action to provide relief to those who are struggling most.", "Today, @POTUS signed an executive order to protect and empower federal employees, who are essential to our country. The action: \n\n- Restores collective bargaining power and worker protections \n- Eliminates Schedule F\n- Promotes a $15 minimum wage", "We’re facing an economic crisis brought on by a public health crisis. And today, the Biden-Harris Administration took bold action to provide relief to help those who are struggling most. https://t.co/GCicFGDk3V", "Tune in as President Biden delivers an update on the Administration’s response to the economic crisis. https://t.co/5FJWCHcsWU", "Tune in for a briefing with Press Secretary Jen Psaki and National Economic Council Director Brian Deese. https://t.co/6PGCAIt0C8", "Today, President Biden is taking bold action to provide critical support to struggling communities and small businesses impacted by COVID-19. https://t.co/xLWzJuyWzU", "President Biden will ensure equity throughout the vaccination distribution process by protecting the most at risk, increasing availability in hard-hit communities, eliminating out-of-pocket costs, and establishing the COVID-19 Health Equity Task Force.", "Yesterday, President Biden reversed the United States’ withdrawal from the World Health Organization. And this morning, Dr. Fauci joined his first meeting as the head of our delegation. Here’s what he said: https://t.co/yvv2ojcfXh", "Today, the Biden-Harris Administration took swift action — grounded in science — to get the COVID-19 pandemic under control. https://t.co/N9ejHSQR9R", "Our goal is 100 million shots administered in our first 100 days. Here is how we plan to get it done. https://t.co/9H8dilhSxp", "Today’s executive actions represent our Administration’s effort to aggressively change the course of COVID-19 by expanding testing, vaccinating more people, protecting those most at risk, and addressing racial and other disparities in COVID impact and care. https://t.co/AgWtxAyFhO", "Tune in for a briefing with Press Secretary Jen Psaki and Dr. Fauci. https://t.co/4GspJEUusY", "President Biden signed several executive orders to contain COVID-19 by expanding testing, administering vaccines, advancing an equitable response, and safely reopening schools and businesses.", "Follow @WHCOVIDResponse for the latest updates on the Biden-Harris Administration’s efforts to contain COVID-19. https://t.co/uqVhTSQRc1", "Tune in as President Biden provides an update on the Administration’s COVID-19 response. https://t.co/xFHzMcVRti", "We are currently facing four converging crises — COVID-19, the resulting economic crisis, climate change, and racial inequity. Today, President Biden took actions to combat these challenges. https://t.co/091jmvCukk", "Today, @POTUS issued a mask mandate on federal property, launching his “100 Day Masking Challenge” as part of our efforts to flatten the COVID-19 curve. https://t.co/NLGr6JHB0h", "Today, President Biden rejoined the Paris Agreement on Climate Change. https://t.co/V4fVV2i2jZ", "Tune in for the first press briefing of the Biden-Harris Administration with Press Secretary Jen Psaki. https://t.co/psa19eCLQa", "President Biden assumes office at a time when our nation is facing crises that demand urgent action. Starting today, the President will take decisive actions to address these challenges, prevent other harms, and restore America's place in the world.", "Today, the work begins. https://t.co/OqdALNJj4A", "Xavier Becerra has the experience we need at HHS. He has spent his career fighting for quality, affordable health care. As Secretary of Health and Human Services, he will continue his work to lower health care costs and expand access for all Americans. https://t.co/PILLBp1eVr", "President-elect Biden has nominated Dr. Levine to serve as Assistant HHS Secretary. A deeply experienced public servant and public health expert, she is poised to become the first openly transgender federal official to be confirmed by the U.S. Senate.\nhttps://t.co/REmjFd98Hl", "As we celebrate the life and legacy of Dr. Martin Luther King, Jr., we honor his commitment to building a country that is rooted in civil rights and racial justice. #MartinLutherKingDay", "RT @DrNunezSmith: \"Now is the time to lift our national policy from the quicksand of racial injustice to the solid rock of human dignity.\"…", "RT @BeKindDreamBig: I am honored to serve alongside @teachcardona to restore our education system – putting teachers, students, and parents…", "Today, President-elect Biden announced a number of key administration posts. These experienced public servants will lead with compassion, integrity, and character to make our government work for all Americans.\nhttps://t.co/rrHKrjHur2", "Vice President-elect Harris bids farewell to her Senate seat today. But as she says, it’s not goodbye—it’s hello as Vice President of the United States. https://t.co/mU8whoxsUe", "The principles of homeland and security have shaped the life of Alejandro Mayorkas, who was brought to the U.S. as a child from Cuba. He’s endorsed by dozens of groups from law enforcement to advocacy who want a Department of Homeland Security that is fair and humane. https://t.co/sQWh7wT4Tt", "RT @jakejsullivan: Mr. Navalny should be immediately released, and the perpetrators of the outrageous attack on his life must be held accou…", "President-elect Biden and Vice President-elect Harris are committed to making sure communities of color, our rural neighbors, those living with disabilities, and seniors are not left behind in our vaccination plans. https://t.co/HTnS6YfnEX", "This week, Dr. Jill Biden announced additional members of the Office of the First Lady, including the new incoming Executive Director of Joining Forces. These dedicated public servants are committed to building an administration that lifts up all Americans.https://t.co/YzvBBfwfAj", "President-elect Biden’s $1.9 trillion American Rescue Plan will contain the virus, rescue the American economy and put money directly into the pockets of working families, communities, and small businesses impacted by the pandemic.", "President-elect Biden and Vice President-elect Harris announced additional staff members of the Office of the Vice President. These accomplished individuals will hit the ground running on day one and will serve our country with honor and integrity.\nhttps://t.co/zsfzwQCAec", "Statement from President-elect Biden on Religious Freedom Day:\n\nhttps://t.co/biyJUKiUsl https://t.co/tDnyHx8j0O", "RT @DouglasEmhoff: I'm so incredibly honored and humbled to be the first @SecondGentleman of the United States. As we countdown to Inaugura…", "Equity is central to our COVID-19 response. And, our administration will ensure that vaccinations are distributed equitably and to hard-to-reach, marginalized and medically-underserved communities.", "The President-elect has set a goal of 100 million shots administered in the first 100 days. Here’s how we make that happen: https://t.co/O92tCiRRSZ", "Tune in as President-elect Biden announces key members of his White House Science Team.\n\nThese diverse, deeply respected and eminently qualified scientists will marshal the force of science to drive meaningful progress in the lives of people https://t.co/JFHTfyOLoQ", "RT @eric_lander: Humbled and excited to serve as WH science advisor for President-elect @JoeBiden. He has assembled a diverse team of brill…", "Small businesses are the engines of our economy, and they have struggled during the pandemic. President-elect Biden’s plan will help provide them with funding to reopen, recover, and rebuild. https://t.co/zuIu1Hh4Ap", "This accomplished team will work closely with Secretary of State-designate @ABlinken to rebuild our institutions, renew and reimagine American leadership to keep Americans safe at home and abroad, and address the defining challenges of our time. https://t.co/Fd8YDzSqvc", "Our White House staff will represent diverse and varied communities, putting service to the American people at the forefront of their work. \n \nThese are the qualified, tested and skilled individuals who were announced today:\nhttps://t.co/t7bA47EAOr", "RT @alondra: Sound science will touch every aspect of what the Biden Administration does–from new policy, to addressing social inequality,…", "Effectively and equitably vaccinating the vast majority of the U.S. population will happen through stronger partnerships with tribes, states, and communities, increased supply, more vaccination sites, and more vaccinators.", "Our plan is as clear as it is bold:\n\n- Allow more people to get vaccinated.\n- Create more places for them to get vaccinated.\n- Mobilize more medical teams to get shots in arms.\n- Increase supply and get it out the door as soon as possible.\n\nhttps://t.co/IbT5dNw0AL", "This team will help our administration confront some of the biggest crises and challenges of our time, from climate change and the impact of technology on society to pandemics, racial inequity, and the current historic economic downturn. \nhttps://t.co/MCjjQnKo7K", "Join our press briefing as members of the Biden-Harris Transition team share the latest updates ahead of the inauguration of President-elect Biden and Vice President-elect Harris: https://t.co/weetSMEbWJ", "President-elect Biden and Vice President-elect Harris announced additional members of the White House COVID-19 Response team. \n\nThis team will work quickly to implement a comprehensive response strategy to contain the pandemic and restore public trust.\nhttps://t.co/HjlCLJmvuG", "These dedicated public servants will lead with compassion, integrity, and character to make our government work for all Americans.\n\nThey will hit the ground running on day one with bold thinking to make a meaningful difference in people’s lives.\nhttps://t.co/KgPxsHIT2R", "Meet Pilar: A small business owner impacted by COVID-19.\n\nShe is one of the millions of Americans the President-elect is working to deliver results for with his American Rescue Plan. https://t.co/KSKxPbk1LP", "President-elect Biden will outline his America Rescue Plan to fund vaccinations and provide immediate, direct relief to working families and communities bearing the brunt of this crisis. https://t.co/gz80hwWoVt", "The President-elect's American Rescue Plan will:\n- Ramp up a national vaccine program\n- Safely reopen majority of K-8 schools in his first 100 days\n- Deliver immediate, direct relief to working families \n- Support hardest-hit communities &amp; small businesses\nhttps://t.co/8zS5KhWGtw https://t.co/yFR120juA3", "President-elect Biden recognizes that millions of working families continue to bear the brunt of the pandemic. Today, he will lay out his plan to rescue our economy and control the virus.", "We can emerge from the most inequitable jobs crisis in modern history by building an economy that gives everyone an equal chance to get ahead.\n\nThis team will help struggling small businesses recover, and put Americans back to work by creating millions of good-paying union jobs. https://t.co/O3zQzeFzNr", "As USAID Administrator, @SamanthaJPower will work with our partners to confront the COVID-19 pandemic, lift up vulnerable communities, fight for the value of every human being, and advance American ideals and interests around the world. https://t.co/Y5spGtH8Ue", "Our National Security Council consists of crisis-tested leaders who will work relentlessly to safeguard Americans, advance our security, and defend our democratic values.\n\nThese are today’s additional members of the NSC staff: \nhttps://t.co/eFzBk29Oan", "These diverse, qualified, and experienced appointees will be vital in supporting day-to-day White House functions and facilitating broad engagement with the American people. They are ready to hit the ground running for American families on day one.\n\nhttps://t.co/g4otGkUvhC https://t.co/CrD2bEcsh6", "President-elect Biden received his second dose of the COVID-19 vaccine because he trusts scientists.\n\nOur administration is committed to doing everything possible to ensure every American has all the information they need to get vaccinated. https://t.co/9FzLEeqwOi", "President-elect Biden has nominated Ambassador Samantha Power as USAID Administrator.\n\nA leading voice for humane and principled American engagement in the world, she will rally the international community and work with our partners to confront the biggest challenges of our time. https://t.co/Gv9G8CLrI5", "Dr. Marcella Nunez-Smith, COVID Equity Task Force Chair-designate, will help advise President-elect Biden on a whole-of-government effort to reduce COVID-19 disparities in response, care, and treatment, including racial and ethnic disparities.\n\nhttps://t.co/nG1LR9RTEg", "RT @LloydAustin: I am enormously grateful for the service and the sacrifices of those who broke barriers before me—and although I may be th…", "This team will restore the independence and integrity of the Justice Department, renew Americans’ faith in the rule of law, and work tirelessly to build a more equitable justice system.\n\nThey understand that the Justice Department exists to serve the American people. https://t.co/nGXVwwDYeb", "RT @RWalensky: Studies have demonstrated the COVID-19 vaccine is safe. The vaccine gives us hope. And I urge everyone to take it once it is…", "Today's appointees to the Office of the White House Counsel are experienced and accomplished individuals that have a wide range of knowledge from various fields and will be ready to get to work on day one.\n\nhttps://t.co/4YQEcC3fyJ https://t.co/6EByVkVoQ0", "We need a CIA Director who understands the dynamic threats we face. A CIA Director who can work with our allies and stand up to our adversaries. A CIA Director who will lead with transparency and integrity.\n\nThat is who Ambassador William Burns is.\nhttps://t.co/oAFLYmbp3j", "RT @CeciliaERouse: Like I told PBS, the current stimulus was a downpayment, but our communities – especially women and teachers – need addi…", "President-elect Biden has nominated career diplomat and crisis-tested national security expert Ambassador William Burns as Director of the CIA.\n\nAmbassador Burns has a deep understanding of the threats we face, and will tirelessly protect the American people. https://t.co/vcTyn7ejOp", "President-elect Biden knows this is no time to build back to the way things were before. \n\nOur administration will work to build an economy that is more vibrant and powerful because everybody will be cut in on the deal.", "Our jobs team will advance President-elect Biden's Build Back Better agenda.\n\nThey will help to build a stronger, more resilient, and more inclusive economy that delivers every American a fair return for their work. https://t.co/QmggJnUCCP", "\"Our priority will be Black, Latino, Asian, and Native American owned small businesses, women-owned businesses, and finally having equal access to resources needed to reopen and rebuild.\" — President-elect Biden https://t.co/pIyDuhf5pH", "RT @GinaRaimondo: I’m excited to help carry out the Build Back Better agenda.\n\nWe have a vision for an inclusive recovery that lifts up tho…", "“As everyone who watched [Wednesday’s] events in Washington now understands–if they did not before—the Rule of Law is not just some lawyer’s turn-of-phrase. It is the very foundation of our democracy.” — Judge Merrick Garland, Nominee for Attorney General https://t.co/9O5Rq8iWBV", "\"We need more direct relief flowing to families, small businesses, including finishing the job of getting people that $2,000 in relief—direct payment. $600 is simply not enough.\" — President-elect Biden https://t.co/rmNdwzBuIU", "RT @dgravesjr: The president-elect has always shown me how to be a public servant the right way.\n\nThat service isn't about the principals w…", "Our administration will work every day to deal with the growing economic inequality in our nation. And to deal with the denial of the promise of this nation—to so many.\n\nThis is our time to root out systemic racism.", "“Ensuring the Rule of Law and making the promise of Equal Justice Under Law real are the great principles upon which the Department of Justice was founded and for which it must always stand.” — Judge Merrick Garland, Nominee for Attorney General https://t.co/48U1XlHXnN", "RT @vanitaguptaCR: There are many agencies in our federal government – but only one which bears the name of a value.\n\nBy virtue of that nam…", "President-elect Biden's Attorney General nominee, Judge Merrick Garland, will help create a more equitable justice system for all Americans. https://t.co/AdODMA19Fe", "ICYMI: Readout of President-elect Biden's Calls with Speaker Nancy Pelosi &amp; Senate Democratic Leader Chuck Schumer: https://t.co/r9DYgUfKqZ", "RT @MartyJWalsh: We are facing hard times – but nobody’s tougher than the American worker. And going forward, we have the opportunity to pu…", "Statement by President-elect Biden on the 10th Anniversary of the Tucson Shooting:\n\nhttps://t.co/32XJwlWju4 https://t.co/C5gh5aFKsV", "RT @dgravesjr: I am so humbled to be nominated by President-elect Biden to serve as Deputy Commerce Secretary. I’ve worked alongside @JoeBi…", "Our transition team continues to lay the foundation for the Biden-Harris administration. Join our press briefing for the latest updates: https://t.co/Jm0t1RkINA", "Our jobs team will help to build a stronger, more resilient, and more inclusive economy that delivers every American a fair return for their work. Tune in as President-elect Biden and Vice President-elect Harris introduce nominees for their team: https://t.co/Qrk2MzRhFt", "Today, President-elect Biden and Vice President-elect Harris announced staff members for the National Security Council. These leaders will work relentlessly to safeguard Americans, defend our interests, and advance our democratic values.\n\nhttps://t.co/Jmj3JgJhwc https://t.co/9RfZWkH7FE", "RT @LisaMonaco: The soul of the Justice Department lives in the integrity of its career professionals, in the independence of its investiga…", "RT @vanitaguptaCR: I am honored to return to a Justice Department that will push every day for justice, accountability, and equality under…", "The Office of the Vice President will consist of experienced individuals who represent the very best of our country, and who are ready to meet the challenges we’re facing and deliver results for the American people on day one.\nhttps://t.co/YCDzAhtq68", "Statement by President-elect Biden marking Orthodox Christmas: https://t.co/snG7aNPy6r", "\"More than anything, we need to restore the honor, the integrity, the independence of the Department of Justice in this nation.\" — President-elect Biden https://t.co/3yZH2me5qT", "RT @MartyJWalsh: Working people, labor unions, and those fighting every day for their shot at the middle class are the backbone of our econ…", "RT @GinaRaimondo: Rhode Island may be small, but our economy is mighty on the strength of our small businesses and innovative technologies.…", "RT @IsabelCGuzman: We have to build our economy back better from this pandemic. Small businesses and their employees will be core to our re…", "Our jobs team’s mission is clear: execute the Build Back Better agenda.\n\nThey will work to dig us out from the worst, most unequal jobs crisis in nearly a century by supporting small businesses and rebuilding the backbone of America — our middle class. https://t.co/bFAAcyv2D9", "These leaders will renew Americans’ faith in the rule of law and work tirelessly to build a more equitable justice system. Tune in as President-elect Biden introduces key nominees for the Department of Justice. https://t.co/ZTIWMmWcpP", "President-elect Biden has nominated Judge Merrick Garland to serve as Attorney General.\n\nHe will work to restore the integrity and independence of the Justice Department, ensure racial equity in our justice system, and ensure we meet the evolving threat of violent extremism. https://t.co/zG8PGk7ibW", "RT @LisaMonaco: I’ve spent years in public service working with those who have dedicated their lives to upholding the law and keeping this…", "This team will work to move us closer to the American ideal of equal justice under law. \n\nThey will work to restore independence of the Justice Department, always follow facts and the law, and serve and protect the American people with integrity.\nhttps://t.co/KPV7ZKVPlB", "President-elect Biden addresses the nation: https://t.co/BXM3SZK25R", "Readout of President-elect Biden’s briefing on COVID-19 response and vaccination strategy: \n\nhttps://t.co/epetoF8NyT https://t.co/hVAnLNXU6i", "El equipo de transición está estableciendo los cimientos que la administración Biden-Harris utilizará para afrontar los desafíos urgentes que enfrenta nuestro país en el primer día en sus cargos.\n\nAprenda más sobre la transición:\nhttps://t.co/qq6HiZGMF9", "Today’s White House appointees will play key roles in coordinating across the administration, working with state and local governments and organizations, and engaging with the public.\nhttps://t.co/zlxWRaRh3U", "Whenever America has had its back against the wall, we’ve come together to lay the foundation—through public investment and a strong social contract—for us to pull together and push forward. \n\nOur economic recovery plan for working families plans to do just that.", "RT @XavierBecerra: ¿Cómo podemos mejorar su vida? \n\nEsa es la función del Departamento de Salud y Servicios Humanos. Nuestra misión es ayud…", "We have an opportunity not just to go back, but to move forward in a meaningful way to address the climate crisis.\n \nOur climate team will work alongside all agencies and all sectors of government to build a future that is healthier, safer, and more prosperous. https://t.co/lOR5Z19tbB", "Statement by President-elect Biden on Nancy Pelosi’s reelection as Speaker of the House: https://t.co/m6u6BwFlRj", "Wearing a mask can save lives.\n\nOur administration will continue to call on:\n\n- Every American to wear a mask for 100 days.\n- Every governor to make that mandatory in their state.", "Preparation is underway to ensure the Biden-Harris administration is able to take on the historic crises our country faces. We won't just return to the way things are. We will build back better than ever before. https://t.co/3kq5F3F2Pb", "Statement by President-elect Biden on the passing of Floyd Little:\n\nhttps://t.co/1qLCIwzi1F https://t.co/AiiD4npJjM", "Our work for the next 20 days will be the infrastructure for the incoming administration, who like us, will prioritize diversity of ideology and background, address the challenges our country faces, and serve the American people.\n\nhttps://t.co/sSSxr0FV5l", "As we bring in the new year, we look forward to ensuring the Biden-Harris administration is ready to tackle our current crises on day one.\n\nFrom the Biden-Harris transition team—Happy New Year!", "\"As we end one of the most difficult years as a nation, I am optimistic about the future.\"  — President-elect Biden https://t.co/0kzteKX4ZJ", "RT @JanetYellen: The challenges we’re facing are unprecedented, and addressing the economic and public health crisis will require bold acti…", "\"We've overcome incredible challenges as a nation. And we've done it before, and we will do it again.\" — President-elect Biden https://t.co/aZ906QudGq", "With today’s announcement, President-elect Biden and Vice President-elect Harris surpass their goal to name over 100 members of our White House team.\n\nThis diverse and talented group not only looks like America, but will deliver results for working families on day one. https://t.co/JaHv1abVnD", "Vice President-elect Harris and the future Second Gentleman Doug Emhoff share the importance of getting the COVID-19 vaccine. https://t.co/BZDkaHk78M", "Secretary of Education nominee Dr. Miguel Cardona is a public school educator who understands the value and importance of public education.\n\nHe will use his expertise to get our nation's schools through this pandemic and beyond. https://t.co/khfgCmid6G", "RT @PeteButtigieg: Decades in the making, the newly renovated Moynihan Train Hall in New York City is one of the most significant passenger…", "These accomplished and barrier-breaking individuals will focus on implementing policies, working with Congress, and communicating with the American people about how the administration will build our nation back better than before.\n \nhttps://t.co/ELBFytBxWa https://t.co/IAAEBTusaL", "Our work to prepare the Biden-Harris administration continues. Join our press briefing to hear the latest updates: https://t.co/2NMJiy5mJU", "President-elect Biden has nominated @kath_hicks as Deputy Secretary of Defense and @ColinKahl as Under Secretary of Defense for Policy.\n\nThey know the Pentagon inside and out, and will work with Secretary-designate @LloydAustin to keep us safe and secure.\n\nhttps://t.co/FeZhLju501", "Statement by President-elect Biden on the 50th anniversary of the Occupational Safety and Health Act:\n\nhttps://t.co/CIesRWzIG3 https://t.co/9lQhKZAde8", "During the first 100 days of the Biden-Harris administration, the president-elect will ask the American people to wear a mask. https://t.co/fTpMpk34uP", "Our COVID-19 response team consists of diverse and crisis-tested individuals who will work to contain the pandemic, restore public trust, and protect all Americans.\n\nhttps://t.co/CI1yHO5anb", "Tune in as President-elect Biden delivers remarks on the state of the ongoing COVID-19 crisis and lays out some initial steps his administration will take to contain the virus: https://t.co/T82uSThTQC", "Meeting our most daunting challenges requires American engagement and leadership. But as President-elect Biden states, we can't act alone. https://t.co/Uku9IWA8i9", "President-elect Biden believes this is no time to build back to the way things were before. \n\nThis is our moment to imagine and build a new American economy for our families and the next generation.", "\"Rebuilding the full set of our instruments of foreign policy and national security is a key challenge that the Vice President-elect Harris and I will face upon taking office—starting with our diplomacy.\" — President-elect Biden https://t.co/9qhlcZrjzq", "RT @DebHaalandNM: The Interior Department manages our public lands to make sure we protect them, honor them, &amp; preserve them for future gen…", "President-elect Biden delivers remarks following his briefing with national security and foreign policy agency review team members. Tune in: https://t.co/GhYVOPiHw8", "President-elect Biden and Vice President-elect Harris announced members of the White House Office of Digital Strategy. \n\nThis talented team will reach and engage users online, and connect our administration to the American people in new &amp; innovative ways.\nhttps://t.co/AgOQFy9Ftr", "In this time of crises, President-elect Biden has a plan to create millions of good-paying jobs, make it easier for workers to organize unions and collectively bargain.\n\nA plan that will give America's working families the tools, choices, &amp; freedom they need to build back better.", "The Biden-Harris administration will always:\n\n- Listen to science\n- Ensure public health professionals inform public health decisions\n- Promote trust, transparency, common purpose, and accountability in our government", "RT @XavierBecerra: My faith has been my North Star throughout my career in public service. It teaches me to give back and care for others —…", "From the Biden-Harris Transition team, we want to send best wishes to everyone celebrating Kwanzaa. A holiday rooted in the Nguzo Saba—Kwanzaa is a time of reflection on the rich heritage of African-American culture.", "Kwanzaa is a time of celebration, reflection, and pride for many American families.\n\nWatch as Vice President-elect Harris shares her Kwanzaa memories and how her favorite principle Kujichagulia continues to motivate her. https://t.co/dTPfCLcrUn", "We know the holiday celebrations are a little different this year. From the Biden-Harris Transition team, we want to wish you a safe and Merry Christmas.", "Vice President-elect Harris and our future Second Gentleman Doug Emhoff remind us that while we have faced many challenges this year, Christmas is a season of hope. https://t.co/C9gyI0N0cF", "Christmas message from President-elect Biden and our next First Lady Jill Biden. https://t.co/f7HpiZ4NlN", "President-elect Biden reminded us that our darkest days of COVID-19 are ahead of us, and we must all do our part to turn this crisis around. https://t.co/yJrTG9Ts9X", "A very special Christmas message from Champ and Major Biden. https://t.co/lKlo5GWfR8", "\"We've gotten through tough times before in this nation, and we'll get through these difficult times as well. And we'll do it by coming together, by working with another.\" — President-elect Biden https://t.co/2JeSlnXoVA", "RT @XavierBecerra: Las vacunas contra el COVID seguras y efectivas están siendo distribuidas, incluyendo en nuestras comunidades latinas. L…", "“We have to recover from the pandemic, we have to rebuild our economy, we have to deal with the climate crisis, the racial equity and racial justice crisis. And all of these things are vital to our national cohesion and strength, and our ability to lead abroad.” —@AmbassadorRice https://t.co/B7hBlYaxTQ", "A teacher will lead the Department of Education. Dr. Miguel Cardona will ensure that every student in the nation can get a high-quality education from pre-K to post-high school—regardless of their ZIP code, income, race, sexual orientation, gender identity, or disability.", "Dr. Miguel Cardona is a former public school teacher &amp; a proven leader ready to lead on day one. Tune in as President-elect Biden introduces Dr. Cardona as his Secretary of Education nominee: https://t.co/vO0cIfMLHM", "RT @LloydAustin: There is much more work to be done in achieving equality for all who wear our nation’s uniform. I share President-elect Bi…", "President-elect Biden and Vice President-elect Harris announced additional members of the Office of the White House Counsel. This qualified and talented group will help restore faith in the rule of law and the accountability of government institutions.\n\nhttps://t.co/4mFA7zRBLp", "Linda's story about losing her mother Sylvia to COVID-19 reminds us that many families across America are grieving.\n\nPresident-elect Biden knows that in these dark times, we must keep the faith. \n\nFor together we can heal. Together we can hope. https://t.co/yG2wfSrS4G", "Dr. Miguel Cardona has been nominated by the president-elect to lead the Department of Education. \n\nAs a former public school teacher, he will lead the effort to invest in all students, support educators, and make reopening schools a national priority. https://t.co/mc1eq3WpbK", "RT @DenisMcDonough: When you get to work with the men and women of our Armed Services day in and day out, you can’t help but believe that w…", "RT @mlfudge: To build back better, we first need to create a base – to build a foundation for those struggling with housing. \n\nThat means e…", "Tune in as President-elect Biden delivers remarks before the holiday. https://t.co/NbGO72Qoph", "President-elect Biden and the next First Lady Jill Biden are demonstrating how our administration will lead—by listening to the scientists, listening to the experts, and helping keep Americans safe. https://t.co/0LyN2kZl22", "RT @Michael_S_Regan: We will be driven by our conviction that every person has the right to clean air, clean water, and a healthier life—no…", "President-elect Biden and Vice President-elect Harris continue to assemble a White House senior staff composed of diverse, experienced, and talented individuals who are day-one ready to deliver results for working families.\n\nhttps://t.co/yOaRHCAuHA", "RT @AmbassadorRice: El presidente electo Biden tiene una visión transformativa para establecer un sistema de inmigración justo, humano y or…", "On day one, the Biden-Harris administration will be ready to take on additional steps to get the virus under control and build our economy back better than it was before this crisis. \n\nThe president-elect knows there's no time to waste.", "RT @AmbassadorRice: President-elect Biden has a transformative vision for establishing a fair, humane, and orderly immigration system. The…", "RT @jakejsullivan: The work to restore safe asylum processing at the border will start right away, but it will take time. We will also begi…", "RT @PeteButtigieg: We will make sure that creating jobs, tackling the climate crisis, and centering equity are at the heart of our transpor…", "RT @ali_a_zaidi: The peril of the climate crisis is already evident. But we can also see the promise.\n\nWe will create good jobs - and lift…", "\"As the first Native American Cabinet Secretary in the history of the United States of America, she’ll be a true steward of our national parks, our natural resources, and all of our lands.\" — President-elect Biden on Congresswoman Deb Haaland, Secretary of the Interior Nominee https://t.co/0Kpj9iNYnZ", "RT @LloydAustin: I have witnessed the selflessness and patriotism of our servicemembers, civilians, and families firsthand, and couldn't be…", "The Biden-Harris National Economic Council will work to get Americans out of this economic crisis — and these individuals will help us build a strong, inclusive, and more resilient economy for the future.\n\nhttps://t.co/D9Bw8YUt93", "Statement from President-elect Biden on bipartisan agreement on COVID-19 relief:\n\nhttps://t.co/sIC4FmXdDe https://t.co/83B8LeWiHZ", "President-elect Biden believes that every American has the fundamental right to breathe clean air and drink clean water. Fulfilling that right won’t be easy, but it is absolutely necessary. https://t.co/2cmI1n9lbA", "RT @DebHaalandNM: Let it be known:\n\nOur Interior Department will fight to address climate change and environmental injustice.\n\nWe will empo…", "President-elect Biden knows that climate change is one of the most important challenges of our lifetimes.\n \nThat’s why he’s building a team that will create jobs we need to build modern, sustainable infrastructure now and to deliver an equitable clean energy future for all.", "RT @Michael_S_Regan: Climate change is the most significant challenge humanity faces. We’ll make meaningful progress together by listening…", "RT @Brenda_Mallory: I grew up knowing the faces of the marginalized and experiencing the challenges of urban pollution. While the words “cl…", "RT @Gina_McCarthy: The President-elect has put together the strongest climate plan ever raised to this level of leadership because he knows…", "RT @XavierBecerra: “How can we make your life better?” \n\nThat is the role we have at HHS. Our mission is to help you stay healthy, be well,…", "Building Back Better means creating good-paying union jobs that will help us modernize infrastructure to withstand the impacts of climate change and build a clean energy future. https://t.co/ppyeiPWyu5", "Resumen de la llamada del presidente electo Biden con el presidente Andrés Manuel López Obrador:\n\nhttps://t.co/qip5FlPOji https://t.co/vxD7yMGo8l", "Readout of President-elect Biden’s Call with President Andrés Manuel López Obrador:\n\nhttps://t.co/WzzNWIgaP9 https://t.co/VrVor1dk1W", "President-elect Biden continues to build a Cabinet that will be historic. That looks like America. That taps into the best of our country. And that is day-one ready to meet the challenges we're facing. https://t.co/OCNSsvCjAC", "President-elect Biden and Vice President-elect Harris know that we must tackle the urgent threat of climate change.\n\nTune in as they introduce the tested team of bold thinkers taking on this challenge: https://t.co/L4fHLMcKir", "It's not enough to say we have a climate crisis. We must take the right actions to confront this crisis, with leadership ready to protect this planet and create millions of good-paying jobs.\n\nThis is the team that will tackle the climate fight:\nhttps://t.co/kj73D37Ql9", "Statement from President-elect Biden on FDA emergency use authorization for Moderna COVID-19 vaccine:\n\nhttps://t.co/nZ53pvxQ2Z https://t.co/EaxqawHePJ", "Statement by HHS, Surgeon General, and CDC nominees on record opioid deaths and spike in overdoses during pandemic: \n\nhttps://t.co/rukJgKaj2Q https://t.co/u0bY0VGq3q", "Statement from incoming Biden-Harris National Economic Council Director Brian Deese on providing critical economic relief to Americans: https://t.co/eltQL6SMlL", "Today, President-elect Biden announced additional members of the White House communications &amp; press staff.\n\nThese talented individuals demonstrate the president-elect's commitment to building an administration that looks like America &amp; is day one ready.\nhttps://t.co/p0VIVu78Q2", "We are continuing to lay the groundwork for the Biden-Harris administration, which will be ready on day one, to tackle the country's current challenges. Join our press briefing to hear the latest: https://t.co/cACd2MYt19", "Readout of Biden-Harris transition meeting with Rev. Dr. William J. Barber II and the Poor People’s Campaign:\n\nhttps://t.co/efiZSMXgJd https://t.co/W19pDr341e", "RT @ali_a_zaidi: We need a whole-of-government approach to take on the climate crisis — in a way that spurs jobs and advances justice. I wa…", "RT @Brenda_Mallory: I’ve dedicated my career to solving environmental challenges for communities, addressing environmental justice, and tac…", "RT @Gina_McCarthy: I am honored to lead the first White House Office of Domestic Climate Policy.\n\nMy goal is to marshal our entire governme…", "RT @JenGranholm: I’m honored that President-elect @joeBiden has placed his faith in me as his Energy Secretary nominee.  We have an opportu…", "RT @DebHaalandNM: A voice like mine has never been a Cabinet secretary or at the head of the Department of Interior.\n\nGrowing up in my moth…", "This team will play a major role in supporting the communities most affected by climate change, while empowering the young people whose futures are most at stake.\n\nWe all have a stake in this fight. And our administration will be ready to meet the moment. https://t.co/AtZzHZx09j", "The undeniable reality of climate change is taking a toll on lives and livelihoods across the country. \n\nThis team will listen to scientists, experts, and affected communities as we race to confront one of the most urgent challenges facing our nation.\nhttps://t.co/kj73D37Ql9", "Statement by President-elect Biden on Cybersecurity: \n\nhttps://t.co/MDDOeoInal https://t.co/tdiLeSbtMi", "RT @PeteButtigieg: Americans shouldn't settle for less than our peers in the developed world—we should lead the way on infrastructure. And…", "President-elect Biden will launch a national effort to create the jobs we need to build modern, sustainable infrastructure now and deliver an equitable clean energy future.", "The Biden-Harris administration will ensure that—coming out of this profound public health and economic crisis, and facing the persistent climate crisis—we are never caught flat-footed again.", "RT @PeteButtigieg: I'm mindful of the history of this appointment, knowing this is the first time an American president has ever sent an op…", "Our administration will work to invest in America's infrastructure to create millions of good, union jobs to rebuild this country back better than ever.", "\"[He] will carry out the Department's duty to keep Americans safe on our roads &amp; railways, &amp; in our skies.\n\nPete will help us build back better with jobs &amp; hope, with vision &amp; execution.\" — President-elect Biden on Pete Buttigieg, Secretary of Transportation Nominee https://t.co/seyglmr9ID", "RT @vivek_murthy: While we may come from different backgrounds, #COVID19 has reminded us that when it comes to our health, we’re all deeply…", "President-elect Biden &amp; Vice President-elect Harris introduce Mayor Pete Buttigieg as their Sec. of Transportation nominee, who will implement the president-elect's build back better agenda. Tune in: https://t.co/RjqpRDzPvT", "RT @PeteButtigieg: This is a moment of tremendous opportunity—to create jobs, meet the climate challenge, and enhance equity for all.\n\nI'm…", "South Bend was once called one of America’s “dying cities.” Today, it’s a hub of innovation and job growth.\n\nMayor Pete Buttigieg led that resurgence, and has been nominated by the President-elect to continue that work as Transportation Secretary.\n\nhttps://t.co/dyqdH2LLk3", "RT @RWalensky: Not seeing our loved ones, not being able to be together or embrace each other, is incredibly hard. I know people are frustr…", "\"I’ve given Denis a clear mission: fight like hell for our veterans and their families.\" — President-elect Biden on Denis McDonough, Nominee for Secretary of Veterans Affairs https://t.co/YzY1hoVg8K", "\"Trade is like any other tool in our domestic or foreign policy—it is not an end in itself. It is a means to create more hope and opportunity for people.\" — Katherine Tai, Nominee for United States Trade Representative https://t.co/SC52W8RbzO", "“The USDA will be a team player—working with our sister agencies to advance issues of shared interest: rebuilding our infrastructure, fixing a broken immigration system, and fighting the ongoing opioid crisis.” — Tom Vilsack, Secretary of Agriculture Nominee https://t.co/upL0BxLNjB", "Stories like Elena &amp; her daughter Xiomara's remind us of the importance of the Affordable Care Act.\n\nToday is the last day of open enrollment for health insurance through the ACA for 2021.\n\nVisit https://t.co/6ylFIJBEoY to find a plan that works for you. #GetCovered https://t.co/q3MDSF8Sl6", "President-elect Biden reminds us that democracy beats deep in the hearts of the American people. https://t.co/hNGrsQGlS4", "RT @DenisMcDonough: The President-elect’s marching orders to me were clear: “Fight like hell for our veterans.”\n\nI will honor that order. W…", "Tune in as President-elect Biden delivers remarks on the electoral college vote certification and the strength and resilience of our democracy. https://t.co/DK3fLbQQNJ", "Tomorrow is the last day of open enrollment for health insurance through the Affordable Care Act for 2021.\n\nVisit https://t.co/6ylFIJBEoY to #GetCovered! https://t.co/hvOlX7XEoD", "Statement by President-elect Biden Marking 8 Years Since the Shooting at Sandy Hook Elementary School: https://t.co/ENGNgDPVQB", "RT @mlfudge: This pandemic, the recession, and the plight of racial injustice has chipped away at our country's hope—and at the promise of…", "RT @ABlinken: Among my parents and grandparents are immigrants, refugees, a Holocaust survivor. For them and many others, America was the l…", "Statement by President-elect Biden on the 25th Anniversary of the Dayton Accords:\n\nhttps://t.co/5mfHwpbOze https://t.co/x8i57fR6Vt", "Millions of Americans can't wait for relief any longer—we must act now. https://t.co/daxPrg6kbT", "We set a bold and doable challenge within the first 100 days of the Biden-Harris administration: \n\n- Vaccinate 100 million Americans \n- Ask the American people to wear masks\n- Reopen most schools\n\nThe first 100 days won't end COVID-19, but meeting these goals can save lives. https://t.co/1jxAfK9mET", "Wearing a mask isn’t about politics—it’s science. https://t.co/InZBj4WkKj", "Climate change poses an existential threat—not just to our environment, but to our health, our communities, our national security, and our economic well-being.\n\nPresident-elect Biden will lead the world to address the climate crisis.\nhttps://t.co/y5aJiGl9CE", "Statement by President-elect Biden on the Five-Year Anniversary of the Paris Agreement:\n\nhttps://t.co/KPvsyFMNHX https://t.co/pM0c82Zqf7", "Five years ago today, the world gathered to adopt the Paris Agreement on climate change. \n\nOn day one of the Biden-Harris administration, we will rejoin the Paris Agreement. https://t.co/unZ4WFInBK", "\"I've seen him take on HIV/AIDS, H1N1, Ebola, Zika, COVID-19, and every infectious disease in between, over his nearly forty years of service to our country.\n\nTrusted. A truth teller. A patriot.\" — President-elect Biden on Dr. Anthony Fauci https://t.co/v76B4ZmqfK", "President-elect Biden believes we need a major mobilization of effort and resources to advance racial equity across the American economy. \nhttps://t.co/zmFstgxdM4", "Extraordinary challenges demand committed leadership. This group of individuals has the experience to get us through this moment—and fight for a government that works for everyone. https://t.co/bxz459wSZr", "Tune in as President-elect Biden &amp; Vice President-elect Harris announce key members of their administration who will lead with compassion &amp; integrity to make our government work for all Americans. https://t.co/h1gTIo4aJx", "Our transition team continues to lay the groundwork for the Biden-Harris administration. Join our press briefing for the latest updates: https://t.co/LTLtv2xTFw", "We have assembled a team of highly respected and qualified individuals to serve on the national security and foreign policy team.\n\nThey will put us on a path to restore our relationships abroad, and renew our safety here at home. https://t.co/4GdYeDAvqi", "Statement from President-elect Biden on FDA Advisory Committee Recommended Emergency Use Authorization of Pfizer-BioNTech COVID-19 Vaccine: https://t.co/rk1G5aLBP5", "Happy Hanukkah to everyone who is celebrating from the Biden-Harris Transition team!\n\nWhile this year may look different for many, we hope these next eight nights are filled with light, joy, and love. Chag Sameach! https://t.co/bggSm7FrLF", "RT @DouglasEmhoff: Hanukkah is one of our favorite holidays -- and a reminder to spread the light at a time when we've never needed it more…", "RT @AmbassadorRice: I am humbled and excited by this call to serve. The scale of the challenges ahead demands a government that works for a…", "Katherine Tai is a dedicated public servant, with deep international trade experience.\n\nNo one is more qualified to work across labor, business, federal agencies, and Congress to pursue the President-elect’s vision of a pro-American worker trade strategy.\nhttps://t.co/Bytd4G7bkr", "“I come to this role now as a civilian leader—with military experience to be sure—but also with a deep appreciation and reverence for the prevailing wisdom of civilian control of our military.” — Lloyd Austin, Nominee for Secretary of Defense https://t.co/MwSRrzovsh", "Our nation faces a hunger crisis, farmers are reeling, &amp; rural communities are struggling with the economic fallout from the pandemic. We need steady leadership––now.\n\nAt the Department of Agriculture, Tom Vilsack will take on those challenges on Day One.\nhttps://t.co/9vkG3fxmVn", "RT @DenisMcDonough: When I received the call from President-elect Biden, I assured him that I will represent the voices of all veterans at…", "Today, President-elect Biden recognizes #HumanRightsDay and honors those who work tirelessly, often at great personal risk, to defend fundamental freedoms and fight oppression. \n\nThe President-elect's full statement: https://t.co/Qqw1YmMrSs", "RT @mlfudge: The President-elect has asked me to serve as Secretary of Housing and Urban Development to make sure people in every part of t…", "Working families, veterans, farmers and producers, and those fighting for their place in the middle class will have partners in government once again.\n\nThis experienced group will help us make it through this pandemic and thrive once the crisis is over.\nhttps://t.co/5tVM8IrmYM", "RT @CeciliaERouse: A central focus of the Council of Economic Advisers is to identify the very best programs and policies to put in place t…", "We will do everything we can to make sure everyone wears masks for 100 days under our administration. \n\nWearing a mask is not a political statement. It's a patriotic act. https://t.co/U6x6hfUt6R", "El presidente electo Biden anunció designaciones y nombramientos de su equipo de salud. \n\nEste es un equipo que se parece a los Estados Unidos y reúne a líderes con vasta experiencia en la salud pública, el gobierno, y el manejo de crisis.\nhttps://t.co/mVmoFRrhj7", "RT @JohnKerry: Climate change is an existential crisis. Life on this planet is being threatened.\n\nBut it’s not all doom and gloom, we have…", "Our national security team will be relentless in keeping our country safe, with a vision on how to tackle the most pressing challenges of our time.\n\nWe will bring together allies and partners around the world to face these threats head on.\n\nAmerica is back. https://t.co/1Vz5Xwe37r", "Tune in as President-elect Biden and Vice President-elect Harris introduce retired four-star Army general Lloyd J. Austin III as their nominee to serve as the 28th United States Secretary of Defense.  https://t.co/YJ0B1sICKV", "RT @LindaT_G: I've been around long enough to know that global change relies on diplomacy and building relationships with people around the…", "RT @RWalensky: Government service was never part of my plans. But every doctor knows that when a patient is coding, your plans don’t matter…", "“In the fight against this pandemic, we must lead with science.” — Dr. Anthony Fauci https://t.co/W6c7Svy15U", "Readout of President-elect Biden and Vice President-elect Harris’s Meeting with Civil Rights Leaders: https://t.co/eEy8LncmbB", "RT @XavierBecerra: Now it's our turn to build up and to back up our health care workers battling the coronavirus.\n\nOur turn to restore fait…", "Through our collective pain, we will find our collective purpose —to control the pandemic, to save lives, and to heal as a nation.\n\nThat is why President-elect Biden built a team of world-class experts who will work with him to change life in America for the better. https://t.co/VywQL7Nnnz", "RT @vivek_murthy: The best doctor is not an authority figure who writes prescriptions, but rather a partner in healing — someone who sees p…", "RT @DrNunezSmith: It is our societal obligation to ensure equitable access to testing, treatments, and vaccines. Equitable support for thos…", "Like President-elect Biden, General Lloyd Austin believes we have the strongest military in the world—and that we must lead not with the example of our power, but the power of our example. https://t.co/6aKTyqtxkw", "President-elect Biden understands that we need a team ready on day one to combat the most pressing health challenges. Tune in as the president-elect announces key members of the health team. https://t.co/t517BL6iWE", ".@JanetYellen is a crisis-tested and experienced leader who has spent her career prioritizing working families.\n\nNo one is better prepared to deal with our economic crises than her. https://t.co/a9MmYPKftG", "Black and Brown communities continue to be disproportionately impacted by climate change, COVID-19, and the economic crisis due to systemic inequalities.\n\nOur administration will work every day to root out systemic racism that hinders progress for all.\nhttps://t.co/zmFstgxdM4", "President-elect Biden and Vice President-elect Harris are confronting a pandemic, an economic crisis, widespread racial injustice, and climate change. The team being assembled will meet these challenges on day one.\nhttps://t.co/umtZMG8BbH", "RT @JanetYellen: Our mission is to restore economic prosperity and financial stability.\n\nWe’ll do that by pursuing an investment agenda to…", "Dr. Anthony Fauci, America's preeminent expert on infectious diseases, has been among the most trusted voices throughout the pandemic. He will continue in his role and serve as Chief Medical Adviser on COVID-19 to President-elect Biden as we work to overcome this crisis.", "RT @vivek_murthy: I never dreamed I’d have the honor to once again serve as Surgeon General. In this moment of crisis, I’m grateful for the…", "RT @DrNunezSmith: As we come back from this crisis, we need to bring everybody along. It's been my life's work to combat systemic inequitie…", "RT @RWalensky: I began my medical career at the height of the HIV/AIDS crisis, and I've spent my life ever since working to research, treat…", "RT @XavierBecerra: In Congress, I helped pass the Affordable Care Act. As California's Attorney General, I defended it. As Secretary of Hea…", "Our health team will be ready to combat our most pressing health challenges: containing the pandemic, tackling inequity, and ensuring every American has access to affordable, quality health care.\n\nThey will lead with science, expertise, and integrity.\nhttps://t.co/v2qAmJURjE", "We aren’t just going to rebuild what has worked in the past. This is our opportunity to build back better than ever.\n\nhttps://t.co/uumnEjWFcJ", "The Biden-Harris administration will work every day to fight for American families. It's time for us to begin the work to heal, unite, and rebuild an economy for ALL Americans. https://t.co/ztOwbdksTW", "We are thankful to Dr. Gilman and all the inspiring frontline workers who risk their lives to protect us during this pandemic. \n\nWe promise you this: You have a partner in the Biden-Harris administration. https://t.co/vcDDL0rOLh", "\"The sooner we pass the funding, the sooner we can turn the corner on COVID-19.\" — President-elect Biden https://t.co/qi7irDy7oF", "46 days until 46.", "Americans are struggling right now.\n\nThey need our help. They can't wait. \n\nWe must come together and act to help the American people. https://t.co/2d8g8ov3Pr", "Statement by President-elect Joe Biden on the November Jobs Report and Continuing Economic Crisis. https://t.co/DhMawzHHMI", "Today's jobs report reinforces we remain in the midst of one of the worst economic and jobs crises in modern history. Tune in as President-elect Biden talks about how we can get through this.  https://t.co/NCuLlfIcmO", "“The President-elect understands how scary these times are, and is committed to an agenda that will ensure we address the virus and restore economic growth for every corner of this country.”  — Neera Tanden, OMB Director Nominee https://t.co/eoW0wnQI7e", "RT @AliMayorkas: I’m very proud of my identity, I’m very proud of my heritage, I’m very proud of my parents, and most of all I’m proud to b…", "The Biden-Harris presidential transition is moving full speed ahead. Join our press briefing to hear the latest updates: https://t.co/6Hw86mbEjQ", "Families across this country need help now.\n\nPresident-elect Biden will work tirelessly to ensure that families come out of this with the support they need to get their lives back on track. \n\nThe American people have shown their grit. It's time the government shows it. https://t.co/sWkOouI20F", "Statement by President-elect Joe Biden on United Nations International Day of Persons with Disabilities. https://t.co/Dr8ZtvHuE2", "RT @BrianCDeese: The climate crisis, racial inequity, and our economic recovery are inextricably linked. Our government must reflect that r…", "If we are going to tackle the climate crisis, then solutions must be woven into every aspect of our economic policy.\n\nBrian Deese is an economic leader and climate policy expert who will bring his expertise back to the White House as Director of the National Economic Council. https://t.co/90ffmreUDf", "Open enrollment for health insurance through the Affordable Care Act is here until December 15.\n\nSign up to #GetCovered: https://t.co/Oppvl638BT https://t.co/OMkMdvHL4m", "Vice President-elect Harris continues to build a White House senior staff that not only looks like America but reflects the very best of our nation and will be ready to hit the ground running on Day One.\nhttps://t.co/qhOdF9MOxQ", "Statement by President-elect Joe Biden on the 50th anniversary of the Environmental Protection Agency. https://t.co/QNdJNXUkd0", ".@NeeraTanden understands the struggles that millions of working Americans are facing because she has lived them.\n\nAs head of OMB, she’ll always be motivated by what she can do to help those families — and create a budget that reflects the values of America. https://t.co/o8ZR5EX5nO", "Esta semana el presidente electo Joe Biden anunció los miembros clave de su equipo económico.\n\nEste es el equipo que ayudará a sacar a nuestro país de la recesión económica y reconstruir mejor. https://t.co/g9yKYeT3zJ", "Tune in as President-elect Biden participates in a virtual roundtable with workers and small business owners impacted by the economic crisis. https://t.co/bW0TRfdAfH", "The Biden-Harris administration will build an economy where every American enjoys a fair return for their work and an equal chance to get ahead. An economy more vibrant and more powerful precisely because everybody will be cut in on the deal. \n\nAmerica—help is on the way. https://t.co/fH8rlImiOv", "RT @wallyadeyemo: America has always overcome crises as a direct result of the determination and persistence of the American people, and th…", "“I’m here today because of social programs. Because of budgetary choices. Because of a government that saw my mother’s dignity, and gave her a chance. Now, it’s my honor to help shape those budgets and programs to keep lifting Americans up.” — Neera Tanden, OMB Director Nominee https://t.co/NtggKHha9k", "This crisis-tested and experienced team of groundbreaking Americans share the President-elect's core economic vision: that given a fair shot and equal chance, there's nothing beyond the capacity of the American people. https://t.co/PIFoZPz5P1", "RT @CeciliaERouse: This is a moment of urgency and opportunity unlike anything we’ve faced in modern times.\n\nThe urgency of ending a devast…", "RT @JanetYellen: The Treasury Department must be an institution that wakes up every morning thinking about the American people. \n\nYour jobs…", "Statement by President-elect Biden on the U.S. Supreme Court case on the Census. https://t.co/9sFp4pIlJt", "On #WorldAIDSDay 2020, President-elect Biden joins communities worldwide in remembering those we have lost and recommits the United States to the important work ahead to achieve an AIDS-free generation.\n\nThe President-elect's full statement: https://t.co/FeaAjrX7P1", "50 days until President-elect @JoeBiden and Vice President-elect @KamalaHarris are inaugurated.", "Tune in as President-elect Biden and Vice President-elect Harris introduce their nominees and appointees for key economic posts.\n\nThis team will get to work on day one to build our economy back better. https://t.co/NewKmFcv9L", "President-elect Biden believes that the federal government must act aggressively to help protect and support our families, small businesses, first responders, and caregivers affected by COVID-19.\n\nThe Biden-Harris administration has a plan to do just that:\nhttps://t.co/bq3bIujJLm", "Today, President-elect Biden took part in separate congratulatory calls today with the leaders of Argentina, Costa Rica, and Kenya as well as with the Secretary-General of the UN.\n\nhttps://t.co/1lvJbEYFFX", "Joint statement by President-elect Biden and Vice President-elect Harris on the anniversary of Guru Nanak Dev Ji's birth: https://t.co/GOQXHk64pb", "President-elect Biden believes this is no time to build back to the way things were before—with the old economy's structural weaknesses and inequalities still in place. \n\nThis is the moment to build a new American economy that works for all.\nhttps://t.co/G86xVtLDIE", "RT @neeratanden: After my parents were divorced when I was young, my mother relied on public food and housing programs to get by. Now, I’m…", "It’s time to rebuild an American economy that works for all of our families and the next generation.\n\nIt’s time to ensure every American enjoys an equal chance to get ahead.\n\nIt’s time to build our economy back better. https://t.co/bRlXXXL3Fo", "RT @HBoushey: My life's work has been centered on ensuring our families and work are properly valued within our economy. \n\nI’m excited to b…", "RT @wallyadeyemo: Public service is about offering hope through the dark times and making sure that our economy works not just for the weal…", "RT @CeciliaERouse: I am focused on the task ahead. This job is about advising the President on how to rebuild and revive our economy. The p…", "RT @JanetYellen: We face great challenges as a country right now. To recover, we must restore the American dream—a society where each perso…", "This crisis-tested team will help lift America out of our current economic downturn and build back better—creating an economy that gives every single American a fair shot and an equal chance to get ahead. \nhttps://t.co/F6JMBHUgVx", "We all have a role to play in beating this crisis—every decision matters. Every decision we make can save lives. https://t.co/XrMZWoTaT4", "President-elect Biden and Vice President-elect Harris today announced new members of the White House staff who will serve in senior communications roles.\n \nFor the first time in history, these communications roles will be filled entirely by women.\nhttps://t.co/SjWAWJg941", "The Biden-Harris administration will always listen to science and ensure public health decisions are informed by public health experts.\n \nToday, we announce additional members joining the Transition COVID-19 Advisory Board: https://t.co/FR7aWzwus4", "Our frontline workers are American heroes. It is not enough to just praise them, we have to listen to them and pay them.\n\nThe Biden-Harris administration will listen to frontline workers and will lead by their example to combat this pandemic. https://t.co/sCzXfJRQj2", "We've fought a nearly year-long battle with COVID-19, but President-elect Biden reminds us that we're at war with a virus--not each other. \n\nWe're all in this together. https://t.co/9GxaZy3c4E", "Today, we honor Indigenous communities and their ancestors. This Native American Heritage Day, let us reflect &amp; celebrate their contributions &amp; rich heritage.\n\nThe Biden-Harris administration will build strong partnerships with Native communities to ensure opportunities for all.", "The moment has come for our country to deal with systemic racism, to deal with growing inequality, and to deal with the denial of the promise of this nation to so many.\nhttps://t.co/zmFstgxdM4", "This Thanksgiving, we reflect on this past year and think about what lies ahead. We know these times are hard, but we know that we will overcome this current crisis together as a nation. We are all in this together. \n\nHappy Thanksgiving.", "\"This Thanksgiving —\nAnd in anticipation of all the Thanksgivings to come —\nLet's dream again.\nLet's commit ourselves to thinking not only of\nourselves but of others.\" — President-elect Joe Biden https://t.co/O5psOkW0cL", "\"America at its best still has a greater ability than any other country on Earth to bring others together to meet the challenges of our time.\" — Nominee for Secretary of State, @ABlinken https://t.co/SRJyazqtDV", "RT @AliMayorkas: For twelve years I had the privilege to stand in a federal courtroom and announce, “Alejandro Mayorkas on behalf of the Un…", "Tune in as President-elect Biden shares a special Thanksgiving message on the shared sacrifices Americans are making this holiday season and how we will get through the current crisis together. https://t.co/fvEPktNyrr", "Statement by President-elect Joe Biden on the International Day for the Elimination of Violence Against Women. https://t.co/Sm3w5ABqQ6", "The presidential transition continues to move forward. \n\nJoin Jen Psaki, Advisor to the Biden-Harris Transition and our Executive Director Yohannes Abraham, for a press briefing on the latest: https://t.co/RWZ7zypOu1", "\"Let’s begin that work to heal and unite America as well as the world.\" — President-elect Joe Biden https://t.co/rwDZXBu3ct", "\"For the first time ever, there will be a principal on the National Security Council who will make sure climate change is on the agenda in the Situation Room.\" — President-elect @JoeBiden on appointing @JohnKerry as the Presidential envoy on climate. https://t.co/chVuorXLi6", "Statement by President-elect Biden on General Motors’ announcement yesterday: https://t.co/mGrBER9kA5", "RT @JohnKerry: The president-elect is right to rejoin the Paris Agreement on Day One. And he is right to recognize that Paris alone is not…", "These public servants will restore America's global leadership and moral leadership. They will reimagine American foreign policy and national security for the next generation. \n\nAnd they will tell President-elect Biden what he needs to know, not what he wants to know. https://t.co/UXQFYippsc", "ICYMI: Readout of President-elect Biden's call with Prime Minister Jacinda Ardern of New Zealand earlier this week. https://t.co/Iwkwef9mi5", "RT @LindaT_G: In my thirty-five years in the Foreign Service across the world, I put a Cajun spin on it. I call it Gumbo diplomacy.\n\nWherev…", "We have assembled a team of highly respected and qualified individuals to serve as national security and foreign policy leaders. Tune in as President-elect Biden &amp; Vice President-elect Harris introduce them. https://t.co/bQpSiT1GHY", "President-elect Biden took part in separate congratulatory calls yesterday with the leaders of the European Commission, European Council, Jordan, and NATO.\nhttps://t.co/YRWHGnsZ5O", "Statement by Biden-Harris Transition Executive Director Yohannes Abraham. https://t.co/lPflye5iTO", "We have gathered the most respected and qualified individuals to serve during our first National Security appointments. This group will put us on a path to restore our relationships abroad, and renew our safety here at home.\nhttps://t.co/geWIRirste", "RT @ABlinken: The messages from friends and colleagues that I’ve received over the past 15 hours have been humbling. \n\nHonored to announce,…", "RT @jakejsullivan: President-elect Biden taught me what it takes to safeguard our national security at the highest levels of our government…", "RT @AliMayorkas: When I was very young, the United States provided my family and me a place of refuge. Now, I have been nominated to be the…", "RT @JohnKerry: America will soon have a government that treats the climate crisis as the urgent national security threat it is. I'm proud t…", "RT @LindaT_G: My mother taught me to lead with the power of kindness and compassion to make the world a better place. I’ve carried that les…", "Under the Biden-Harris administration, American national security and foreign policy will be led by experienced professionals ready to restore principled leadership on the world stage and dignified leadership at home. Read more: https://t.co/ojrTxrzafV", "Our White House Senior staff will work with President-elect Biden and Vice President-elect Harris to implement a bold agenda that will build our nation back better than before and ensure every American has a fair shot.\nhttps://t.co/ruN2HkW4P5", "It’s time to rebuild our economy better than before—so that this time everyone is in on the deal.\n\nPresident-elect Biden has a plan to ensure every American has an equal chance to get ahead.\n\nhttps://t.co/zVjm3uVCPe", "More than 250,000 Americans have died from COVID-19.\n\nTo the families who have lost loved ones — our thoughts are with you.\n\nPresident-elect Biden and Vice President-elect Harris will fight every day to contain COVID-19.", "Today, President-elect Biden and Vice President-elect Harris met with Speaker Pelosi and Democratic Leader Schumer to discuss their shared priorities to provide help to struggling working families and small businesses. https://t.co/vo2yzh5Sbj", "Statement by President-elect Biden on Transgender Day of Remembrance: https://t.co/CghbBwRtq5 https://t.co/P4Q1DVJfxp", "Tune in as we discuss the delay in ascertainment and how we are moving forward for a smooth transition. https://t.co/El8RemDBwU", "President-elect Biden continues to assemble a White House Senior Staff that looks like America, recognizes the challenges Americans face, and is committed to delivering working families results on Day One.\nhttps://t.co/tQ5HdhqK1w", "The Biden-Harris transition will listen to science, be driven by honesty, and reflect the positive character of the American people.", "Governors are working tirelessly to protect Americans during these unprecedented times.\n\nToday, President-elect Biden &amp; Vice President-elect Harris met with @NatlGovsAssoc. Tune in for their remarks: https://t.co/pnLu9IVhIP", "The Biden-Harris administration will act swiftly and aggressively to help protect and support the frontline health care workers helping us face this pandemic. Tune in as President-elect Biden participates in a virtual roundtable with frontline workers: https://t.co/mGcpbDOc9G", "President-elect Biden took part in separate congratulatory calls today with leaders in Chile, India, Israel, and South Africa: https://t.co/geWMmDNNYO https://t.co/rEBxMETvWM", "Jen O’Malley Dillon will serve in the Biden-Harris White House as Deputy Chief of Staff. https://t.co/d2BEaAjFnJ", "Congressman Cedric Richmond will serve in the Biden-Harris White House as Senior Advisor to the President and Director of the White House Office of Public Engagement. https://t.co/DzI24x7mVH", "Our White House senior staff is composed of individuals who demonstrate the President-elect's commitment to building an administration that looks like America, has expertise in governing, and will be ready deliver results for working families on Day One.\n\nhttps://t.co/MXnMExXAFp https://t.co/DaWmRI8PRk", "This is the moment to imagine and build a new American economy for our families and the next generation.\n\nTune in as President-elect Biden delivers remarks on how we can build back better: https://t.co/ofo7h7VxxN", "On today's anniversary of the Clean Air Act, the task of protecting the air we breathe has never been more urgent or more vital.\n\nOur administration will deliver on the goals of the Clean Air Act, while meeting this moment in history to address the climate crisis.", "We face four historic crises.\n\nThe worst pandemic in a century. The worst economic crisis since the Great Depression. The most compelling call for racial justice since the 60s. And the undeniable threat of climate change.\n\nWe're preparing to tackle these challenges on Day One. https://t.co/534ZoGNqTt", "The presidential transition is moving full speed ahead. Join our press briefing for updates on where we stand: https://t.co/grAzzVzDCr", "Readout of President-elect Biden's conversation with House Speaker Nancy Pelosi and Senate Democratic Leader Chuck Schumer: https://t.co/mfn6lGPgAc https://t.co/O388Jhlu1O", "President-elect Biden spoke this morning with His Holiness Pope Francis. https://t.co/om635SC3M9 https://t.co/DYuiiphOE0", "President-elect Biden took part in separate congratulatory calls this evening with the leaders of Australia, Japan, and the Republic of Korea.\n\nhttps://t.co/u0wd70i1y3 https://t.co/09AqoO8875", "Ronald Klain will serve President-Elect Biden as White House Chief of Staff. https://t.co/hERLdgML6n", "Together, as a nation, we pause to honor the service, the valor, and the commitment of all those who have worn the uniform of the Armed Forces of the United States.\n\nThose who have fought and sacrificed for our country are heroes who have earned our thanks and respect.", "Today, President-elect Joe Biden took part in separate congratulatory calls with the leaders of France, Germany, Ireland, and the United Kingdom. https://t.co/vCyAVVF3qw", "Agency review teams are an integral part of the transition process, responsible for evaluating the operations of federal agencies.\n\nOur teams are composed of diverse experts with deep policy expertise, ready to ensure we're prepared to lead on Day One.\n\nhttps://t.co/2gY1E0Ey5k", "It's wrong for healthcare to be made less accessible and more expensive––especially during a global pandemic.\n\nThe Biden-Harris administration will fight to protect and expand the Affordable Care Act, so every American has access to quality, affordable health care.", "President-elect Biden and Vice President-elect Harris deliver remarks on the stakes for families across the country in Texas v. California, the Trump administration’s lawsuit to overturn the Affordable Care Act. https://t.co/8Oc8fafdkm", "Right now, the most potent weapon against this virus is a mask. It is our shared duty to protect our fellow Americans as we wait for a vaccine. https://t.co/YGvdkSM08Q", "Today, President-elect Biden thanked Prime Minister Trudeau for his congratulations and reaffirmed the close bonds between the United States and Canada. https://t.co/DFnfdL2Qbp", "President-elect Biden promised to ensure public health decisions are informed by public health experts. We are making good on that promise.\n\nToday, we announced a COVID-19 advisory board to provide science-based guidance for navigating this pandemic: https://t.co/z0nuAkWPcu https://t.co/524nqj4IKJ", "President-elect Biden just met with his newly formed COVID-19 advisory board.\n\nTune in for a debrief:  https://t.co/fVLhCn6adH", "Statement by President-elect Biden on Pfizer's vaccine progress: https://t.co/eOiLZnqO8N", "The President-elect spoke with former President Bush this morning. https://t.co/fYx2Lux6OM", "The task ahead of the Biden-Harris administration is unlike any other in our history.\n\nIn preparation, our transition will be led by experts, by science, and with character—ensuring that we will be ready to lead on Day One.", "We are preparing to lead on Day One, ensuring the Biden-Harris administration is able to take on the most urgent challenges we face: protecting and preserving our nation's health, renewing our opportunity to succeed, advancing racial equity, and fighting the climate crisis.", "The work ahead in the next 73 days will be the foundation for an administration that puts the health, safety, and character of our communities first.\n\nLearn how the Biden-Harris transition will move forward at https://t.co/97NKAZksSL\n\nhttps://t.co/No1DQqI4gx", "We stand together as one America. We will rise stronger than we were before.\n\nhttps://t.co/97NKAZksSL https://t.co/PRvzygWxRI"]}