{"tweets": "RT @mrshananto: For those who say \"that's privilege\".\n\nBe that person who supports teenage girls getting this kind of privilege.\nBe that pe… RT @mrshananto: Our daughter is turning 17.\nShe studies chemistry, biology, history.\nShe loves singing.\nShe is involved in social projects.… RT @afgansyah_reza: It's here!! My new song featuring @JacksonWang852 is available on all digital platfroms!! Lets keep this one on repeat… Bagi-bagi bunga 💖🌸\n\nELLE Magazine @elleindonesia https://t.co/Q7kcePg6WL Surat Untuk Presiden.\n\nFilm Indonesia milik kita semua, menjadi sahabat di banyak waktu, merekam banyak peristiwa bangsa. \n\nKami ingin kembali bisa berkarya dan menginspirasi. \n\nKami memohon dukungan Bapak Presiden @jokowi. \nDan seluruh rakyat Indonesia.\n\n#FilmIndonesiaFilmKita https://t.co/7uXRGaAK1h Mood 🔥\n\n #EarwigAndTheWitch @JP_GHIBLI https://t.co/msB7vF0utt Malam ini di IGLIVE mau diskusi sama dokter @darrellfernando seputar pencegahan kanker payudara dan serviks. https://t.co/yh69S4Ut2n Mimpi jadi Hime setengah hari ☑️\n\nHonored to be on the cover of @elleindonesia magazine March 2021 issue for #ElleWomenInMusic https://t.co/NxqN8dUTF1 Petualangan Sherina 2 UPDATE\n\nSedang tahap tulis lagu &amp; workshop aransemen musik! Sebagian dikerjakan di kantor @MilesFilms &amp; kini lanjut via daring. \n\nSaya bertindak sebagai composer &amp; penata musik. Workshop dengan Alvin Witarsa sebagai Co-Orchestrator. ✨ \n\n#PetualanganSherina2 https://t.co/ZyKbGGWdCB RT @majelismeyong: https://t.co/At7EvgqxwC Happy Valentine’s Day @baskaramp 🤍\n\nHonored to be on the cover of \n@dewimag for their January-March issue. Thank you Dewi Magazine!\n\nArticle:\nhttps://t.co/YibyvPuGHi https://t.co/pSfKGdEKOB Our first ever magazine cover together!\n\nHonored to be on the cover of @dewimag for their January-March issue.\n\nEntire team PCR tested negative, masks on at all times, except models only during makeup &amp; photoshoot. Thank you so much dream team!\n\nArticle:\nhttps://t.co/YibyvPuGHi https://t.co/glCS1ExXmZ RT @ernestprakasa: Teman-teman sejawat di industri hiburan, tolong lah kalo positif meski OTG jangan maksain tetep kerja. Anda mungkin gak… 2021 ini lagi belajar nulis dengan baik dan benar di Sibelius! Iseng sharing lagu yang ku tulis minggu lalu. \n\nDitulis untuk Solo Violin tapi jelek bgt suaranya 😱, untuk kepentingan preview ku ganti jadi Violin sekawan. \n\nGlissando bunyinya juga wakwaw...\n\nPokoknya belajar dulu~ https://t.co/EGCIAX33Hs Random love you mom post! \n\n03/11/2020 https://t.co/vfxbb6NqLO Saya mendukung Natha Satwa Nusantara dan aparat hukum Indonesia untuk mengusut sampai tuntas dan menghukum pelaku penyiksaan terhadap hewan, khususnya kasus yang sekarang sedang terjadi di Medan. https://t.co/HSRp1LMWdV Oct 24 2018, vocal recording session for Studio Ghibli’s Earwig and The Witch!\n\nI miss Tokyo so much!\n@JP_GHIBLI https://t.co/zJJb55HOLW Kita sangat berharap kantor pemerintah di kota lain yang punya wewenang untuk membuat perubahan juga menyadari bahwa kekejaman &amp; siksaan terhadap kuda pekerja adalah hal yang tidak benar &amp; sekarang saatnya menghentikan penderitaan kuda-kuda ini. Berita gembira lainnya adalah @jaan_indonesia baru saja membahas program ini dengan Ibu Drh. Rismiati MSE, Kepala Bidang Peternakan dan Kesehatan Hewan, KPKP DKI Jakarta, yang mengatakan bahwa beliau berkomitmen untuk menerapkan program ini di seluruh wilayah di Jakarta! 👏🏻😭💖 Saat ini @jaan_indonesia kerja sama dengan Drh. Hasudungan - KPKP Jaksel untuk menjalankan program melindungi kesejahteraan kuda pekerja di Jaksel.\n\nProgram mulai resmi Februari 2021, tapi Drh. Hasudungan &amp; tim memulai persiapan lebih awal di Desember 2020! 👏🏻👏🏻 Di balik budaya yang sudah menjadi hal yang umum, kita luput dari realita bahwa banyak kuda pekerja di Indonesia yang hidup menderita. Seringkali dipaksa kerja sampai mati kelelahan.  \n\nMari ikut bersuara dan beraksi untuk hentikan penderitaan ini. https://t.co/g41XI2xzmp おやすみ🌛 https://t.co/OOW1Cr5R4x Lagi berandai-andai biar optimis. \n\nApa hal pertama yang ingin kamu lakukan setelah pandemi kelar?\n\nKalau aku pengen banget ketemu kakak dan adek. Mereka sahabatku dan aku masih suka mewek inget pas nikah kemarin mereka ga bisa hadir langsung. \n\nI miss them so much! https://t.co/IlArFprsJ0 @adriandanarw Seru bacain thread neanderthal denisovannya. Inget nonton docu yg bilang mustahil ada interbreeding neanderthal-homo sapien, sampe akhirnya docu lebih baru lagi yg ngebahas soal interbreeding ini. Just imagining the days when we weren’t the only homo genus! 🤩 A little throwback, foto 15 Oktober 2019, kangen brainstorm ide, tatap muka kayak gini, sambil ditemani piring di tengah meja yang isinya snack2 untuk sharing. 😭💖\n\nSemenjak Maret 2020, pre-produksi Petualangan Sherina 2 dilakukan secara virtual. Ditunggu ya update selanjutnya! https://t.co/MdCj6yQFVK My 2021 so far:\n“MINIGIR ITI BILIH, TIPI JINGIN MINJ....“ https://t.co/14FHIvonNo If you’re in for some crazy out of this world entertainment, go browse the comment section in my Instagram. Hopefully you’ll enjoy it as much as I do. https://t.co/TkKFRMMozB See you in year 1955\n\n#upcoming https://t.co/vxc4aU1OpQ Buat yang tadi gak sempat nonton IGLive aku, @baskaramp dan @KawalCOVID19, kamu bisa nonton sesi ngobrol barusan, melalui link berikut ya. Topik obrolannya adalah aktif dan aman selama pandemi!\n\nhttps://t.co/htmwGSQu40 https://t.co/iSUzyA9lYO Live di Instagram @KawalCOVID19 dalam waktu 5 menit lagi! Yuk gabung! 💖 https://t.co/SAXWog9HAm Knew it! 😭💖\n\nFor while we have our eyes on the future\nHistory has its eyes on us https://t.co/GXLRkzckX2 https://t.co/RoCdboz6g6 RT @TheAmandaGorman: Thx @Lin_Manuel ! Did you catch the 2 @HamiltonMusical references in the inaugural poem? I couldn’t help myself! https… Hari Jumat, 22 Januari 2021, jam 20:00 WIB.\n\nAku &amp; @baskaramp akan live di Instagram @KawalCOVID19 untuk ngobrol seputar effort &amp; keputusan2 kita berdua dalam menjalani berbagai aktifitas selama pandemi agar tetap aman untuk kita &amp; orang2 di sekitar kita juga. \n\nSee you then! 😚 https://t.co/aZCLcKv5D0 RT @darrellfernando: abis kena COVID, banyak banget yang nanya:\n- KOK SWAB SAYA MASIH POSITIF?\n- CT VALUE SAYA BELUM NAIK?\n- ISOLASI SAMPAI… HAPPY BIRTHDAY LIN-MANUEL MIRANDA!\n\nManifesting dreams to someday have my future musicals (Yes, musicalSSS) be noticed by the ultimate senpai. \n\nJust you waaaiit! \n\n(Hahahaha ngarep 🥲, oke balik kutak kutik sibelius lagi) @viraniamunaf https://t.co/iIMzdhHQ2d Klarifikasi dari Raffi. Terima kasih! Mari makin aware protokol/guideline kesehatan yang ada, saling mengingatkan demi menekan angka penularan. \n\nFeel free to also call me out in public if you think I’m wrong. Publik jadi bisa belajar dari kesalahan kita.\n\nhttps://t.co/NugzYnooJd Halo Raffi Ahmad, setelah divaksin bukan berarti keluyuran rame2 dong. Anda dipilih jatah awal2 vaksin karena followers banyak. Dengan alasan yang sama, tolong berikutnya konsisten beri contoh yang baik. Please you can do better than this. Your followers are counting on you. “EARWIG AND THE WITCH” Original Soundtrack Album link in my bio.\n\nSome behind the scene photos of our recording session!\n\nWith composer Satoshi Takebe, director Goro Miyazaki, &amp; producer Toshio Suzuki. \n\nStudio Ghibli, Tokyo, October 2018. https://t.co/sXO2LajdZb Mulai hari ini OST Earwig and The Witch sudah bisa dinikmati di platform-platform digital!\n\nDi tweet sebelumnya aku taro link untuk lagu “Don’t Disturb Me”. \nNah, sekarang ini link untuk lagu satunya lagi “The World Is In My Hands”: https://t.co/jBPpZfxNAV Akhirnyaaa Album Original Soundtrack film EARWIG AND THE WITCH hari ini sudah direlease!\n\nUntuk lagu DON’T DISTURB ME bisa diakses lewat link ini: \n\nhttps://t.co/snQWy2mSgx @baskaramp Mulai khawatir sama nasib selimut kita dari om @rizariri 😨 https://t.co/oZ7yVHhyyi Stop covid = aib, kalau gak nyaman go public at least kabari orang2 yg kontak erat, gak usah pake alibi sakit yg lain.\n\nSupport mental tetangga, keluarga atau teman yg terpapar. \n\nTerima kasih buat yang bertanggung jawab kabarin orang2 sekitarnya, go public, ending the stigma. The only way to beat this thing is if we work as a team, karena kebetulan virusnya ini nulaaar. Bukan nakut2in, bukan mau nurunin imun dengan berita buruk, tapi ya ini realitanya. \nBagi yg lg berjuang melawan covid, nakes maupun pasien, semangat! Masih ada orang2 yg peduli 😭🤗 Ada yg terpapar karena pekerjaan resiko tinggi (nakes), ada yg kena karena harus kerja di luar, tapi ada juga yg kena karena ngumpul2 gak esensial yg bisa banget dicegah. Yg terakhir itu nambah masalah. Takut ketauan ga disiplin akhirnya nutup2in, jadilah stigma covid itu aib. Gak semua punya privilege utk selalu physical distancing, jadi kalau kita punya privilege itu bok ya jangan nambah nyusahin mereka yang mau gak mau harus keluar rumah cari nafkah pas pandemi. Tahan dulu lah party2 atau buka2 masker “sejenak” itu. Face shield doang gak ngaruh woy. Gak semua bisa WFH terus menerus, akhirnya ada kasus kena dari tempat kerja, kantor, dll. I want to let you know that I’m sorry you’re going through this. 😞 \nJadi makin 🤬 sama yang kena dari ngumpul keluyuran di luar bubble mereka, terus bilangnya “kaget” atau ngaku sakit lain. “Life's not a song, life isn't bliss, life is just this, it’s living.\n\nYou'll get along, the pain that you feel, you only can heal by living.\n\nYou have to go on living. So one of us is living.”\n\nOnce More, With Feeling\nBuffy the Vampire Slayer https://t.co/OVI36Iijft I used to hateee season 6 of Buffy the Vampire Slayer. The darkest and most depressing season in the series. But now I’m rewatching everything and I find season 6 to be the BEST, it’s sooo gooooood. Especially “Once More, With Feeling” musical episode. 😭👏🏻💖 https://t.co/uzkAEPsFFK Good morning Twitter!\n\nStarting my day with my favorite morning song, singing my favorite verse from My Favorite Things song (The Sound of Music) supaya lebih semangat!\n\nSemangaaaat! 💪🏻 https://t.co/ieYcHBNq5G Masih banget nih party rame-rame? Kapan waras ya? 🥲 @miund Perih banget DUARRR\n\nSherina dan Sadam siap petualangan lagi! 🥲 wkwk\n\n#puber #fashun #fesyenebel #bunga #backdropestetik #adapadengansherina #takut https://t.co/KZia0ydhZt So happy to announce that I’m singing “Don’t Disturb Me” &amp; “The World is In My Hands” (あたしの世界征服), also voicing ‘Earwig’s Mother’ for Studio Ghibli’s upcoming film “Earwig and The Witch”.\n\nAnd omg @KaceyMusgraves is singing &amp; voicing Earwig’s Mother for the English dub! 😍 https://t.co/3xkFLn17CS NEW TRAILER! Wah kek kenal suaranya... (brasa ngimpi yawla) 😭💖 https://t.co/qxtDLOT4Ea Misalnya kena Covid, takut dihakimi karena tidak disiplin 3M/physical distancing, lalu ditutup2i &amp; takut reaksi publik ngefek ke mental yg lagi harus fokus sembuh, ya wes itu pilihan masing2. Dimengerti. Tapi please tetap tanggung jawab info orang2 yg sempat kontak denganmu. 🙏🏻 Makin banyak sosok dikenal terpapar Covid. Pilihan masing2 untuk mengumumkan secara publik terkena Covid atau melaksanakan pengobatan tanpa “libatkan” publik. Whatever works for you. Tapi semoga, setidaknya walau gak mengumumkan secara publik, tetap melakukan contact tracing ya. Terima kasih telah membesarkan aku &amp; @baskaramp dengan penuh kasih sayang, mengajarkan kita untuk gak kapok mengejar mimpi, dan peduli pada sesama manusia, satwa serta lingkungan.\n\nKini saatnya kita membalas kasih Ibu dan Nani yang tiada terhingga besarnya. \n\nSelamat Hari Ibu 💖 https://t.co/lKgC03Iev3 Hi again! Twitter @baskaramp berhasil Baskara ambil alih lagi! 🥳 Terima kasih saran-sarannya ya! Have a great Sunday semuanya! Hi guys, twitternya @baskaramp dibajak pagi ini. Kalau ada postingan dari akunnya setelah tweet aku yg ini, itu bukan Baskara. Kita lg cari cara untuk ambil alih lagi. Kalau berhasil, aku akan info kembali ya! \n\n(Ada yg pernah alamin ini? Boleh bagi saran langkah2nya? Thank you!) Remember, @baskaramp? Missed our drive-in movie, mortified we couldn’t find Bambi our cat, balcony door was half open, she was out! Took her in, argued, calmed down. Eyes away for a second then there it was. A ring in a string dangling around Bambi’s neck. Said YES. What a night! https://t.co/PmkcgLhpXY 🤯😍 https://t.co/3Kmgwg9Ihx I scroll, see people hanging out in clubs bars etc, obviously outside their clusters, without their masks on. Meanwhile numbers are increasing rapidly. It’s getting harder to make sense of it all. I miss social life too you know, but bear with it for now &amp; stop pushing your luck. My ❤️ goes to pasien yg fokus berjuang lawan penyakitnya, nakes yg hati2 &amp; teliti tangani pasien2nya, &amp; nantinya, petugas/saksi yg akan bersinggungan dgn pasien yg tengah isolasi. \n\nPlease didengar resiko ini dari para ahlinya: Nakes yg selama ini harus menangani semua ini. 😭 https://t.co/sQRboLMYOR Banyak banget akhir-akhir ini yang bikin geleng-geleng kepala, gak tahu mau mulai dari mana. \n\nIntolerance, massive covid clusters, injustice, trust issues w/ the ones in charge, etc.\n\nSeharusnya jadi prioritas saat ini nyawa masyarakatnya kan ya.\n\nHang in there guys 😢. Click to see the first Trailer of,\n\nStudio Ghibli’s “EARWIG AND THE WITCH” directed by Goro Miyazaki\n\nスタジオジブリ最新作「アーヤと魔女」のＰＶ\n\nhttps://t.co/C14HSJLJEi Sebelum pandemi, skenario Petualangan Sherina 2 sudah mulai kami godok &amp; kembangin di kantor Miles. Semenjak pandemi, kami lanjut via online!\n\nSaat ini kami masuk tahap casting final &amp; workshop aransemen musik.\nTunggu update selanjutnya ya!  🤗\n\n#PetualanganSherina2 @MilesFilms https://t.co/hNogdq0uJf Terima kasih semuanya! Melihat respons dan antusiasme teman-teman semua dan tentunya liputan seru dari teman-teman media, kami makin-makin semangat mempersiapkan film ini!\n\nNantikan terus update selanjutnya film Petualangan Sherina 2 ya!\n\n#PetualanganSherina2 @MilesFilms https://t.co/R9fPsuMn2W Upcoming STUDIO GHIBLI movie: EARWIG AND THE WITCH\n\nDirected by Gorō Miyazaki, Produced by Toshio Suzuki\n\nI was so lucky to have participated by singing the songs &amp; voicing one of the characters\n\nRelease Date: December 30th, 2020 (19:30 JPT) at NHK\n\n© 2020 NHK, NEP, Studio Ghibli https://t.co/T4u6AcISPF To many more adventures and plot twists. 🤍\n\n@baskaramp https://t.co/z3MnP82Xop @viraniamunaf @AdibHidayat Love youuu 😭💖 Keduluan @AdibHidayat 😅 lol https://t.co/FP0vBGrKLh Skenario dikembangkan oleh @jujurprananto, @MirLes, @rizariri, aku, &amp; kakakku, @viraniamunaf.\n\nAku juga menulis lagu2 &amp; scoring film, meneruskan posisi almarhum Elfa Secioria. I will do my best to make you proud om Abang! 🤗🎵\n\n#25ThMilesFilms #MilesFilms #PetualanganSherina2 https://t.co/kjTesZBFBD Sekuel film musikal ini akan kembali disutradarai @rizariri &amp; diproduseri @MirLes. \n\nAku &amp; @Derby_Rr akan kembali memerankan tokoh Sherina dan Sadam. \n\n#25ThMilesFilms #MilesFilms #PetualanganSherina2 https://t.co/iWeJGsFrkD Kembali bertualang... 🎵 https://t.co/hj1GDUYaOd Desember 2019 aku bersyukur dapat kesempatan ikut \"pelepasliaran\" orangutan bersama @bornean_OU. Perjalanan panjang tapi luar biasa tak terlupakan momen melihat orangutan kembali ke habitatnya. \n\nIni teaser video, Episode 1 lengkapnya bisa disaksikan di:\n https://t.co/zKBieZnNdb https://t.co/6KfBmx7NFE Melihat respons Tweet ini, tampaknya ada gap dalam kesadaran perbedaan \"pelihara satwa liar di rumah\" dengan \"penangkaran satwa liar untuk direhabilitasi dengan tujuan sebisa mungkin bisa dilepasliarkan ke alam\". Kebetulan ada yang ingin aku share nih. Di Tweet berikut ya! https://t.co/D75l1NrSTE Satwa liar itu BUKAN binatang peliharaan. Izin apapun tidak akan mengubah fakta bahwa habitatnya BUKAN di rumah anda, mau sekecil atau segede apapun halaman anda. Well written character, and well acted, I remember thinking I must meet this talented man! Had the honor to congratulate him after the premiere, and the rest is history.  🤩😘 https://t.co/YHKGgDXrW5 @moy_NF Kayak chacha kayak M&amp;M's Kalau nanya yang mana: Chacha apa Smarties apa M&amp;Ms? \n\nMaap yang saya inget makannya doang. 🙏🏻 Give me all your High Def Petualangan Sherina memes. \nBring. It. On.\n\nSiapa takuttt? 🤩 @miund @NetflixID Lol. Inget kalap nyomotin in between takes. 🤤 RT @kitabisacom: Plis jangan skip dulu twit ini. Cerita dokter Nina di video ini penting banget buat kita pegang.\n\nKarena RS beneran penuh,… Sendirian nyetir, kendaraan sendiri pula, ya masuk akal aja lepas masker. Aturan dipahami secara kritis, bukan kata per kata semata dijalani tanpa konteks.\n\nMudah-mudahan aparat berangkat dari niat baik untuk memastikan aturan ditaati, tapi harus diakui blunder dalam eksekusinya. https://t.co/D14vCA4efg Hiiiiihhhh 🤯 https://t.co/Ty08gZbkt0 https://t.co/hkhXt0alut Every time we talk about theater, film, &amp; acting, your eyes light up with passion. I will always remember your dedication &amp; kindness. What a talented man. What a humble human being. What a loss. https://t.co/rwRMdceZXn Produktif di studio = Puasa mandi RT @TirtoID: Pada satu kesempatan di tengah pertarungan, Malahayati berhasil menikam Cornelis de Houtman hingga tewas. Peristiwa itu terjad… Memancing ide untuk menulis lagu baru hari ini. Yes, lagu baru = DAW kosong, kertas kosong, ide kosong. Jadilah pemanasan dengan lagu Om Elfa yang kaya akan chords indah.\n\nJuga buat yang belum ketemu lagi sama para sahabatnya semenjak PSBB April lalu. (I miss them so much) https://t.co/0T8MvwXVGu Hang in there guys. Let's survive this year together. 🤗 ♥️♥️♥️ https://t.co/8979JGWGrv RT @NYGovCuomo: Masks work.\nClimate change is real.\nVaccines are effective.\nTrust scientists. An___ aku tlah dewasa 🎶 RT @9GAG: If you gaze long enough into an abyss, the abyss will gaze back into you.\n\n@MeowedOfficial https://t.co/7Wy2QrQtcN RT @AdviceToWriters: You have to live with the notion of, “If I don’t write this, no one’s going to write it. If I die, this idea dies with… 🦧🥰 https://t.co/Stv6zpp2ql We don't have time to deal with antivaxxers and conspiracy theories... Covid19 is real. \n\nWhen outside please wear a mask, practise physical distancing, wash your hands, follow the health protocols, avoid crowds, stay alert. \n\nStay alive because you are not alone &amp; loved by many. Hari ini ceritanya, banyak yang dikerjakan tapi ga ada yang selesai. https://t.co/knHdmRjG7p Random update 💌 https://t.co/Kxa0Hqp4mz RT @ernestprakasa: Surat terbuka saya untuk para pekerja film tanah air. ❤️ https://t.co/UUkqcigMpd Mood: pengen bikin-bikin rumah di sims. (motherlode) 🙂 https://t.co/V6b8z6Vscv Defeat bad ideas with good ideas. \nFight hoaxes with facts. \n\nFreedom of speech means hearing a lot of terrible and 'offensive' opinions. But it also gives you the equal chance to speak up and argue.\n\nInstead of silencing those you disagree with, voice out your disagreements. This week was emotionally taxing yet... strangely rewarding at the same time. Ever had a breakdown yet feel enlightened at once? It was both unpleasant and enjoyable.\n\nHuman emotions are riddled with fascinating paradoxes. 🤔 https://t.co/S37gJeTidt PUNYA ANAK SAMA SIAPA?? RIN?? https://t.co/hhBMKpBjcd APA APA APA?!?!?!?!?!?! https://t.co/dBbuK1AQQ1 Seharian riset buat lagu baru, muter ulang-ulang Flamenco, Pasodoble, Habanera, Bolero nyampur jadi satu mulai ketuker-tuker rhythmnya... 💃🤪 Lagu kayak apa ya nanti jadinya. https://t.co/UD2gdpTPeD Pagi ini... kita bernostalgia... dan tetap menjaga jarak hehe.\n\n#20TahunPetualanganSherina \n\n@rivanos @viraniamunaf @Derby_Rr \n@totopras @MirLes @aditmur \n@rizariri @jujurprananto @MilesFilms https://t.co/ZCHJAe8tDe 🌌 Canopus... Capella... Vega... 🌌 @erasmus70 Betul, kalau ada kritik harus dievaluasi. Nah kebetulan, menanggapi video guguk pinter, antara sadar bahwa guguk itu gemes dan ternyata lebih penting dari kita semua 😂, atau berlalu saja kalau sampai dirasa bibit-bibit perasaan se’entitled’ “tersinggung”. Anjing menggonggong, khafilah berlalu.\n\nTidak usahlah dimasukkan ke hati @KemenkesRI. Tidak perlulah repot tersinggung.\n\nYuk yuk kembalilah pada prioritas perhatian untuk yang lebih darurat. 🙏🏻 Some of the replies I got from my previous tweets are just https://t.co/MMA2iy1AH9 @aldorojax121 @ElgarLouee Baca lagi twitnya. Kalau “seenaknya” saya bakal bilang silahkan keluyuran tanpa masker di luar rumah. Ini sebaliknya. \nTidak keluar rumah KALAU TIDAK PERLU. \nKalau harus bekerja di luar, pake masker, cuci tangan, dsb. @Bugie_Aryatmo Di rumah saja KALAU TIDAK PERLU mas. Kalau harus beraktifitas di luar mencari nafkah dsb, pakai masker.\nKalau keluyuran ngumpul-ngumpul gak perlu, ditambah lagi gak pake masker, ya gak usah dulu: di rumah saja. Semoga jelas mas. Stay safe 🙏🏻 @omhansss @jokowi Terima kasih sudah disiplin dari awal, memutus rantai penyebaran. Sayangnya gak semua orang seperti anda. Saya gak punya VIP backdoor akses ke Istana, yang terbaik bisa saya lakukan saya lakukan. Menggaungkan awareness selebar2nya. Yuk bantu saya sama2 ingatkan yang lain. 🙏🏻 Sudah terlalu banyak tenaga medis gugur.\n\nTolong jaga jarak, pakai masker, tdk keluar rumah kl tdk perlu. \n\nBisa saja tak bergejala tapi bawa virus. Yg rugi bukan hanya kamu tapi orang sekitarmu.\n\nHasil tes negatif ≠ imun dari covid. \n\nJangan lengah. Vaksin belum tersedia. Youtube binge day. \nTravel: Flying The Nest, Kara &amp; Nate, Eamon &amp; Bec.\nFood: Pick Up Limes, Abbey Sharp, Cooking with Dog, Jun’s Kitchen, Nina Montagne, Unconventional Baker, Peaceful Cuisine &amp; Ochikeron. \nFitness: Sarah’s Day. \nMusic: Usnavi. \n😼: Kitten Lady &amp; Jackson Galaxy. Menahan diri untuk gak ikutan but\n\nI'm past patiently waitin' I'm passionately smashin' every expectation\nEvery action's an act of creation\nI'm laughin' in the face of casualties and sorrow\nFor the first time, I'm thinkin' past tomorrow!!!!!!!!!!!!!\n\nAaaaaaaa https://t.co/SIRIScGoAp Terima kasih untuk Joshua yang mengingatkan kembali urgensi pandemi ini, terutama di saat kita yang mulai lengah karena “fear fatigue”. Terima kasih tiada henti untuk kerja keras mereka yg di garda terdepan; nakes, pekerja rs, relawan, jurnalis dan masih banyak lagi. https://t.co/yXHayxZVIE RT @rickygervais: It's common now to mistake defending someone's right to say things, with agreeing with those things. If you don't support… RT @magdaleneid: \"Working hard\" and \"studying hard\" will only ever make a difference to the few who are privileged, not the unfortunate maj… Karena teman2 sabar banget nungguin aku yang siput berkarya, aku bocorin dikit...\n\nAda 5-6 lagu yang selesai ditulis untuk sebuah project.\nDan 2-3 lagu untuk project lainnya.\n\nJadi ada 2 project yg disiapkan! Masing2 penuh lagu2 baru! Siap eneg yaa love you maaci sabar nunggu! 😘 Embracing my slow writing pace. Cemas pandemi cukup mengganggu kreatifitas. Bersyukur at least ada sesuatu yang muncul walau lama banget mancingnya. Untung kerannya belum kering, my biggest fear, walau macet. Plis plis plis jangan macet dulu lagi masih banyak deadlinenya 🙏🏻😭 Hari ini perdana berhasil memusnahkan kutukan creative block selama 2,5 bulan. AKHIRNYA DAPAT JUGA MELODY DAN CHORDS BUAT NIH LAGU. Momennya lagi sikat gigi tiba-tiba bak wangsit melody itu datang. Kalau lagu ini sudah dilepas ke publik, punten bantu ingetin aku pernah twit ini. All is forgiven https://t.co/lXk7lB1cWg Dari:\nBaskara ✅\nKekasih Sherina ✅\nAncaman pembunuhan ✅\n\nUjung-ujungnya:\nDoyan kulineran ✅\n\nOke. https://t.co/Pv52nxQFpp It’s been a really tough day, weekend, week, month, year for all of us. Hang in there guys. Goodnight and stay safe always. 🤗\n\n“Smile” Nat King Cole https://t.co/HF9wfw5wXp Kebiasaan 😭😭😭😭 https://t.co/1LyF4UaXUy RT @AdibHidayat: Indonesian music long forgotten, from pop and rock to traditional sounds, digitised for younger generations to appreciate… Ju-On Origins seruu 👻 I need Season Two! https://t.co/LYOpbzZXSL Akhirnya dandan terniat selama periode Work From Home ini. Pengen aja. 🙃 https://t.co/RKI3moBB9k “If you stand for nothing Burr, what’ll you fall for?” https://t.co/XvGO9Ngu4I Kemarin beberes, nemu ini di bawah wastafel. https://t.co/pH6WGarPgz Hari Senin, saatnya membangunkan otak yang mati suri selama akhir pekan. \n\nKembali menulis lagu lagi, siapkan mental dicabik-cabik oleh draft awal yang sudah dipastikan keruh. \n\nLet’s get to: https://t.co/NLGDRLR87I @BruceEmond What? I totally missed this! Thank you for this beautiful birthday message! 🤩 Saya salah. Covid-19 adalah penyakitnya, yang disebabkan oleh Virusnya: SARS-CoV-2. Tapi untuk memperjelas, tetap bukan nyamuk.\n\nDitunggu jurnal ilmiah kalung eucalyptus VS Covid-19 nya. Saya terima kalau saya blunder. Semoga nyawa tidak melayang karena takhayul yang diilmiahkan. @iindraxe Paham. Terima kasih koreksinya. Yang pasti bukan nyamuk ya, virus ataupun penyakitnya. Kalung Antivirus Eucalyptus Anti Corona mau diproduksi massal?\n\nSetahu saya Covid-19 itu virus.\n\nBukan nyamuk. Alasan valid gak olahraga 2 bulan kemarin. Selalu ada gangguan-gangguan. https://t.co/gijJ25GYfI “These little birds don’t have no legs at all, so they have to live their whole lives on the wing. And they sleep on the wind... and they only light on this earth but one time. It’s when they die.” \n\nThe Fugitive Kind (1960) https://t.co/SbKhLEqaJ5 Hmm. Sepertinya dimulai saat ada yang MALAS bekerja. 🤔 https://t.co/48XSkLMOPu Sulit itu hidup tanpa: https://t.co/9on5aPzc7G Good morning Twitter!\n\nKalau hari ini atau kemarin bukan hari mu, mungkin esok akan lebih baik. Tunggu sedikit lagi, besok kan datang sebentar lagi. \n\nBacking Vocal credit: \nBambi the singing cat\n\nSong: Tomorrow (Annie) https://t.co/Krv01CQ5km Almost perfect circle #Baloo https://t.co/vJxhVmI1Uj Di tengah pandemi ini, @bornean_OU terus berkomitmen menjaga keamanan &amp; kesejahteraan Orangutan, &amp; dengan dukunganmu kita bersama bisa terus menyelamatkan orangutan &amp; berkampanye demi kelangsungan hidup mereka. \n\nBeri dukunganmu melalui: https://t.co/MM49vGWqoJ https://t.co/nEuRFVCChO Berhubung situasi pandemi, cabin fever, berita yang dibaca, dll..\n\nRasanya mau berkarya tapi otak ke-distract terus. Alhasil berminggu2 tidak ada progres kreatif signifikan.\n\nTapi... hari ini akan coba lagi. \nMasa depan di luar kontrol, tapi cara menghadapinya masih di tanganku. https://t.co/8FSi8oJBga RT @mrshananto: I am experiencing quarantine fatigue.\nMeanwhile the virus doesn't get tired at all.\n\nStay safe everyone. https://t.co/TyC6u… Mulai ketagihan bikin Bath Bomb uhuhuhu~\nYang ini Lavender &amp; Earl Grey Bath Bomb.\nJadi pengen bikin bentuk pokemon. https://t.co/pXlSseIq4J Masa kecilku diwarnai oleh lagu-lagu dari para Maestro ini. Aku merasa sangat bersyukur dinyanyikan lagu-lagu ini oleh Ibu &amp; Ayah, menyanyikannya bersama teman dan guru di sekolah, dan juga membawakan medley lagu-lagu ini di atas panggung dulu. \n🎈🌽🌈🌲🌄 https://t.co/fJGEqua5TI @ted_kho Teddy! Thank you. I know I say this way too many times but let’s catch up soon! (once this crazy pandemic is over!) @baimGuitar Abbey!!! Masih inget gemes banget nyanyi nyanyi 🤗🤗😍😍. Sending virtual hugs! @miund Terima kasih hehe! 💖💖💖 @Cittairlanie Thank you Cania! 😊😊 @alexandermatius Thank youu! 🤩🥳 @FebryMeuthia Terima kasih Mba Febry! 😊🙏🏻 @HDSTN Thank you lop I lop you! 🤖 @HaikalKurnia Thank you! 🍺 @LunaMaya26 Thank you dear! 🤗💖😚 @baimGuitar Thank youu 🤩🤩🥳 @AdibHidayat Terima kasih mas Adib! 😊😊 I’M 30 TODAY OOWOOHOO https://t.co/teeTn12cGn @haudaradiva Baloo dan Bambi sudah disteril 😊💖 Suka suka Baloo https://t.co/d6kfXnY6E6 Upacara berlangsung sehari, ijazah bisa membantu sampai ke titik tertentu. \n\nTapi, effort dan resilience untuk menyelesaikan kuliah di kala situasi seperti ini akan stick dengan kalian sampai kapanpun. \n\nApapun pilihan karirnya nanti. \n\nCongratulations and bring it on, future! Kalian berhasil menyelesaikan kuliah di tengah pressure pandemi ini. Itu adalah skills yang angkatan2 sebelumnya belum tentu punya. \n\nAku lagi... boro-boro kelar kuliah. 😅\n\nJadi kl sedih karena tidak bisa seperti angkatan2 sebelumnya, ingat kamu hebat bisa sampai finish line! Untuk yang lulus tahun ini, ga bisa ngumpul wisuda dengan peers pake toga, mungkin agak nyes lihat foto2 throwback achievement teman2 yang beruntung bisa berwisuda pre-covid. \n\nLet me remind you that it doesn’t make your achievements any less. In certain aspects I am privileged, therefore my understanding will never be perfect. Therefore I will continue to educate myself, starting with my own country and then global. I’ll always be on the side of free speech &amp; equality. And I will march against violence &amp; injustice. Saya masih banyak belajar dan butuh pendapat teman-teman. Jadi mohon jangan dulu tutup ruang diskusi kalau ada pendapat yang tidak sesuai dengan kamu. Yang penting percakapan tidak berhenti, agar kita bergerak ke arah solusi, bukan untuk memenangkan ego yang tersentil. Topik yang tadinya terhalang oleh isu-isu lain kini tersorot. Kita akan menyerap dengan cara yang berbeda, memiliki pendapat yang berbeda-beda, dan memberi pendapat dengan cara yang berbeda. Ruang diskusi pun terbuka. Dan dari situlah progres akan terjadi. Saya percaya setiap orang harus mendapatkan kesempatan yang sama dan adil, mempunyai suara, apapun gender atau sukunya. Namun walau saya menjunjung tinggi ideologi ini, saya juga menyadari bahwa selama ini saya “sheltered” dari realita sebenarnya. Jadi kembali lagi edukasi diri. Melihat apa yang sedang terjadi di dunia, kesadaran secara global, serta perdebatan di sosmed akhir2 ini, mendorong saya untuk mengedukasi diri tentang inequality yang terjadi di “backyard” kita sendiri. Menelaah kembali relationship “free speech” dengan “identity politics”. Masih lihat-lihat foto lama.\n\nWedding Day.\n\nAtas: Ibu\nBawah: Eyang Putri (Ibunya Ibu)\n\n@Triawan https://t.co/09PqAvEyxy Ayah lagi rajin warnain foto-foto lama pake sebuah app. Jadi di WA Group keluarga lagi banyak dishare foto-foto Kakek-Nenek masa muda. \n\nSalah satunya, foto Eyang Putri aku (Ibunya Ibu)\n\n“Moetiari Sugianto”\n\nKangen. https://t.co/Dknkaw0VEW Setuju. https://t.co/1JcTpJy28l RT @Prestige_Mag: As we face one of the most challenging periods of our lifetime, Indonesian designer #PatrickOwen encourage us to maintain… Biasanya ngegas sekarang lagi akur menyambut lebaran.\n\nMinal Aidin dari Baloo dan Bambi. \n\nMeaowaf lahir dan batin. ❤️🙏🏻 https://t.co/mLaqnkDz5o Dari empat tempat yang berbeda, buat yang merayakan kami sekeluarga ucapkan:\n\n“Selamat Hari Raya Idulftiri, Mohon Maaf dan Lahir Batin”\n\nLebaran kali ini misah-misah dulu ya, supaya lebaran tahun depan bisa bersama lagi!\n\n#LebaranAtHome\n#DiRumahAja\n#StayAtHome\n#JanganMudikDulu https://t.co/Rf3QJbqCCO I bored annoy u: https://t.co/ShdGZELhuW RT @jokoanwar: Dear @CNN, your @CNNIndonesia is distributing illegal sites for pirated movies in their article. Meong terbang. \n\nhttps://t.co/UIrMcVIdFs\n\n#DrawFirstThinkLater https://t.co/fwkaTJTIjK Baru bikin Instagram khusus buat gambar2 selama pandemi ini. \n\nTujuannya supaya rutin, belajar lagi pelan2 sampai setidaknya... senyaman dulu pas rajin. Bakal upload yang malu2in sampai yang lumayanlah. Yang penting #DrawFirstThinkLater.\n\nSilahkan follow:\nhttps://t.co/kPQZaMuxXw Paper trial. Yang penting mulai lagi dulu. 😭\n\n#DrawFirstThinkLater https://t.co/q2cPPY2MUd @KuroBovenover Can’t even look at it without cringing myself, let alone showing to another human being. Haven’t touched my art supplies for almost three years, until two days ago.  \n\nTook a whole day of trying, dabbling, cursing (yes, I did). The result was a poorly drawn not even close to a doodle. Oh. I. Wept. \n\nBut... it had to be done. \nWill try again tomorrow. Baru mau mulai gambar udah ada obstacle. https://t.co/1D40JeOKuE Sudah hampir gak pernah sentuh alat-alat gambar semenjak tahun 2017. Pengen mulai rajin gambar lagi, satu gambar per hari yang cimit aja. \n\nGoal ambisiusnya adalah satu buku sketsa selesai diisi dalam sebulan. Mampu konsisten apa enggak ya...? 😏\n\nBagi tema-tema gambar dong. 🙏🏻 Hai yang masih pada bangun. Besok, JUMAT jam 5 sore, aku akan IGLive!\n\nYuk ikutan ngobrol2 santai dipandu WifWorld Peduli yang sedang bermisi menggalang dana 1000 Paket Lengkap APD untuk Indonesia. \n\nSampai besok di Instagram @wifworld di: https://t.co/UIrMcVIdFs 😘\n\n#DiRumahAja https://t.co/Gc4qwS1ALJ Terima kasih Om @rizariri dan @MilesFilms udah ajak ngobrol-ngobrol pagi ini di Cabin Fever! Terima kasih teman-teman yang ikutan nonton. Have a great day, #StayAtHomeAndStaySafe ❤️\n\n#DiRumahAja https://t.co/SdXnxFhcoG BESOK, Kamis (23 April 2020) jam 10:00 WIB:\n\nAku akan LIVE di Instagram @MilesFilms “CABIN FEVER” bersama Om @rizariri. \n\nKalau mau ikutan nonton dan punya pertanyaan, langsung aja besok ke Instagram @MilesFilms atau @sherinasinna. \n\nSee you tomorrow! 💖 https://t.co/FTKm7S5GeL SETUJU. https://t.co/qCH6TZ6vH5 😭🤗💖 https://t.co/BbNU10bhje @zavarusvhanzo Tekstur baju suwer 😭🙏🏻 💇🏻‍♀️ ? #DiRumahAja https://t.co/LK73qPryuh @mbahndi Semangat Dr. Andri. Stay safe. 🙏🏻 Everybody processes grief/tragedy/obstacles differently, but I think most of you here would agree that 2020 has been a total: https://t.co/XyUiMyj0iB You’ve touched so many hearts, inspired many generations of musicians through your kindness, beautiful voice, and music. No doubt that your work will transcend through time. Your legacy will continue to live forever in our hearts. \n\nRest in peace talented man, bung @GlennFredly. https://t.co/p0Ak8blVYX Jujur makin ke sini sebenernya makin kurang demen nyanyi di panggung, tapi kalau ala-ala “manggung” #dirumahaja apalagi dasteran ya.... \n\nKayaknya bisa seru hehe. Udah lama gak nyanyi, bawain apa ya. 👏🏻👏🏻👏🏻🥳 https://t.co/Syt4N7QsUZ Instastories Disney Song Challenge. Keep em coming. \n\n#DiRumahAjaYa https://t.co/4qpwRC5mE9 Siapa yang berasa debu angkat tangan? https://t.co/xdr31whsue Mengajak yang mau ngobrol-ngobrol dan tanya jawab, mampir yuk ke VLIVE ku jam 16:00 sore. (Setengah jam lagi). Aku mau break sebelum kerja lanjut lagi sambil bikin 🍵. ❤️\n\nSee you guys di VLIVE!\n\n#DiRumahAjaDulu https://t.co/LDeUq7kSn6 I will continue prepping surprises for all of us to enjoy after we get through this pandemic. Meanwhile, stay safe, be mindful and aware, but don’t forget to take care of your mental well-being too. \n\nLove you guys. https://t.co/p7gQspMamx Karena kita mengalami ini bersama. \n\nJadi bersama kita lalui ini, bersama kita optimis, bersama kita berjuang dan bersama kita dukung mereka yang berjuang di garda terdepan demi kita semua. Tapi aku tidak sendirian cemas menghadapi penyesuaian baru, aku tidak sendirian kesepian terpisah fisik dari teman atau keluarga, aku tidak sendirian gemas baca berita, aku tidak sendirian sedih karena rencana pekerjaan terpaksa mundur atau tantangan baru dari work from home ini. Yang bisa ku lakukan sekarang selain dari semua yang disebut di atas adalah beraktivitas #dirumahsaja dulu untuk memutuskan rantai penyebaran. Plus nguat2in stamina bekerja agar tetap kreatif berkarya walau jujur pikiran seringnya terganggu oleh khawatir &amp; cemas akan situasi ini. Mari kita bantu sesuai dengan porsi kita masing2. Order makanan tambahan untuk driver ojol, cek tetangga/teman yang rentan butuh bantuan apa, jaga jarak agar mencegah penyebaran Covid-19 supaya tidak terjadi pembludakan yang bikin kewalahan tenaga medis kita, donasi masker dll. Tidak terbayang perasaan mereka yang berada di luar sana, bekerja dan berjuang demi kesehatan dan keselamatan kita semua. \n\nTidak terbayang juga kesabaran sekaligus kekhawatiran para sanak saudara, keluarga, sahabat para pekerja yang luar biasa berjasa di saat genting ini. Hanya ketika itu kita tersadar, betapa berharganya momen-momen “on script” atau “sesuai rencana” yang dilalui tersebut, sebelum terjadi sesuatu yang mengubah segalanya dalam skala sebesar ini. Kalau lagi mumet kerjaan biasanya janjian ngumpul keluarga, bertemu teman dan lainnya. Dan sekarang kita harus #socialdistancing alias #jagajarak. \n\nBenar-benar teguran keras bahwa sebaik-baiknya kita membuat rencana, dunia bisa berbalik begitu saja. In this case, wabah. Agak lebih membutuhkan tenaga mental dan disiplin yang kuat bagi orang-orang yang tidak terbiasa bekerja di rumah untuk memulai hari kerjanya di lingkungan rumah. \n\nDitambah setiap scroll handphone/sosial media yang muncul adalah berita yang mengingatkan kita untuk terus waspada. Iseng nonton video jadul. https://t.co/W0QAgCmjq3 Lagi pada mikirin apa ya? 😋\n\n@MirLes @rizariri @alvinpentol https://t.co/jRF30MHT31 “We can know just how much to cherish the quiet days in which nothing much has yet gone very wrong. And when the off-script event comes, we can at least say that we knew – and realised a while back that this what it means to be human.” School Of Life\n\nhttps://t.co/cYS7azgxzT Kayaknya mau bikin daily VLIVE selama self-quarantine ini. Yang tertarik join, ada ide topik-topik VLIVE nya apa aja ya kira-kira? Dan maunya sesering apa? Hehe... 😙 Thank you. Pastinya bukan keputusan yang mudah. 🙏🏻 https://t.co/WhU3qZne5h 😍🙏🏻 This is what we need. Supporting each other! https://t.co/B3bzPPjv71 My babies Mr. Baloo and Lady Bambi shaped like a heart. 💖#WorkFromHome #Frenemies https://t.co/Rscd7GIeZL Tidak boleh terlewatkan: Di tengah kita yang mulai Quarantine, aku sangat berterima kasih pada para tenaga kerja kesehatan, driver ojol yang mengarungi jalanan untuk delivery makanan/barang, &amp; masih banyak lagi mereka yang kondisinya tak bisa Work From Home. Stay safe! 🤗 Self Quarantine Day 2 usaha tidak terjerumus leyeh2 walau godaannya kuat banget hehe. Produksi untuk beberapa #secretprojects tetap berjalan, olahraga adjust di rumah, bikin list bacaan &amp; kyknya seru nih ngeVLive buat nemenin kalian yang juga lagi Work/Study From Home. Thoughts? Terima kasih teman-teman yang dengan segala keterbatasan &amp; hal yang harus dikorbankan, membuat keputusan tidak mudah yaitu mulai sedikit demi sedikit mempraktekan social distancing &amp; self quarrantine. \n\nYou’re not alone because I’m doing it too! Let’s fight this together. 🤜🏻🦠 RT @scottderrickson: Self-quarantine isn’t just about not getting sick. It’s about not becoming a carrier leading to others getting sick.… Sekolah atau kantor diliburin itu untuk menghindari kerumunan banyak orang dan mencegah penyebaran virus. \n\nLah tapi malah dijadikan kesempatan buat liburan murah dan jalan-jalan rame-rame. \n\nBegimana ini. Harus apa ya supaya kita kompak memandang prioritas. https://t.co/XjWZ4hqA36 Tak usah sungkan untuk sementara hindari berjabat tangan atau kontak fisik. Yuk saling mengerti bahwa melindungi kesehatan satu sama lain saat ini jauh lebih penting daripada merasa tersinggung karena ditolak salim atau jabat tangan. \nIt’s for your own good too. \n\nNamaste 🙏🏻☺️❤️ RT @the_magdalene: Relasi kuasa antara laki-laki dan perempuan mempertajam stigma terhadap menstruasi dan seksualitas perempuan. \n\nHal ini… We stand with you! https://t.co/Ks2rjEhizX “I have no idea where music comes from. So there’s always the fear that somebody’s going to switch off the tap.” \n\nHans Zimmer, on facing new film scoring projects.\n\nDia aja takut gimana gue. 😱 https://t.co/paJJkeOyJi RT @AdviceToWriters: You can't control the success or failure of a thing you work on. You can only control the thing you work on.\n@Lin_Manu… Mengawali hari dengan olahraga pagi di @soulboxjakarta. (Yang ingin tahu lebih banyak tentang Personal Training di Soulbox, bisa langsung mampir ke IGTV aku.)\n\nLanjut meeting dan workshop untuk ‘sesuatu’ dari pagi ke sore.\n\nSekarang mengakhiri hari dengan belajar, alias nonton: https://t.co/KSro3TGTDR 💖 https://t.co/9okxcL1enz RT @lalatimothy: It’s an honour to be mentioned among these incredible strong women. Thank you @Variety https://t.co/Vh4bpJ3I80 RT @MirLes: Saya menulis sebuah artikel opini di majalah @elleindonesia , mengungkapkan kegelisahan saya ttg ancaman hilangnya rasa aman ba… A little throwback 🥶 https://t.co/E7Dmj3xEO3 Sedang jauh dari hingar bingar ibukota karena fokus melakukan writing retreat dan workshop selama beberapa hari. \n\nBanyak bekerja + banyak belajar = banyak ngemil. https://t.co/fVOVkycGuC Finally getting there!\n\nExciting story attracts interesting melodies. \nCreating a playlist of songs.\nPerfect ammunition for tomorrow’s creative adventure.\n\nYes yes yes! https://t.co/8thL6S5xFG Started the day with a morning meeting over breakfast. Hoping this productive energy lasts until the day’s over. 😅 https://t.co/44vGHYvhLR @newsplatter @GagasMedia Brilliant* 😅 @newsplatter @GagasMedia This is briliant. 😍 Back in Jakarta to write a new story and compose some more songs. Feeling physically tired after the trip and to be honest, a tad melancholic, but at the same time grateful knowing that you guys are out there, always waiting for our work patiently. \n\nThank you and just you wait! https://t.co/xOSFV02N3Q 🎼🩹🍩🧗🏻‍♀️🦋🥬🌌 https://t.co/6xkVh1UfoQ Tadi siang di Canopy Bridge Bukit Bangkirai. 😁 https://t.co/V3T9z94nkN To celebrate history being made. \n\nEdited by @ditsmad 😂 https://t.co/5xPv3EoQf8 @alexandermatius @MirLes @rizariri Busted! 😂 Live streaming here in Balikpapan, PARASITE in 92nd Academy Awards!\n\nBest Original Screenplay\nBest International Film (formerly, Best Foreign Language Film)\nBest Director\nAnd...\nBEST PICTURE!\n\nHistory made. https://t.co/ySKHJgGGEf Menanam Durian di tepi salah satu pulau Orangutan dalam Samboja Lestari. Pulau-pulau dibuat khusus untuk para orangutan yang tidak bisa dilepasliarkan, karena penyakit atau lainnya, agar mereka tidak selamanya di kandang dan dapat hidup nyaman dalam lingkungan yang semi liar. https://t.co/jLEvfcNAgy @piyopikavet Selain dari rescue/rehabilitasi orangutan sampai kembali ke habitatnya di hutan, BOSF juga meningkatkan kesadaran bahwa orangutan tempatnya bukan di rumah manusia yang ingin ‘uyel-uyel’ memeliharanya karena dianggap lucu ketika bayi. Kalau setuju, boleh bantu sebarkan pesan ini. Sepanjang Sungai Hitam, Kaltim, sekumpulan Bekantan bertengger di pepohonan, bakau dan nipah keemasan terkena sinar matahari, lalu Kampung Nelayan serta kapal mereka hiasi sungai hingga muara. Indah sekali. \n\nMari kita jaga dengan tidak membuang sampah sembarangan di kawasan ini. https://t.co/GoPsb7lLLt Kembali menjelajahi alam Kalimantan dan mempelajari lebih dalam kehidupan para Orangutan bersama @bornean_OU. \n\nSebelumnya kami ikut pelepasliaran Orangutan di Nyarumenteng, kali ini kami mampir ke basecamp BOSF yang di Samboja Lestari, Kalimantan Timur. https://t.co/GqVMkFcnyc Selamat sore Twitter!\nKami sedang berada di Sungai Hitam, Kaltim.\n\n@viraniamunaf @MirLes @rizariri https://t.co/TNFyQVvrql ❤️❤️❤️ https://t.co/4penhM8pfG @aMrazing Aku lagi di St. Petersburg, tapi besok balik ke Moscow! Bersua dong! Sampe kapan? @aMrazing Lagi di Russia? Di manaa? @kevinzebua_ Itu Audioguide dari Museumnya 😁 Di Hermitage bertemu satu lukisan bertema “Judith slaying Holofernes”. Kali ini dilukis oleh Giorgione. Pertama kali lihat Judith yang dilukis Lucas Cranach the Elder, koleksi MET, langsung jatuh cinta dengan tema ini. Pengen banget lihat yang versi Gustav Klimt di Vienna. 😍 https://t.co/xXfzHdtooq @kadin_kumala @baskaramp Haha iya I know. An honest typo. Gak perlu malu kok. 😉 Had fun exploring the second largest art museum in the world: “Hermitage Museum”, also Winter Palace, in St. Petersburg. The museum houses beautiful works of art by Renoir, Degas, Picasso, Van Gogh, Monet, Rembrandt, Kadinsky, and many more. \n\nAlso, one sculpture by Michelangelo! https://t.co/iTBUPrFsFj Baru tahu di dalem Moscow ada Jerman. Atau di dalem Jerman ada Moscow? Sungguh sebuah teka teki. 🤔 https://t.co/24b5DWUwwF Nyobain donat terkenal di Pyshechnaya, St. Petersburg. \nKonon ini resep tradisional mereka dari tahun 1958. \n\nJujur rasanya seperti cakwe. \nTapi enak.\n\nWatch till video ends, couldn’t resist. https://t.co/JQRb15EUYn On board the SAPSAN Train!\n4 hours from Moscow to St. Petersburg! ❄️\n\n@baskaramp https://t.co/Nhq3IsmSdO One of the most whimsical places to dine in Moscow: Cafe Pushkin.\n\nAbsolutely in love with its Library Hall, food and service @CafePushkin 💕 https://t.co/GKjEWfmklK Hello! Masih di Moscow, kemarin sudah explore St. Basil’s Cathedral, Kazan Cathedral, State Museum of Russian History, Museum of Patriotic War of 1812. 🤩\n\nNyobain makan Pelmeni di Grand Cafe Dr. Zhivago, semacam dumpling. Pesan yang isi kentang dan mushroom dan ditabur dill. 😋 https://t.co/mzKqpZ7dGM First stop in Moscow: \n\nThe beautiful St. Basil’s Cathedral 😍\n\n@baskaramp https://t.co/fOegf290ZT Off to a land far far away. \nFor a week.\nBrief vacation to... Russia!\nReady to be fascinated by the culture and history of this winter wonderland. I hate how much I love packing. Konklusi dari Live hari ini di V LIVE: \n\nTernyata gw bacot.\n\n#youneverknowuntilyoutry Jam 14:00 siang sekarang mampir ke V Live yuk. Mau jawab-jawab pertanyaan netijen, siap-siap berangkat pergi, dsb. See you! https://t.co/3Ed8iGdRGU So happy wearing this cute Ghibli necklace! It’s Jiji the cat and Kiki’s broom. 😘 https://t.co/19OlODGNVG Semangat kerja keropos bersama para kuku. #nailart https://t.co/0Aobjs4dgr Feeling incredibly grateful today. I was given the chance to test my limit as an artist, and go beyond my comfort zone.\n\nお疲れ様でした。😊 https://t.co/ZAxSLotvMw Delicious Omurice dinner with Ghibli family and had the honor to meet director Nakagawa Ryutaro san! https://t.co/OLpwEJfbP4 東京に着きました！\n\nBersinggah sebentar ke Tokyo untuk partisipasi di project yang seru banget. Belum bisa diumumin apa, jadi lagi-lagi mohon ditunggu ya hehe.\n\nDi sini hanya 3 hari, wish I could stay longer, tapi pekerjaan lain di Jakarta menunggu... 🤪\n\n楽しみに待っててね！😚 https://t.co/gSH7g02wj8 Melalui program @SunsetVetBali dan Villa Kitty Foundation Ubud, setelah kami rescue (@viraniamunaf), Buster sudah divaksinasi dan akhirnya diadopsi bulan November kemarin. Terima kasih tak terhingga untuk pihak-pihak yang membantu Buster mendapatkan rumah barunya. 🥰 https://t.co/YeeGowSCkE https://t.co/BlSQ4Rq5za @motulz Yang apa nih hehehe. @ted_kho Thank you so much Teddy! Yes, definitely let’s catch up. Pick up where we left off! 🤩🤩 @baskaramp FITNAH RT @rickygervais: If you don’t believe in free speech for people who you disagree with, and even hate for what they stand for, then you don… Ogah ngetik panjang-panjang, jadi ini video “Hai gaes” singkat, quick 2020 update:\n\n- Upcoming Projects\n- V Live App\n- Daster\n- Niat olahraga yang mudah2an terlaksana tanpa ditunda-tunda!\n\nTerima kasih selalu sabar menunggu! Jaga kesehatan manteman. https://t.co/M2p0hX6eOQ Officially sembuh dari pilek meriang kemarin! \n\nKembali bekerja, semangat menyiapkan kejutan-kejutan seru untuk tahun 2020 ini dan tahun-tahun seterusnya. \n\nDitunggu ya teman-teman. Will drop more hints later but for now this photo of bumbu pesmol... https://t.co/Lp28W3oFVo Do not f*ck with cats. Seriously. https://t.co/22jSMsJTnV Make Jokes, Not War 🤩\n\n@rickygervais https://t.co/uWtVtJqFmS Caught a cold!\n\nSniffle season is upon us and it seems to be putting almost everybody’s 2020 plans on hold. Drink water, wash your hands, and eat well to boost your immune system. Stay healthy guys!\n\n(Btw, interesting discovery in the gif section 🤧) https://t.co/2UU1xyVuLc Nobody told me about today’s dress code.\n\n@baskaramp and mom looking cute. https://t.co/n121XAd9GE Can’t wait for After Life season 2. https://t.co/AwjEBm7srE Finished all 3 seasons of The Marvelous Mrs. Maisel in a week. Absolutely in love with its beautiful production design, its sharp witty script, its interesting character development and its brilliantly shot long takes. Can’t wait for season 4! https://t.co/RdQhcLdQXg RT @CenayangFilm: Knockup stream  menuju Skypiea https://t.co/zhAxWSS2ob Gw sayang sama yang jawab ENAK. https://t.co/Le3ztH8on1 Mengikuti perjalanan panjang ke titik pelepasliaran dan menyaksikan secara langsung para Orangutan kembali ke rumah sejatinya, sungguh merupakan momen yang tak terlupakan dan cara yang indah untuk menutup tahun 2019. https://t.co/fYitH1d7Za Pos jaga Pulau Kaja, pulau pra-pelepasliaran para Orangutan yang lulus dari Sekolah hutan Nyaru Menteng @bornean_OU. Setelah setahun dimonitor di pulau ini, Orangutan yang dinilai siap, akan dipersiapkan untuk pelepasliaran seutuhnya. https://t.co/XHLK39DO5J Kalimantan. Menuju titik pelepasliaran Orangutan di Taman Nasional Bukit Baka Bukit Raya. Naik perahu kelotok di Sungai Hiran selama 4 jam. \n\nSkill baru: Bisa tidur di mana saja.\n\n@rizariri @MirLes @bornean_OU https://t.co/Hg6z5Gveu7 Why you have to be all glowy like a 💡 https://t.co/D8KXvpJZNc Yayang mampir ke kantor\n\n@viraniamunaf @MirLes @rizariri @Derby_Rr @MilesFilms https://t.co/dNxMf2MeQ6 Baloo mau ikut emaknya meeting ya. https://t.co/V95mlbxMlh @baskaramp Bijak Caught in the middle of a daydream~\n\nThank you “Manual Jakarta” for the beautifully written article. I especially love the glossary section!\n\nPhotographer: Prabowo Prajogio\nStylist: Allysha Nila\nMakeup Artist: Sissy Sosro\nHairdo: Yosefina Yustiani\nMiu Miu &amp; See You At One https://t.co/LoITTOlyED @miund OH MY GOODNESS YES. I thought I was the only one. Merdeka adalah milik kita semua. Mayoritas maupun Minoritas semua berhak berkisah dan dikisahkan.\n\nSelamat “Kucumbu Tubuh Indahku” atas kemenangan besarnya dalam FFI 2019. \n\nSemoga menjadi inspirasi dan semangat bagi kita semua untuk berani jujur dalam berkarya. \n\n#FFI2019 https://t.co/WqAbEzcTwN Morning control freaks.\n\nDisappointments. \nBy day you attract it. \nBy night you’re haunted by it. \nYet you bravely endure, always searching for ways to soften the blow.\n\nDisappointments don’t deserve your courage to keep going. \n\nYou deserve life’s peculiar way of surprising you. Fleabag 🖤 https://t.co/gzn5rnSa4Y @OmDennis Masa sii. Pasti kyot kayak meong. @BruceEmond Thanks Bruce! You too. 😊😊 Wonderful week. \nThank you luck.\nThank you life.\nTomorrow we begin again. \nWho’s with me? https://t.co/RFTvCCkVsR Setelah workshop, dilanjutkan rusuh kena bumbu Pesmol. 🤤\n\n@viraniamunaf @MirLes @rizariri https://t.co/zZqlzI3p5u Happy Bday Ayah! Stay healthy, banyak gerak, kopi boleh tapi air putih juga harus minum banyak. Petai bagi-bagi, duren jauh-jauh. Semoga seiring kita tambah usia, selera musik semakin sama, gak kayak dulu berantem rebutan lagu selama perjalanan Jakarta-Bandung.\n\nLove! @Triawan https://t.co/7YpL7CpSNy RT @AdviceToWriters: You're gonna make mistakes.\nYou're gonna fail.\nYou're gonna get back up.\nYou're gonna break hearts.\nYou're gonna chang… RT @mbahndi: Teman2 sekalian saya menginformasikan apps yg telah Dr.dr. Kristiana Siste,SpKJ(K) dan tim buat untuk penapisan adiksi interne… Ralat, bukan Minggu. \nPagi hari Sabtu berkebaya 💕 https://t.co/cyyQQ1sOAP Selamat jalan Om Djaduk, terima kasih sudah mencintai seni, musik, budaya, dan mewarnai hidup kita dengan karya-karyamu yang indah. 🤗 https://t.co/ClOBR0q33g @baskaramp 🥳 Papasan sama orang pake kaos Germa 66 Vinsmoke Family. Nyaris ngajak rumpi, tapi tahu diri gak kenal jadi tahan-tahan.\n\n(Padahal kan kita nakama walau belum kenal) Good morning. \nTotally planned this. \nIt’s called THE AUTOSPLIT. https://t.co/2koAbF2SAt @TrinityOptimaP 頑張ります❣️ Inspirasi terbesar untuk lagu kali ini. 🤫🎼🎬 https://t.co/r1fFHivq9F Today I came home empty handed, brain fried, emotionally drained. But it’s okay. \n\nThe search isn’t over. The song is somewhere waiting to be discovered. @baskaramp 🐈🐈🐈 Setelah 3 bulan lebih, Reff lagu ini mulai kebentuk!!! \n\nMakasih buat yang pada sabar masih mau nungguin dengerin saya koar-koar tentang proses di Twitter, love you all muah!!!!! \n\nTular-tularin terus semangat kalian ya!\n\n#OpeningSongPressure\n#MustStartWithABang https://t.co/kskzZkPmzH 🤯 https://t.co/OClElJobwB Memulai lagi dengan rapi-rapihin kerangka lagu yang sebelumnya serabutan karena ditulis secara spontan. Dengan struktur yang lebih teratur, mudah-mudahan ide akan lebih ramah untuk datang bertamu. @AdibHidayat @killthedj @HERUWA @faridstevy Haha haloo Barusan dari Ullen Sentalu, hujan-hujan tapi tetap happy. Sekarang dingin-dingin laper. Di Jogja makan dimana ya enaknya? 😋 Terima kasih rekomendasinya teman-teman Semarang. Kemarin akhirnya mampir ke Tahu Gimbal Pak Edi, ngopi di Spiegel Bistro dan jalan-jalan di Kota Lama. 😊 Jalan-jalan di Semarang enaknya kemana dan ngapain aja ya? Mau rekomendasinya dong teman-teman. Taking a few days off away from Jakarta. Got my laptop with me, ready to dig for new ideas, be inspired by the environment and...\n\nWrite like I’m running out of time! \n🎼✍🏻\n\nPS: Yep, I’m still working on the same project that I’ve been yapping about for almost a year. #singsabar Waaah terima kasih! 🎻🤩 https://t.co/GD6AhE1DVx Thank you for your talent, hardwork, and honesty Eva 💜 https://t.co/xx6kgBSa7X Ibu berkali-kali berhasil tunjukan bahwa dengan kerja keras dan dedikasi, usia tidaklah lagi jadi halangan untuk wujudkan cita-cita.\n\nI’m definitely a lucky daughter raised by a freaking awesome Mom.\n\nHappy birthday and love you Ibu 💙 https://t.co/oMs99VYRah Bandung 🤩 https://t.co/JBieFbnWwQ Mengenang tapak tilas keluarga Munaf di Nagari Sumpur, Tanah Datar.\n\nDestinasi berikut adalah menyusuri jejak seorang wanita dari Payakumbuh yang nekat bermimpi.\n\n#upcoming https://t.co/bprT60zO3o The world is being noisy, let us escape for a while. Don’t worry I’m here too. We’ll be together in our solitary retreat. Baloo adalah Jekyll and Hyde 🙄\n\n@viraniamunaf https://t.co/0Rd6WsmcE5 @rizariri @MirLes @viraniamunaf Hikss brrr Meracik, menggali, mencari yang terbaik. \n✍🏻🎬🎼💃🏻🕺🏻\n@rizariri @MirLes @viraniamunaf https://t.co/a2RNKbwMvn Saya akan nonton film Bebas ke4 kalinya. Iya. Sesuka itu. Janji kalian bakal sesuka itu juga. \n\nNah makanya, yuk temenin saya nonton. Sekalian kita yang tumbuh dengan PETUALANGAN SHERINA reunian!\n\nKamis, 10 Oktober, pukul 19:00 WIB\nSenayan City XXI.\n\nHTM: 45rb\nHub: +6281993373888 https://t.co/hlJmxJKkXk Jadiin profile pic gak ya. https://t.co/gpWxbCt1y5 🌅 https://t.co/ur1iH55jIM Don’t be so hard on yourself. \n\nEveryone is a fool, no one is spared, not even the people you look up to, not even the greatest scholars. \n\nWe all pee, poop, foolish by nature and certainly not immune from death. \n\nThere. Less pressure to be perfect. RT @BBCIndonesia: [Video] Sola Gratia Sihaloho dan Sumarni Laman  memerangi api, sekaligus menolak stigma. \"Katanya, 'Bisa perempuan bawa s… “Keajaiban di Pasar Senen” oleh Misbach Yusa Biran adalah buku pamungkas kami saat ini.\n\n@MirLes @rizariri @viraniamunaf https://t.co/2tRl3kUyaL Kalian yang di lapangan, terima kasih sudah menjadi tenaga dan suara kita. Stay safe. Inspirasi nulis lagu kali ini!\n\n“A Rumor in St. Petersburg” by Kelsey Grammer &amp; Jonathan Dokuchitz for Anastasia\n“Pantjaran Kasih” by Orkes Tropicana\n“Ayam Den Lapeh” by Sharifah Aini\n“Ya Mahmud” by Orkes Kelana Ria https://t.co/2czhoR5fxM Perhaps you feel like your life is running in slow motion, or maybe you think you’re not moving fast enough. \n\nSteady...\n\nSlow progress is still progress, and better than nothing. You’ll get there champion. ONE PIECE, Princess Mononoke, The Godfather, How to Train Your Dragon, Pocahontas, Jurassic Park, The Last of The Mohicans, Inuyasha\n\nPetualangan Sherina ☺️ https://t.co/TzBVmpNVFw Emotional speed bumps are bound to happen anyway. All you can do is overcome it, stick to your destination (or... improvise), and enjoy the ride while it lasts. \n\nPreferably with your favorite human by your side.\n\nIn my case, a cat or two. https://t.co/H0bFuGJ4PX Pukul 19:00: Iya iya saya bangun. https://t.co/fC5lL2qZ3U Alarm pagi tadi https://t.co/LkiGU0936j Working with the best!\nLearning from the best!\n@MirLes @rizariri @viraniamunaf https://t.co/T8TnSG9oTE Selamat jalan Bapak B.J. Habibie \n\n🛫 https://t.co/hdNUVQulYX ALWAYS AUTOSAVE https://t.co/XkhBXkwRgg Menerima dengan lapang dada, air keruh dari keran yang sudah lama tidak dinyalakan.\n\nOtak karatan kelamaan break nulis lagu kemarin. https://t.co/oyL0b4EeGI Tiap abis workshop untuk project yang lagi dikerjakan, rasanya gak sabar ingin segera sharing di sini. Tapi harus menahan diri. Kami ingin persembahkan yang terbaik untuk kalian. \n\nBesok dilanjutkan dengan menulis lagu...\n\nIt’s. So. Exciting. 😚 Seakan kembali ke era ... https://t.co/DJO2km7USi Di balik fenomena erep-erep https://t.co/A3RXFvZz9x You.\n\nFussy, meddlesome, nosy, potty and occasionally judgmental smart-assed trolls.\n\nAt the same time,\n\nIdealistic, passionate, curious, witty and surprisingly observant bright netizens.\n\nYou bring color to my timeline. \nA dreadfully delightful color.\n\nHate you but Love you. Call me whatever you want. Insults and profanities don’t offend me. Animal cruelty does. Truly the lowest of the low.\n\nBless you all animal rescuers. Dear humans.\nYou are capable of rational thinking yet passion renders you irrational.\nFor an inconsistent being, you crave consistency the most.\nYou starve your curiosity, afraid the answers might disappoint you.\nYou’re hopelessly, weirdly, fascinating.\nLet me write about you. Goodbye social life. 👋🏻 https://t.co/2YSH3S8zpD Just learning how to be a worthy cat mom. https://t.co/pmXWeTV71v Halo. Rehat dikit dari Twitter, otak dan hati lagi ngurusin bayi kucing. I’m so in love with this little champion it hurts. Yes it hurts, I love my precious Baloo so much. 🐈 https://t.co/sWeW2ozjcq When they call you cat mom. https://t.co/biksy6G70h Ditunggu fanart ini: https://t.co/1tdOT5tk3N Pagi ini gak sengaja liat-liatan sama cicak. \nSaling tatap sejenak.\nTerus pelan-pelan...\nSaling jalan mundur.\n\nBentar. \n\nAda yang pernah liat cicak jalan mundur juga gak? 🤔 Lobak apa kucing?\n\n@viraniamunaf https://t.co/3xo0aLDHt3 Halo, ini Baloo. 🐈 Usianya masih 6 minggu tapi nafsu makan dan beraknya sama besarnya. 🥰 https://t.co/8r52KpCOWl Tonight, let go and let your dreams tell you a story.  \n\nTomorrow, take control and tell us your story. Roger https://t.co/ZrRL5Zx6hA Yang akan hadir ke konser @afgansyah_reza malem ini suaranya manaaaa?\n\nAaaaaaaku hadir!\n\nGoodluck mabro 🤩🕺🏻 Lagi jadi ....\n\nPhotographed by Ryan Tandya\nStyled by Claresta Pitojo\nMake-Up by Sissy Sosro\nHair by Kiefer Lippens \nWardrobe Harry Halim Paris &amp; Tangan Official \nAccessories Aidan and Ice https://t.co/DTp4WibPSc Throwback to my sister’s Wedding Cake.\n\n@viraniamunaf @Indoventurers https://t.co/5JeMwYjlSC { The Sleep of Reason Produces Monsters }\n\n“Fantasy, abandoned by reason, produces impossible monsters; united with it, she is the mother of the arts and the origin of marvels.”\n\nQuote &amp; Etching by Francisco de Goya https://t.co/aKE8LVRGVe Casual photo 🇮🇩\n\n...\n\n*brb checking my heartbeat* https://t.co/sVZFFqC7EZ Casual goyang pagi https://t.co/mgOdwr1JrM Casual senam pagi 🇮🇩 https://t.co/OGLvnx0n4S Casual good morning 🇮🇩 https://t.co/JeTch4sovQ Adik-adik SD sekolah Scott’s Head Public School di New South Wales, Australia, menyanyikan lagu dari Petualangan Sherina.\n\nSenang dan terharu nonton ini. 🙏🏻😭 Bagus sekali! 🤗Semangat terus belajar Bahasa Indonesianya adik-adik! \n\n@MirLes @rizariri https://t.co/L5t2GCL4JL Our musical morning anthem. https://t.co/VopSR9uKYl Good good good morning! https://t.co/9uvQKVRI6q If you’re lying in bed, wondering why your life is such a ‘meh’, let me tell you, others are wondering how you’ve been nailing it.\n\nStrength, flaws, everything in between, it’ll take me more than a lifetime studying about you &amp; your yet to be seen layers, you unique specimen. Satu meja beda-beda profesi. Tapi profesi terkeren adalah....\n\n(@royyansungkar @HDSTN @deayunda) https://t.co/zFGFNo8FBz Noooooonstop! Hamilton on our way to work work. \n@HDSTN @royyansungkar https://t.co/SZ9skKPcKo Mudah-mudahan sesuai ekspektasi si krucil sebelah kiri. 😂 https://t.co/6kO7qYGczS Tarik nafas, buang nafas, dan maju.\n\nHajar.\n\nSaatnya mengejar lagi. Tarik nafas, buang nafas, dan tunggu. \n\nSabar. \n\nBesok kamu kejar lagi. Loading gula dulu 🍪🍪🍪 https://t.co/wOEsOlE0ea 😆 https://t.co/5G8J9gaguj Don’t forget to recite your gratitude list before you go to bed. \n\nGood night. ☺️ https://t.co/3HF3l0Bg0x Menjelang Hari Anak Nasional, saya diajak Fenty Effendy &amp; @narasitv mengenang buku-buku masa kecil! 👧🏻📚\n\nLengkapnya bisa cek di sini: https://t.co/LQIANIQyBL \n\nPS: Ingat bacaan masa kecilmu yang masih sangat berkesan buatmu?\n\n#BukaBuku #BanyakBaca #HariAnakNasional https://t.co/Yq419jYpcf @alandakariza Thank you for this. A life cut short. A glimpse to his brilliant mind.\n\n“What is a legacy?\nIt's planting seeds in a garden you never get to see.” Hamilton Musical\n\nYet some of us, throughout growth &amp; series of character transformations, strive to leave something behind still. Good morning from your annoying gym rat friend. https://t.co/XmGgu46EEE Melihat mereka yang duluan berhasil, hampir tak mungkin egomu tak tersentil.\n \nMungkin mereka telah memulai lebih dahulu,\ndan kau butuh waktu menggapai benih mimpimu.\n\nTerdengar hatimu yang menggebu. \nTerdengar langkahmu yang menderu. \n\nDunia melupakan tempo,\nmenunggu giliranmu. https://t.co/hwl5FV5iW9 Kenyang https://t.co/XhbNuqIAj5 RICH BRIAN AT JAMES CORDENNN WOOT WOOT https://t.co/UvjWVYyeoA WE DEMAND A RICH BRIAN CARPOOL KARAOKE SEGMENT\n\nNew Rapper Ad-Libs w/ Rich Brian &amp; James Corden https://t.co/HWDX7ab4D8 via @YouTube Update gak penting di hari yang penuh kejadian penting. \n\nSelamat malam dari #republikdaster https://t.co/eh4XdPfkzD @miund @MirLes @rizariri @viraniamunaf Akan disampaikan 😁😁 Deg-degan bagi rapot. \n\nPresiden kami Pak @jokowi. https://t.co/GgWgkwJU6X 🎼💃🏻🕺🏻🎬\n\n@MirLes @rizariri @viraniamunaf https://t.co/TSiWXnhLEv Saya... benar-benar harus kembali bekerja. \n\n#pencapaianmingguini \n#hidupberfaedah https://t.co/6sc9QXrU0K Saat sakit kelamaan nganggur tapi tetap berjiwa kompetitif.\nMba Kylie dan bff ataw emak-emak dasteran? https://t.co/jLz1m47xTI Saya sangat menantikan karya2 @ginaSnoer ke depannya. Sekarang mau shoutout ke para aktor dan crew #DuaGarisBiru tapi gak tahu Twitter usernamenya. Bentar ya nyari dulu. Film #DuaGarisBiru bagus, saya gak mau maksa penonton Indonesia wajib nonton film Indonesia, karena alasan nasionalisme.\n\nTapi film ini bagus, dan kalau kalian pengen lebih banyak lagi film-film Indonesia bagus bermunculan, film bagus perlu dukungan penonton. Alasan kenapa harus nonton #DuaGarisBiru:\n- Bagus\n- Mengilustrasikan kesenjangan sosial\n- Bagus\n- Pentingnya tidak men-taboo kan sex education (sistem reproduksi, sexual health, resiko, kehamilan) untuk remaja dan keluarga.\n- Bagus\n- Bagus Karena lagi belajar tentang pelem, ada banyak scene #DuaGarisBiru (gak mau spoil) yang bikin melongo halo ini ngedirect dan planning bagaimana ya bisa seorganik dan spontan begini hasilnya. Misteri. Cast dan crew yang gokil bisa mencapai ini. Dari segala kegiatan stalking pada perjalanan karir @ginaSnoer (yes, stalking) tetap saja ketika kemarin nonton #DuaGarisBiru benar-benar di luar ekspektasi kami sekeluarga. Saya mungkin sotoy tapi saya seperti merasakan film ini dibuat dan dikemas dengan penuh cinta dan passion. Ngikutin @ginaSnoer dan selalu kagum sama apapun di mana Gina terlibat. Penulis skenario di “Posesif”, “Ku Lari Ke Pantai”, &amp; produser juga di “Keluarga Cemara”.  Pantau juga debut sutradaranya di #DuaGarisBiru dari awal pengumuman akan produksi film ini sampai post-production. Bangun-bangun semangat, karena semalam sebelumnya nonton film Indonesia bagus #DuaGarisBiru \n\nMengembalikan kepercayaan pada industri film Indonesia yang terus berkembang ini. \n\nSecara pribadi untuk saya jadi tamparan pelajaran dan pecutan semangat bekerja keras untuk berkarya. Reaksi nonton sekeluarga film DUA GARIS BIRU : 🥺😢😭😥😍🤗 \n\nIni posting 20 menit setelah nonton. Akan saya proses semalaman &amp; besok share lebih dalam mengapa menurut saya teman-teman harus nonton film ini. \n\nTo director @ginaSnoer, Indonesian cinema is lucky to have you! Kaget juga. https://t.co/hwP5g2iJNh Bisa saja lelucon yang dulunya tidak offensive berubah menjadi offensive atau woke, vice versa. \n\nTo be continued, nyimak lagi. Kalau pilih berhati-hati, kini komedian menghadapi tantangan melucu tanpa potensi menyinggung pihak2 tertentu, tidak terbatas pada era kini saja. Mereka harus berpikir beberapa tahun, bahkan era ke depan, di mana value publik kemungkinan besar berkembang ke arah yang berlawanan. Berbincang mengenai dunia komedi di era sosmed yang kini sering bersinggungan dengan identity politics dan tantangan para komedian menavigasi landscape yang penuh “ranjau” political correctness.\nPilih untuk terobos atau melangkah hati-hati selamanya? Sambil nyimak podcast, izinkan saya sharing beberapa poin menarik utk kamu yg mungkin gak bisa akses ini. (Gamang bersin2 sendirian). \n\nDialog Sam Harris (penulis, public intellectual neuroscience/filsafat, empunya podcast ini) dengan Ricky Gervais (komedian, aktor, penulis). https://t.co/4YswOJHehA Yes! https://t.co/dYT1XYx3V6 Selamat *bersin*\nPagi *bersin*\nNe *bersin* \nTijen\n\n...\n\n*bersin*\n🤧\n\n#storyofmylife Sick day = Family movie marathon \n“Die Hard”\n“Die Hard 2” \n“Double Jeopardy”\n“Kiss Kiss Bang Bang” https://t.co/Qa9OniZ4NY @newsplatter Memulai yang tak bisa diselesaikan Weirrrdly attracted to Alan Rickman in Die Hard https://t.co/38OY77IUej 🥺 https://t.co/crjVzz0KoP https://t.co/y3CU6T539z Tango sama mini komodo. https://t.co/ex639uDoSm https://t.co/SU5MVyZen7 Selamat pagi dari rumah Munaf. 😷🤧 Untuk mem-balance akhir-akhir ini posting foto niat dandan dan background ciamique, saya mau sharing sedikit minuman anget buat yang lagi pilek. https://t.co/QHJuYjn8p8 Selamat pagi teman-teman! \n\nBiar hepi, ngepost selfie outdoor karena realitanya sekarang lagi di kamar selimutan, batuk-batuk, ingusan, suara ngebass dan meriang. \n\nYang lagi sakit semoga cepet sembuh, yang pada sehat jaga kesehatan yao lagi musim radang. Happy weekend! 😘 https://t.co/ikeuDoSupV Hey you, hang in there you got this! https://t.co/myebX11jQl Clean Bali air and a tropical color palette! 🌸🌴🌞 https://t.co/tJOUUAV5GM Today may or may not be your best day. Nonetheless keep writing. Different days stimulate different reactions, you’ll want to be prepared for anything.\n\nYou might write garbage on one of your “best days” but accidentally find a diamond in your worst day. Who knows. Keep writing Dream team 😭 https://t.co/oWgodgmEiv Holy 🦀 we love you and super excited for this 🧜🏼‍♀️ https://t.co/l4NIjMOUOF @newsplatter Salah orang nih nanya nya. Kalau belum bukan Sherina. Sekian kesotoyan saya, mudah-mudahan berfaedah untuk teman-teman seniman yang merasa bete abis nonton sesuatu yang mereka anggap receh. Bukan salah saya sih tapi saya ikutan minta maaf untuk perasaan hampamu. Saya ngerti bgt kok. (Menanti film Sharknado ke-100). Intinya, perjalanan berkarya seniman tidak terbatas melahap karya2 yang dianggap masterpieces saja, tapi juga hal-hal yang tidak sesuai preferensi. Melalui proses penyaringan itulah terbentuk jati diri berkesenian yang akan terus berkembang. Kita makin tahu apa yang kita mau! Karya orang lain yg kita suka pasti picu banyak inspirasi. Kalo gak suka, reaksi umumnya menghindari. Tapi akhir2 ini lg coba bertahan, hargai effortnya (kl memang ada) &amp; pelajari aspek apa yg gak disukai. Mungkin nemu cara spy gak bikin “kesalahan” sama di karya sendiri kelak. Siang ini bersama team @narasitv dan mbak Fenty Effendy rame-rame baca buku-buku masa kecil. Hehe. Ditunggu ya tayangnya. 😁📚 #bukabuku #banyakbaca https://t.co/qD7ci6icD0 Selamat pagi Jakarta! \n(Pose kalender)\n📸: @viraniamunaf https://t.co/jGOgwNFrX2 Saya dan kak @viraniamunaf mendarat di Bali. Akhir pekan ini di sini kami mau menghadiri wedding Tante tersayang. Perjalanan menulis juga tetap lanjut, kali ini dengan pemandangan yang berbeda. Happy weekend teman-teman! https://t.co/dkpPPAljS7 🦀 https://t.co/hEmbZHRBpR Enjoying Jakarta Cypher videos on Youtube. Indorappers freestyling making me realize how far away I am from the swag spectrum.\n\nI’m sure I’ll discover more later, but for now kudos to @Laze92_ &amp; @SinniKaLOne \n\n- salam from someone who has absolutely no chill. Mampir rame-rame ke Plaza Indonesia buat lihat-lihat instalasi “BALUUN by Haluu World” yang Instagramable ini. \nBagi kalian yang pengen menghalukan Instagram Feed pribadi dengan foto-foto unik, coba kesini deh. Lebih seru lagi kalo bareng temen-temen. https://t.co/aYih94qEQJ Tadi lari pagi denger musik di earphone. Papasan sama pelari lain yang kyk nanya sesuatu (gak kedengeran) nunjuk2 pergelangan tangannya. Saya pake smart watch. Jawab bangga,\n“Iya ini pake app buat lari lho!”\n\nSkrg baru nyadar kyknya dia cm nanya jam berapa. Malu udh congkak. Mau ngucapin terima kasih pada teman-teman followers yang sabar ngikutin twit-twit saya yang seringnya seputar: \n\n“Nulis si satu lagu ini yang gak kelar-kelar!”\n\nSemoga gak cepet bosen ya. Suatu hari pas karyanya siap ditampilkan, saya pengen baca twit ini lagi sambil senyum. 😊 Now it’s bedtime, time to wind down and chill. Embrace the possibility that in the next 6 to 8 hours, your dreaming mind may be generous enough to take you to a hopefully pleasant journey around your subconscious thoughts. Prepping you for another morning of more sh*t to do. 🤪 Didn’t realize I was putting so much pressure on things to run perfectly according to plan, just cause \nit’s a “Monday” and also, the “1st”. 😑 \nOnce I stopped worrying about factors beyond my control and just went ahead and DO IT, I got sh*t done. With less anxiety. When you, the author, don’t know the answer to one of your characters’ question. \n\nI’m screwed. ☺️ https://t.co/3Y9TmGtFi8 Selamat #HariKeluargaNasional juga dari Keluarga Darmawan. \n\nI love you Ayah, Ibu, dan Donat.\n\n(Foto dari @abdullah_maksum) https://t.co/1CSklUbscR Kita tak bisa pilih dilahirkan di keluarga seperti apa. Jadi saya sangat bersyukur dikelilingi oleh keluarga yang saling mendukung, melindungi &amp; cinta seni.\n\nKadang berantem, saling bete, tapi tetep cinta hehe.\n\nFoto: @putradjohan\nTema: NIAT PAKE KONSEP.\n\n#HariKeluargaNasional https://t.co/zpKtgyAUd6 Menurut kalian yang nyanyi siapa. \nSaya atau @destrianac ? \n\n(Song: Schuyler Sisters Hamilton!) https://t.co/yCxf586OB5 Menyambung motivasi kemarin kali ini dengan tagar:\n\n#SherYourDesktop \n\nSesuai saran dari saudara @almuhtadimd dan @FilmCerita https://t.co/V2VFTVe8av Sudah kuduga akan nerima ini. https://t.co/jeB5q80Z7i YA MASA https://t.co/Fpdl9NttMn 🐱🐱🐱🐱🐱🐱🐱🐱🐱🐱🐱🐱 https://t.co/UdLIrJ7Qq4 Apa kabar? Ayo semangat maju terus, sebentar lagi weekend! \nSedikit motivasi diri dari Wallpaper teman kami di Twitter: https://t.co/tzo5PkgppF Baik. Nerima banyak banget foto desktop. 😂 \nSaya jadiin rutin untuk RT satu per hari ya. Dibikin hashtagnya juga kali ya, apa terlalu berlebihan. 🤩\n\nPosting desktop dimulai hari ini dari saudara kami yang terniat: https://t.co/CjibFknaZb ‘Kamu yang dulu’ telah memilih gambar yang paling berkesan, untuk dipajang di Wallpaper Desktop/HPmu, agar selalu dilihat oleh ‘kamu yang sekarang’.\n\nJadi kalau lagi merasa hilang arah, mungkin coba intip lagi Wallpapernya. \n\nAda petunjuk dari ‘kamu yang dulu’. \n\nMalam. ☺️ Berawal iseng tapi makasih lho pada share wallpaper desktop/smartphone di Tweet sebelumnya. Tiap break ngintip foto wallpaper kalian &amp; nyoba nebak kalian kayak gimana, aspirasinya apa, dsb. Gak tau akurat apa engga tapi pastinya menghibur. 😂 Besok saya RT yang unik-unik ya haha. Ini desktop background saya. Pentingnya memasang wallpaper yang senanstiasa menyemangati otak yang kerap kering akan ide. Apa desktop background teman-teman? Boleh lho dishare di sini. (Kalau jorok jangan, silahkan dinikmati sendiri saja. Bok ya kasian sama timeline ku.) https://t.co/dIxyKGogO2 Bener ya elegan. Saya pegang statementnya. ⬇️ https://t.co/u1BgFh2fMz https://t.co/FfWo9bSHON Jakarta, di sebuah kasir:\n\n“Mbak Sherina ya? Enakan liat mbaknya yang dulu masih kecil deh.”\n\nMe: 😨💔\n“Jadi... sekarang saya gak enak dilihat?”\n\n“Iya dulu pipinya chubby. Sekarang kayak kurus gitu.”\n\n....\n\nDon’t get me wrong, I’m not offended. Just fascinated by her honesty... @BruceEmond I love her! Main-main ke era favorit 1950an.\n\nPhotographed by Ryan Tandya \nStyled by Claresta Pitojo\nMakeup by Sissy Sosro\nHairdo by Kiefer Lippens\nWardrobe by Max Mara\nAccessories by Aidan and Ice https://t.co/iviS3mVL71 I'd be lying if I said my day had turned out exactly as I'd expected. Binge-watched last season of Parks &amp; Recreation, rooting for Leslie Knope’s rise to success. I swear to Li’l Sebastian (&amp; Leslie’s love for waffles), I’ll be more productive tomorrow... https://t.co/TkeQg6SKRQ Allow yourself to dream beyond your circumstances. And then, work your ass off to transcend those circumstances, overcoming obstacles that may hinder you from achieving your true potential.\nDream and work, like you’re running out of time! \n\n(Warning: misleading message via photo) https://t.co/Dp4hCBnlB0 29 yo me now flattered https://t.co/Zei8g0oTWu https://t.co/kohiJ4lTtK @deelestari @sophialatjuba88 😷 slay right Mari berburu melodi. https://t.co/s8g12UuHpz Kebangun gara-gara cegukan https://t.co/i64Lv9soGW Who knows whether you’re brave or plainly stupid.\nThough I can tell you these rhymes are gravely... putrid. \nBut I don’t mind being called a dumbass poet wannabe,\nLong as I get to call you a badass who aims to be,\n\nThe best of the best which is yourself, so f the rest. You’re such a badass making tough decisions. \nTaking a chance, a stance, blasting through transitions. \nDon’t worry too much, results won’t appear straightaway. \nYou’re not out of touch, rewards don’t come easy anyway. When you think you can pull off a badass exercise video like @xcintakiehlx but you end up looking like an idiot popping in and out of frame. https://t.co/KwnlSHXCz4 Sebelum tidur lepas satu per satu perisaimu hari ini. \n\nRaut tegas untuk jaga wibawa\nSenyuman menyamarkan ragu\nPikiran positif yang tangkis kecewa\nKesibukan demi lupa rasa putus asa.\n\nKita yang tak sempurna berhasil bertempur di hari yang jauh dari sempurna ini. \n\nNow be you. 😴 https://t.co/tlqhEE8L6h *bangun* \n*nguap* \n*ngulet* \n*senyum terbego* \n\nHari baru! 🌞 @ted_kho Thank you Teddy! Meet up soon when you’re in Jakarta please 😁 Huaaaa.... 🥳 Terima kasih ucapan ultahnya. Takut ketuker gak itu chat-chatnya. https://t.co/PHD5pHWbBE We’ve been developing this thing for a year now, because we would like to present you with nothing but the best! Hopefully you guys will like it when it’s out. Public announcement coming soon! This year I am working together with the cream of the crop of Indonesia’s creative artists (whom I look up to so much!) to create something that would hopefully entertain you. Di tahun 2019, saya kerja bareng dengan para seniman kreatif (yang sangat saya ❤️), untuk menyiapkan sesuatu. Kami mulai mengerjakan ini dari setahun yang lalu, gak kilat karena ingin hasil yang terbaik untukmu! Ditunggu ya dalam waktu dekat akan kami umumkan. 🤗 Terima kasih ucapan ulang tahunnya! Thank you so much for your sweet birthday wishes!\n\nPhotographed by Ryan Tandya\nStyled by Claresta Pitojo\nMake-Up by Sissys Sosro\nHair by Kiefer Lippens\nWardrobe Orél \nJewelry Clarissa Kwok https://t.co/ERI3JeLrcZ Diusahakan! 🙏🏻 https://t.co/gdKt68xu2n https://t.co/j6cb8pQh4E @AdibHidayat Terima kasih mas Adib! Ayo kita berburu harta karun lagi 🎼 Holiday’s over! \n\nTime to go back to work and write like you’re running out of time. ✍🏼 https://t.co/kqSLwKvIux Tujuan mau ala Cate Blanchett tapi disebut netijen instagram KWnya Genji atau Loki ya udah diterima aja. 🖤\n\nPhotographed by Ryan Tandya\nStyled by Claresta Pitojo\nMake-Up by Sissy Sosro\nHair by Kiefer Lippens \nWardrobe Harry Halim Paris &amp; Tangan Studio\nAccessories Aidan and Ice https://t.co/XjISF75uYS Tamparan realita itu akhirnya menghasilkan beberapa foto. Akan dishare di sini satu-satu kalau twitter berkenan. Untuk foto ini, thank you:\nFotografer Ryan Tandya\nStylist Claresta Pitojo\nMakeup Sissy Sosro\nHairdo Kiefer Lippens\nWardrobe Rama Dauhan\nJewelry Clarissa Kwok\n❤️ https://t.co/qxPPWhDyhO Saya memutuskan update stock foto profile keperluan event, media &amp; client. Semua diawali oleh insiden lalu di mana saya gak punya stock foto baru untuk sebuah event, nyaris pake foto alakadarnya. Kontrasnya level profesionalime berikut ini. \n\nnote: @sophialatjuba88 cakep ngeut https://t.co/UMB3aLiFqD Hobi terbaru kali ini adalah makan masakan @viraniamunaf yaitu Kimchi Pancake + saos Gochujang campur sambel abece + nasi putih ditabur minyak wijen dan Gochugaru, sembari nonton Yoona di Hyori’s Bed &amp; Breakfast season 2. ☺️ https://t.co/MBtl7AkjX4 In the spirit of lebaran, I forgive you kucing kurang ajar. \n@viraniamunaf https://t.co/1eo156wzKN Lebaran kali ini jauh dari keluarga, karena lagi fokus workshop nulis di luar Jakarta. Tapi selalu happy karena tiap hari ditemenin mikir sama kucing.\n\nMaaf lahir batin semua!\nBiar makin dimaafin misalkan ada salah-salah, saya persembahkan video @viraniamunaf ngasih Buffy treats. https://t.co/44aEI11zsN Good morni- wait... what. My pillow is alive?! https://t.co/oh7w3b0YDK Wrote some lyrics, but mostly distracted by Buffy the cat’s fluffiness &amp; the Bridget Jones’s Diary franchise. \n\nHere’s to wearing PJs all day &amp; a ‘totally spontaneous’ selfie. Featuring a t*i kucing litter box in the background. \n\nHope you guys are having a chill Sunday too! https://t.co/UIjZrCyJVe Turut berduka cita untuk keluarga dan para sahabat tercinta Bu Kristiani Herrawati Yudhoyono. Semoga diberikan ketabahan dan kekuatan dalam menghadapi kepergian beliau. \nSelamat jalan Bu Ani. 🙏🏻 https://t.co/7qpynRF3us Listing off Chinese dignitaries I’m dead. 😂 https://t.co/pmQJQNv684 Ga tahu hari ini, lebih tahu besok\nCobaan hari ini, tempaan tuk besok.\nBingung-bingung hari ini, ancang-ancang besok.\n\nMakin mengerti, mandiri, dan berani besok, karena hari ini dilalui meski terseok-seok.\n\nSekarang bobok, \nberjuang lagi besok.🌛😴 Setelah bongkar pasang keramasin otak bangun mimpi bangun dua minggu lebih akhirnya nemu juga Reff yang tepat untuk nih lagu. https://t.co/uUzyaz3Q5f Here’s a Friday morning jam to my fellow hardworking netijen friends.\n“Let the problems in your mind become ancient artifacts\nPerhaps these raps can help you alleviate” 😝\n- ‘Acid Raindrops’ People Under The Stairs - O.S.T. (2002) https://t.co/t14Uti4OM5 Pagi! \n\nBuat yang sedang bikin sesuatu tapi proses berkarya lagi berjalan lamban, mudah-mudahan stamina kerja kerasmu bisa melampaui kemacetan ini. You got this! Sedikit demi sedikit nanti sampai Grand Line (eeee). \n\nGood luck to you (&amp; wish me luck too)! Go go go! 🎼✍🏼 https://t.co/8JehNHsqmu Inspirasi nulis lagu seminggu ini!\n\n“No. 13 IV - Danse des petits cygnes” by Tchaikovsky for Swan Lake\n“Cabinet Battle #1” by Lin-Manuel Miranda for Hamilton\n“Mine, Mine, Mine” by Alan Menken &amp; Stephen Schwartz for Pocahontas\n“Pada Pahlawan” oleh Cornel Simanjuntak &amp; Usmar Ismail https://t.co/qP2Pk9vbxq Apa kabar hari produktif. https://t.co/XmJqpm2MAM Saat senyum sembunyikan \nteka-teki lika-liku hari mu\n\nBiarkan ku telusuri \nlabirinmu di sanubari\nBiarkan ku pecahkan sandi \ndi benakmu, Biarkan lepas abadi\nBiarkan ku bacakan rahasia \nterkuncimu, Tak sia-sia\ndunia melupakan, tapi Biarkan\n\nKu ada ‘tuk temukan yang \nkau sembunyikan Happy birthday @afgansyah_reza! Di usia barunya, skill &amp; karirnya makin mateng pengalaman. Mari kita terus pantau si bro, karena masih banyak lagi kejutan yang dia punya untuk para pendengar musik Indonesia. Saya persembahkan foto zaman segala baju dilapis biar fesyenebel. https://t.co/whoK0K60iD Happy birthday to my smart, fearless and beautiful baby sister, Maura. Thank you for being the mature one. Just like that time when you willingly gave up your window seat for your gorgeous sister, without struggle and drama. Love you! https://t.co/jwOTK7vioH “JDGWKANSHSKANAJSG!” 💥\nThe sound of my mind being blown to pieces after @JohnWickMovie! Our Silat masters Kang @YayanRuhian dan kang Cecep keren banget! 🙏🏻😭 https://t.co/WfuvGO1Izd You who are physically in the field, away from your families &amp; risking your lives:\n\nThank you for tirelessly ensuring everyone’s safety and protecting the legacy that is our country.\n\nYou deserve all the rests &amp; goodnight sleeps, for our country’s peaceful now and tomorrow. 💪🏻🇲🇨 You who actively fill our timelines with valuable information &amp; your frustrations:\n\nThank you for keeping the rest of us updated &amp; be the brave one who voiced our frustrations too.\n \nNow phones down, get some sleep, for our country needs more of your reality slaps tomorrow. 😎🇲🇨 You who chose to keep your reactions to today’s timeline privately, maybe silently crying while you were at it: \n\nThank you for loving us so much to the point where disappointments has rendered you speechless. \n\nNow rest up, for our country needs more of that love tomorrow. 🤗🇲🇨 Terlepas dari pandangan politik,\n\nKepada yang berbuat keributan, merusak infrastruktur, dan melukai saudara satu negara, terlebih lagi di bulan suci yang seharusnya berjalan damai:\n\nKisah macam inikah yang kalian ingin sejarah kenang?\n\nSejarah mencatat. Political parties and your votes aside, to those who cause the ruckus and disturb what’s supposed to be a peaceful holy month:\n\nIs this how you want your country’s history to remember you? Sejarah mencatat,\nTak lengah menggurat,\nKisah-kisah yang sesaat,\nLangkah-langkah yang tersirat.\n\nSejarah mencatat,\nUlah, titah pendaulat,\nHadiah-hadiah yang bersyarat,\nSalah-salah yang diralat.\n\nSejarah mencatat,\nBersumpah untuk mengingat. “Sunday is suppose to be playtime, human.”  \n\nHello Twitter. This cute but psycho cat goes by the name ‘Buffy’, and what Buffy wants, Buffy gets. \n\n#BuffyTheSpiderSlayer https://t.co/aFpokw4OCW Hi you, woke up scrolling through your timeline, feeling overwhelmed. I feel you. The world can be so damn complicated.\n\nTake your time sunshine. \nIt might be baby steps but hey look, you’re moving forward.\n\nHi you, you’re not alone because we are trying to figure it out too. 🤗 Merasa kurang cerdas untuk jadi \"pembaca buku\"?\nSusah? Pelan-pelan.\nTebal? Sabar, 'ntar nyesal kalau cepat kelar.\nGak suka? 'Kan jadi ngeh sukanya apa.\nPenulis \"jenius\" saja harus mulai dari paragraf satu.\nMaka kamu pembaca, mulai dulu dari halaman pertama.\n\n#HariBukuNasional Listen to your heartbeat. You’re alive! First, say thank you. It has kept you alive all this time. And then... what are you waiting for? Go seize the day you beautiful thing! Pada tubuh ku terima kasih\nSetia temani berletih demi meraih\nambisi, visi, tanpa menagih\nIkut terjebak saat pikiran bertindih\nTanpa sadar mekanisme canggih mulai bergerak tertatih-tatih\nJanji tak lagi meminta berlebih\nPada tubuh yang tak bisa memilih\n(Bye kopi walau cedih) #GERD Hidup memang tak ada gladiresik,\ntapi kau bebas kemanapun membidik,\n\nSaatnya racik, obrak abrik, s’gala taktik,\nDemi kejar visi yang lama menggelitik,\nLalu kupas, t’lisik, ulik dan kritik,\n\nSelagi waktu masih berbaik-baik,\nBelum menghadiahkan tanda titik. Speed menulis hari ini bisa dikatakan sangat, sangat, lamban. Masih mengerjakan lagu yang sama sejak... entah kapan. Better be a damn epic song or else. https://t.co/jUkiIEMqi2 Agenda untuk weekend ini guys! Aren’t you curious about our country’s cinema history? https://t.co/HLd3NsbHwy Kesampaian juga nonton film perdana PERFINI “Darah dan Doa” (The Long March), salah satu masterpiece Usmar Ismail, kemarin malam screening diadakan @kineforum. Terima kasih Om @rizariri dan Tante @MirLes untuk infonya dan @kineforum yang sudah mengadakan penayangan ini! 😭🙏🏻 https://t.co/dnLWuQPDge *Pseudo Typo Currently writing a psedo-swing number and wondering why must I put so many tempo changes in one song. Perfect case of tech skill struggling to keep up with the demands of imagination. Must. Fulfill. Demand. Come on resilience! Raih perjalanan tak terlupakan ke #Borneo! Kesempatan luar biasa melihat langsung pelepasliaran orangutan bersama @bornean_OU! Kunjungi https://t.co/dFej5E1OOm untuk info lebih lanjut dan beri dukunganmu dengan memajang foto #OrangutanFreedom seperti saya di akun sosmedmu! #bosf https://t.co/qHvGtMjLct Thank you Jakarta Post! On Wiro Sableng, Far East Film Festival Udine, and my future (movie+music) project.\n\n@wirosablengID @fareastfilm \n\nhttps://t.co/lSwR0DHGXZ About time lah. #NewProfilePic https://t.co/K3xR43sbsL There’s a million things I haven’t done, but just you wait. Just you wait. https://t.co/cHMhFsHYqa The pleasure is ours! 😊 https://t.co/ysK2xif6cN Had so much fun at the press interview. Thank you! https://t.co/MWzFmy2orD Wiro Sableng @wirosablengID movie screening at Udine @fareastfilm Festival, Italy! \n\nHere with our producer @lalatimothy, festival president Sabrina Baracetti and festival coodinator Thomas Bertache. \n\nCaptured by @sharifahamani! https://t.co/sYXimXDWvb To the 23%, well I’ve got bad news for yall cause starting today I’m back in the Twitter bizness! 😎\n\n(subtext: love me please) Hi Twitter, how are you? Thinking of tweeting more this year. What’s your answer (please be nice please I’m fragile inside 🥺😚) Thank you @Lin_Manuel for @HamiltonMusical finally got the chance to see it with my sister @viraniamunaf we are OBSESSED! Love, from Indonesia. 18 Desember 2018, kami antar “Oci” ke titik PRA-pelepasliaran di Pulau Bangamat. Di sini Oci akan praktekkan yang dipelajarinya selama di sekolah hutan dulu, dan akan dipantau Yayasan BOS @bornean_OU sebelum nantinya Oci siap kembali ke hutan. #SaveOrangutans #OrangutanFreedom https://t.co/agVstvLRoZ Gala Dana 100 Biduan, 100 Hits, untuk Palu, Donggala, Sulteng. https://t.co/vglZZpsxJf Terima kasih untuk acara Gala Dana 100 Biduan, 100 Hits untuk Palu, Donggala, Sulteng. Semoga alunan kami kemarin bisa sampai ke dalam benak saudara-saudara kami; bahwa kami ada, untukmu semua. https://t.co/uvYiF4B8RQ ‘Melangkah ke depan, pendam ragu dalam hingga hilang. Kalaupun diam, terus berdiri dengan kuda-kudanya yang kokoh.’ https://t.co/sfAfUM2cHB Film Wiro Sableng tayang di Bioskop pada tanggal 30 Agustus 2018. Official Full Trailer:\nhttps://t.co/YFMX1j3xi8\n\n#SiapSableng #WiroSableng30Agustus2018 #WiroSableng #LifelikePictures #20thCenturyFox #20thCenturyFoxID", "bag_of_tweets": ["RT @mrshananto: For those who say \"that's privilege\".\n\nBe that person who supports teenage girls getting this kind of privilege.\nBe that pe…", "RT @mrshananto: Our daughter is turning 17.\nShe studies chemistry, biology, history.\nShe loves singing.\nShe is involved in social projects.…", "RT @afgansyah_reza: It's here!! My new song featuring @JacksonWang852 is available on all digital platfroms!! Lets keep this one on repeat…", "Bagi-bagi bunga 💖🌸\n\nELLE Magazine @elleindonesia https://t.co/Q7kcePg6WL", "Surat Untuk Presiden.\n\nFilm Indonesia milik kita semua, menjadi sahabat di banyak waktu, merekam banyak peristiwa bangsa. \n\nKami ingin kembali bisa berkarya dan menginspirasi. \n\nKami memohon dukungan Bapak Presiden @jokowi. \nDan seluruh rakyat Indonesia.\n\n#FilmIndonesiaFilmKita https://t.co/7uXRGaAK1h", "Mood 🔥\n\n #EarwigAndTheWitch @JP_GHIBLI https://t.co/msB7vF0utt", "Malam ini di IGLIVE mau diskusi sama dokter @darrellfernando seputar pencegahan kanker payudara dan serviks. https://t.co/yh69S4Ut2n", "Mimpi jadi Hime setengah hari ☑️\n\nHonored to be on the cover of @elleindonesia magazine March 2021 issue for #ElleWomenInMusic https://t.co/NxqN8dUTF1", "Petualangan Sherina 2 UPDATE\n\nSedang tahap tulis lagu &amp; workshop aransemen musik! Sebagian dikerjakan di kantor @MilesFilms &amp; kini lanjut via daring. \n\nSaya bertindak sebagai composer &amp; penata musik. Workshop dengan Alvin Witarsa sebagai Co-Orchestrator. ✨ \n\n#PetualanganSherina2 https://t.co/ZyKbGGWdCB", "RT @majelismeyong: https://t.co/At7EvgqxwC", "Happy Valentine’s Day @baskaramp 🤍\n\nHonored to be on the cover of \n@dewimag for their January-March issue. Thank you Dewi Magazine!\n\nArticle:\nhttps://t.co/YibyvPuGHi https://t.co/pSfKGdEKOB", "Our first ever magazine cover together!\n\nHonored to be on the cover of @dewimag for their January-March issue.\n\nEntire team PCR tested negative, masks on at all times, except models only during makeup &amp; photoshoot. Thank you so much dream team!\n\nArticle:\nhttps://t.co/YibyvPuGHi https://t.co/glCS1ExXmZ", "RT @ernestprakasa: Teman-teman sejawat di industri hiburan, tolong lah kalo positif meski OTG jangan maksain tetep kerja. Anda mungkin gak…", "2021 ini lagi belajar nulis dengan baik dan benar di Sibelius! Iseng sharing lagu yang ku tulis minggu lalu. \n\nDitulis untuk Solo Violin tapi jelek bgt suaranya 😱, untuk kepentingan preview ku ganti jadi Violin sekawan. \n\nGlissando bunyinya juga wakwaw...\n\nPokoknya belajar dulu~ https://t.co/EGCIAX33Hs", "Random love you mom post! \n\n03/11/2020 https://t.co/vfxbb6NqLO", "Saya mendukung Natha Satwa Nusantara dan aparat hukum Indonesia untuk mengusut sampai tuntas dan menghukum pelaku penyiksaan terhadap hewan, khususnya kasus yang sekarang sedang terjadi di Medan. https://t.co/HSRp1LMWdV", "Oct 24 2018, vocal recording session for Studio Ghibli’s Earwig and The Witch!\n\nI miss Tokyo so much!\n@JP_GHIBLI https://t.co/zJJb55HOLW", "Kita sangat berharap kantor pemerintah di kota lain yang punya wewenang untuk membuat perubahan juga menyadari bahwa kekejaman &amp; siksaan terhadap kuda pekerja adalah hal yang tidak benar &amp; sekarang saatnya menghentikan penderitaan kuda-kuda ini.", "Berita gembira lainnya adalah @jaan_indonesia baru saja membahas program ini dengan Ibu Drh. Rismiati MSE, Kepala Bidang Peternakan dan Kesehatan Hewan, KPKP DKI Jakarta, yang mengatakan bahwa beliau berkomitmen untuk menerapkan program ini di seluruh wilayah di Jakarta! 👏🏻😭💖", "Saat ini @jaan_indonesia kerja sama dengan Drh. Hasudungan - KPKP Jaksel untuk menjalankan program melindungi kesejahteraan kuda pekerja di Jaksel.\n\nProgram mulai resmi Februari 2021, tapi Drh. Hasudungan &amp; tim memulai persiapan lebih awal di Desember 2020! 👏🏻👏🏻", "Di balik budaya yang sudah menjadi hal yang umum, kita luput dari realita bahwa banyak kuda pekerja di Indonesia yang hidup menderita. Seringkali dipaksa kerja sampai mati kelelahan.  \n\nMari ikut bersuara dan beraksi untuk hentikan penderitaan ini. https://t.co/g41XI2xzmp", "おやすみ🌛 https://t.co/OOW1Cr5R4x", "Lagi berandai-andai biar optimis. \n\nApa hal pertama yang ingin kamu lakukan setelah pandemi kelar?\n\nKalau aku pengen banget ketemu kakak dan adek. Mereka sahabatku dan aku masih suka mewek inget pas nikah kemarin mereka ga bisa hadir langsung. \n\nI miss them so much! https://t.co/IlArFprsJ0", "@adriandanarw Seru bacain thread neanderthal denisovannya. Inget nonton docu yg bilang mustahil ada interbreeding neanderthal-homo sapien, sampe akhirnya docu lebih baru lagi yg ngebahas soal interbreeding ini. Just imagining the days when we weren’t the only homo genus! 🤩", "A little throwback, foto 15 Oktober 2019, kangen brainstorm ide, tatap muka kayak gini, sambil ditemani piring di tengah meja yang isinya snack2 untuk sharing. 😭💖\n\nSemenjak Maret 2020, pre-produksi Petualangan Sherina 2 dilakukan secara virtual. Ditunggu ya update selanjutnya! https://t.co/MdCj6yQFVK", "My 2021 so far:\n“MINIGIR ITI BILIH, TIPI JINGIN MINJ....“ https://t.co/14FHIvonNo", "If you’re in for some crazy out of this world entertainment, go browse the comment section in my Instagram. Hopefully you’ll enjoy it as much as I do. https://t.co/TkKFRMMozB", "See you in year 1955\n\n#upcoming https://t.co/vxc4aU1OpQ", "Buat yang tadi gak sempat nonton IGLive aku, @baskaramp dan @KawalCOVID19, kamu bisa nonton sesi ngobrol barusan, melalui link berikut ya. Topik obrolannya adalah aktif dan aman selama pandemi!\n\nhttps://t.co/htmwGSQu40 https://t.co/iSUzyA9lYO", "Live di Instagram @KawalCOVID19 dalam waktu 5 menit lagi! Yuk gabung! 💖 https://t.co/SAXWog9HAm", "Knew it! 😭💖\n\nFor while we have our eyes on the future\nHistory has its eyes on us https://t.co/GXLRkzckX2 https://t.co/RoCdboz6g6", "RT @TheAmandaGorman: Thx @Lin_Manuel ! Did you catch the 2 @HamiltonMusical references in the inaugural poem? I couldn’t help myself! https…", "Hari Jumat, 22 Januari 2021, jam 20:00 WIB.\n\nAku &amp; @baskaramp akan live di Instagram @KawalCOVID19 untuk ngobrol seputar effort &amp; keputusan2 kita berdua dalam menjalani berbagai aktifitas selama pandemi agar tetap aman untuk kita &amp; orang2 di sekitar kita juga. \n\nSee you then! 😚 https://t.co/aZCLcKv5D0", "RT @darrellfernando: abis kena COVID, banyak banget yang nanya:\n- KOK SWAB SAYA MASIH POSITIF?\n- CT VALUE SAYA BELUM NAIK?\n- ISOLASI SAMPAI…", "HAPPY BIRTHDAY LIN-MANUEL MIRANDA!\n\nManifesting dreams to someday have my future musicals (Yes, musicalSSS) be noticed by the ultimate senpai. \n\nJust you waaaiit! \n\n(Hahahaha ngarep 🥲, oke balik kutak kutik sibelius lagi) @viraniamunaf https://t.co/iIMzdhHQ2d", "Klarifikasi dari Raffi. Terima kasih! Mari makin aware protokol/guideline kesehatan yang ada, saling mengingatkan demi menekan angka penularan. \n\nFeel free to also call me out in public if you think I’m wrong. Publik jadi bisa belajar dari kesalahan kita.\n\nhttps://t.co/NugzYnooJd", "Halo Raffi Ahmad, setelah divaksin bukan berarti keluyuran rame2 dong. Anda dipilih jatah awal2 vaksin karena followers banyak. Dengan alasan yang sama, tolong berikutnya konsisten beri contoh yang baik. Please you can do better than this. Your followers are counting on you.", "“EARWIG AND THE WITCH” Original Soundtrack Album link in my bio.\n\nSome behind the scene photos of our recording session!\n\nWith composer Satoshi Takebe, director Goro Miyazaki, &amp; producer Toshio Suzuki. \n\nStudio Ghibli, Tokyo, October 2018. https://t.co/sXO2LajdZb", "Mulai hari ini OST Earwig and The Witch sudah bisa dinikmati di platform-platform digital!\n\nDi tweet sebelumnya aku taro link untuk lagu “Don’t Disturb Me”. \nNah, sekarang ini link untuk lagu satunya lagi “The World Is In My Hands”: https://t.co/jBPpZfxNAV", "Akhirnyaaa Album Original Soundtrack film EARWIG AND THE WITCH hari ini sudah direlease!\n\nUntuk lagu DON’T DISTURB ME bisa diakses lewat link ini: \n\nhttps://t.co/snQWy2mSgx", "@baskaramp Mulai khawatir sama nasib selimut kita dari om @rizariri 😨 https://t.co/oZ7yVHhyyi", "Stop covid = aib, kalau gak nyaman go public at least kabari orang2 yg kontak erat, gak usah pake alibi sakit yg lain.\n\nSupport mental tetangga, keluarga atau teman yg terpapar. \n\nTerima kasih buat yang bertanggung jawab kabarin orang2 sekitarnya, go public, ending the stigma.", "The only way to beat this thing is if we work as a team, karena kebetulan virusnya ini nulaaar. Bukan nakut2in, bukan mau nurunin imun dengan berita buruk, tapi ya ini realitanya. \nBagi yg lg berjuang melawan covid, nakes maupun pasien, semangat! Masih ada orang2 yg peduli 😭🤗", "Ada yg terpapar karena pekerjaan resiko tinggi (nakes), ada yg kena karena harus kerja di luar, tapi ada juga yg kena karena ngumpul2 gak esensial yg bisa banget dicegah. Yg terakhir itu nambah masalah. Takut ketauan ga disiplin akhirnya nutup2in, jadilah stigma covid itu aib.", "Gak semua punya privilege utk selalu physical distancing, jadi kalau kita punya privilege itu bok ya jangan nambah nyusahin mereka yang mau gak mau harus keluar rumah cari nafkah pas pandemi. Tahan dulu lah party2 atau buka2 masker “sejenak” itu. Face shield doang gak ngaruh woy.", "Gak semua bisa WFH terus menerus, akhirnya ada kasus kena dari tempat kerja, kantor, dll. I want to let you know that I’m sorry you’re going through this. 😞 \nJadi makin 🤬 sama yang kena dari ngumpul keluyuran di luar bubble mereka, terus bilangnya “kaget” atau ngaku sakit lain.", "“Life's not a song, life isn't bliss, life is just this, it’s living.\n\nYou'll get along, the pain that you feel, you only can heal by living.\n\nYou have to go on living. So one of us is living.”\n\nOnce More, With Feeling\nBuffy the Vampire Slayer https://t.co/OVI36Iijft", "I used to hateee season 6 of Buffy the Vampire Slayer. The darkest and most depressing season in the series. But now I’m rewatching everything and I find season 6 to be the BEST, it’s sooo gooooood. Especially “Once More, With Feeling” musical episode. 😭👏🏻💖 https://t.co/uzkAEPsFFK", "Good morning Twitter!\n\nStarting my day with my favorite morning song, singing my favorite verse from My Favorite Things song (The Sound of Music) supaya lebih semangat!\n\nSemangaaaat! 💪🏻 https://t.co/ieYcHBNq5G", "Masih banget nih party rame-rame? Kapan waras ya? 🥲", "@miund Perih banget", "DUARRR\n\nSherina dan Sadam siap petualangan lagi! 🥲 wkwk\n\n#puber #fashun #fesyenebel #bunga #backdropestetik #adapadengansherina #takut https://t.co/KZia0ydhZt", "So happy to announce that I’m singing “Don’t Disturb Me” &amp; “The World is In My Hands” (あたしの世界征服), also voicing ‘Earwig’s Mother’ for Studio Ghibli’s upcoming film “Earwig and The Witch”.\n\nAnd omg @KaceyMusgraves is singing &amp; voicing Earwig’s Mother for the English dub! 😍 https://t.co/3xkFLn17CS", "NEW TRAILER! Wah kek kenal suaranya... (brasa ngimpi yawla) 😭💖 https://t.co/qxtDLOT4Ea", "Misalnya kena Covid, takut dihakimi karena tidak disiplin 3M/physical distancing, lalu ditutup2i &amp; takut reaksi publik ngefek ke mental yg lagi harus fokus sembuh, ya wes itu pilihan masing2. Dimengerti. Tapi please tetap tanggung jawab info orang2 yg sempat kontak denganmu. 🙏🏻", "Makin banyak sosok dikenal terpapar Covid. Pilihan masing2 untuk mengumumkan secara publik terkena Covid atau melaksanakan pengobatan tanpa “libatkan” publik. Whatever works for you. Tapi semoga, setidaknya walau gak mengumumkan secara publik, tetap melakukan contact tracing ya.", "Terima kasih telah membesarkan aku &amp; @baskaramp dengan penuh kasih sayang, mengajarkan kita untuk gak kapok mengejar mimpi, dan peduli pada sesama manusia, satwa serta lingkungan.\n\nKini saatnya kita membalas kasih Ibu dan Nani yang tiada terhingga besarnya. \n\nSelamat Hari Ibu 💖 https://t.co/lKgC03Iev3", "Hi again! Twitter @baskaramp berhasil Baskara ambil alih lagi! 🥳 Terima kasih saran-sarannya ya! Have a great Sunday semuanya!", "Hi guys, twitternya @baskaramp dibajak pagi ini. Kalau ada postingan dari akunnya setelah tweet aku yg ini, itu bukan Baskara. Kita lg cari cara untuk ambil alih lagi. Kalau berhasil, aku akan info kembali ya! \n\n(Ada yg pernah alamin ini? Boleh bagi saran langkah2nya? Thank you!)", "Remember, @baskaramp? Missed our drive-in movie, mortified we couldn’t find Bambi our cat, balcony door was half open, she was out! Took her in, argued, calmed down. Eyes away for a second then there it was. A ring in a string dangling around Bambi’s neck. Said YES. What a night! https://t.co/PmkcgLhpXY", "🤯😍 https://t.co/3Kmgwg9Ihx", "I scroll, see people hanging out in clubs bars etc, obviously outside their clusters, without their masks on. Meanwhile numbers are increasing rapidly. It’s getting harder to make sense of it all. I miss social life too you know, but bear with it for now &amp; stop pushing your luck.", "My ❤️ goes to pasien yg fokus berjuang lawan penyakitnya, nakes yg hati2 &amp; teliti tangani pasien2nya, &amp; nantinya, petugas/saksi yg akan bersinggungan dgn pasien yg tengah isolasi. \n\nPlease didengar resiko ini dari para ahlinya: Nakes yg selama ini harus menangani semua ini. 😭 https://t.co/sQRboLMYOR", "Banyak banget akhir-akhir ini yang bikin geleng-geleng kepala, gak tahu mau mulai dari mana. \n\nIntolerance, massive covid clusters, injustice, trust issues w/ the ones in charge, etc.\n\nSeharusnya jadi prioritas saat ini nyawa masyarakatnya kan ya.\n\nHang in there guys 😢.", "Click to see the first Trailer of,\n\nStudio Ghibli’s “EARWIG AND THE WITCH” directed by Goro Miyazaki\n\nスタジオジブリ最新作「アーヤと魔女」のＰＶ\n\nhttps://t.co/C14HSJLJEi", "Sebelum pandemi, skenario Petualangan Sherina 2 sudah mulai kami godok &amp; kembangin di kantor Miles. Semenjak pandemi, kami lanjut via online!\n\nSaat ini kami masuk tahap casting final &amp; workshop aransemen musik.\nTunggu update selanjutnya ya!  🤗\n\n#PetualanganSherina2 @MilesFilms https://t.co/hNogdq0uJf", "Terima kasih semuanya! Melihat respons dan antusiasme teman-teman semua dan tentunya liputan seru dari teman-teman media, kami makin-makin semangat mempersiapkan film ini!\n\nNantikan terus update selanjutnya film Petualangan Sherina 2 ya!\n\n#PetualanganSherina2 @MilesFilms https://t.co/R9fPsuMn2W", "Upcoming STUDIO GHIBLI movie: EARWIG AND THE WITCH\n\nDirected by Gorō Miyazaki, Produced by Toshio Suzuki\n\nI was so lucky to have participated by singing the songs &amp; voicing one of the characters\n\nRelease Date: December 30th, 2020 (19:30 JPT) at NHK\n\n© 2020 NHK, NEP, Studio Ghibli https://t.co/T4u6AcISPF", "To many more adventures and plot twists. 🤍\n\n@baskaramp https://t.co/z3MnP82Xop", "@viraniamunaf @AdibHidayat Love youuu 😭💖", "Keduluan @AdibHidayat 😅 lol https://t.co/FP0vBGrKLh", "Skenario dikembangkan oleh @jujurprananto, @MirLes, @rizariri, aku, &amp; kakakku, @viraniamunaf.\n\nAku juga menulis lagu2 &amp; scoring film, meneruskan posisi almarhum Elfa Secioria. I will do my best to make you proud om Abang! 🤗🎵\n\n#25ThMilesFilms #MilesFilms #PetualanganSherina2 https://t.co/kjTesZBFBD", "Sekuel film musikal ini akan kembali disutradarai @rizariri &amp; diproduseri @MirLes. \n\nAku &amp; @Derby_Rr akan kembali memerankan tokoh Sherina dan Sadam. \n\n#25ThMilesFilms #MilesFilms #PetualanganSherina2 https://t.co/iWeJGsFrkD", "Kembali bertualang... 🎵 https://t.co/hj1GDUYaOd", "Desember 2019 aku bersyukur dapat kesempatan ikut \"pelepasliaran\" orangutan bersama @bornean_OU. Perjalanan panjang tapi luar biasa tak terlupakan momen melihat orangutan kembali ke habitatnya. \n\nIni teaser video, Episode 1 lengkapnya bisa disaksikan di:\n https://t.co/zKBieZnNdb https://t.co/6KfBmx7NFE", "Melihat respons Tweet ini, tampaknya ada gap dalam kesadaran perbedaan \"pelihara satwa liar di rumah\" dengan \"penangkaran satwa liar untuk direhabilitasi dengan tujuan sebisa mungkin bisa dilepasliarkan ke alam\". Kebetulan ada yang ingin aku share nih. Di Tweet berikut ya! https://t.co/D75l1NrSTE", "Satwa liar itu BUKAN binatang peliharaan. Izin apapun tidak akan mengubah fakta bahwa habitatnya BUKAN di rumah anda, mau sekecil atau segede apapun halaman anda.", "Well written character, and well acted, I remember thinking I must meet this talented man! Had the honor to congratulate him after the premiere, and the rest is history.  🤩😘 https://t.co/YHKGgDXrW5", "@moy_NF Kayak chacha kayak M&amp;M's", "Kalau nanya yang mana: Chacha apa Smarties apa M&amp;Ms? \n\nMaap yang saya inget makannya doang. 🙏🏻", "Give me all your High Def Petualangan Sherina memes. \nBring. It. On.\n\nSiapa takuttt? 🤩", "@miund @NetflixID Lol. Inget kalap nyomotin in between takes. 🤤", "RT @kitabisacom: Plis jangan skip dulu twit ini. Cerita dokter Nina di video ini penting banget buat kita pegang.\n\nKarena RS beneran penuh,…", "Sendirian nyetir, kendaraan sendiri pula, ya masuk akal aja lepas masker. Aturan dipahami secara kritis, bukan kata per kata semata dijalani tanpa konteks.\n\nMudah-mudahan aparat berangkat dari niat baik untuk memastikan aturan ditaati, tapi harus diakui blunder dalam eksekusinya. https://t.co/D14vCA4efg", "Hiiiiihhhh 🤯 https://t.co/Ty08gZbkt0 https://t.co/hkhXt0alut", "Every time we talk about theater, film, &amp; acting, your eyes light up with passion. I will always remember your dedication &amp; kindness. What a talented man. What a humble human being. What a loss. https://t.co/rwRMdceZXn", "Produktif di studio = Puasa mandi", "RT @TirtoID: Pada satu kesempatan di tengah pertarungan, Malahayati berhasil menikam Cornelis de Houtman hingga tewas. Peristiwa itu terjad…", "Memancing ide untuk menulis lagu baru hari ini. Yes, lagu baru = DAW kosong, kertas kosong, ide kosong. Jadilah pemanasan dengan lagu Om Elfa yang kaya akan chords indah.\n\nJuga buat yang belum ketemu lagi sama para sahabatnya semenjak PSBB April lalu. (I miss them so much) https://t.co/0T8MvwXVGu", "Hang in there guys. Let's survive this year together. 🤗", "♥️♥️♥️ https://t.co/8979JGWGrv", "RT @NYGovCuomo: Masks work.\nClimate change is real.\nVaccines are effective.\nTrust scientists.", "An___ aku tlah dewasa 🎶", "RT @9GAG: If you gaze long enough into an abyss, the abyss will gaze back into you.\n\n@MeowedOfficial https://t.co/7Wy2QrQtcN", "RT @AdviceToWriters: You have to live with the notion of, “If I don’t write this, no one’s going to write it. If I die, this idea dies with…", "🦧🥰 https://t.co/Stv6zpp2ql", "We don't have time to deal with antivaxxers and conspiracy theories... Covid19 is real. \n\nWhen outside please wear a mask, practise physical distancing, wash your hands, follow the health protocols, avoid crowds, stay alert. \n\nStay alive because you are not alone &amp; loved by many.", "Hari ini ceritanya, banyak yang dikerjakan tapi ga ada yang selesai. https://t.co/knHdmRjG7p", "Random update 💌 https://t.co/Kxa0Hqp4mz", "RT @ernestprakasa: Surat terbuka saya untuk para pekerja film tanah air. ❤️ https://t.co/UUkqcigMpd", "Mood: pengen bikin-bikin rumah di sims. (motherlode) 🙂 https://t.co/V6b8z6Vscv", "Defeat bad ideas with good ideas. \nFight hoaxes with facts. \n\nFreedom of speech means hearing a lot of terrible and 'offensive' opinions. But it also gives you the equal chance to speak up and argue.\n\nInstead of silencing those you disagree with, voice out your disagreements.", "This week was emotionally taxing yet... strangely rewarding at the same time. Ever had a breakdown yet feel enlightened at once? It was both unpleasant and enjoyable.\n\nHuman emotions are riddled with fascinating paradoxes. 🤔 https://t.co/S37gJeTidt", "PUNYA ANAK SAMA SIAPA?? RIN?? https://t.co/hhBMKpBjcd", "APA APA APA?!?!?!?!?!?! https://t.co/dBbuK1AQQ1", "Seharian riset buat lagu baru, muter ulang-ulang Flamenco, Pasodoble, Habanera, Bolero nyampur jadi satu mulai ketuker-tuker rhythmnya... 💃🤪 Lagu kayak apa ya nanti jadinya. https://t.co/UD2gdpTPeD", "Pagi ini... kita bernostalgia... dan tetap menjaga jarak hehe.\n\n#20TahunPetualanganSherina \n\n@rivanos @viraniamunaf @Derby_Rr \n@totopras @MirLes @aditmur \n@rizariri @jujurprananto @MilesFilms https://t.co/ZCHJAe8tDe", "🌌 Canopus... Capella... Vega... 🌌", "@erasmus70 Betul, kalau ada kritik harus dievaluasi. Nah kebetulan, menanggapi video guguk pinter, antara sadar bahwa guguk itu gemes dan ternyata lebih penting dari kita semua 😂, atau berlalu saja kalau sampai dirasa bibit-bibit perasaan se’entitled’ “tersinggung”.", "Anjing menggonggong, khafilah berlalu.\n\nTidak usahlah dimasukkan ke hati @KemenkesRI. Tidak perlulah repot tersinggung.\n\nYuk yuk kembalilah pada prioritas perhatian untuk yang lebih darurat. 🙏🏻", "Some of the replies I got from my previous tweets are just https://t.co/MMA2iy1AH9", "@aldorojax121 @ElgarLouee Baca lagi twitnya. Kalau “seenaknya” saya bakal bilang silahkan keluyuran tanpa masker di luar rumah. Ini sebaliknya. \nTidak keluar rumah KALAU TIDAK PERLU. \nKalau harus bekerja di luar, pake masker, cuci tangan, dsb.", "@Bugie_Aryatmo Di rumah saja KALAU TIDAK PERLU mas. Kalau harus beraktifitas di luar mencari nafkah dsb, pakai masker.\nKalau keluyuran ngumpul-ngumpul gak perlu, ditambah lagi gak pake masker, ya gak usah dulu: di rumah saja. Semoga jelas mas. Stay safe 🙏🏻", "@omhansss @jokowi Terima kasih sudah disiplin dari awal, memutus rantai penyebaran. Sayangnya gak semua orang seperti anda. Saya gak punya VIP backdoor akses ke Istana, yang terbaik bisa saya lakukan saya lakukan. Menggaungkan awareness selebar2nya. Yuk bantu saya sama2 ingatkan yang lain. 🙏🏻", "Sudah terlalu banyak tenaga medis gugur.\n\nTolong jaga jarak, pakai masker, tdk keluar rumah kl tdk perlu. \n\nBisa saja tak bergejala tapi bawa virus. Yg rugi bukan hanya kamu tapi orang sekitarmu.\n\nHasil tes negatif ≠ imun dari covid. \n\nJangan lengah. Vaksin belum tersedia.", "Youtube binge day. \nTravel: Flying The Nest, Kara &amp; Nate, Eamon &amp; Bec.\nFood: Pick Up Limes, Abbey Sharp, Cooking with Dog, Jun’s Kitchen, Nina Montagne, Unconventional Baker, Peaceful Cuisine &amp; Ochikeron. \nFitness: Sarah’s Day. \nMusic: Usnavi. \n😼: Kitten Lady &amp; Jackson Galaxy.", "Menahan diri untuk gak ikutan but\n\nI'm past patiently waitin' I'm passionately smashin' every expectation\nEvery action's an act of creation\nI'm laughin' in the face of casualties and sorrow\nFor the first time, I'm thinkin' past tomorrow!!!!!!!!!!!!!\n\nAaaaaaaa https://t.co/SIRIScGoAp", "Terima kasih untuk Joshua yang mengingatkan kembali urgensi pandemi ini, terutama di saat kita yang mulai lengah karena “fear fatigue”. Terima kasih tiada henti untuk kerja keras mereka yg di garda terdepan; nakes, pekerja rs, relawan, jurnalis dan masih banyak lagi. https://t.co/yXHayxZVIE", "RT @rickygervais: It's common now to mistake defending someone's right to say things, with agreeing with those things. If you don't support…", "RT @magdaleneid: \"Working hard\" and \"studying hard\" will only ever make a difference to the few who are privileged, not the unfortunate maj…", "Karena teman2 sabar banget nungguin aku yang siput berkarya, aku bocorin dikit...\n\nAda 5-6 lagu yang selesai ditulis untuk sebuah project.\nDan 2-3 lagu untuk project lainnya.\n\nJadi ada 2 project yg disiapkan! Masing2 penuh lagu2 baru! Siap eneg yaa love you maaci sabar nunggu! 😘", "Embracing my slow writing pace. Cemas pandemi cukup mengganggu kreatifitas. Bersyukur at least ada sesuatu yang muncul walau lama banget mancingnya. Untung kerannya belum kering, my biggest fear, walau macet. Plis plis plis jangan macet dulu lagi masih banyak deadlinenya 🙏🏻😭", "Hari ini perdana berhasil memusnahkan kutukan creative block selama 2,5 bulan. AKHIRNYA DAPAT JUGA MELODY DAN CHORDS BUAT NIH LAGU. Momennya lagi sikat gigi tiba-tiba bak wangsit melody itu datang. Kalau lagu ini sudah dilepas ke publik, punten bantu ingetin aku pernah twit ini.", "All is forgiven https://t.co/lXk7lB1cWg", "Dari:\nBaskara ✅\nKekasih Sherina ✅\nAncaman pembunuhan ✅\n\nUjung-ujungnya:\nDoyan kulineran ✅\n\nOke. https://t.co/Pv52nxQFpp", "It’s been a really tough day, weekend, week, month, year for all of us. Hang in there guys. Goodnight and stay safe always. 🤗\n\n“Smile” Nat King Cole https://t.co/HF9wfw5wXp", "Kebiasaan 😭😭😭😭 https://t.co/1LyF4UaXUy", "RT @AdibHidayat: Indonesian music long forgotten, from pop and rock to traditional sounds, digitised for younger generations to appreciate…", "Ju-On Origins seruu 👻 I need Season Two! https://t.co/LYOpbzZXSL", "Akhirnya dandan terniat selama periode Work From Home ini. Pengen aja. 🙃 https://t.co/RKI3moBB9k", "“If you stand for nothing Burr, what’ll you fall for?” https://t.co/XvGO9Ngu4I", "Kemarin beberes, nemu ini di bawah wastafel. https://t.co/pH6WGarPgz", "Hari Senin, saatnya membangunkan otak yang mati suri selama akhir pekan. \n\nKembali menulis lagu lagi, siapkan mental dicabik-cabik oleh draft awal yang sudah dipastikan keruh. \n\nLet’s get to: https://t.co/NLGDRLR87I", "@BruceEmond What? I totally missed this! Thank you for this beautiful birthday message! 🤩", "Saya salah. Covid-19 adalah penyakitnya, yang disebabkan oleh Virusnya: SARS-CoV-2. Tapi untuk memperjelas, tetap bukan nyamuk.\n\nDitunggu jurnal ilmiah kalung eucalyptus VS Covid-19 nya. Saya terima kalau saya blunder. Semoga nyawa tidak melayang karena takhayul yang diilmiahkan.", "@iindraxe Paham. Terima kasih koreksinya. Yang pasti bukan nyamuk ya, virus ataupun penyakitnya.", "Kalung Antivirus Eucalyptus Anti Corona mau diproduksi massal?\n\nSetahu saya Covid-19 itu virus.\n\nBukan nyamuk.", "Alasan valid gak olahraga 2 bulan kemarin. Selalu ada gangguan-gangguan. https://t.co/gijJ25GYfI", "“These little birds don’t have no legs at all, so they have to live their whole lives on the wing. And they sleep on the wind... and they only light on this earth but one time. It’s when they die.” \n\nThe Fugitive Kind (1960) https://t.co/SbKhLEqaJ5", "Hmm. Sepertinya dimulai saat ada yang MALAS bekerja. 🤔 https://t.co/48XSkLMOPu", "Sulit itu hidup tanpa: https://t.co/9on5aPzc7G", "Good morning Twitter!\n\nKalau hari ini atau kemarin bukan hari mu, mungkin esok akan lebih baik. Tunggu sedikit lagi, besok kan datang sebentar lagi. \n\nBacking Vocal credit: \nBambi the singing cat\n\nSong: Tomorrow (Annie) https://t.co/Krv01CQ5km", "Almost perfect circle #Baloo https://t.co/vJxhVmI1Uj", "Di tengah pandemi ini, @bornean_OU terus berkomitmen menjaga keamanan &amp; kesejahteraan Orangutan, &amp; dengan dukunganmu kita bersama bisa terus menyelamatkan orangutan &amp; berkampanye demi kelangsungan hidup mereka. \n\nBeri dukunganmu melalui: https://t.co/MM49vGWqoJ https://t.co/nEuRFVCChO", "Berhubung situasi pandemi, cabin fever, berita yang dibaca, dll..\n\nRasanya mau berkarya tapi otak ke-distract terus. Alhasil berminggu2 tidak ada progres kreatif signifikan.\n\nTapi... hari ini akan coba lagi. \nMasa depan di luar kontrol, tapi cara menghadapinya masih di tanganku. https://t.co/8FSi8oJBga", "RT @mrshananto: I am experiencing quarantine fatigue.\nMeanwhile the virus doesn't get tired at all.\n\nStay safe everyone. https://t.co/TyC6u…", "Mulai ketagihan bikin Bath Bomb uhuhuhu~\nYang ini Lavender &amp; Earl Grey Bath Bomb.\nJadi pengen bikin bentuk pokemon. https://t.co/pXlSseIq4J", "Masa kecilku diwarnai oleh lagu-lagu dari para Maestro ini. Aku merasa sangat bersyukur dinyanyikan lagu-lagu ini oleh Ibu &amp; Ayah, menyanyikannya bersama teman dan guru di sekolah, dan juga membawakan medley lagu-lagu ini di atas panggung dulu. \n🎈🌽🌈🌲🌄 https://t.co/fJGEqua5TI", "@ted_kho Teddy! Thank you. I know I say this way too many times but let’s catch up soon! (once this crazy pandemic is over!)", "@baimGuitar Abbey!!! Masih inget gemes banget nyanyi nyanyi 🤗🤗😍😍. Sending virtual hugs!", "@miund Terima kasih hehe! 💖💖💖", "@Cittairlanie Thank you Cania! 😊😊", "@alexandermatius Thank youu! 🤩🥳", "@FebryMeuthia Terima kasih Mba Febry! 😊🙏🏻", "@HDSTN Thank you lop I lop you! 🤖", "@HaikalKurnia Thank you! 🍺", "@LunaMaya26 Thank you dear! 🤗💖😚", "@baimGuitar Thank youu 🤩🤩🥳", "@AdibHidayat Terima kasih mas Adib! 😊😊", "I’M 30 TODAY OOWOOHOO https://t.co/teeTn12cGn", "@haudaradiva Baloo dan Bambi sudah disteril 😊💖", "Suka suka Baloo https://t.co/d6kfXnY6E6", "Upacara berlangsung sehari, ijazah bisa membantu sampai ke titik tertentu. \n\nTapi, effort dan resilience untuk menyelesaikan kuliah di kala situasi seperti ini akan stick dengan kalian sampai kapanpun. \n\nApapun pilihan karirnya nanti. \n\nCongratulations and bring it on, future!", "Kalian berhasil menyelesaikan kuliah di tengah pressure pandemi ini. Itu adalah skills yang angkatan2 sebelumnya belum tentu punya. \n\nAku lagi... boro-boro kelar kuliah. 😅\n\nJadi kl sedih karena tidak bisa seperti angkatan2 sebelumnya, ingat kamu hebat bisa sampai finish line!", "Untuk yang lulus tahun ini, ga bisa ngumpul wisuda dengan peers pake toga, mungkin agak nyes lihat foto2 throwback achievement teman2 yang beruntung bisa berwisuda pre-covid. \n\nLet me remind you that it doesn’t make your achievements any less.", "In certain aspects I am privileged, therefore my understanding will never be perfect. Therefore I will continue to educate myself, starting with my own country and then global. I’ll always be on the side of free speech &amp; equality. And I will march against violence &amp; injustice.", "Saya masih banyak belajar dan butuh pendapat teman-teman. Jadi mohon jangan dulu tutup ruang diskusi kalau ada pendapat yang tidak sesuai dengan kamu. Yang penting percakapan tidak berhenti, agar kita bergerak ke arah solusi, bukan untuk memenangkan ego yang tersentil.", "Topik yang tadinya terhalang oleh isu-isu lain kini tersorot. Kita akan menyerap dengan cara yang berbeda, memiliki pendapat yang berbeda-beda, dan memberi pendapat dengan cara yang berbeda. Ruang diskusi pun terbuka. Dan dari situlah progres akan terjadi.", "Saya percaya setiap orang harus mendapatkan kesempatan yang sama dan adil, mempunyai suara, apapun gender atau sukunya. Namun walau saya menjunjung tinggi ideologi ini, saya juga menyadari bahwa selama ini saya “sheltered” dari realita sebenarnya. Jadi kembali lagi edukasi diri.", "Melihat apa yang sedang terjadi di dunia, kesadaran secara global, serta perdebatan di sosmed akhir2 ini, mendorong saya untuk mengedukasi diri tentang inequality yang terjadi di “backyard” kita sendiri. Menelaah kembali relationship “free speech” dengan “identity politics”.", "Masih lihat-lihat foto lama.\n\nWedding Day.\n\nAtas: Ibu\nBawah: Eyang Putri (Ibunya Ibu)\n\n@Triawan https://t.co/09PqAvEyxy", "Ayah lagi rajin warnain foto-foto lama pake sebuah app. Jadi di WA Group keluarga lagi banyak dishare foto-foto Kakek-Nenek masa muda. \n\nSalah satunya, foto Eyang Putri aku (Ibunya Ibu)\n\n“Moetiari Sugianto”\n\nKangen. https://t.co/Dknkaw0VEW", "Setuju. https://t.co/1JcTpJy28l", "RT @Prestige_Mag: As we face one of the most challenging periods of our lifetime, Indonesian designer #PatrickOwen encourage us to maintain…", "Biasanya ngegas sekarang lagi akur menyambut lebaran.\n\nMinal Aidin dari Baloo dan Bambi. \n\nMeaowaf lahir dan batin. ❤️🙏🏻 https://t.co/mLaqnkDz5o", "Dari empat tempat yang berbeda, buat yang merayakan kami sekeluarga ucapkan:\n\n“Selamat Hari Raya Idulftiri, Mohon Maaf dan Lahir Batin”\n\nLebaran kali ini misah-misah dulu ya, supaya lebaran tahun depan bisa bersama lagi!\n\n#LebaranAtHome\n#DiRumahAja\n#StayAtHome\n#JanganMudikDulu https://t.co/Rf3QJbqCCO", "I bored annoy u: https://t.co/ShdGZELhuW", "RT @jokoanwar: Dear @CNN, your @CNNIndonesia is distributing illegal sites for pirated movies in their article.", "Meong terbang. \n\nhttps://t.co/UIrMcVIdFs\n\n#DrawFirstThinkLater https://t.co/fwkaTJTIjK", "Baru bikin Instagram khusus buat gambar2 selama pandemi ini. \n\nTujuannya supaya rutin, belajar lagi pelan2 sampai setidaknya... senyaman dulu pas rajin. Bakal upload yang malu2in sampai yang lumayanlah. Yang penting #DrawFirstThinkLater.\n\nSilahkan follow:\nhttps://t.co/kPQZaMuxXw", "Paper trial. Yang penting mulai lagi dulu. 😭\n\n#DrawFirstThinkLater https://t.co/q2cPPY2MUd", "@KuroBovenover Can’t even look at it without cringing myself, let alone showing to another human being.", "Haven’t touched my art supplies for almost three years, until two days ago.  \n\nTook a whole day of trying, dabbling, cursing (yes, I did). The result was a poorly drawn not even close to a doodle. Oh. I. Wept. \n\nBut... it had to be done. \nWill try again tomorrow.", "Baru mau mulai gambar udah ada obstacle. https://t.co/1D40JeOKuE", "Sudah hampir gak pernah sentuh alat-alat gambar semenjak tahun 2017. Pengen mulai rajin gambar lagi, satu gambar per hari yang cimit aja. \n\nGoal ambisiusnya adalah satu buku sketsa selesai diisi dalam sebulan. Mampu konsisten apa enggak ya...? 😏\n\nBagi tema-tema gambar dong. 🙏🏻", "Hai yang masih pada bangun. Besok, JUMAT jam 5 sore, aku akan IGLive!\n\nYuk ikutan ngobrol2 santai dipandu WifWorld Peduli yang sedang bermisi menggalang dana 1000 Paket Lengkap APD untuk Indonesia. \n\nSampai besok di Instagram @wifworld di: https://t.co/UIrMcVIdFs 😘\n\n#DiRumahAja https://t.co/Gc4qwS1ALJ", "Terima kasih Om @rizariri dan @MilesFilms udah ajak ngobrol-ngobrol pagi ini di Cabin Fever! Terima kasih teman-teman yang ikutan nonton. Have a great day, #StayAtHomeAndStaySafe ❤️\n\n#DiRumahAja https://t.co/SdXnxFhcoG", "BESOK, Kamis (23 April 2020) jam 10:00 WIB:\n\nAku akan LIVE di Instagram @MilesFilms “CABIN FEVER” bersama Om @rizariri. \n\nKalau mau ikutan nonton dan punya pertanyaan, langsung aja besok ke Instagram @MilesFilms atau @sherinasinna. \n\nSee you tomorrow! 💖 https://t.co/FTKm7S5GeL", "SETUJU. https://t.co/qCH6TZ6vH5", "😭🤗💖 https://t.co/BbNU10bhje", "@zavarusvhanzo Tekstur baju suwer 😭🙏🏻", "💇🏻‍♀️ ? #DiRumahAja https://t.co/LK73qPryuh", "@mbahndi Semangat Dr. Andri. Stay safe. 🙏🏻", "Everybody processes grief/tragedy/obstacles differently, but I think most of you here would agree that 2020 has been a total: https://t.co/XyUiMyj0iB", "You’ve touched so many hearts, inspired many generations of musicians through your kindness, beautiful voice, and music. No doubt that your work will transcend through time. Your legacy will continue to live forever in our hearts. \n\nRest in peace talented man, bung @GlennFredly. https://t.co/p0Ak8blVYX", "Jujur makin ke sini sebenernya makin kurang demen nyanyi di panggung, tapi kalau ala-ala “manggung” #dirumahaja apalagi dasteran ya.... \n\nKayaknya bisa seru hehe. Udah lama gak nyanyi, bawain apa ya.", "👏🏻👏🏻👏🏻🥳 https://t.co/Syt4N7QsUZ", "Instastories Disney Song Challenge. Keep em coming. \n\n#DiRumahAjaYa https://t.co/4qpwRC5mE9", "Siapa yang berasa debu angkat tangan? https://t.co/xdr31whsue", "Mengajak yang mau ngobrol-ngobrol dan tanya jawab, mampir yuk ke VLIVE ku jam 16:00 sore. (Setengah jam lagi). Aku mau break sebelum kerja lanjut lagi sambil bikin 🍵. ❤️\n\nSee you guys di VLIVE!\n\n#DiRumahAjaDulu https://t.co/LDeUq7kSn6", "I will continue prepping surprises for all of us to enjoy after we get through this pandemic. Meanwhile, stay safe, be mindful and aware, but don’t forget to take care of your mental well-being too. \n\nLove you guys. https://t.co/p7gQspMamx", "Karena kita mengalami ini bersama. \n\nJadi bersama kita lalui ini, bersama kita optimis, bersama kita berjuang dan bersama kita dukung mereka yang berjuang di garda terdepan demi kita semua.", "Tapi aku tidak sendirian cemas menghadapi penyesuaian baru, aku tidak sendirian kesepian terpisah fisik dari teman atau keluarga, aku tidak sendirian gemas baca berita, aku tidak sendirian sedih karena rencana pekerjaan terpaksa mundur atau tantangan baru dari work from home ini.", "Yang bisa ku lakukan sekarang selain dari semua yang disebut di atas adalah beraktivitas #dirumahsaja dulu untuk memutuskan rantai penyebaran. Plus nguat2in stamina bekerja agar tetap kreatif berkarya walau jujur pikiran seringnya terganggu oleh khawatir &amp; cemas akan situasi ini.", "Mari kita bantu sesuai dengan porsi kita masing2. Order makanan tambahan untuk driver ojol, cek tetangga/teman yang rentan butuh bantuan apa, jaga jarak agar mencegah penyebaran Covid-19 supaya tidak terjadi pembludakan yang bikin kewalahan tenaga medis kita, donasi masker dll.", "Tidak terbayang perasaan mereka yang berada di luar sana, bekerja dan berjuang demi kesehatan dan keselamatan kita semua. \n\nTidak terbayang juga kesabaran sekaligus kekhawatiran para sanak saudara, keluarga, sahabat para pekerja yang luar biasa berjasa di saat genting ini.", "Hanya ketika itu kita tersadar, betapa berharganya momen-momen “on script” atau “sesuai rencana” yang dilalui tersebut, sebelum terjadi sesuatu yang mengubah segalanya dalam skala sebesar ini.", "Kalau lagi mumet kerjaan biasanya janjian ngumpul keluarga, bertemu teman dan lainnya. Dan sekarang kita harus #socialdistancing alias #jagajarak. \n\nBenar-benar teguran keras bahwa sebaik-baiknya kita membuat rencana, dunia bisa berbalik begitu saja. In this case, wabah.", "Agak lebih membutuhkan tenaga mental dan disiplin yang kuat bagi orang-orang yang tidak terbiasa bekerja di rumah untuk memulai hari kerjanya di lingkungan rumah. \n\nDitambah setiap scroll handphone/sosial media yang muncul adalah berita yang mengingatkan kita untuk terus waspada.", "Iseng nonton video jadul. https://t.co/W0QAgCmjq3", "Lagi pada mikirin apa ya? 😋\n\n@MirLes @rizariri @alvinpentol https://t.co/jRF30MHT31", "“We can know just how much to cherish the quiet days in which nothing much has yet gone very wrong. And when the off-script event comes, we can at least say that we knew – and realised a while back that this what it means to be human.” School Of Life\n\nhttps://t.co/cYS7azgxzT", "Kayaknya mau bikin daily VLIVE selama self-quarantine ini. Yang tertarik join, ada ide topik-topik VLIVE nya apa aja ya kira-kira? Dan maunya sesering apa? Hehe... 😙", "Thank you. Pastinya bukan keputusan yang mudah. 🙏🏻 https://t.co/WhU3qZne5h", "😍🙏🏻 This is what we need. Supporting each other! https://t.co/B3bzPPjv71", "My babies Mr. Baloo and Lady Bambi shaped like a heart. 💖#WorkFromHome #Frenemies https://t.co/Rscd7GIeZL", "Tidak boleh terlewatkan: Di tengah kita yang mulai Quarantine, aku sangat berterima kasih pada para tenaga kerja kesehatan, driver ojol yang mengarungi jalanan untuk delivery makanan/barang, &amp; masih banyak lagi mereka yang kondisinya tak bisa Work From Home. Stay safe! 🤗", "Self Quarantine Day 2 usaha tidak terjerumus leyeh2 walau godaannya kuat banget hehe. Produksi untuk beberapa #secretprojects tetap berjalan, olahraga adjust di rumah, bikin list bacaan &amp; kyknya seru nih ngeVLive buat nemenin kalian yang juga lagi Work/Study From Home. Thoughts?", "Terima kasih teman-teman yang dengan segala keterbatasan &amp; hal yang harus dikorbankan, membuat keputusan tidak mudah yaitu mulai sedikit demi sedikit mempraktekan social distancing &amp; self quarrantine. \n\nYou’re not alone because I’m doing it too! Let’s fight this together. 🤜🏻🦠", "RT @scottderrickson: Self-quarantine isn’t just about not getting sick. It’s about not becoming a carrier leading to others getting sick.…", "Sekolah atau kantor diliburin itu untuk menghindari kerumunan banyak orang dan mencegah penyebaran virus. \n\nLah tapi malah dijadikan kesempatan buat liburan murah dan jalan-jalan rame-rame. \n\nBegimana ini. Harus apa ya supaya kita kompak memandang prioritas. https://t.co/XjWZ4hqA36", "Tak usah sungkan untuk sementara hindari berjabat tangan atau kontak fisik. Yuk saling mengerti bahwa melindungi kesehatan satu sama lain saat ini jauh lebih penting daripada merasa tersinggung karena ditolak salim atau jabat tangan. \nIt’s for your own good too. \n\nNamaste 🙏🏻☺️❤️", "RT @the_magdalene: Relasi kuasa antara laki-laki dan perempuan mempertajam stigma terhadap menstruasi dan seksualitas perempuan. \n\nHal ini…", "We stand with you! https://t.co/Ks2rjEhizX", "“I have no idea where music comes from. So there’s always the fear that somebody’s going to switch off the tap.” \n\nHans Zimmer, on facing new film scoring projects.\n\nDia aja takut gimana gue. 😱 https://t.co/paJJkeOyJi", "RT @AdviceToWriters: You can't control the success or failure of a thing you work on. You can only control the thing you work on.\n@Lin_Manu…", "Mengawali hari dengan olahraga pagi di @soulboxjakarta. (Yang ingin tahu lebih banyak tentang Personal Training di Soulbox, bisa langsung mampir ke IGTV aku.)\n\nLanjut meeting dan workshop untuk ‘sesuatu’ dari pagi ke sore.\n\nSekarang mengakhiri hari dengan belajar, alias nonton: https://t.co/KSro3TGTDR", "💖 https://t.co/9okxcL1enz", "RT @lalatimothy: It’s an honour to be mentioned among these incredible strong women. Thank you @Variety https://t.co/Vh4bpJ3I80", "RT @MirLes: Saya menulis sebuah artikel opini di majalah @elleindonesia , mengungkapkan kegelisahan saya ttg ancaman hilangnya rasa aman ba…", "A little throwback 🥶 https://t.co/E7Dmj3xEO3", "Sedang jauh dari hingar bingar ibukota karena fokus melakukan writing retreat dan workshop selama beberapa hari. \n\nBanyak bekerja + banyak belajar = banyak ngemil. https://t.co/fVOVkycGuC", "Finally getting there!\n\nExciting story attracts interesting melodies. \nCreating a playlist of songs.\nPerfect ammunition for tomorrow’s creative adventure.\n\nYes yes yes! https://t.co/8thL6S5xFG", "Started the day with a morning meeting over breakfast. Hoping this productive energy lasts until the day’s over. 😅 https://t.co/44vGHYvhLR", "@newsplatter @GagasMedia Brilliant* 😅", "@newsplatter @GagasMedia This is briliant. 😍", "Back in Jakarta to write a new story and compose some more songs. Feeling physically tired after the trip and to be honest, a tad melancholic, but at the same time grateful knowing that you guys are out there, always waiting for our work patiently. \n\nThank you and just you wait! https://t.co/xOSFV02N3Q", "🎼🩹🍩🧗🏻‍♀️🦋🥬🌌 https://t.co/6xkVh1UfoQ", "Tadi siang di Canopy Bridge Bukit Bangkirai. 😁 https://t.co/V3T9z94nkN", "To celebrate history being made. \n\nEdited by @ditsmad 😂 https://t.co/5xPv3EoQf8", "@alexandermatius @MirLes @rizariri Busted! 😂", "Live streaming here in Balikpapan, PARASITE in 92nd Academy Awards!\n\nBest Original Screenplay\nBest International Film (formerly, Best Foreign Language Film)\nBest Director\nAnd...\nBEST PICTURE!\n\nHistory made. https://t.co/ySKHJgGGEf", "Menanam Durian di tepi salah satu pulau Orangutan dalam Samboja Lestari. Pulau-pulau dibuat khusus untuk para orangutan yang tidak bisa dilepasliarkan, karena penyakit atau lainnya, agar mereka tidak selamanya di kandang dan dapat hidup nyaman dalam lingkungan yang semi liar. https://t.co/jLEvfcNAgy", "@piyopikavet Selain dari rescue/rehabilitasi orangutan sampai kembali ke habitatnya di hutan, BOSF juga meningkatkan kesadaran bahwa orangutan tempatnya bukan di rumah manusia yang ingin ‘uyel-uyel’ memeliharanya karena dianggap lucu ketika bayi. Kalau setuju, boleh bantu sebarkan pesan ini.", "Sepanjang Sungai Hitam, Kaltim, sekumpulan Bekantan bertengger di pepohonan, bakau dan nipah keemasan terkena sinar matahari, lalu Kampung Nelayan serta kapal mereka hiasi sungai hingga muara. Indah sekali. \n\nMari kita jaga dengan tidak membuang sampah sembarangan di kawasan ini. https://t.co/GoPsb7lLLt", "Kembali menjelajahi alam Kalimantan dan mempelajari lebih dalam kehidupan para Orangutan bersama @bornean_OU. \n\nSebelumnya kami ikut pelepasliaran Orangutan di Nyarumenteng, kali ini kami mampir ke basecamp BOSF yang di Samboja Lestari, Kalimantan Timur. https://t.co/GqVMkFcnyc", "Selamat sore Twitter!\nKami sedang berada di Sungai Hitam, Kaltim.\n\n@viraniamunaf @MirLes @rizariri https://t.co/TNFyQVvrql", "❤️❤️❤️ https://t.co/4penhM8pfG", "@aMrazing Aku lagi di St. Petersburg, tapi besok balik ke Moscow! Bersua dong! Sampe kapan?", "@aMrazing Lagi di Russia? Di manaa?", "@kevinzebua_ Itu Audioguide dari Museumnya 😁", "Di Hermitage bertemu satu lukisan bertema “Judith slaying Holofernes”. Kali ini dilukis oleh Giorgione. Pertama kali lihat Judith yang dilukis Lucas Cranach the Elder, koleksi MET, langsung jatuh cinta dengan tema ini. Pengen banget lihat yang versi Gustav Klimt di Vienna. 😍 https://t.co/xXfzHdtooq", "@kadin_kumala @baskaramp Haha iya I know. An honest typo. Gak perlu malu kok. 😉", "Had fun exploring the second largest art museum in the world: “Hermitage Museum”, also Winter Palace, in St. Petersburg. The museum houses beautiful works of art by Renoir, Degas, Picasso, Van Gogh, Monet, Rembrandt, Kadinsky, and many more. \n\nAlso, one sculpture by Michelangelo! https://t.co/iTBUPrFsFj", "Baru tahu di dalem Moscow ada Jerman. Atau di dalem Jerman ada Moscow? Sungguh sebuah teka teki. 🤔 https://t.co/24b5DWUwwF", "Nyobain donat terkenal di Pyshechnaya, St. Petersburg. \nKonon ini resep tradisional mereka dari tahun 1958. \n\nJujur rasanya seperti cakwe. \nTapi enak.\n\nWatch till video ends, couldn’t resist. https://t.co/JQRb15EUYn", "On board the SAPSAN Train!\n4 hours from Moscow to St. Petersburg! ❄️\n\n@baskaramp https://t.co/Nhq3IsmSdO", "One of the most whimsical places to dine in Moscow: Cafe Pushkin.\n\nAbsolutely in love with its Library Hall, food and service @CafePushkin 💕 https://t.co/GKjEWfmklK", "Hello! Masih di Moscow, kemarin sudah explore St. Basil’s Cathedral, Kazan Cathedral, State Museum of Russian History, Museum of Patriotic War of 1812. 🤩\n\nNyobain makan Pelmeni di Grand Cafe Dr. Zhivago, semacam dumpling. Pesan yang isi kentang dan mushroom dan ditabur dill. 😋 https://t.co/mzKqpZ7dGM", "First stop in Moscow: \n\nThe beautiful St. Basil’s Cathedral 😍\n\n@baskaramp https://t.co/fOegf290ZT", "Off to a land far far away. \nFor a week.\nBrief vacation to... Russia!\nReady to be fascinated by the culture and history of this winter wonderland.", "I hate how much I love packing.", "Konklusi dari Live hari ini di V LIVE: \n\nTernyata gw bacot.\n\n#youneverknowuntilyoutry", "Jam 14:00 siang sekarang mampir ke V Live yuk. Mau jawab-jawab pertanyaan netijen, siap-siap berangkat pergi, dsb. See you! https://t.co/3Ed8iGdRGU", "So happy wearing this cute Ghibli necklace! It’s Jiji the cat and Kiki’s broom. 😘 https://t.co/19OlODGNVG", "Semangat kerja keropos bersama para kuku. #nailart https://t.co/0Aobjs4dgr", "Feeling incredibly grateful today. I was given the chance to test my limit as an artist, and go beyond my comfort zone.\n\nお疲れ様でした。😊 https://t.co/ZAxSLotvMw", "Delicious Omurice dinner with Ghibli family and had the honor to meet director Nakagawa Ryutaro san! https://t.co/OLpwEJfbP4", "東京に着きました！\n\nBersinggah sebentar ke Tokyo untuk partisipasi di project yang seru banget. Belum bisa diumumin apa, jadi lagi-lagi mohon ditunggu ya hehe.\n\nDi sini hanya 3 hari, wish I could stay longer, tapi pekerjaan lain di Jakarta menunggu... 🤪\n\n楽しみに待っててね！😚 https://t.co/gSH7g02wj8", "Melalui program @SunsetVetBali dan Villa Kitty Foundation Ubud, setelah kami rescue (@viraniamunaf), Buster sudah divaksinasi dan akhirnya diadopsi bulan November kemarin. Terima kasih tak terhingga untuk pihak-pihak yang membantu Buster mendapatkan rumah barunya. 🥰 https://t.co/YeeGowSCkE https://t.co/BlSQ4Rq5za", "@motulz Yang apa nih hehehe.", "@ted_kho Thank you so much Teddy! Yes, definitely let’s catch up. Pick up where we left off! 🤩🤩", "@baskaramp FITNAH", "RT @rickygervais: If you don’t believe in free speech for people who you disagree with, and even hate for what they stand for, then you don…", "Ogah ngetik panjang-panjang, jadi ini video “Hai gaes” singkat, quick 2020 update:\n\n- Upcoming Projects\n- V Live App\n- Daster\n- Niat olahraga yang mudah2an terlaksana tanpa ditunda-tunda!\n\nTerima kasih selalu sabar menunggu! Jaga kesehatan manteman. https://t.co/M2p0hX6eOQ", "Officially sembuh dari pilek meriang kemarin! \n\nKembali bekerja, semangat menyiapkan kejutan-kejutan seru untuk tahun 2020 ini dan tahun-tahun seterusnya. \n\nDitunggu ya teman-teman. Will drop more hints later but for now this photo of bumbu pesmol... https://t.co/Lp28W3oFVo", "Do not f*ck with cats. Seriously. https://t.co/22jSMsJTnV", "Make Jokes, Not War 🤩\n\n@rickygervais https://t.co/uWtVtJqFmS", "Caught a cold!\n\nSniffle season is upon us and it seems to be putting almost everybody’s 2020 plans on hold. Drink water, wash your hands, and eat well to boost your immune system. Stay healthy guys!\n\n(Btw, interesting discovery in the gif section 🤧) https://t.co/2UU1xyVuLc", "Nobody told me about today’s dress code.\n\n@baskaramp and mom looking cute. https://t.co/n121XAd9GE", "Can’t wait for After Life season 2. https://t.co/AwjEBm7srE", "Finished all 3 seasons of The Marvelous Mrs. Maisel in a week. Absolutely in love with its beautiful production design, its sharp witty script, its interesting character development and its brilliantly shot long takes. Can’t wait for season 4! https://t.co/RdQhcLdQXg", "RT @CenayangFilm: Knockup stream  menuju Skypiea https://t.co/zhAxWSS2ob", "Gw sayang sama yang jawab ENAK. https://t.co/Le3ztH8on1", "Mengikuti perjalanan panjang ke titik pelepasliaran dan menyaksikan secara langsung para Orangutan kembali ke rumah sejatinya, sungguh merupakan momen yang tak terlupakan dan cara yang indah untuk menutup tahun 2019. https://t.co/fYitH1d7Za", "Pos jaga Pulau Kaja, pulau pra-pelepasliaran para Orangutan yang lulus dari Sekolah hutan Nyaru Menteng @bornean_OU. Setelah setahun dimonitor di pulau ini, Orangutan yang dinilai siap, akan dipersiapkan untuk pelepasliaran seutuhnya. https://t.co/XHLK39DO5J", "Kalimantan. Menuju titik pelepasliaran Orangutan di Taman Nasional Bukit Baka Bukit Raya. Naik perahu kelotok di Sungai Hiran selama 4 jam. \n\nSkill baru: Bisa tidur di mana saja.\n\n@rizariri @MirLes @bornean_OU https://t.co/Hg6z5Gveu7", "Why you have to be all glowy like a 💡 https://t.co/D8KXvpJZNc", "Yayang mampir ke kantor\n\n@viraniamunaf @MirLes @rizariri @Derby_Rr @MilesFilms https://t.co/dNxMf2MeQ6", "Baloo mau ikut emaknya meeting ya. https://t.co/V95mlbxMlh", "@baskaramp Bijak", "Caught in the middle of a daydream~\n\nThank you “Manual Jakarta” for the beautifully written article. I especially love the glossary section!\n\nPhotographer: Prabowo Prajogio\nStylist: Allysha Nila\nMakeup Artist: Sissy Sosro\nHairdo: Yosefina Yustiani\nMiu Miu &amp; See You At One https://t.co/LoITTOlyED", "@miund OH MY GOODNESS YES. I thought I was the only one.", "Merdeka adalah milik kita semua. Mayoritas maupun Minoritas semua berhak berkisah dan dikisahkan.\n\nSelamat “Kucumbu Tubuh Indahku” atas kemenangan besarnya dalam FFI 2019. \n\nSemoga menjadi inspirasi dan semangat bagi kita semua untuk berani jujur dalam berkarya. \n\n#FFI2019 https://t.co/WqAbEzcTwN", "Morning control freaks.\n\nDisappointments. \nBy day you attract it. \nBy night you’re haunted by it. \nYet you bravely endure, always searching for ways to soften the blow.\n\nDisappointments don’t deserve your courage to keep going. \n\nYou deserve life’s peculiar way of surprising you.", "Fleabag 🖤 https://t.co/gzn5rnSa4Y", "@OmDennis Masa sii. Pasti kyot kayak meong.", "@BruceEmond Thanks Bruce! You too. 😊😊", "Wonderful week. \nThank you luck.\nThank you life.\nTomorrow we begin again. \nWho’s with me? https://t.co/RFTvCCkVsR", "Setelah workshop, dilanjutkan rusuh kena bumbu Pesmol. 🤤\n\n@viraniamunaf @MirLes @rizariri https://t.co/zZqlzI3p5u", "Happy Bday Ayah! Stay healthy, banyak gerak, kopi boleh tapi air putih juga harus minum banyak. Petai bagi-bagi, duren jauh-jauh. Semoga seiring kita tambah usia, selera musik semakin sama, gak kayak dulu berantem rebutan lagu selama perjalanan Jakarta-Bandung.\n\nLove! @Triawan https://t.co/7YpL7CpSNy", "RT @AdviceToWriters: You're gonna make mistakes.\nYou're gonna fail.\nYou're gonna get back up.\nYou're gonna break hearts.\nYou're gonna chang…", "RT @mbahndi: Teman2 sekalian saya menginformasikan apps yg telah Dr.dr. Kristiana Siste,SpKJ(K) dan tim buat untuk penapisan adiksi interne…", "Ralat, bukan Minggu. \nPagi hari Sabtu berkebaya 💕 https://t.co/cyyQQ1sOAP", "Selamat jalan Om Djaduk, terima kasih sudah mencintai seni, musik, budaya, dan mewarnai hidup kita dengan karya-karyamu yang indah. 🤗 https://t.co/ClOBR0q33g", "@baskaramp 🥳", "Papasan sama orang pake kaos Germa 66 Vinsmoke Family. Nyaris ngajak rumpi, tapi tahu diri gak kenal jadi tahan-tahan.\n\n(Padahal kan kita nakama walau belum kenal)", "Good morning. \nTotally planned this. \nIt’s called THE AUTOSPLIT. https://t.co/2koAbF2SAt", "@TrinityOptimaP 頑張ります❣️", "Inspirasi terbesar untuk lagu kali ini. 🤫🎼🎬 https://t.co/r1fFHivq9F", "Today I came home empty handed, brain fried, emotionally drained. But it’s okay. \n\nThe search isn’t over. The song is somewhere waiting to be discovered.", "@baskaramp 🐈🐈🐈", "Setelah 3 bulan lebih, Reff lagu ini mulai kebentuk!!! \n\nMakasih buat yang pada sabar masih mau nungguin dengerin saya koar-koar tentang proses di Twitter, love you all muah!!!!! \n\nTular-tularin terus semangat kalian ya!\n\n#OpeningSongPressure\n#MustStartWithABang https://t.co/kskzZkPmzH", "🤯 https://t.co/OClElJobwB", "Memulai lagi dengan rapi-rapihin kerangka lagu yang sebelumnya serabutan karena ditulis secara spontan. Dengan struktur yang lebih teratur, mudah-mudahan ide akan lebih ramah untuk datang bertamu.", "@AdibHidayat @killthedj @HERUWA @faridstevy Haha haloo", "Barusan dari Ullen Sentalu, hujan-hujan tapi tetap happy. Sekarang dingin-dingin laper. Di Jogja makan dimana ya enaknya? 😋", "Terima kasih rekomendasinya teman-teman Semarang. Kemarin akhirnya mampir ke Tahu Gimbal Pak Edi, ngopi di Spiegel Bistro dan jalan-jalan di Kota Lama. 😊", "Jalan-jalan di Semarang enaknya kemana dan ngapain aja ya? Mau rekomendasinya dong teman-teman.", "Taking a few days off away from Jakarta. Got my laptop with me, ready to dig for new ideas, be inspired by the environment and...\n\nWrite like I’m running out of time! \n🎼✍🏻\n\nPS: Yep, I’m still working on the same project that I’ve been yapping about for almost a year. #singsabar", "Waaah terima kasih! 🎻🤩 https://t.co/GD6AhE1DVx", "Thank you for your talent, hardwork, and honesty Eva 💜 https://t.co/xx6kgBSa7X", "Ibu berkali-kali berhasil tunjukan bahwa dengan kerja keras dan dedikasi, usia tidaklah lagi jadi halangan untuk wujudkan cita-cita.\n\nI’m definitely a lucky daughter raised by a freaking awesome Mom.\n\nHappy birthday and love you Ibu 💙 https://t.co/oMs99VYRah", "Bandung 🤩 https://t.co/JBieFbnWwQ", "Mengenang tapak tilas keluarga Munaf di Nagari Sumpur, Tanah Datar.\n\nDestinasi berikut adalah menyusuri jejak seorang wanita dari Payakumbuh yang nekat bermimpi.\n\n#upcoming https://t.co/bprT60zO3o", "The world is being noisy, let us escape for a while. Don’t worry I’m here too. We’ll be together in our solitary retreat.", "Baloo adalah Jekyll and Hyde 🙄\n\n@viraniamunaf https://t.co/0Rd6WsmcE5", "@rizariri @MirLes @viraniamunaf Hikss brrr", "Meracik, menggali, mencari yang terbaik. \n✍🏻🎬🎼💃🏻🕺🏻\n@rizariri @MirLes @viraniamunaf https://t.co/a2RNKbwMvn", "Saya akan nonton film Bebas ke4 kalinya. Iya. Sesuka itu. Janji kalian bakal sesuka itu juga. \n\nNah makanya, yuk temenin saya nonton. Sekalian kita yang tumbuh dengan PETUALANGAN SHERINA reunian!\n\nKamis, 10 Oktober, pukul 19:00 WIB\nSenayan City XXI.\n\nHTM: 45rb\nHub: +6281993373888 https://t.co/hlJmxJKkXk", "Jadiin profile pic gak ya. https://t.co/gpWxbCt1y5", "🌅 https://t.co/ur1iH55jIM", "Don’t be so hard on yourself. \n\nEveryone is a fool, no one is spared, not even the people you look up to, not even the greatest scholars. \n\nWe all pee, poop, foolish by nature and certainly not immune from death. \n\nThere. Less pressure to be perfect.", "RT @BBCIndonesia: [Video] Sola Gratia Sihaloho dan Sumarni Laman  memerangi api, sekaligus menolak stigma. \"Katanya, 'Bisa perempuan bawa s…", "“Keajaiban di Pasar Senen” oleh Misbach Yusa Biran adalah buku pamungkas kami saat ini.\n\n@MirLes @rizariri @viraniamunaf https://t.co/2tRl3kUyaL", "Kalian yang di lapangan, terima kasih sudah menjadi tenaga dan suara kita. Stay safe.", "Inspirasi nulis lagu kali ini!\n\n“A Rumor in St. Petersburg” by Kelsey Grammer &amp; Jonathan Dokuchitz for Anastasia\n“Pantjaran Kasih” by Orkes Tropicana\n“Ayam Den Lapeh” by Sharifah Aini\n“Ya Mahmud” by Orkes Kelana Ria https://t.co/2czhoR5fxM", "Perhaps you feel like your life is running in slow motion, or maybe you think you’re not moving fast enough. \n\nSteady...\n\nSlow progress is still progress, and better than nothing. You’ll get there champion.", "ONE PIECE, Princess Mononoke, The Godfather, How to Train Your Dragon, Pocahontas, Jurassic Park, The Last of The Mohicans, Inuyasha\n\nPetualangan Sherina ☺️ https://t.co/TzBVmpNVFw", "Emotional speed bumps are bound to happen anyway. All you can do is overcome it, stick to your destination (or... improvise), and enjoy the ride while it lasts. \n\nPreferably with your favorite human by your side.\n\nIn my case, a cat or two. https://t.co/H0bFuGJ4PX", "Pukul 19:00: Iya iya saya bangun. https://t.co/fC5lL2qZ3U", "Alarm pagi tadi https://t.co/LkiGU0936j", "Working with the best!\nLearning from the best!\n@MirLes @rizariri @viraniamunaf https://t.co/T8TnSG9oTE", "Selamat jalan Bapak B.J. Habibie \n\n🛫 https://t.co/hdNUVQulYX", "ALWAYS AUTOSAVE https://t.co/XkhBXkwRgg", "Menerima dengan lapang dada, air keruh dari keran yang sudah lama tidak dinyalakan.\n\nOtak karatan kelamaan break nulis lagu kemarin. https://t.co/oyL0b4EeGI", "Tiap abis workshop untuk project yang lagi dikerjakan, rasanya gak sabar ingin segera sharing di sini. Tapi harus menahan diri. Kami ingin persembahkan yang terbaik untuk kalian. \n\nBesok dilanjutkan dengan menulis lagu...\n\nIt’s. So. Exciting. 😚", "Seakan kembali ke era ... https://t.co/DJO2km7USi", "Di balik fenomena erep-erep https://t.co/A3RXFvZz9x", "You.\n\nFussy, meddlesome, nosy, potty and occasionally judgmental smart-assed trolls.\n\nAt the same time,\n\nIdealistic, passionate, curious, witty and surprisingly observant bright netizens.\n\nYou bring color to my timeline. \nA dreadfully delightful color.\n\nHate you but Love you.", "Call me whatever you want. Insults and profanities don’t offend me. Animal cruelty does. Truly the lowest of the low.\n\nBless you all animal rescuers.", "Dear humans.\nYou are capable of rational thinking yet passion renders you irrational.\nFor an inconsistent being, you crave consistency the most.\nYou starve your curiosity, afraid the answers might disappoint you.\nYou’re hopelessly, weirdly, fascinating.\nLet me write about you.", "Goodbye social life. 👋🏻 https://t.co/2YSH3S8zpD", "Just learning how to be a worthy cat mom. https://t.co/pmXWeTV71v", "Halo. Rehat dikit dari Twitter, otak dan hati lagi ngurusin bayi kucing. I’m so in love with this little champion it hurts. Yes it hurts, I love my precious Baloo so much. 🐈 https://t.co/sWeW2ozjcq", "When they call you cat mom. https://t.co/biksy6G70h", "Ditunggu fanart ini: https://t.co/1tdOT5tk3N", "Pagi ini gak sengaja liat-liatan sama cicak. \nSaling tatap sejenak.\nTerus pelan-pelan...\nSaling jalan mundur.\n\nBentar. \n\nAda yang pernah liat cicak jalan mundur juga gak? 🤔", "Lobak apa kucing?\n\n@viraniamunaf https://t.co/3xo0aLDHt3", "Halo, ini Baloo. 🐈 Usianya masih 6 minggu tapi nafsu makan dan beraknya sama besarnya. 🥰 https://t.co/8r52KpCOWl", "Tonight, let go and let your dreams tell you a story.  \n\nTomorrow, take control and tell us your story.", "Roger https://t.co/ZrRL5Zx6hA", "Yang akan hadir ke konser @afgansyah_reza malem ini suaranya manaaaa?\n\nAaaaaaaku hadir!\n\nGoodluck mabro 🤩🕺🏻", "Lagi jadi ....\n\nPhotographed by Ryan Tandya\nStyled by Claresta Pitojo\nMake-Up by Sissy Sosro\nHair by Kiefer Lippens \nWardrobe Harry Halim Paris &amp; Tangan Official \nAccessories Aidan and Ice https://t.co/DTp4WibPSc", "Throwback to my sister’s Wedding Cake.\n\n@viraniamunaf @Indoventurers https://t.co/5JeMwYjlSC", "{ The Sleep of Reason Produces Monsters }\n\n“Fantasy, abandoned by reason, produces impossible monsters; united with it, she is the mother of the arts and the origin of marvels.”\n\nQuote &amp; Etching by Francisco de Goya https://t.co/aKE8LVRGVe", "Casual photo 🇮🇩\n\n...\n\n*brb checking my heartbeat* https://t.co/sVZFFqC7EZ", "Casual goyang pagi https://t.co/mgOdwr1JrM", "Casual senam pagi 🇮🇩 https://t.co/OGLvnx0n4S", "Casual good morning 🇮🇩 https://t.co/JeTch4sovQ", "Adik-adik SD sekolah Scott’s Head Public School di New South Wales, Australia, menyanyikan lagu dari Petualangan Sherina.\n\nSenang dan terharu nonton ini. 🙏🏻😭 Bagus sekali! 🤗Semangat terus belajar Bahasa Indonesianya adik-adik! \n\n@MirLes @rizariri https://t.co/L5t2GCL4JL", "Our musical morning anthem. https://t.co/VopSR9uKYl", "Good good good morning! https://t.co/9uvQKVRI6q", "If you’re lying in bed, wondering why your life is such a ‘meh’, let me tell you, others are wondering how you’ve been nailing it.\n\nStrength, flaws, everything in between, it’ll take me more than a lifetime studying about you &amp; your yet to be seen layers, you unique specimen.", "Satu meja beda-beda profesi. Tapi profesi terkeren adalah....\n\n(@royyansungkar @HDSTN @deayunda) https://t.co/zFGFNo8FBz", "Noooooonstop! Hamilton on our way to work work. \n@HDSTN @royyansungkar https://t.co/SZ9skKPcKo", "Mudah-mudahan sesuai ekspektasi si krucil sebelah kiri. 😂 https://t.co/6kO7qYGczS", "Tarik nafas, buang nafas, dan maju.\n\nHajar.\n\nSaatnya mengejar lagi.", "Tarik nafas, buang nafas, dan tunggu. \n\nSabar. \n\nBesok kamu kejar lagi.", "Loading gula dulu 🍪🍪🍪 https://t.co/wOEsOlE0ea", "😆 https://t.co/5G8J9gaguj", "Don’t forget to recite your gratitude list before you go to bed. \n\nGood night. ☺️ https://t.co/3HF3l0Bg0x", "Menjelang Hari Anak Nasional, saya diajak Fenty Effendy &amp; @narasitv mengenang buku-buku masa kecil! 👧🏻📚\n\nLengkapnya bisa cek di sini: https://t.co/LQIANIQyBL \n\nPS: Ingat bacaan masa kecilmu yang masih sangat berkesan buatmu?\n\n#BukaBuku #BanyakBaca #HariAnakNasional https://t.co/Yq419jYpcf", "@alandakariza Thank you for this. A life cut short. A glimpse to his brilliant mind.\n\n“What is a legacy?\nIt's planting seeds in a garden you never get to see.” Hamilton Musical\n\nYet some of us, throughout growth &amp; series of character transformations, strive to leave something behind still.", "Good morning from your annoying gym rat friend. https://t.co/XmGgu46EEE", "Melihat mereka yang duluan berhasil, hampir tak mungkin egomu tak tersentil.\n \nMungkin mereka telah memulai lebih dahulu,\ndan kau butuh waktu menggapai benih mimpimu.\n\nTerdengar hatimu yang menggebu. \nTerdengar langkahmu yang menderu. \n\nDunia melupakan tempo,\nmenunggu giliranmu. https://t.co/hwl5FV5iW9", "Kenyang https://t.co/XhbNuqIAj5", "RICH BRIAN AT JAMES CORDENNN WOOT WOOT https://t.co/UvjWVYyeoA", "WE DEMAND A RICH BRIAN CARPOOL KARAOKE SEGMENT\n\nNew Rapper Ad-Libs w/ Rich Brian &amp; James Corden https://t.co/HWDX7ab4D8 via @YouTube", "Update gak penting di hari yang penuh kejadian penting. \n\nSelamat malam dari #republikdaster https://t.co/eh4XdPfkzD", "@miund @MirLes @rizariri @viraniamunaf Akan disampaikan 😁😁", "Deg-degan bagi rapot. \n\nPresiden kami Pak @jokowi. https://t.co/GgWgkwJU6X", "🎼💃🏻🕺🏻🎬\n\n@MirLes @rizariri @viraniamunaf https://t.co/TSiWXnhLEv", "Saya... benar-benar harus kembali bekerja. \n\n#pencapaianmingguini \n#hidupberfaedah https://t.co/6sc9QXrU0K", "Saat sakit kelamaan nganggur tapi tetap berjiwa kompetitif.\nMba Kylie dan bff ataw emak-emak dasteran? https://t.co/jLz1m47xTI", "Saya sangat menantikan karya2 @ginaSnoer ke depannya. Sekarang mau shoutout ke para aktor dan crew #DuaGarisBiru tapi gak tahu Twitter usernamenya. Bentar ya nyari dulu.", "Film #DuaGarisBiru bagus, saya gak mau maksa penonton Indonesia wajib nonton film Indonesia, karena alasan nasionalisme.\n\nTapi film ini bagus, dan kalau kalian pengen lebih banyak lagi film-film Indonesia bagus bermunculan, film bagus perlu dukungan penonton.", "Alasan kenapa harus nonton #DuaGarisBiru:\n- Bagus\n- Mengilustrasikan kesenjangan sosial\n- Bagus\n- Pentingnya tidak men-taboo kan sex education (sistem reproduksi, sexual health, resiko, kehamilan) untuk remaja dan keluarga.\n- Bagus\n- Bagus", "Karena lagi belajar tentang pelem, ada banyak scene #DuaGarisBiru (gak mau spoil) yang bikin melongo halo ini ngedirect dan planning bagaimana ya bisa seorganik dan spontan begini hasilnya. Misteri. Cast dan crew yang gokil bisa mencapai ini.", "Dari segala kegiatan stalking pada perjalanan karir @ginaSnoer (yes, stalking) tetap saja ketika kemarin nonton #DuaGarisBiru benar-benar di luar ekspektasi kami sekeluarga. Saya mungkin sotoy tapi saya seperti merasakan film ini dibuat dan dikemas dengan penuh cinta dan passion.", "Ngikutin @ginaSnoer dan selalu kagum sama apapun di mana Gina terlibat. Penulis skenario di “Posesif”, “Ku Lari Ke Pantai”, &amp; produser juga di “Keluarga Cemara”.  Pantau juga debut sutradaranya di #DuaGarisBiru dari awal pengumuman akan produksi film ini sampai post-production.", "Bangun-bangun semangat, karena semalam sebelumnya nonton film Indonesia bagus #DuaGarisBiru \n\nMengembalikan kepercayaan pada industri film Indonesia yang terus berkembang ini. \n\nSecara pribadi untuk saya jadi tamparan pelajaran dan pecutan semangat bekerja keras untuk berkarya.", "Reaksi nonton sekeluarga film DUA GARIS BIRU : 🥺😢😭😥😍🤗 \n\nIni posting 20 menit setelah nonton. Akan saya proses semalaman &amp; besok share lebih dalam mengapa menurut saya teman-teman harus nonton film ini. \n\nTo director @ginaSnoer, Indonesian cinema is lucky to have you!", "Kaget juga. https://t.co/hwP5g2iJNh", "Bisa saja lelucon yang dulunya tidak offensive berubah menjadi offensive atau woke, vice versa. \n\nTo be continued, nyimak lagi.", "Kalau pilih berhati-hati, kini komedian menghadapi tantangan melucu tanpa potensi menyinggung pihak2 tertentu, tidak terbatas pada era kini saja. Mereka harus berpikir beberapa tahun, bahkan era ke depan, di mana value publik kemungkinan besar berkembang ke arah yang berlawanan.", "Berbincang mengenai dunia komedi di era sosmed yang kini sering bersinggungan dengan identity politics dan tantangan para komedian menavigasi landscape yang penuh “ranjau” political correctness.\nPilih untuk terobos atau melangkah hati-hati selamanya?", "Sambil nyimak podcast, izinkan saya sharing beberapa poin menarik utk kamu yg mungkin gak bisa akses ini. (Gamang bersin2 sendirian). \n\nDialog Sam Harris (penulis, public intellectual neuroscience/filsafat, empunya podcast ini) dengan Ricky Gervais (komedian, aktor, penulis). https://t.co/4YswOJHehA", "Yes! https://t.co/dYT1XYx3V6", "Selamat *bersin*\nPagi *bersin*\nNe *bersin* \nTijen\n\n...\n\n*bersin*\n🤧\n\n#storyofmylife", "Sick day = Family movie marathon \n“Die Hard”\n“Die Hard 2” \n“Double Jeopardy”\n“Kiss Kiss Bang Bang” https://t.co/Qa9OniZ4NY", "@newsplatter Memulai yang tak bisa diselesaikan", "Weirrrdly attracted to Alan Rickman in Die Hard https://t.co/38OY77IUej", "🥺 https://t.co/crjVzz0KoP https://t.co/y3CU6T539z", "Tango sama mini komodo. https://t.co/ex639uDoSm https://t.co/SU5MVyZen7", "Selamat pagi dari rumah Munaf. 😷🤧 Untuk mem-balance akhir-akhir ini posting foto niat dandan dan background ciamique, saya mau sharing sedikit minuman anget buat yang lagi pilek. https://t.co/QHJuYjn8p8", "Selamat pagi teman-teman! \n\nBiar hepi, ngepost selfie outdoor karena realitanya sekarang lagi di kamar selimutan, batuk-batuk, ingusan, suara ngebass dan meriang. \n\nYang lagi sakit semoga cepet sembuh, yang pada sehat jaga kesehatan yao lagi musim radang. Happy weekend! 😘 https://t.co/ikeuDoSupV", "Hey you, hang in there you got this! https://t.co/myebX11jQl", "Clean Bali air and a tropical color palette! 🌸🌴🌞 https://t.co/tJOUUAV5GM", "Today may or may not be your best day. Nonetheless keep writing. Different days stimulate different reactions, you’ll want to be prepared for anything.\n\nYou might write garbage on one of your “best days” but accidentally find a diamond in your worst day. Who knows. Keep writing", "Dream team 😭 https://t.co/oWgodgmEiv", "Holy 🦀 we love you and super excited for this 🧜🏼‍♀️ https://t.co/l4NIjMOUOF", "@newsplatter Salah orang nih nanya nya. Kalau belum bukan Sherina.", "Sekian kesotoyan saya, mudah-mudahan berfaedah untuk teman-teman seniman yang merasa bete abis nonton sesuatu yang mereka anggap receh. Bukan salah saya sih tapi saya ikutan minta maaf untuk perasaan hampamu. Saya ngerti bgt kok. (Menanti film Sharknado ke-100).", "Intinya, perjalanan berkarya seniman tidak terbatas melahap karya2 yang dianggap masterpieces saja, tapi juga hal-hal yang tidak sesuai preferensi. Melalui proses penyaringan itulah terbentuk jati diri berkesenian yang akan terus berkembang. Kita makin tahu apa yang kita mau!", "Karya orang lain yg kita suka pasti picu banyak inspirasi. Kalo gak suka, reaksi umumnya menghindari. Tapi akhir2 ini lg coba bertahan, hargai effortnya (kl memang ada) &amp; pelajari aspek apa yg gak disukai. Mungkin nemu cara spy gak bikin “kesalahan” sama di karya sendiri kelak.", "Siang ini bersama team @narasitv dan mbak Fenty Effendy rame-rame baca buku-buku masa kecil. Hehe. Ditunggu ya tayangnya. 😁📚 #bukabuku #banyakbaca https://t.co/qD7ci6icD0", "Selamat pagi Jakarta! \n(Pose kalender)\n📸: @viraniamunaf https://t.co/jGOgwNFrX2", "Saya dan kak @viraniamunaf mendarat di Bali. Akhir pekan ini di sini kami mau menghadiri wedding Tante tersayang. Perjalanan menulis juga tetap lanjut, kali ini dengan pemandangan yang berbeda. Happy weekend teman-teman! https://t.co/dkpPPAljS7", "🦀 https://t.co/hEmbZHRBpR", "Enjoying Jakarta Cypher videos on Youtube. Indorappers freestyling making me realize how far away I am from the swag spectrum.\n\nI’m sure I’ll discover more later, but for now kudos to @Laze92_ &amp; @SinniKaLOne \n\n- salam from someone who has absolutely no chill.", "Mampir rame-rame ke Plaza Indonesia buat lihat-lihat instalasi “BALUUN by Haluu World” yang Instagramable ini. \nBagi kalian yang pengen menghalukan Instagram Feed pribadi dengan foto-foto unik, coba kesini deh. Lebih seru lagi kalo bareng temen-temen. https://t.co/aYih94qEQJ", "Tadi lari pagi denger musik di earphone. Papasan sama pelari lain yang kyk nanya sesuatu (gak kedengeran) nunjuk2 pergelangan tangannya. Saya pake smart watch. Jawab bangga,\n“Iya ini pake app buat lari lho!”\n\nSkrg baru nyadar kyknya dia cm nanya jam berapa. Malu udh congkak.", "Mau ngucapin terima kasih pada teman-teman followers yang sabar ngikutin twit-twit saya yang seringnya seputar: \n\n“Nulis si satu lagu ini yang gak kelar-kelar!”\n\nSemoga gak cepet bosen ya. Suatu hari pas karyanya siap ditampilkan, saya pengen baca twit ini lagi sambil senyum. 😊", "Now it’s bedtime, time to wind down and chill. Embrace the possibility that in the next 6 to 8 hours, your dreaming mind may be generous enough to take you to a hopefully pleasant journey around your subconscious thoughts. Prepping you for another morning of more sh*t to do. 🤪", "Didn’t realize I was putting so much pressure on things to run perfectly according to plan, just cause \nit’s a “Monday” and also, the “1st”. 😑 \nOnce I stopped worrying about factors beyond my control and just went ahead and DO IT, I got sh*t done. With less anxiety.", "When you, the author, don’t know the answer to one of your characters’ question. \n\nI’m screwed. ☺️ https://t.co/3Y9TmGtFi8", "Selamat #HariKeluargaNasional juga dari Keluarga Darmawan. \n\nI love you Ayah, Ibu, dan Donat.\n\n(Foto dari @abdullah_maksum) https://t.co/1CSklUbscR", "Kita tak bisa pilih dilahirkan di keluarga seperti apa. Jadi saya sangat bersyukur dikelilingi oleh keluarga yang saling mendukung, melindungi &amp; cinta seni.\n\nKadang berantem, saling bete, tapi tetep cinta hehe.\n\nFoto: @putradjohan\nTema: NIAT PAKE KONSEP.\n\n#HariKeluargaNasional https://t.co/zpKtgyAUd6", "Menurut kalian yang nyanyi siapa. \nSaya atau @destrianac ? \n\n(Song: Schuyler Sisters Hamilton!) https://t.co/yCxf586OB5", "Menyambung motivasi kemarin kali ini dengan tagar:\n\n#SherYourDesktop \n\nSesuai saran dari saudara @almuhtadimd dan @FilmCerita https://t.co/V2VFTVe8av", "Sudah kuduga akan nerima ini. https://t.co/jeB5q80Z7i", "YA MASA https://t.co/Fpdl9NttMn", "🐱🐱🐱🐱🐱🐱🐱🐱🐱🐱🐱🐱 https://t.co/UdLIrJ7Qq4", "Apa kabar? Ayo semangat maju terus, sebentar lagi weekend! \nSedikit motivasi diri dari Wallpaper teman kami di Twitter: https://t.co/tzo5PkgppF", "Baik. Nerima banyak banget foto desktop. 😂 \nSaya jadiin rutin untuk RT satu per hari ya. Dibikin hashtagnya juga kali ya, apa terlalu berlebihan. 🤩\n\nPosting desktop dimulai hari ini dari saudara kami yang terniat: https://t.co/CjibFknaZb", "‘Kamu yang dulu’ telah memilih gambar yang paling berkesan, untuk dipajang di Wallpaper Desktop/HPmu, agar selalu dilihat oleh ‘kamu yang sekarang’.\n\nJadi kalau lagi merasa hilang arah, mungkin coba intip lagi Wallpapernya. \n\nAda petunjuk dari ‘kamu yang dulu’. \n\nMalam. ☺️", "Berawal iseng tapi makasih lho pada share wallpaper desktop/smartphone di Tweet sebelumnya. Tiap break ngintip foto wallpaper kalian &amp; nyoba nebak kalian kayak gimana, aspirasinya apa, dsb. Gak tau akurat apa engga tapi pastinya menghibur. 😂 Besok saya RT yang unik-unik ya haha.", "Ini desktop background saya. Pentingnya memasang wallpaper yang senanstiasa menyemangati otak yang kerap kering akan ide. Apa desktop background teman-teman? Boleh lho dishare di sini. (Kalau jorok jangan, silahkan dinikmati sendiri saja. Bok ya kasian sama timeline ku.) https://t.co/dIxyKGogO2", "Bener ya elegan. Saya pegang statementnya. ⬇️ https://t.co/u1BgFh2fMz https://t.co/FfWo9bSHON", "Jakarta, di sebuah kasir:\n\n“Mbak Sherina ya? Enakan liat mbaknya yang dulu masih kecil deh.”\n\nMe: 😨💔\n“Jadi... sekarang saya gak enak dilihat?”\n\n“Iya dulu pipinya chubby. Sekarang kayak kurus gitu.”\n\n....\n\nDon’t get me wrong, I’m not offended. Just fascinated by her honesty...", "@BruceEmond I love her!", "Main-main ke era favorit 1950an.\n\nPhotographed by Ryan Tandya \nStyled by Claresta Pitojo\nMakeup by Sissy Sosro\nHairdo by Kiefer Lippens\nWardrobe by Max Mara\nAccessories by Aidan and Ice https://t.co/iviS3mVL71", "I'd be lying if I said my day had turned out exactly as I'd expected. Binge-watched last season of Parks &amp; Recreation, rooting for Leslie Knope’s rise to success. I swear to Li’l Sebastian (&amp; Leslie’s love for waffles), I’ll be more productive tomorrow... https://t.co/TkeQg6SKRQ", "Allow yourself to dream beyond your circumstances. And then, work your ass off to transcend those circumstances, overcoming obstacles that may hinder you from achieving your true potential.\nDream and work, like you’re running out of time! \n\n(Warning: misleading message via photo) https://t.co/Dp4hCBnlB0", "29 yo me now flattered https://t.co/Zei8g0oTWu https://t.co/kohiJ4lTtK", "@deelestari @sophialatjuba88 😷 slay right", "Mari berburu melodi. https://t.co/s8g12UuHpz", "Kebangun gara-gara cegukan https://t.co/i64Lv9soGW", "Who knows whether you’re brave or plainly stupid.\nThough I can tell you these rhymes are gravely... putrid. \nBut I don’t mind being called a dumbass poet wannabe,\nLong as I get to call you a badass who aims to be,\n\nThe best of the best which is yourself, so f the rest.", "You’re such a badass making tough decisions. \nTaking a chance, a stance, blasting through transitions. \nDon’t worry too much, results won’t appear straightaway. \nYou’re not out of touch, rewards don’t come easy anyway.", "When you think you can pull off a badass exercise video like @xcintakiehlx but you end up looking like an idiot popping in and out of frame. https://t.co/KwnlSHXCz4", "Sebelum tidur lepas satu per satu perisaimu hari ini. \n\nRaut tegas untuk jaga wibawa\nSenyuman menyamarkan ragu\nPikiran positif yang tangkis kecewa\nKesibukan demi lupa rasa putus asa.\n\nKita yang tak sempurna berhasil bertempur di hari yang jauh dari sempurna ini. \n\nNow be you. 😴 https://t.co/tlqhEE8L6h", "*bangun* \n*nguap* \n*ngulet* \n*senyum terbego* \n\nHari baru! 🌞", "@ted_kho Thank you Teddy! Meet up soon when you’re in Jakarta please 😁", "Huaaaa.... 🥳 Terima kasih ucapan ultahnya. Takut ketuker gak itu chat-chatnya. https://t.co/PHD5pHWbBE", "We’ve been developing this thing for a year now, because we would like to present you with nothing but the best! Hopefully you guys will like it when it’s out. Public announcement coming soon!", "This year I am working together with the cream of the crop of Indonesia’s creative artists (whom I look up to so much!) to create something that would hopefully entertain you.", "Di tahun 2019, saya kerja bareng dengan para seniman kreatif (yang sangat saya ❤️), untuk menyiapkan sesuatu. Kami mulai mengerjakan ini dari setahun yang lalu, gak kilat karena ingin hasil yang terbaik untukmu! Ditunggu ya dalam waktu dekat akan kami umumkan. 🤗", "Terima kasih ucapan ulang tahunnya! Thank you so much for your sweet birthday wishes!\n\nPhotographed by Ryan Tandya\nStyled by Claresta Pitojo\nMake-Up by Sissys Sosro\nHair by Kiefer Lippens\nWardrobe Orél \nJewelry Clarissa Kwok https://t.co/ERI3JeLrcZ", "Diusahakan! 🙏🏻 https://t.co/gdKt68xu2n https://t.co/j6cb8pQh4E", "@AdibHidayat Terima kasih mas Adib! Ayo kita berburu harta karun lagi 🎼", "Holiday’s over! \n\nTime to go back to work and write like you’re running out of time. ✍🏼 https://t.co/kqSLwKvIux", "Tujuan mau ala Cate Blanchett tapi disebut netijen instagram KWnya Genji atau Loki ya udah diterima aja. 🖤\n\nPhotographed by Ryan Tandya\nStyled by Claresta Pitojo\nMake-Up by Sissy Sosro\nHair by Kiefer Lippens \nWardrobe Harry Halim Paris &amp; Tangan Studio\nAccessories Aidan and Ice https://t.co/XjISF75uYS", "Tamparan realita itu akhirnya menghasilkan beberapa foto. Akan dishare di sini satu-satu kalau twitter berkenan. Untuk foto ini, thank you:\nFotografer Ryan Tandya\nStylist Claresta Pitojo\nMakeup Sissy Sosro\nHairdo Kiefer Lippens\nWardrobe Rama Dauhan\nJewelry Clarissa Kwok\n❤️ https://t.co/qxPPWhDyhO", "Saya memutuskan update stock foto profile keperluan event, media &amp; client. Semua diawali oleh insiden lalu di mana saya gak punya stock foto baru untuk sebuah event, nyaris pake foto alakadarnya. Kontrasnya level profesionalime berikut ini. \n\nnote: @sophialatjuba88 cakep ngeut https://t.co/UMB3aLiFqD", "Hobi terbaru kali ini adalah makan masakan @viraniamunaf yaitu Kimchi Pancake + saos Gochujang campur sambel abece + nasi putih ditabur minyak wijen dan Gochugaru, sembari nonton Yoona di Hyori’s Bed &amp; Breakfast season 2. ☺️ https://t.co/MBtl7AkjX4", "In the spirit of lebaran, I forgive you kucing kurang ajar. \n@viraniamunaf https://t.co/1eo156wzKN", "Lebaran kali ini jauh dari keluarga, karena lagi fokus workshop nulis di luar Jakarta. Tapi selalu happy karena tiap hari ditemenin mikir sama kucing.\n\nMaaf lahir batin semua!\nBiar makin dimaafin misalkan ada salah-salah, saya persembahkan video @viraniamunaf ngasih Buffy treats. https://t.co/44aEI11zsN", "Good morni- wait... what. My pillow is alive?! https://t.co/oh7w3b0YDK", "Wrote some lyrics, but mostly distracted by Buffy the cat’s fluffiness &amp; the Bridget Jones’s Diary franchise. \n\nHere’s to wearing PJs all day &amp; a ‘totally spontaneous’ selfie. Featuring a t*i kucing litter box in the background. \n\nHope you guys are having a chill Sunday too! https://t.co/UIjZrCyJVe", "Turut berduka cita untuk keluarga dan para sahabat tercinta Bu Kristiani Herrawati Yudhoyono. Semoga diberikan ketabahan dan kekuatan dalam menghadapi kepergian beliau. \nSelamat jalan Bu Ani. 🙏🏻 https://t.co/7qpynRF3us", "Listing off Chinese dignitaries I’m dead. 😂 https://t.co/pmQJQNv684", "Ga tahu hari ini, lebih tahu besok\nCobaan hari ini, tempaan tuk besok.\nBingung-bingung hari ini, ancang-ancang besok.\n\nMakin mengerti, mandiri, dan berani besok, karena hari ini dilalui meski terseok-seok.\n\nSekarang bobok, \nberjuang lagi besok.🌛😴", "Setelah bongkar pasang keramasin otak bangun mimpi bangun dua minggu lebih akhirnya nemu juga Reff yang tepat untuk nih lagu. https://t.co/uUzyaz3Q5f", "Here’s a Friday morning jam to my fellow hardworking netijen friends.\n“Let the problems in your mind become ancient artifacts\nPerhaps these raps can help you alleviate” 😝\n- ‘Acid Raindrops’ People Under The Stairs - O.S.T. (2002) https://t.co/t14Uti4OM5", "Pagi! \n\nBuat yang sedang bikin sesuatu tapi proses berkarya lagi berjalan lamban, mudah-mudahan stamina kerja kerasmu bisa melampaui kemacetan ini. You got this! Sedikit demi sedikit nanti sampai Grand Line (eeee). \n\nGood luck to you (&amp; wish me luck too)! Go go go! 🎼✍🏼 https://t.co/8JehNHsqmu", "Inspirasi nulis lagu seminggu ini!\n\n“No. 13 IV - Danse des petits cygnes” by Tchaikovsky for Swan Lake\n“Cabinet Battle #1” by Lin-Manuel Miranda for Hamilton\n“Mine, Mine, Mine” by Alan Menken &amp; Stephen Schwartz for Pocahontas\n“Pada Pahlawan” oleh Cornel Simanjuntak &amp; Usmar Ismail https://t.co/qP2Pk9vbxq", "Apa kabar hari produktif. https://t.co/XmJqpm2MAM", "Saat senyum sembunyikan \nteka-teki lika-liku hari mu\n\nBiarkan ku telusuri \nlabirinmu di sanubari\nBiarkan ku pecahkan sandi \ndi benakmu, Biarkan lepas abadi\nBiarkan ku bacakan rahasia \nterkuncimu, Tak sia-sia\ndunia melupakan, tapi Biarkan\n\nKu ada ‘tuk temukan yang \nkau sembunyikan", "Happy birthday @afgansyah_reza! Di usia barunya, skill &amp; karirnya makin mateng pengalaman. Mari kita terus pantau si bro, karena masih banyak lagi kejutan yang dia punya untuk para pendengar musik Indonesia. Saya persembahkan foto zaman segala baju dilapis biar fesyenebel. https://t.co/whoK0K60iD", "Happy birthday to my smart, fearless and beautiful baby sister, Maura. Thank you for being the mature one. Just like that time when you willingly gave up your window seat for your gorgeous sister, without struggle and drama. Love you! https://t.co/jwOTK7vioH", "“JDGWKANSHSKANAJSG!” 💥\nThe sound of my mind being blown to pieces after @JohnWickMovie! Our Silat masters Kang @YayanRuhian dan kang Cecep keren banget! 🙏🏻😭 https://t.co/WfuvGO1Izd", "You who are physically in the field, away from your families &amp; risking your lives:\n\nThank you for tirelessly ensuring everyone’s safety and protecting the legacy that is our country.\n\nYou deserve all the rests &amp; goodnight sleeps, for our country’s peaceful now and tomorrow. 💪🏻🇲🇨", "You who actively fill our timelines with valuable information &amp; your frustrations:\n\nThank you for keeping the rest of us updated &amp; be the brave one who voiced our frustrations too.\n \nNow phones down, get some sleep, for our country needs more of your reality slaps tomorrow. 😎🇲🇨", "You who chose to keep your reactions to today’s timeline privately, maybe silently crying while you were at it: \n\nThank you for loving us so much to the point where disappointments has rendered you speechless. \n\nNow rest up, for our country needs more of that love tomorrow. 🤗🇲🇨", "Terlepas dari pandangan politik,\n\nKepada yang berbuat keributan, merusak infrastruktur, dan melukai saudara satu negara, terlebih lagi di bulan suci yang seharusnya berjalan damai:\n\nKisah macam inikah yang kalian ingin sejarah kenang?\n\nSejarah mencatat.", "Political parties and your votes aside, to those who cause the ruckus and disturb what’s supposed to be a peaceful holy month:\n\nIs this how you want your country’s history to remember you?", "Sejarah mencatat,\nTak lengah menggurat,\nKisah-kisah yang sesaat,\nLangkah-langkah yang tersirat.\n\nSejarah mencatat,\nUlah, titah pendaulat,\nHadiah-hadiah yang bersyarat,\nSalah-salah yang diralat.\n\nSejarah mencatat,\nBersumpah untuk mengingat.", "“Sunday is suppose to be playtime, human.”  \n\nHello Twitter. This cute but psycho cat goes by the name ‘Buffy’, and what Buffy wants, Buffy gets. \n\n#BuffyTheSpiderSlayer https://t.co/aFpokw4OCW", "Hi you, woke up scrolling through your timeline, feeling overwhelmed. I feel you. The world can be so damn complicated.\n\nTake your time sunshine. \nIt might be baby steps but hey look, you’re moving forward.\n\nHi you, you’re not alone because we are trying to figure it out too. 🤗", "Merasa kurang cerdas untuk jadi \"pembaca buku\"?\nSusah? Pelan-pelan.\nTebal? Sabar, 'ntar nyesal kalau cepat kelar.\nGak suka? 'Kan jadi ngeh sukanya apa.\nPenulis \"jenius\" saja harus mulai dari paragraf satu.\nMaka kamu pembaca, mulai dulu dari halaman pertama.\n\n#HariBukuNasional", "Listen to your heartbeat. You’re alive! First, say thank you. It has kept you alive all this time. And then... what are you waiting for? Go seize the day you beautiful thing!", "Pada tubuh ku terima kasih\nSetia temani berletih demi meraih\nambisi, visi, tanpa menagih\nIkut terjebak saat pikiran bertindih\nTanpa sadar mekanisme canggih mulai bergerak tertatih-tatih\nJanji tak lagi meminta berlebih\nPada tubuh yang tak bisa memilih\n(Bye kopi walau cedih) #GERD", "Hidup memang tak ada gladiresik,\ntapi kau bebas kemanapun membidik,\n\nSaatnya racik, obrak abrik, s’gala taktik,\nDemi kejar visi yang lama menggelitik,\nLalu kupas, t’lisik, ulik dan kritik,\n\nSelagi waktu masih berbaik-baik,\nBelum menghadiahkan tanda titik.", "Speed menulis hari ini bisa dikatakan sangat, sangat, lamban. Masih mengerjakan lagu yang sama sejak... entah kapan. Better be a damn epic song or else. https://t.co/jUkiIEMqi2", "Agenda untuk weekend ini guys! Aren’t you curious about our country’s cinema history? https://t.co/HLd3NsbHwy", "Kesampaian juga nonton film perdana PERFINI “Darah dan Doa” (The Long March), salah satu masterpiece Usmar Ismail, kemarin malam screening diadakan @kineforum. Terima kasih Om @rizariri dan Tante @MirLes untuk infonya dan @kineforum yang sudah mengadakan penayangan ini! 😭🙏🏻 https://t.co/dnLWuQPDge", "*Pseudo Typo", "Currently writing a psedo-swing number and wondering why must I put so many tempo changes in one song. Perfect case of tech skill struggling to keep up with the demands of imagination. Must. Fulfill. Demand. Come on resilience!", "Raih perjalanan tak terlupakan ke #Borneo! Kesempatan luar biasa melihat langsung pelepasliaran orangutan bersama @bornean_OU! Kunjungi https://t.co/dFej5E1OOm untuk info lebih lanjut dan beri dukunganmu dengan memajang foto #OrangutanFreedom seperti saya di akun sosmedmu! #bosf https://t.co/qHvGtMjLct", "Thank you Jakarta Post! On Wiro Sableng, Far East Film Festival Udine, and my future (movie+music) project.\n\n@wirosablengID @fareastfilm \n\nhttps://t.co/lSwR0DHGXZ", "About time lah. #NewProfilePic https://t.co/K3xR43sbsL", "There’s a million things I haven’t done, but just you wait. Just you wait. https://t.co/cHMhFsHYqa", "The pleasure is ours! 😊 https://t.co/ysK2xif6cN", "Had so much fun at the press interview. Thank you! https://t.co/MWzFmy2orD", "Wiro Sableng @wirosablengID movie screening at Udine @fareastfilm Festival, Italy! \n\nHere with our producer @lalatimothy, festival president Sabrina Baracetti and festival coodinator Thomas Bertache. \n\nCaptured by @sharifahamani! https://t.co/sYXimXDWvb", "To the 23%, well I’ve got bad news for yall cause starting today I’m back in the Twitter bizness! 😎\n\n(subtext: love me please)", "Hi Twitter, how are you? Thinking of tweeting more this year. What’s your answer (please be nice please I’m fragile inside 🥺😚)", "Thank you @Lin_Manuel for @HamiltonMusical finally got the chance to see it with my sister @viraniamunaf we are OBSESSED! Love, from Indonesia.", "18 Desember 2018, kami antar “Oci” ke titik PRA-pelepasliaran di Pulau Bangamat. Di sini Oci akan praktekkan yang dipelajarinya selama di sekolah hutan dulu, dan akan dipantau Yayasan BOS @bornean_OU sebelum nantinya Oci siap kembali ke hutan. #SaveOrangutans #OrangutanFreedom https://t.co/agVstvLRoZ", "Gala Dana 100 Biduan, 100 Hits, untuk Palu, Donggala, Sulteng. https://t.co/vglZZpsxJf", "Terima kasih untuk acara Gala Dana 100 Biduan, 100 Hits untuk Palu, Donggala, Sulteng. Semoga alunan kami kemarin bisa sampai ke dalam benak saudara-saudara kami; bahwa kami ada, untukmu semua. https://t.co/uvYiF4B8RQ", "‘Melangkah ke depan, pendam ragu dalam hingga hilang. Kalaupun diam, terus berdiri dengan kuda-kudanya yang kokoh.’ https://t.co/sfAfUM2cHB", "Film Wiro Sableng tayang di Bioskop pada tanggal 30 Agustus 2018. Official Full Trailer:\nhttps://t.co/YFMX1j3xi8\n\n#SiapSableng #WiroSableng30Agustus2018 #WiroSableng #LifelikePictures #20thCenturyFox #20thCenturyFoxID"]}