{"tweets": "shout out to when my 5th-grade maturation told the guys to not be dicks about the girl's needing tampons and pads Hey @MaraMagill, Thank you for the follow! If you send death threats to people... you're not cool and are a criminal\n\nbye. This is how I’m sharing my picture for a theatre history project. https://t.co/AfCZxWmUBc My advice to anyone just graduating (or anyone) is to get your own opinions. Feel free to disagree with your upbringing and their opinions. If you find you agree with them after you figure it out yourself, cool. (Don't hurt others). You can change your parents to be better. wasn't worth it - my wrists and hands hurt so bad! so i go t bored and attscheed electric ipu;es to my hands and i can't control them well so let;s see how this twee tgoes https://t.co/81dx2tVXxl Hey @savotteson, Thank you for the follow! thinking about the time i straight up told my straight friend he was a hunk after he asked what gay type he would be My professor that just ends class when it's over after saying goodbye so the Zoom meeting ends and you don't have that weird time of trying to hit the exit button politely should be praised for this. If you bully others (ranging from just being a dick to hate crimes) then just stop and reconsider. #ifirstknewIwasLGBTQ when I went and saw Star Trek: Into Darkness on a friend date with the attractive guy friend in my group and enjoyed the date along with the fact that Sulu was gay in it. So apparently my mental breakdowns need a social media platform to explode on or whatever because this last one was in the comments of YouTube videos...\n\nso we did what we always do, delete them and move on We Stan the internet fighting the bad people.\n\nIt gives me hope and helps with the anxiety. We Stan the subtle homophobia from straight men on the internet...\n\n(this is sarcasm btw - in the words of Dua Lipa - in case you need it mansplained) @dawismusic Happy birthday Luke!!!! We love when presumably white people put up a we support and pray for our police sign not understanding the entire situation in the world because of their privileged white world view\n\n(Sarcasm btw) RT @Swilua: Heather: you know the weirdest thing about you \n\nme: idk babe there are so many options here \n\nH: you went your WHOLE LIFE not… All these mfing boys who break your heart ask for you snap and yet I still be catching feelings This should probably go without saying but fuck the KKK I felt so cool answering this survey in my AP English class and getting to fill in the \"identify as gay\" bubble. Brandon Parker https://t.co/LsRtBpMLUe I still get anxious at the reaction.\n\nThough I had a dental assistant when I told her I matched with a boy on Tinder apologized for the heteros not knowing and asked the normal questions (I used they/them pronouns to not give it away) and they thought I meant multiple girls. Does any other openly gay/queer person still have trouble knowing when and how to tell people you are gay/queer? Hey @Gengar__666, Thank you for the follow! RT @Pokemon: ...ahem.\n\nMr. Mime will only let you see this post if you promise to behave, Trainers. 😒 https://t.co/yEPDR6Qdj4 RT @SenKamalaHarris: September is Suicide Prevention Awareness Month. To anyone who is struggling: please know that you are not alone.\n\nTo… So I found out that there was a textbook controversy in 1974 in Kanawha County, Texas, and on the Wikipedia article this badass kid literally is just like \"They're shooting people because they don't want to see violence in books.\" and I wanna know who that is!!!! I'm genuinely confused why white people were so adamant against black people in the 1960s (and all other times in history, but this idea stemmed from reading about this) when it literally doesn't even have any negative effect on their (our) privelege Bro types of straight men scare me... but I’m prepared to frighten them with my raging homosexuality because their afraid of the gay Getting ready to bond with my coworkers over the great internet outage that is not letting us work at 5 am The day I figured out that my work lets me kindly tell people they are being mean with their language was the best day I'm proud that my attempts to use more gender-neutral language has become far easier and has rubbed off on my family This was genuinely cool. Even if I literally didn't say anything, everyone else's comments were just amazing! https://t.co/enPc5kUuZL Hey @Swilua, Thank you for the follow! Invite me to your virtual weddings, please! :) Why did they allow the song “Fergalicious” to be played at my extremely Mormon high-school Yo, my education professor be kinda passionate about teachers being badasses and deserving better and all this stuff and I LOVE IT! I gave my friend sound credit card and financial advice...\n\nI'm still in shock So I don't know why I thought of the phrase, \"I'm gonna go all Wii Sports on your ass,\" but now I want to know what that would even mean. @SlackHQ #WhenRemoteWorks (this is for a good cause so I think it’s cute)\n\nMy new job as an alarm monitor works pretty well from home, especially working grave shifts where I literally just go to bed right after. It worked! Weber's online campus store service isn't working for me so I'm ready to have my first panic attack of the semester. Hey @mckennakylie_, Thank you for the follow! RT @Chrish_the_fish: If God exists, he WITHOUT A DOUBT wants me to marry a handsome successful and caring man @saintlystel My gay male ass didn't realize what this meant until just know. All these Mormons be moving at lesbian speeds Snoop Dogg says read the syllabus! https://t.co/GZo79ayJrM via @YouTube \n\nMY TEACHER WENT OFF! Did I just comment on my education class that we should teach things like taxes and how to sew a button and figure out how to include the fact we should teach about sex more...\n\nYES AND I'M SO PROUD! Science is kinda crazy ngl. I have a conspiracy theory that the reason I didn't make it to state solo and ensemble in choir my senior year is I picked a song that was 7 minutes long. The actual relief when you look at a IsOverParty tag on someone you admire and people are there being like \"guys, this is actually too far\"\n\nOnly when it actually was, like jokes and other things that need context. Otherwise, if they need to be, let it at 'em. I wanna do things because we're in quarantine, but I still can't get myself to do the things available I have a memory of learning how to eject a USB drive in elementary school. Thinking about how some people like to think that woman are pregnant if they remotely look a bit bloated or the like Plants be kinda freaky! I would've been a herbology professor at Hogwarts. Hey @Abdullah3404851, Thank you for the follow! Botany is kinda lit ngl I just finished the 3rd season of Glee and started crying...\n\nso I guess I'm ready to be an educator Guess who made a healthy decision and deleted the Facebook app?!!?!?!?!?!?!?!?!? @IMLIBERTEA_ I was so good at this game!!!! I just realized that my blue-light glasses block my blue-light laser pointer, which I thought was running low on batteries. Hey @KristenVanNest, Thank you for the follow! I am 39.3% heterosexual, 100% homosexual, which places me in the homosexual quadrant. https://t.co/2Th85AB8Jo via @idr_labs @hulu Oreos RT @TheRealCoolmath: Reply for a free hoodie👇 Hey @Landry_Thomas, Thank you for the follow! I've officially had Twitter feud in my Twitter replies and I can't help but feel proud The best version of Robin Hood is the Disney version with the animals Do straight men still think that women do everything just to impress them? If you're a straight guy who thinks he's hot enough to make queer women straight...\n\nThen you're probably too ugly for straight women you know Racist white people wanting black people gone forget that there's a chance their ancestor brought black people over in slavery, who could even be this person's ancestor. RT @muyskerm: If you are a teacher or know a teacher in the US who needs supplies please fill out or share this form! \n\nAll stars donated d… If you call an inbound line for someone who is literally monitoring the alarms to make you safe just to say \"go f#$k yourself,\" then you don't deserve them being there to make sure you don't f#@king die. Hey @DijaSanneh, Thank you for the follow! Who wants to start an internet hoax with me? Some people be out here being like, \"It's so hard to say that being gay is wrong.\" B!tch, imagine actually being f#@king gay. All these straight boys on TikTok be dancing like they're at the casting call for Magic Mike 3. Botony is reminding me that my biology teacher once opened up a chemical that smelled like puke because it's what your body produces when you vomit... Is it bad that I want to revamp some community theatre ideals and procedures into more professional ideas just based on what I'm learning in school? The fact that people jump on bandwagons without research scares the hell out of me Botony is teaching me about fermentation so maybe I need to start a brewery Botony is reminding me when I threw up in Biology from just doing jumping jacks So I was curious after I read something on Twitter about Facebook D#zN#t groups and I found this.\n\nThey freaking kindly roast people who are being dumb. This is actually amazing. https://t.co/bD18vcsTAL If you can't breathe in a mask then either\n1) you don't have a good mask\n2) you really shouldn't be outside like at all because you're in a high-risk category The people saying that masks shouldn't be mandatory because they cannot breathe and that we shouldn't mandate breath should really be fighting with BLM, right? Like that would make sense, right? Who makes those memes with some picture on the top and a tweet on the bottom because Twitter for me be a whole other direction. Watch me use Cooper Anderson's acting advice from Glee in the real world Watching Glee made me realize how blessed I was in high-school. I only had one pretty bad experience with homophobic people and now I only fight hard as hell against them. It sucked and I hated myself for a while. I love myself. But people go through a lot worse and it's not fair I'm proud to be part of gay Twitter and TikTok because dang if we aren't supportive and defensive of each other RT @itsmarkyoung: @kingdeficit The comments have me SCREAMING https://t.co/l54DS0BunA RT @chrispena_16: @kingdeficit buckle up because this video is even worse https://t.co/7Mc04K5oO5 Did I Google \"how do gay dads talk to their daughter about periods\" without having\nA) a husband\nB) a child\nC) the above occuring within the near future\n\nYes\n\nI also googled how other gay dads celebrate mother's day Guys TikTok is for the gays because his comments are gold Yo this is the type of guy you're gay best friend tells you to break up with https://t.co/NQAwXrRLbu RT @angelicabastien: How is everyone dealing with the crushing loneliness of being alive? Real question. thinking about how all humans were once in their mothers and either pushed out the vagina or cut out But then some people be kinda woke af and I really want to read all they say People you don't expect be wildin' with their opinions on Facebook Raise your hand if this pandemic has brought out the crazy in your otherwise mostly sane family 🖐️ So all these girls I knew from high school are getting married and I'm prepared to be the token gay at their weddings. Hey @Jadekatrina8, Thank you for the follow! My friend @annarpeacock got proposed to onstage and I've never had more serotonin in the past 4 months. Hey all. After my crazy rants last night I've decided to use scheduled tweets so I'm not tweet bombing y'all. I've set a reminder when they all go off that I will update if I have more thoughts that can wait a while. You're all great (well, most of you who interact with me). :) I miss getting tagged in Facebook challenges Sometimes the internet makes me feel like the only good person who thinks what they say through because everybody be out here kinda being dicks to each other over the stupidest sh!t RT @Fby541: https://t.co/CzKenL5cVT Oh she’s just a Karen. Ok we’re all good. I can dismiss this in my compartmentalized mind. Ah her recent posts are so icky! I’m so disheartened. What should I do? Also this lady who’s my neighbor just shared a thing saying that positive test results might be from having some similar antibodies to COVID and I want to say, “so.” Because I don’t see how that proves any point. I’m ready to bring back “ok boomer” as a valid response when I don’t have enough energy to call out people with wack-ass conspiracy theories and hateful stuff. Is Glee making me realize I’m lonely? Yes.\n\nWill I stop watching? No. RT @IMLIBERTEA_: Confused on why I don’t have a hot fireman boyfriend 🤷🏾‍♀️ I love my friends so much! The fact that heterosexual men sexual lesbians makes me really mad Btw, I’m on cold medicine right now I was thinking about what if I went to an all-boys school how that would’ve probably been... something\n\nbut then like what if they were like you’re gay you can go to an all girls school\n\nthat’d be weird and like how many girls would have their hearts broken that the I’m the 1 guy I got on Twitter for like 10 minutes today to check notifications and I'm already mad. Are you happy Twitter?! I’ve been thinking about the power of theatre as an art form as a way that creatives cope with tragedies or historical events that are quite intense and I think it’s so cool. Every Wikipedia article I’ve read about some big tragedy has theatre under its popular culture category. @Christi58186388 Omg Christina, not you, you're fabulous! Just literally, everyone, we graduated with who is ALREADY GETTING MARRIED! Do other gays think about how much the opposite sex might be attracted to them? What if I start a series of lessons about how to respond to posts and tweets in a way that isn't absolutely pointless.\n\nLike lesson 1: you don't have to comment on a post saying \"why did I see this\" unless your friend posted a nude picture on Facebook or the like Is it bad that I fantasize about some homophobe or some bully in the future when I'm an educator who I get to tell to knock it off?\n\nOr have I just been watching too much Glee? I can't wait to find love and prove to everyone I graduated with who is getting married that I could be happier and more fabulous than them. I'm gonna start to tweet ambiguously in the first tweet of threads so someone will make an article with it and use my first tweet as the Snapchat and thumbnail What if we in the world did the \"ouch\" \"oops\" thing that all those theatres in Chicago did? Will Schuester is a whore We love when you get a group email from work saying you need to improve, and then a follow-up email from your manager saying, \"except you, you're doing great\"\n\nThis is feeding my already very big ego. Be proud of me: I reported some dumbass's https://t.co/KyktLMdERX petition that was full of misinformation, with a supporting article! Why I felt it was fecked up that some guy put funny a serious scene from a cop drama about school shootings; those kids in the comments scared me https://t.co/radVObBoVj Hi everyone, this is a social media rule I've set for myself:\n\nI only engage in negative posts that are blatantly racist, homophobic, or targeting others/bullying or have messages that can influence others in an extremely negative way (making fun of school shootings/petitions) Why did America decide masks needed to be a political issue and to conspiracy theorize about it when it's harmful to not wear one? Update: I just told the person I snoozed that their petition to make masks NOT mandatory for schools was anti-vax level dangerous and unfounded so...\n\nhere's to possibly losing some dumbass on Facebook as a friend The Snooze for 30 days option on Facebook is my version of giving people on Facebook a time out for the stupid s#!t they say. can someone tell me it's ok that i email my professors who are trying to figure out this online stuff with feedback when things go a bit wrong very, every is also hilarious if being a decent non-hating person was difficult, then why would so many people do it? sometimes i think i might be straight/bisexual and then i see a gorgeous man and my brain reminds me saying \"hey adam, remember you're every gay\" i tried that name + color aesthetic facebook thing and all i found was vibrators I might just be an English minor but the etymology of words makes so much fecking sense RT @iashmcknight: I'm pissed at all of you selfish pricks who made it so now my education and career are at risk. Don't be selfish and just… RT @IMLIBERTEA_: The theatre department isn’t doing any shows for the fall semester. This hurts a lot. I had an idea last night while not being able to sleep:\n\nSo I don't know if you've ever seen those animated educational videos on YouTube, but what if you made one explaining Black Lives Matter to kids\n\nI'll leave this for the people who can do this and have the right voice So there's a show you can watch on BroadwayHD call Puffs, you can buy the script! AND I WANT TO PERFORM THIS AS SOON AS FECKING POSSIBLE! botony is mostly reminding me that we're all allergic to plant semen here's some wholesomeness:\n\nbe like a Bristlecone pine\n\nthey can live to 4,600 years, but only in the harshest of climates tonight is a listen to breakaway and cry kinda night having two older sisters and mostly female friends showed me how easy being a man is and how the patriarchy needs to be dismantled thinking about my theatrical past and all the cringy stuff I did is anyone who makes those how to approach women videos actually in a healthy stable relationship?\n\nasking for a straight person here's your wholesomeness for the day:\n\nmy dad just taught me how to unclog a drain today today i discovered i've been spelling batten wrong my entire life Confession time:\n\nI can't do downward facing dog in a relaxed way without feeling kinda sweaty Hey @miles_peach, Thank you for the follow! watch me single ladies myself into the ideal male body i've given up hope in humanity based on the fact that @paulandersen, a guy who made science cool, has mean comments on his tweets Some of us be allergic to plant semen me trying to get invited to my straight female friend's girl group https://t.co/vre0CYe0kz The Hate U Give is on HBOMax. I finished The Hate U Give. I cried so hard. Watch it! If you want to know even an ounce of how the black community is hurting (to my friends who don't get it) just watch it.\nAlso, I signed up for the Utah chapter of Black Lives Matter. I'm mad I missed the protests, but I'm here I would like to reiterate that this isn't about me. These are my thoughts. It is my experience that gives me empathy for SOME of the bad things that black people can and have experienced. I'm fine. I'm privileged. Time to use it for good. https://t.co/Y0nVPCmlb8 I posted these to my Snapchat. Please read the reply to this with the last two before making any comments. https://t.co/aUfbqjSyZH Andy Beshear: Justice for Breonna Taylor - Sign the Petition! https://t.co/zdrAQM1rBG via @Change RT @DlORLOU: reasons not to go; a thread for you. thinking about how many people on Facebook probably unfollowed me because they’re too afraid to unfriend me Me to all the toxic people in high-school https://t.co/NIC5gdTPIS thinking about starlight express Do you think straight men will ever understand the relationship between gay men and straight women? What are the realistic expectations of owning Clifford the Big Red Dog? i'm 99% sure that the cause of my sexual confusion growing up was Glee The fact that literally children are allowed on social media scares the feck out of me All these people be out here proudly shouting how they aren't wearing masks and are taking the chance like real proud in all these Facebook posts and I be out here just wanting school to start in the fall The most surprising people have been sending me messages about good things with pride this month...\n\nso this is good :) Hey @ML__Jack, Thank you for the follow! Hey @Christi58186388, Thank you for the follow! thinking about the irony of being cast as Sir Galahad in a script reading of Monty Python as a gay man RT @seywarddarby: This is my friend Ethan. He lost sight in one eye when a police officer shot a tear gas canister directly into his face w… thinking about the YouTube videos about people from two different worlds coming together on something Hey Twitter fam,\nTime to do an honest check in. How are you? Especially my LGBTQ+ friends. Can I do anything to help? If you need an ear DM me here or wherever you have contact with me (I check Twitter not too often). At least reflect on how you feel and take care of yourself.\n❤️ Hey @maddie_rae_01, Thank you for the follow! and that not everyone will like me and that history is kinda fecked up I'm coming to the healthy realization that I can't please everyone Happy Juneteenth! thinking about how the high school in love, Simon was performing Cabaret Hey @Aria89425011, Thank you for the follow! Yo, it’s been over a year since I’ve come out and holy s#!t that was the hardest thing I think I’ve ever done So Love, Victor exists and I’m dying How do people* i might just be a good person but I don't get how people ever thought that another human was lesser old women being kinda horny for old attractive male actors is the aesthetic I need justice for craig bowker jr. The fact that Idina Menzel doesn’t sing in Enchanted is a crime in of itself the first crime I'm commiting in the purge is tax fraud Hey @gracieg28715730, Thank you for the follow! So I don't normally read books because I'm not a bookworm, but my new job gives me time to and I just finished The Wednesday Wars by Gary D. Schmidt and it is SO GOOD! thinking about how I'm older than the actor who played Myron in Glee Depressed Adam really does respect the daily nook mile streak If Wicked exists in the Glee universe, why do both Kristin Chenoweth and Idina Mendel not appear as themselves?? Albus Severus Potter and Scorpius Malfoy are gay... no debate (maybe Scorpius is bi) So this has been my random favorite video for a while, but I feel like we all need this (some more than others): https://t.co/WbkwhguzjK Also there's a search engine extension called \"Search for a Cause\" that tallies hearts together with \"Tab for a Cause\" and it gets you hearts way faster This is a service I've been using for a bit. It's a Chrome extension that puts some ads in your corner and gives you \"hearts\" that you can use to show the company where you want the money they get from ads to go. Right now they are doing the NAACP\n\nhttps://t.co/ELtAYSzNXU thinking about when Julie Andrews says \"shut up\" in The Princess Diaries 2: A Royal Engagement RT @Nickelodeon: we are all part of the change #blacklivesmatter\n✊🏿✊🏾✊🏽✊🏼✊🏻 https://t.co/Y3Fzvob54X have you ever thought about how much money you've wasted? it's bad that i could see myself owning every LEGO game made for the Xbox 360 within the next few months idk how much longer i can keep from spending $40 on 5 lego games for the Xbox 360 #HappyPrideMonth a year ago this month I came out. So much has changed.\n\nP.s. #BlackLivesMatter Hey you, yeah you, scrolling rn. Take a moment and either take a break or take a breath. You got this. Slow down. Take care of yourself. And maybe call your parents. They miss you and they're worried. RT @topher_skies: It’s been a while since I’ve taken time to appreciate my life and privilege. I don’t know a thing about how to help the m… I'm into the idea of using theatre to help like they did with the Laramie Project, so I'm interested in seeing/participating in something like that for what's going on now. I’m too unintelligent for LEGO games when people text with extra consonants at the end what is that supposed to sound like? i'm curiousssssssssss catch me naming my first child after a Pokemon https://t.co/R6FTvhgxNx Hey @JaredDomino7, Thank you for the follow! let people learn from their past mistakes Appa bb https://t.co/a2IMmwg9xL RT @brynn__adams: I've been working on this for a couple months. #Pride is my favorite part of the year, and I'd much rather have a #Remote… RT @madddiexo: i love when guys on dating apps ask  “how is a gorgeous girl like you single” I’m mentally ill, brandon @acnhtortuga @TomNookNMT @TotalDramaTiler RT @acnhtortuga: ✨ Star Fragments Giveaway ✨\n\n✨ regular &amp; large star fragments (25 each)\n\n2 winners will be chosen in 16 hours! \nto enter:… one minute you're singing the entirety of \"American Pie\" next thing you know you're singing \"Sucker\" Chad Micheal Murray defined my early closeted sexuality the fact you can't delete Facebook signs constantly reminds me when I made a whole page for turbo the snail I'm conflicted on whether or not the girl who tipped me $15 for delivering Postmates meant to do it or is very nice I was today years old when I found that Reeve Carney was in Spider-Man: Turn off the Dark catch me in 2029 being depressed until the late 2030s @acnhtortuga Sure Yo, why is Sarah Brightman in Repo: The Genetic Opera? my claim to fame when I was younger was knowing the rap part of \"Hasta La Vista\" from Camp Rock This is my new favorite line in any show I've ever listened to:\n\"And if you're wondering why I'm a fan\nIt's 'cause there's a black woman inside the soul of every gay man\" RT @acnhtortuga: ✨ small catalog party ✨\n\n✨ simple panels\n✨ soft-serve lamps\n✨ floor lights\n\nI'm excited to finally host a catalog party! j… did getting a graduation announcement from an old castmate make me cry? yes. am i ok? probably not @marshalsmaid @rvayanna @TotalDramaTiler RT @marshalsmaid: i'm bored so this is a\n\n⚡️flash giveaway⚡️\n\n1200 nook miles tickets ❤️\n3 winners ❤️\n\nrt + follow + tag a friend!\nends in… how come no one ever told me about The Laramie Project?!?!?! @lilymakesmyday @rvayanna Shell bb RT @lilymakesmyday: 🌸 ACNH POCHETTE GIVEAWAY 💞\n\n2 lucky winners will receive every single pochette in this picture &amp; 20 NMT \n\nTO ENTER\n- fo… how do people get all those filters that tell them what they are? asking for a friend how old were u when u did it for the first time:\n\n- 17\n- complicated\n- 4\n- 12\n- 16\n- x\n- 11\n- x \n- 12\n- 13 \n- 16\n\nreply with emoji and i’ll send u questions How did no one tell me?!?! https://t.co/3CRSTZNppC I'm crying https://t.co/CpMi08sI69 Me https://t.co/8YnEQdidXt @astro_chica 😎 I would like having this knowledge https://t.co/cO2NlJ78f4 except no men will do it with me 😩 https://t.co/5xrJAC7m0d Honestly no idea. https://t.co/PGk2ZqdaiL Daytime-Adam is upset with midnight-Adam who decided that his super funny tweet idea would be better if tweeted in the morning, and now he can’t remember it. how does one casually ask their professor for their switch friend code? Did anyone else play a game called Pocket Frogs on the the first iPhone? yo, why tf were poe and finn not gay? Is performing the Laramie Project a good idea for high-school? Asking for a friend have you ever felt guilty that people likely changed things to be more sensitive to you the irony of when i texted cute boys during church classes when i was younger @Amyjayyyyyyyyyy I get it, 100% Hey @that_bitch_1st, Thank you for the follow! Hey @SterlingShane13, Thank you for the follow! Hey @not__hunter, Thank you for the follow! are straight people ok? https://t.co/ouIeegZoA5 https://t.co/WLQWMwqthI thinking about the time i came across an article from Idaho about a kid who got bullied for some small thing and everyone thought he was gay when he was definitely not thinking about the time i unadded some transphobic kid from my snapchat @Mattie_252 @TotalDramaTiler @acnhtortuga @TomNookNMT Brooklyn 99 (there are 7 seasons so you have tons) and Zoey's Extraordinary Playlist (there is about 12 episodes this first season). RT @acnhtortuga: ✨ 100 NMTs Giveaway ✨\n\n1 winner will be chosen in 7 hours! \nto enter:\n🌹 must be following\n🌹 like &amp; rt\n🌹 reply your fave sh… First to know what this is referencing gets a prize of personal satisfaction Everyone to me before I was out: \"We've heard say, you are gay, night and day.\"\n\nMe: \"You go 'way\" All these boys asking about dream first dates. I haven't gone on too many because none of y'all will go so how TF am I supposed to know. Hey @nick_p_warner14, Thank you for the follow! RT @JaiLenJosey_: Ain’t nobody want this. https://t.co/FWDY5glNZE tonight's a listen to the \"pretend I'm something other than these broken parts\" part of \"Words Fail\" and cry kinda nights @LilliCooper @CBS @TheTonyAwards PLEASE! RT @LilliCooper: Hey @CBS Instead of a singalong, I’d LOVE to see a lineup of prior @TheTonyAwards performances. Anyone else? y'all, Disney didn't listen to 1920s musical theatre telling you to not get married after meeting a man for the first time and it shows and also that we're in QUARANTINE!? Do I really have to be your dad and tell you to meet people you met on dating apps in public places ON THE DATING APP IN QUESTION?! https://t.co/wJDB9U9Zdg\n\n@somegoodnews \n\nThis is a video that high school choir teachers in Utah made for their students! 😭😭 Today we reflect on the fact that I dated a second girl after I thought I was gay because I thought she was the one woman to make me straight. And we condemn the fact that she and I sent the most lubby-dubby gifs to each other. Thank you for coming to my confession Does any other out gay person love the feeling of having someone who doesn't know you're gay find out? @ColleenB123 hi @McNastyFlavor Hey if y'all haven't seen the Netflix movie The Half of It, then wtf are you doing rn?!?!?! do isabelle and tom nook ever sleep? the way isabelle tries to impersonate blathers when you expand your museum is iconic Taking Spanish for 10 years might’ve been the best long-play into finding love Any anonymous gay men within a reasonable age and distance want to be secret penpals like in Love, Simon? or make it lesbians to all the boys I’ve ever loved, but it’s a semi-closeted gay boy in high-school who does the same thing Laura did and they get sent out and he gets outed and finds out that one is actually gay and they fall in love\n\ni’m trademarking this idea btw Hey @FanCriticalPod, Thank you for the follow! how do people not know how to play uno today is a listen to the Glee version of \"cough syrup\" and cry in you bed kind a day Happy mother's day to this amazing woman!!! And also I guess some Disneyland pictures 😂😂. #mothersday @ Disney California Adventure Park https://t.co/gIvGUzAahT klaine messed with my hopes of finding a soulmate at a young age the glow up that Blaine and Kurt had proved that queer people glow up after high school more than anyone else glee single-handedly made me think that i was the center of attention at all times is any other gay person jealous of the friendship that blaine and sam had in glee? Hey @19thnote, Thank you for the follow! the feelings I'm feeling from accidentally swiping left on tinder are making me consider buying tinder premium or whatever tf it is today's the day i realize that if i was filthy rich i would venmo my friends when they're sad to go buy some of that good stuff sometimes I turn from flirt to therapist in dating apps Hey @kenzma_12, Thank you for the follow! thinking about calling my high-school teachers by their first names how did none of y'all know that C3-PO was gay thinking about Anakin killing an entire group because of his mother #MayThe4thBeWithYou Do you ever just think about Order 66? RT @onewiththehair: @adamdoestw just told me I am a comedic genius and honestly I have never felt SO validated 😭😤 https://t.co/Tv467y6aj3 Hey @TotalDramaTiler, Thank you for the follow! How come everyone pronounces \"absurd\" like an English person. Hey @rvayanna, Thank you for the follow! @roey_howell YESSSSSSSSS!!!!!!!!!! I just signed the petition urging Congress: Secure Our Safety. Add your name now:  https://t.co/uInZ1wrh8P COD Modern Warfare Stream! https://t.co/un5Hg8cDUO\n\nThis is one of my friends from high-school. I'm chilling on his stream. He's genuinely pretty entertaining to watch or just vibe with. All these straight f-boys I graduated with be SUPER HORNY with each other. How can a literally child have a successful squishy company? today's the day I need my entire family to get on TikTok so we can become a famous TikTok family https://t.co/DZZ4KaBRgL\n\nI just got really sad over this video and about Broadway rn. @WaitWings I'm upgrading myself from gay best friend to gay husband with all this loyalty and support I've been giving I just got sad because some of my high school friends aren't friends with me anymore on social media and I want to talk to them. I'm trying to convince this boy I've been talking to on @hinge to get Animal Crossing so we can go on a date in the game because I'm lonely...\n\nand I'm now prepared to spend hours of my life to impress him with my island so I need tips. :) Hey @DevonOltmanns, Thank you for the follow! Quarantine got me almost adding women to the dating pool on my dating apps My goal was to become a viral hit on Twitter or TikTok and so far I’ve experienced the emptiness of no replies All these dating app boys constantly telling me how handsome I am is kinda freaking me out Hey @marleydangerk, Thank you for the follow! Hey @KirtlanM, Thank you for the follow! Hey theatre community\nThis is your moment. I'm listening to new musicals while doing homework. I'm running out on the list I made. I, of course, can't list what I've already listened to but think of more obscure musicals, but even some popular ones I might've skipped over.\nThanks I'm too good at essay titles https://t.co/Wlzv02eltg I've never related more to the \"in the workplace, being gay just has its perks\" meme more in my life. Sometimes I have to remember the words of my favorite stage manager:\n\"I just pretend like every decision I made was the right decision or I'm going to overthink it all\" You Can't Stop the Beat (Music Video)| #IsolatedNotAlone https://t.co/A3HwfZohE1 via @YouTube\n\nIf you were wondering I posted that video on here now you know. @waitwings What's the irony of citing a website that publishes papers written by professionals meant to be plagiarized? \"Why Simon's Friends in Love Simon Were Terrible Friends - A Retrospective\" So this might be old news but if you haven't ever watched @somegoodnews by @johnkrasinski then you freakin' better! Here's said vibrator joke.\n\nCheck out what happened in #Quiplash2 #JBPP3 https://t.co/FYO5ezGg0S https://t.co/gEtJk58iso The two youngest people in the group voted for my indirect vibrator joke... I'm the comedic genius behind the second one.\n\nCheck out what happened in #Quiplash2 #JBPP3 https://t.co/FYO5ezGg0S https://t.co/7zHf0iC6pI I hate to say it...\n\nBut I think I'm the funniest member of my family. I think I just slipped an innuendo underneath my family...\n\nI think my uncle might have gotten it. My censorship skills are on point while playing JackBox with my family I want to be the textbook author who thought of saying that Titanic the Musical \"sailed off with five Tonys.\" Whoever tried to hack my Spotify...\n\nHave any music recommendations? Yo, can we all learn how grammar works during this quarantine? Thank you. What if I find a boyfriend using Animal Crossing? I'm too invested into Animal Crossing so I'm having anxiety over not getting the Cherry-Blossom recipes I definitely got too upset figuring out that planting Bell Trees in Animal Crossing: New Horizons is gambling and not investing A girl online from the southern hemisphere in Animal Crossing might be flirting with me and I'm too gay to know if she is and I'm scared. I have too many opinions for the internet to handle It's so weird to watch this Broadway documentary because it's so concerned about the theatre being popular and about @WICKED_Musical and stuff and now it's 2020 and we love theatre!\n\nI'm just saying I liked theatre before y'all thought it was cool. I'm watching a Broadway documentary and I started crying so that's my mental state. RT @DnDeej: Before you tweet, reply, or engage, consider the Craig Ferguson method and ask yourself these three things:\n\n- \"Does this need… Some people my age don't know how to use Zoom and I'm shook. So I'm posting this because I just got recommended a video on YouTube that makes me quite upset but people should know\nSchool shooter jokes, memes, videos where you're hiding and then there are gunshots and cries and pleads for life AREN'T FUNNY and are gross and disgusting. Stop RT @claudmp3: happy trans visibility day you’re valid af and don’t let anyone tell you otherwise!!!!!! @ma3chapman Dad and old man Am I the only one who takes off one ear-bud/half of the headphone when I'm trying to focus and listen to something at the same time. I forced my friend to not let me have the code to some clothes she designed for me in Animal Crossing until I finish my homework. Hey update time: I'm feeling so much better. Sometimes anxieties about the world tend to excite all the other possibilities, plus I've been alone with my thoughts for too long. So that technically means I need to play more Animal Crossing or else I'll explode. @CoryThomps The small things. Hey @aldafffodil, Thank you for the follow! Quarantine Adam is not ok In the midst of the anxieties of the end of the world, I have to deal with the anxiety of wondering if I'm doing what I really want to do with my life and if I'm choosing the right major. I'm having a fun time in quarantine. 😟🙄😣 So like I don't like to get political but even if you think it's not the truth or whatever you believe, understand that Coronavirus is affecting people. People can have mild causes, sure. But just like other illnesses we shouldn't try and spread it. There is no conspiracy so stop RT @Wordsmith161: So apparently one of my favorite YouTubers, @WaitWings , is making a video about Beetlejuice the Musical (the Musical the… @ABrightMonster #FindAlexBrightman2020 https://t.co/o5AUwGY4i4 Hey @ABrightMonster make a NEW BEST FRIEND in @WaitWings and let us hear your Beetlejuice Story! #FindAlexBrightman2020 My new goal in life is to be a part of a group of mom friends that sit around and drink wine and wear gorgeous sun hats and dresses sitting in lawn furniture in one of our rich husband's backyards. RT @colindross: Im really about to comment on EVERY SINGLE PERSONS SNAP STORY idc anymore I've shared too many of those Facebook sharing things for the entire time we'll be in this pandemic. The sheer anxiety that @onewiththehair had for me while I was having allergies randomly hit me like a truck is the type of anxious energy I need from all of my friends.\n\nSo step up! https://t.co/gOpyryydCA\n\nUm don't watch this unless you're @WaitWings \nThanks Why am I  jealous of those people that get mentioned in their friends' stories? Do I need to pick better friends? Utah Governor: Utah Gov to Issue a Statewide \"Shelter in Place\" Order - Sign the Petition! https://t.co/CKQxmgfX37 via @Change Stay safe and wash yo hands! I'm coining the term SFF for straight female friend. Does anyone know a job that needs someone who knows every American folk song? Does anyone know if I'm qualified for unemployment if I still live with my parents? I ordered Animal Crossing on Amazon cuz I thought it'd be here today... Today can officially stop existing. Today's list of offenses from the world to me:\nWoke up to an effing earthquake!\nCOVID-19 already got me having to stay inside\nAnxiety\nMy body effing hates me rn\n\nGuys my head hurt real bad and now my jaw hurts (I think I got some sinus problems) and now my stomach hurts Who wants to make \"It's The End Of The World As We Know It (And I Feel Fine)\" a chart-topper with me? So I think I made everything get worse with Coronavirus because my birthday wish was more sleep and now I get that because everything is canceled... BTW today was my birthday! I'm back rn to share this really nerdy thing I just found out.\nThe 2009 revival cast recording of West Side Story's recording of \"America\" sounds like the beginning of \"In the Heights\" from In the Heights. Well, the beginning pattern of the percussion. Hey @AliciaThurman10, Thank you for the follow! Get Amar Ramasar Off The Broadway Stage - Sign the Petition! https://t.co/WxauaQc33s via @Change The Importance of Being Earnest - Garden #TheSims4 https://t.co/lmbwIeKSdg The Importance of Being Earnest - Garden #TheSims4 https://t.co/JUKeKPOsFL Do you remember when you joined Twitter? I do! #MyTwitterAnniversary https://t.co/uD9FoLMnJW The Importance of Being Earnest - Country Home - Top-Down #TheSims4 https://t.co/MHjFOLgnD1 The Importance of Being Earnest - Country Home #TheSims4 https://t.co/sJhQMBjXXR The Importance of Being Earnest - Algernon's Set - Top-Down #TheSims4 https://t.co/Bo9PQj4qst The Importance of Being Earnest - Algernon's Set #TheSims4 (I'm only posting on this rn so I can get the image) https://t.co/Mv54lxmOzf I'm only getting on Twitter rn after not being on to tell my Script Analysis friends to DO YOUR DESIGN ANALYSIS ASSIGNMENTS LIKE RN!\n\nbye, luv you\nthanks for being awesome twitter\n(also my thank you for the follows and liking youtube videos are automatic) 🤘🖐️ Hey @hyperhoff, Thank you for the follow! Hey @GladdenGracie, Thank you for the follow! Liked on YouTube: *Giveaway!* Special Edition Nintendo Switch For Animal Crossing: New Horizons https://t.co/ZYTTOQuUFo Hey @sandeylock, Thank you for the follow! Hey @MeganAckerman9, Thank you for the follow! Hey @daily_theater, Thank you for the follow! If you've noticed all my tweets are gone, don't worry, it's for my own good. I'm starting over, but first I'm taking a break for my mental health. Thanks for actually reading my dumb too-frequent tweets. (If you want any of my pictures I tweeted DM me and when I get on I'll reply"}