{"tweets": "Zodiac signs are so antiquated, what Monster's University fraternity/sorority are you? #PalacePix https://t.co/fq1aF0KhqD If you're my friend and I talk about you in therapy and share that I did, it's because you're special and I love you Did anyone else ever get the dating talk that the \"man\" is supposed to walk on the side of the sidewalk closest to the street in case something happens or was that just a fever dream? @morganmatilda98 Sending love ❤️❤️❤️ 🎤I wanna rock🎤\n\nCan you guess who I was this morning?!\n\nHere's a hint: 🎤 We're not gonna take it🎤\n\nI finally got to be the man behind the song I sang way too much when the people tried to be cramping my style https://t.co/JozMe7al08 Do you think two men like Lewis and Clark who spent so much time together exploring didn’t get lonely and kiss, just a little? Damn, I wanna be on Drunk History I have a straight uncle who comes over with his roommate I’m not heterophobic, I have straight friends My daily timer extension on Chrome disabled so you all had to deal with me sitting here contemplating whether to tweet things for like 5 minutes each wondering why the timer isn't hurrying my ass instead of doing homework RT @goblynnmarket: https://t.co/EAL3LoFL35 I don't think this is said enough but\n\nFUCK THE PR%UD B%YS The sun's always had corona people I think @JakeStateFarm is my type I didn’t expect to get on Twitter and cry tears of empathetic sadness today, but here we are @krisis86 Hey neither do I! Let’s be sick friends! Listening to \"Everyone's a Little Bit Racist\" from Avenue Q in 2021 hits different Why does YouTube think I'm remotely interested in listening to EXTREMELY right-leaning politics The internet knows how to fuck up your day doesn't it RT @levarburton: Happy Birthday, Fred! He would have been 93years old today... #bydhttmwfi https://t.co/odBR6bKHUX The one superhero universe I want explored more is The Incredibles and you can fight me on that I might be very gay but a good hetero meetcute still is enjoyable Why does anyone like Reagan and wear his campaign shirts? I'm still mad that I was in NYC and was so close to Stonewall during pride month on the 50th anniversary of the riots and I didn't go\n\nAll I got were the playbills with brick-rainbows and many pictures of pride flags everywhere\n\nI think I was also late or early to world pride I would just like to say that I still think it’s a trip that collectively the entire theatre world was shaken by a musical based on a Nickelodeon cartoon that had no right to be as amazing as it was I watched one video about the Equality house next to a specific Church and next thing you know I'm looking on Spotify to see if they have any of their dumb parodies only to find that people have created playlists named this church but with pride anthems and I'm living for it Not me accidentally just unmuting myself instead of turning off my camera to then blow my nose The scene from Victorious right before Jade and Tori sing \"Take a Hint\" is probably what lesbians go through when some men are trying to hit on them\n\nAlso one of the creepy guys' name is Chad We all know the people who cut themselves off in Zoom by only unmuting for the words they say and then immediately muting themselves right at the end Not me spending my time I should be doing homework printing off NASA coloring pages and coloring them Hey Google, how do I join the #TwitterBookClub? Not my astronomy class getting existential Reading scholarly fights is my new favorite thing, especially when people attempt to do them in a public forum and then some bozo comes along with something dumb, which makes it even better. The best thing about being 20 is forgetting to get K.K. Birthday on your birthday in Animal Crossing The dark recesses of my mind scare me with what random thing they can make me go find on the internet from whatever fucked up thing I watched as a kid and forgot and now research instead of being normal RT @OriginalFunko: RT &amp; follow @OriginalFunko for the chance TO WIN this @HotTopic exclusive Scarlet Witch Pop! #WandaVision #ScarletWitch… Hey, guess who already knew that this was a thing because that day has significance to them very personally.... ;) https://t.co/qzaB9Kv5D4 Happy Mar10 day! @OriginalFunko What's the best selling figure? My catharsis for the day was flipping off a house with a T***p flag @MessyPod Victorious bb RT @MoveOn: Democrats in Congress just passed one of the most significant economic packages in American history.\n\nThese are just a few of t… At the Pretzelmaker where I am at rn grabbing Postmates a group of girls ran in screamed \"red alert\" to their friend and they all left in a hurry @govkristinoem stop discriminating against LGBTQ South Dakotans and VETO HB 1217 and SB124. Why are like 15 individual states trying to shove trans kids back into the closets all at once I stopped myself from sinking further into this toxic wasteland but thankfully most comments were positive I'm probably preaching to the choir with my followers, but for the love of God, do NOT fucking call a black person a monkey!!!! Are you fucking kidding me!\n\n(I reported that comment which was on a post about Michelle Obama) There's so much shit out there that is just cesspools of toxicity and hatred and they are the reasons that I need to be a teacher... To protect all my vulnerable future students The dates in astronomy are crazy! Like NASA sends something up in 2017 to get something done and return and it takes until 2020 just to get there and then 2023 to get back! Did anybody else wanna make out with someone underwater after watching Leonardo di Caprio's Romeo and Juliet? So I might be depressed because some wonderful people made Disney World in Minecraft and I don't want to do anything else RT @OriginalFunko: RT &amp; follow @OriginalFunko for the chance to WIN this Spring Convention exclusive Yoda Pop! #FunkoVirtualCon #FunkoECCC… I need everyone to see what comments I got when I shared the Y being lit up\n\n(top comment is a good friend, the bottom comment is an old director who is a fabulous older gay gentleman - for context) https://t.co/PWMizvwKRR We love that DC comics has a gay character no one has heard about since 2000 named Rick Stone TIL: there are transphobic and homophobic gay and trans people I just sent an urgent message telling UT Gov. @SpencerJCox to VETO Stand Your Ground and guns on campus bills: Send your message now &gt;&gt; https://t.co/t8EKCBhOTj #UTPol @MomsDemand @RMP_Utah wants to make rooftop #solar more expensive, again. Only the #Utah PSC can stop the monopoly utility from taking our power! I’m adding to the list the older white gentleman who show support for the LGBTQ+ community on Twitter Utahns will obsess about a show about a fabulous Old Testament guy wearing a technicolor dream coat but get mad when some people hold up LEDs around a letter on a mountain Gay BYU students are actually the reason I haven’t offed myself yet I have the strange need to keep reading the toxic comments from this news source, but QUEER PEOPLE HAVE QUEER PEOPLE'S BACKS BB! I love you all! RT @OriginalFunko: Hope you are enjoying #FunkoVirtualCon! RT &amp; follow @OriginalFunko for the chance to WIN this Spring Convention exclusiv… Did I have to subtly figure out if my friend had a baby or was just posting about a niece or nephew... yes The way you somehow connect with people in a class to feel comfortable with them over time is kinda powerful So every day in my English classes is the confirmation that gays are successful and will always be successful in literature 2) This story was about a South Korean Military trans-woman being found dead in her home. The top comments were people sharing love and if people commented under those comments bad things, people came right back and fought their negativity. This made me happy. RIP to her though 1) Here is why the LGBTQ+ community is tight-knit and won't take your bullshit. I saw a story on a news site that has a comments section that I always doom-read because people spend their time commenting on news sources they disagree with terrible things. The Senate must act urgently: Pass Biden's COVID relief bill w/o delay, obstruction, or watering down essential policies. Anything removed from the bill means more will suffer. #OurSurvivalAtStake A year into this pandemic, we still don't have the support needed. It's beyond relief; it's about survival. #OurSurvivalAtStake RT @OriginalFunko: Happy #FunkoVirtualCon! RT &amp; follow @OriginalFunko for the chance to WIN this Spring Convention exclusive Jackie Chun Po… RT @OriginalFunko: RT &amp; follow @OriginalFunko for the chance to WIN this #TargetCon exclusive Star Wars™ - Jumbo StormTrooper (Artist Serie… @savotteson As I Pisces, I will But like, what if we actually all believed in global warming and didn’t politicize it? RT @GeorgiaBridgers: i. love. my. grandma. https://t.co/ubladRHDCj RT @Daniela_A_Wolfe: Beware the lure of heterosexuality. https://t.co/UQGlsWJFA8 RT @Nintendo_NWR: We're giving away tickets to the biggest \"Dodgebrawl\" event around - this weekend's Closed PC Beta for the newly revealed… RT @annarpeacock: Nick Miller               Spencer Shay\n                      🤝          \n      Hot funny man who dropped\n            out… RT @sesamestreet: Groovin' right into the weekend with @Grover 💙 #FridayFeeling https://t.co/gXTxCh0EFP Who wants to go on a literary tour of famous American authors and visit their historical homes? @drjenniferkokai https://t.co/KSGc6MKLLC I dyed my hair for the first time in my life today! https://t.co/wV7uvWL33l RT @the_hipp0: Aight... Time to put the Biden/Harris on blast. Close them camps and abolish ICE #BidenTakeAction Thinking about how I used to watch Duck Dynasty and Last Man Standing RT @BetteMidler: He got away with murder.  Let that sink in. Why does theatre have to be so goddamn powerful?!?! The cultural phenomenon that we all are listening to Taylor Swift's new version of old music and feeling like children is pleasant. The little gay soul I had when I was young that I suffocated until it \"died\" until coming back like a sexy vampire at 17 is happy and fulfilled RT @OriginalFunko: RT &amp; follow @OriginalFunko for the chance to WIN this Funko exclusive Sheriff Deadpool Riding Horsey Pop! Rides! https:/… I googled myself and there is a far more interesting person with my name so hopefully that will give me job benefits RT @SuperMarioOOC85: https://t.co/4L7nnyNyBW @savotteson YES!!!!!!!!!! RT @_davidtitan: Angola just decriminalized homosexually and evening passed a law that discrimination based on sexual orientation can land… We can't heal as a country without accountability. Convicting Trump names his active role in the attack. We must not let this violent pattern continue. #ConvictTrump I never got a coming out party so I think I'm gonna hold one when this shit ends How do these kids know how to work Zoom so well?\n\nAlso they all like Fortnite or anime RT @mollypdf: when my nephew steals the phone during facetime #PepsiHalftime https://t.co/hOPd1hRLX4 Maybe I'm just gay, but why do a bunch of psychoanalytical theorists think that everyone wants to have sex with their mom? In my internship some of the kids were using chat to say things in French so I screenshotted them so I could translate and maybe it's just Google translate but so far it's about radioactive cookies RT @onewiththehair: His face is like is political views: moderate. @adamdoestw Hey @ellieryanh, Thank you for the follow! Turns out that parents in the school district I grew up with are mad at \"The Diary of Anne Frank\" and for one girl mentioning she has a crush on another girl in another story...\n\nWTF RT @latimes: For over 30 years, Hashem Ahmad Alshilleh helped to bury a generation of Muslims across SoCal.\n\nHe never charged for his servi… RT @whatitd0babey: I FORGOT TO EDIT MY NOTEBOOK TO SUBMIT TO CLASS AND SAID ONE OF DICKINSON’S POEMS HAD “big gay energy” my professor said… RT @nooksstyles: 🦆GIVEAWAY🦆 \n\nim giving away another custom ac embroidered sweater ! \n\nto enter : follow me, rt/like this tweet (no qrt), r… RT @theodd1sout: In hindsight 'Robin Hood' was not the best name to go with RT @SenSanders: The business model of Wall Street is fraud. RT @calvinjburke: Reddit trolling Wall Street has restored my faith in humanity RT @jon_actual: This is bullshit. The Redditors aren't cheating, they're joining a party Wall Street insiders have been enjoying for years.… Is there ever a sound in a song that you enjoy for some weird reason and you wish you could find it in other songs? Sometimes the internet surprises me with how nice it can be. Whenever I see a thing that talks about strong queer, black, and/or female voices I’m always checking the comments like the crazy person I am and surprisingly sometimes it’s not hate fueled Oh God, am I Chrissy Teigen? https://t.co/RGMh0SXhi8 RT @PinkNews: Joe Biden signs 'most substantive LGBT+ executive order in history' as America quickly moves away from Trump's dystopia https… Basically what I am learning in American Literature is that to be a successful poet you had to secretly be gay and sometimes let that out in your poems So my mom’s friend shared a news story saying that Joe Biden swore in on the communist manifesto and didn’t read it because it literally was from an Onion-like news source and I’m dead Help: how do you either convince or stop thinking about the people who still think Tr*mp didn't commit an insurrection? I felt really old when I helped with an audition for a community theatre youth camp and one of the girl's made a comment that her sister pranked her with the \"Who sings this song? (insert artist name) Good, keep it that way\" joke and she had never had that happen So sometimes when I'm on mute in classes I'll talk to myself and today some ok-looking guy made a joke that his wife didn't get an attractive husband and out loud (on mute) I said, \"I'm gay and I think you're alright\" and was mortified if I was on mute or not You can just tell that a lot of old classical literature was written by men I feel called out by Dracula in how I write long texts to my friends Who remembers when my entire personality was theatre? Imagine committing treason and walking home and having to deal with that (if you didn’t get caught) Whoever didn’t told me that DaVinci was flamboyantly gay can stop talking to me forever I wish I had the confidence I do now when my sister dared to me run into a room full of my extended family say \"Troll, Troll in the dungeon. I thought you ought to know\" and then pretend faint because I would do that now in a heartbeat I can't be the only queer person who sometimes gets morbidly curious and researches the ideals of anti-queer groups. Not out of self-hatred, because f#@k them, I love me, but because you want to feel some anxiety and also wanna see how f#@king dumb they are. If my Spotify friends see I'm listening to \"Grown-Up Christmas List\" know that I am not ok and I need this right now Sometimes when I'm feeling morbid and down because the world has hate groups against me and my friends, I just remember that there are a ton of people like me and our existence is resistance so then I realize that me not existing would be what they want, so I exist harder. RT @nooksstyles: 🍭 GIVEAWAYYY 🍭\n\nto celebrate my website relaunch im giving away a custom ac embroidered sweater ! \n\nto enter : follow me,… One of my theatre friends knew I was sad and tagged me in a cute animal photo. Weber State University students who have scholarships, remember to pay tuition today as the scholarships are now in! It took 6 days for 2021 to disappoint RT @HayleyTakeuchi: I said the f word a lot today and I have no regrets RT @UtterPWNedNoob: This is without a doubt the shittiest production of Les Mis I've ever seen. If I was over 21, didn't live in a pretty against drinking household, and could get access to weed I would've been very high or very drunk today I think people will understand why I stopped \"uncensoring\" myself tonight RT @nathanallebach: 🛑 STOP 🛑\n\nyou've reached the doomscrolling checkpoint. this is your reminder to take a break from doomscrolling The fact that it's being spun in the other direction baffles me. That's the most unbelievable lie to try and spin https://t.co/VbnSZRKJ5H RT @closetmormon: So..... my mom's saying there were antifa and BLM protestors disguised as Trump supporters and chanting and stirred up th… The actual irony of antifa being literally against this (it's in the name)\nThey aren't sounding so bad rn https://t.co/dIg8mDk0ab RT @JoeBiden: Today is a reminder, a painful one, that democracy is fragile. To preserve it requires people of good will, leaders with the… RT @ellle_em: What Trump has meant for the people currently storming the Capitol is and endorsement from the highest level of their worst i… RT @JelaniAlladin: COULD YOU IMAGINE THE BRUTALITY IF IT WERE BLACK PEOPLE  SCALING THE CAPITAL BUILDING?!?.....do y’all see this?! I wish (famous) people with tons of influence over young minds would do something good with that power So I guess this is my first tweet of 2021 \n\nI spent the last minutes of 2021 trying to put in contacts while listening to \"The Final Countdown\" So a Republican representative from Louisiana died from coronavirus and the comments on that post on a pretty left leaning news source were mostly nice but some made me kinda upset at humanity so that's fun Remember when every person and their mother (or other parental figure 😉) lost their minds to the “shipping your pants” commercial The people who bullied Karofsky in Glee even after he tried to kill himself and weren’t deeply ashamed or regretful deserve the real hell I can also not stress enough that many are now on LDS missions (which they went on shortly after this experience our senior year) thinking about the times in high school when these white boys would do the Hitler salute and start saying some Nazi shit in German RT @Slimecicle: Slimecicle Plushies are dropping December 22nd!\n\nRetweet and follow @youtooz and I will choose 2 lucky winners to receive T… Thinking about when in elementary school this kid took my pen that my dad got me from his company and pretended his dad gave it to him when his father worked at a high school If you know you know. https://t.co/Q9YghGTTy3 Charlie Brown directing is the energy I'm bringing into the first school year I am a teacher. Plus when I was little all throughout the year (and mostly when it was late at night during winter) I would watch our VCR recording of A Charlie Brown Christmas and honestly that's probably why I didn't feel super depressed during SAD time until recently. So for my friends who have Season Affective Disorder (which the acronym is SAD so I'm calling it The Big SAD), A Charlie Brown Christmas is on Apple TV for free rn and it's bringing me joy. And we can all relate to sad Charlie Brown. RT @MacDoesIt: Let’s just forget all pronouns and call each other Kronk Can someone homophobic tell me why you give a f#@k? Someone commented under a news community post on a YouTube news channel \"Trump hurted AmErIcA\" and I can't stop thinking about it Hey @the_noracle, Thank you for the follow! Thinking about the time that I got a copyright claim on an audition video when my voice teacher was playing the piano RT @AustinOnTwitter: I'm so gay lol @Geodude25trade @NVIDIAGeForce Yo! This was a great surprise!! Those were great times! #wewerehere “Purging Our Sins with a Neti Pot” RT @ElateLemming: #unusannusweknowwhatitis we know Wow, I joined a cult. #UnusAnnus #UnusAnnusisoverparty Hey @alidryg1, Thank you for the follow! RT @MacDoesIt: I’m gay Did you also know that you can register to be a poll worker and get paid?\n\n(Side note - if you're in Davis County, it's full - hopefully with the good people - so just register to vote and vote as well instead) If your voting for the next Minecraft mob and aren’t registered to vote in America (if you can) then you should The world needs more lesbians White people be like “enough is enough” when we are asked to recognize privilege seriously for a few months \n\nBut BIPOC have been saying “enough is enough” for literally hundreds of years So an 11 year old asked me if I knew the WAP dance.... RT @adidasUS: Real change requires action. We have work to do, but we remain committed. Here are the actions adidas is taking: https://t.co… Insecurity is feeling like every time a higher-up talks to you at work that you're getting fired... RT @2K19Grads: Hardest pill I’ve ever had to swallow was accepting the fact that, I CAN’T do everything, I CAN’T make everyone happy, and I… So umm I Stan this girl who I haven’t talked to in person since I was like 12 and in the closet https://t.co/NH0VTdI3XV RT @PeytDavis: Due to unforeseen circumstances (he got a new boyfriend) I’m in need of someone to complete my couples costume this Hallowee… “Wake me up, when all this shit ends” I just noticed that my customer service voice is my normal gay voice but to an extreme. RT @ecareyo: When the high school play starts with the cast coming down the aisles in character https://t.co/zJt5qE4lKD To the white man who threatened protestors with a gun, sprayed them and tazed them in West Valley tonight\n\nYou deserve more of a punishment then you are likely to get and you should see that that's your white privilege and stop doing what you're doing and reconsider being violent Black Lives Matter is NOT a domestic terrorist group. Here’s you reminder to vote and to register to do so. ABCDEFGHIJKLMNOPQRSTUVWXYZ https://t.co/p5HqwETEKF If you send death threats to people... you're not cool and are a criminal\n\nbye. This is how I’m sharing my picture for a theatre history project. https://t.co/AfCZxWmUBc My advice to anyone just graduating (or anyone) is to get your own opinions. Feel free to disagree with your upbringing and their opinions. If you find you agree with them after you figure it out yourself, cool. (Don't hurt others). You can change your parents to be better. https://t.co/81dx2tVXxl Hey @savotteson, Thank you for the follow! thinking about the time i straight up told my straight friend he was a hunk after he asked what gay type he would be #ifirstknewIwasLGBTQ when I went and saw Star Trek: Into Darkness on a friend date with the attractive guy friend in my group and enjoyed the date along with the fact that Sulu was gay in it. We Stan the internet fighting the bad people.\n\nIt gives me hope and helps with the anxiety. We love when presumably white people put up a we support and pray for our police sign not understanding the entire situation in the world because of their privileged white world view\n\n(Sarcasm btw) RT @Swilua: Heather: you know the weirdest thing about you \n\nme: idk babe there are so many options here \n\nH: you went your WHOLE LIFE not… This should probably go without saying but fuck the KKK I felt so cool answering this survey in my AP English class and getting to fill in the \"identify as gay\" bubble. RT @Pokemon: ...ahem.\n\nMr. Mime will only let you see this post if you promise to behave, Trainers. 😒 https://t.co/yEPDR6Qdj4 RT @SenKamalaHarris: September is Suicide Prevention Awareness Month. To anyone who is struggling: please know that you are not alone.\n\nTo… Getting ready to bond with my coworkers over the great internet outage that is not letting us work at 5 am The day I figured out that my work lets me kindly tell people they are being mean with their language was the best day I'm proud that my attempts to use more gender-neutral language has become far easier and has rubbed off on my family This was genuinely cool. Even if I literally didn't say anything, everyone else's comments were just amazing! https://t.co/enPc5kUuZL Invite me to your virtual weddings, please! :) So I don't know why I thought of the phrase, \"I'm gonna go all Wii Sports on your ass,\" but now I want to know what that would even mean. @SlackHQ #WhenRemoteWorks (this is for a good cause so I think it’s cute)\n\nMy new job as an alarm monitor works pretty well from home, especially working grave shifts where I literally just go to bed right after. Weber's online campus store service isn't working for me so I'm ready to have my first panic attack of the semester. RT @Chrish_the_fish: If God exists, he WITHOUT A DOUBT wants me to marry a handsome successful and caring man @saintlystel My gay male ass didn't realize what this meant until just know. All these Mormons be moving at lesbian speeds Did I just comment on my education class that we should teach things like taxes and how to sew a button and figure out how to include the fact we should teach about sex more...\n\nYES AND I'M SO PROUD! Science is kinda crazy ngl. I have a conspiracy theory that the reason I didn't make it to state solo and ensemble in choir my senior year is I picked a song that was 7 minutes long. I wanna do things because we're in quarantine, but I still can't get myself to do the things available I have a memory of learning how to eject a USB drive in elementary school. Plants be kinda freaky! I would've been a herbology professor at Hogwarts. I just finished the 3rd season of Glee and started crying...\n\nso I guess I'm ready to be an educator Guess who made a healthy decision and deleted the Facebook app?!!?!?!?!?!?!?!?!? @IMLIBERTEA_ I was so good at this game!!!! RT @TheRealCoolmath: Reply for a free hoodie👇 Hey @Landry_Thomas, Thank you for the follow! I've officially had Twitter feud in my Twitter replies and I can't help but feel proud The best version of Robin Hood is the Disney version with the animals Do straight men still think that women do everything just to impress them? If you're a straight guy who thinks he's hot enough to make queer women straight...\n\nThen you're probably too ugly for straight women you know Racist white people wanting black people gone forget that there's a chance their ancestor brought black people over in slavery, who could even be this person's ancestor. RT @muyskerm: If you are a teacher or know a teacher in the US who needs supplies please fill out or share this form! \n\nAll stars donated d… Who wants to start an internet hoax with me? All these straight boys on TikTok be dancing like they're at the casting call for Magic Mike 3. Botony is reminding me when I threw up in Biology from just doing jumping jacks I'm proud to be part of gay Twitter and TikTok because dang if we aren't supportive and defensive of each other RT @itsmarkyoung: @kingdeficit The comments have me SCREAMING https://t.co/l54DS0BunA RT @chrispena_16: @kingdeficit buckle up because this video is even worse https://t.co/7Mc04K5oO5 Guys TikTok is for the gays because his comments are gold Yo this is the type of guy you're gay best friend tells you to break up with https://t.co/NQAwXrRLbu Raise your hand if this pandemic has brought out the crazy in your otherwise mostly sane family 🖐️ So all these girls I knew from high school are getting married and I'm prepared to be the token gay at their weddings. My friend @annarpeacock got proposed to onstage and I've never had more serotonin in the past 4 months. Hey all. After my crazy rants last night I've decided to use scheduled tweets so I'm not tweet bombing y'all. I've set a reminder when they all go off that I will update if I have more thoughts that can wait a while. You're all great (well, most of you who interact with me). :) RT @Fby541: https://t.co/CzKenL5cVT Also this lady who’s my neighbor just shared a thing saying that positive test results might be from having some similar antibodies to COVID and I want to say, “so.” Because I don’t see how that proves any point. I’m ready to bring back “ok boomer” as a valid response when I don’t have enough energy to call out people with wack-ass conspiracy theories and hateful stuff. I love my friends so much! The fact that heterosexual men sexual lesbians makes me really mad I got on Twitter for like 10 minutes today to check notifications and I'm already mad. Are you happy Twitter?! I’ve been thinking about the power of theatre as an art form as a way that creatives cope with tragedies or historical events that are quite intense and I think it’s so cool. Every Wikipedia article I’ve read about some big tragedy has theatre under its popular culture category. Is it bad that I fantasize about some homophobe or some bully in the future when I'm an educator who I get to tell to knock it off?\n\nOr have I just been watching too much Glee? I can't wait to find love and prove to everyone I graduated with who is getting married that I could be happier and more fabulous than them. What if we in the world did the \"ouch\" \"oops\" thing that all those theatres in Chicago did? We love when you get a group email from work saying you need to improve, and then a follow-up email from your manager saying, \"except you, you're doing great\"\n\nThis is feeding my already very big ego. Why did America decide masks needed to be a political issue and to conspiracy theorize about it when it's harmful to not wear one? Update: I just told the person I snoozed that their petition to make masks NOT mandatory for schools was anti-vax level dangerous and unfounded so...\n\nhere's to possibly losing some dumbass on Facebook as a friend The Snooze for 30 days option on Facebook is my version of giving people on Facebook a time out for the stupid s#!t they say. very, every is also hilarious sometimes i think i might be straight/bisexual and then i see a gorgeous man and my brain reminds me saying \"hey adam, remember you're every gay\" i tried that name + color aesthetic facebook thing and all i found was vibrators RT @iashmcknight: I'm pissed at all of you selfish pricks who made it so now my education and career are at risk. Don't be selfish and just… here's some wholesomeness:\n\nbe like a Bristlecone pine\n\nthey can live to 4,600 years, but only in the harshest of climates tonight is a listen to breakaway and cry kinda night having two older sisters and mostly female friends showed me how easy being a man is and how the patriarchy needs to be dismantled thinking about my theatrical past and all the cringy stuff I did is anyone who makes those how to approach women videos actually in a healthy stable relationship?\n\nasking for a straight person here's your wholesomeness for the day:\n\nmy dad just taught me how to unclog a drain today Confession time:\n\nI can't do downward facing dog in a relaxed way without feeling kinda sweaty watch me single ladies myself into the ideal male body Some of us be allergic to plant semen The Hate U Give is on HBOMax. I finished The Hate U Give. I cried so hard. Watch it! If you want to know even an ounce of how the black community is hurting (to my friends who don't get it) just watch it.\nAlso, I signed up for the Utah chapter of Black Lives Matter. I'm mad I missed the protests, but I'm here I would like to reiterate that this isn't about me. These are my thoughts. It is my experience that gives me empathy for SOME of the bad things that black people can and have experienced. I'm fine. I'm privileged. Time to use it for good. https://t.co/Y0nVPCmlb8 I posted these to my Snapchat. Please read the reply to this with the last two before making any comments. https://t.co/aUfbqjSyZH thinking about how many people on Facebook probably unfollowed me because they’re too afraid to unfriend me Me to all the toxic people in high-school https://t.co/NIC5gdTPIS Do you think straight men will ever understand the relationship between gay men and straight women? What are the realistic expectations of owning Clifford the Big Red Dog? i'm 99% sure that the cause of my sexual confusion growing up was Glee The fact that literally children are allowed on social media scares the feck out of me All these people be out here proudly shouting how they aren't wearing masks and are taking the chance like real proud in all these Facebook posts and I be out here just wanting school to start in the fall thinking about the irony of being cast as Sir Galahad in a script reading of Monty Python as a gay man RT @seywarddarby: This is my friend Ethan. He lost sight in one eye when a police officer shot a tear gas canister directly into his face w… and that not everyone will like me and that history is kinda fecked up I'm coming to the healthy realization that I can't please everyone thinking about how the high school in love, Simon was performing Cabaret Yo, it’s been over a year since I’ve come out and holy s#!t that was the hardest thing I think I’ve ever done So Love, Victor exists and I’m dying i might just be a good person but I don't get how people ever thought that another human was lesser old women being kinda horny for old attractive male actors is the aesthetic I need The fact that Idina Menzel doesn’t sing in Enchanted is a crime in of itself the first crime I'm commiting in the purge is tax fraud thinking about how I'm older than the actor who played Myron in Glee If Wicked exists in the Glee universe, why do both Kristin Chenoweth and Idina Mendel not appear as themselves?? Albus Severus Potter and Scorpius Malfoy are gay... no debate (maybe Scorpius is bi) thinking about when Julie Andrews says \"shut up\" in The Princess Diaries 2: A Royal Engagement RT @Nickelodeon: we are all part of the change #blacklivesmatter\n✊🏿✊🏾✊🏽✊🏼✊🏻 https://t.co/Y3Fzvob54X have you ever thought about how much money you've wasted? it's bad that i could see myself owning every LEGO game made for the Xbox 360 within the next few months Hey you, yeah you, scrolling rn. Take a moment and either take a break or take a breath. You got this. Slow down. Take care of yourself. And maybe call your parents. They miss you and they're worried. RT @topher_skies: It’s been a while since I’ve taken time to appreciate my life and privilege. I don’t know a thing about how to help the m… when people text with extra consonants at the end what is that supposed to sound like? i'm curiousssssssssss catch me naming my first child after a Pokemon https://t.co/R6FTvhgxNx Hey @JaredDomino7, Thank you for the follow! let people learn from their past mistakes RT @madddiexo: i love when guys on dating apps ask  “how is a gorgeous girl like you single” I’m mentally ill, brandon RT @acnhtortuga: ✨ Star Fragments Giveaway ✨\n\n✨ regular &amp; large star fragments (25 each)\n\n2 winners will be chosen in 16 hours! \nto enter:… the fact you can't delete Facebook signs constantly reminds me when I made a whole page for turbo the snail I'm conflicted on whether or not the girl who tipped me $15 for delivering Postmates meant to do it or is very nice catch me in 2029 being depressed until the late 2030s my claim to fame when I was younger was knowing the rap part of \"Hasta La Vista\" from Camp Rock RT @acnhtortuga: ✨ small catalog party ✨\n\n✨ simple panels\n✨ soft-serve lamps\n✨ floor lights\n\nI'm excited to finally host a catalog party! j… RT @marshalsmaid: i'm bored so this is a\n\n⚡️flash giveaway⚡️\n\n1200 nook miles tickets ❤️\n3 winners ❤️\n\nrt + follow + tag a friend!\nends in… how do people get all those filters that tell them what they are? asking for a friend I'm crying https://t.co/CpMi08sI69 @astro_chica 😎 I would like having this knowledge https://t.co/cO2NlJ78f4 except no men will do it with me 😩 https://t.co/5xrJAC7m0d Daytime-Adam is upset with midnight-Adam who decided that his super funny tweet idea would be better if tweeted in the morning, and now he can’t remember it. Did anyone else play a game called Pocket Frogs on the the first iPhone? yo, why tf were poe and finn not gay? Is performing the Laramie Project a good idea for high-school? Asking for a friend the irony of when i texted cute boys during church classes when i was younger @Amyjayyyyyyyyyy I get it, 100% Hey @that_bitch_1st, Thank you for the follow! Hey @not__hunter, Thank you for the follow! are straight people ok? RT @acnhtortuga: ✨ 100 NMTs Giveaway ✨\n\n1 winner will be chosen in 7 hours! \nto enter:\n🌹 must be following\n🌹 like &amp; rt\n🌹 reply your fave sh… Everyone to me before I was out: \"We've heard say, you are gay, night and day.\"\n\nMe: \"You go 'way\" All these boys asking about dream first dates. I haven't gone on too many because none of y'all will go so how TF am I supposed to know. Hey @nick_p_warner14, Thank you for the follow! RT @JaiLenJosey_: Ain’t nobody want this. https://t.co/FWDY5glNZE tonight's a listen to the \"pretend I'm something other than these broken parts\" part of \"Words Fail\" and cry kinda nights @LilliCooper @CBS @TheTonyAwards PLEASE! RT @LilliCooper: Hey @CBS Instead of a singalong, I’d LOVE to see a lineup of prior @TheTonyAwards performances. Anyone else? y'all, Disney didn't listen to 1920s musical theatre telling you to not get married after meeting a man for the first time and it shows Do I really have to be your dad and tell you to meet people you met on dating apps in public places ON THE DATING APP IN QUESTION?! Does any other out gay person love the feeling of having someone who doesn't know you're gay find out? if y'all haven't seen the Netflix movie The Half of It, then wtf are you doing rn?!?!?! today is a listen to the Glee version of \"cough syrup\" and cry in you bed kind a day klaine messed with my hopes of finding a soulmate at a young age the glow up that Blaine and Kurt had proved that queer people glow up after high school more than anyone else glee single-handedly made me think that i was the center of attention at all times is any other gay person jealous of the friendship that blaine and sam had in glee? the feelings I'm feeling from accidentally swiping left on tinder are making me consider buying tinder premium or whatever tf it is sometimes I turn from flirt to therapist in dating apps Hey @kenzma_12, Thank you for the follow! how did none of y'all know that C3-PO was gay thinking about Anakin killing an entire group because of his mother #MayThe4thBeWithYou Do you ever just think about Order 66? RT @onewiththehair: @adamdoestw just told me I am a comedic genius and honestly I have never felt SO validated 😭😤 https://t.co/Tv467y6aj3 @roey_howell YESSSSSSSSS!!!!!!!!!! All these straight f-boys I graduated with be SUPER HORNY with each other. today's the day I need my entire family to get on TikTok so we can become a famous TikTok family I'm upgrading myself from gay best friend to gay husband with all this loyalty and support I've been giving I just got sad because some of my high school friends aren't friends with me anymore on social media and I want to talk to them. Hey @DevonOltmanns, Thank you for the follow! Quarantine got me almost adding women to the dating pool on my dating apps Sometimes I have to remember the words of my favorite stage manager:\n\"I just pretend like every decision I made was the right decision or I'm going to overthink it all\" You Can't Stop the Beat (Music Video)| #IsolatedNotAlone https://t.co/A3HwfZohE1 via @YouTube\n\nIf you were wondering I posted that video on here now you know. @waitwings So this might be old news but if you haven't ever watched @somegoodnews by @johnkrasinski then you freakin' better! I want to be the textbook author who thought of saying that Titanic the Musical \"sailed off with five Tonys.\" Yo, can we all learn how grammar works during this quarantine? Thank you. What if I find a boyfriend using Animal Crossing? A girl online from the southern hemisphere in Animal Crossing might be flirting with me and I'm too gay to know if she is and I'm scared. I'm watching a Broadway documentary and I started crying so that's my mental state. RT @DnDeej: Before you tweet, reply, or engage, consider the Craig Ferguson method and ask yourself these three things:\n\n- \"Does this need… Some people my age don't know how to use Zoom and I'm shook. So I'm posting this because I just got recommended a video on YouTube that makes me quite upset but people should know\nSchool shooter jokes, memes, videos where you're hiding and then there are gunshots and cries and pleads for life AREN'T FUNNY and are gross and disgusting. Stop RT @claudmp3: happy trans visibility day you’re valid af and don’t let anyone tell you otherwise!!!!!! @ma3chapman Dad and old man Am I the only one who takes off one ear-bud/half of the headphone when I'm trying to focus and listen to something at the same time. Hey update time: I'm feeling so much better. Sometimes anxieties about the world tend to excite all the other possibilities, plus I've been alone with my thoughts for too long. So that technically means I need to play more Animal Crossing or else I'll explode. @CoryThomps The small things. Quarantine Adam is not ok In the midst of the anxieties of the end of the world, I have to deal with the anxiety of wondering if I'm doing what I really want to do with my life and if I'm choosing the right major. I'm having a fun time in quarantine. 😟🙄😣 So like I don't like to get political but even if you think it's not the truth or whatever you believe, understand that Coronavirus is affecting people. People can have mild causes, sure. But just like other illnesses we shouldn't try and spread it. There is no conspiracy so stop RT @Wordsmith161: So apparently one of my favorite YouTubers, @WaitWings , is making a video about Beetlejuice the Musical (the Musical the… @ABrightMonster #FindAlexBrightman2020 https://t.co/o5AUwGY4i4 Hey @ABrightMonster make a NEW BEST FRIEND in @WaitWings and let us hear your Beetlejuice Story! #FindAlexBrightman2020 My new goal in life is to be a part of a group of mom friends that sit around and drink wine and wear gorgeous sun hats and dresses sitting in lawn furniture in one of our rich husband's backyards. RT @colindross: Im really about to comment on EVERY SINGLE PERSONS SNAP STORY idc anymore I've shared too many of those Facebook sharing things for the entire time we'll be in this pandemic. The sheer anxiety that @onewiththehair had for me while I was having allergies randomly hit me like a truck is the type of anxious energy I need from all of my friends.\n\nSo step up! https://t.co/gOpyryydCA\n\nUm don't watch this unless you're @WaitWings \nThanks Why am I  jealous of those people that get mentioned in their friends' stories? Do I need to pick better friends? Stay safe and wash yo hands! I'm coining the term SFF for straight female friend. Does anyone know a job that needs someone who knows every American folk song? Does anyone know if I'm qualified for unemployment if I still live with my parents? I ordered Animal Crossing on Amazon cuz I thought it'd be here today... Today can officially stop existing. Today's list of offenses from the world to me:\nWoke up to an effing earthquake!\nCOVID-19 already got me having to stay inside\nAnxiety\nMy body effing hates me rn\n\nGuys my head hurt real bad and now my jaw hurts (I think I got some sinus problems) and now my stomach hurts Who wants to make \"It's The End Of The World As We Know It (And I Feel Fine)\" a chart-topper with me? So I think I made everything get worse with Coronavirus because my birthday wish was more sleep and now I get that because everything is canceled... BTW today was my birthday! I'm only getting on Twitter rn after not being on to tell my Script Analysis friends to DO YOUR DESIGN ANALYSIS ASSIGNMENTS LIKE RN!\n\nbye, luv you\nthanks for being awesome twitter\n(also my thank you for the follows and liking youtube videos are automatic) 🤘🖐️ Hey @hyperhoff, Thank you for the follow! Hey @GladdenGracie, Thank you for the follow! If you've noticed all my tweets are gone, don't worry, it's for my own good. I'm starting over, but first I'm taking a break for my mental health. Thanks for actually reading my dumb too-frequent tweets. (If you want any of my pictures I tweeted DM me and when I get on I'll reply @ellieryanh I would say I'd take them, but I bought myself Oreos after my coworkers started talking about them Saturday and have already probably eaten a whole thing by myself.\n\nBut still...", "bag_of_tweets": ["Zodiac signs are so antiquated, what Monster's University fraternity/sorority are you?", "#PalacePix https://t.co/fq1aF0KhqD", "If you're my friend and I talk about you in therapy and share that I did, it's because you're special and I love you", "Did anyone else ever get the dating talk that the \"man\" is supposed to walk on the side of the sidewalk closest to the street in case something happens or was that just a fever dream?", "@morganmatilda98 Sending love ❤️❤️❤️", "🎤I wanna rock🎤\n\nCan you guess who I was this morning?!\n\nHere's a hint: 🎤 We're not gonna take it🎤\n\nI finally got to be the man behind the song I sang way too much when the people tried to be cramping my style https://t.co/JozMe7al08", "Do you think two men like Lewis and Clark who spent so much time together exploring didn’t get lonely and kiss, just a little?", "Damn, I wanna be on Drunk History", "I have a straight uncle who comes over with his roommate", "I’m not heterophobic, I have straight friends", "My daily timer extension on Chrome disabled so you all had to deal with me sitting here contemplating whether to tweet things for like 5 minutes each wondering why the timer isn't hurrying my ass instead of doing homework", "RT @goblynnmarket: https://t.co/EAL3LoFL35", "I don't think this is said enough but\n\nFUCK THE PR%UD B%YS", "The sun's always had corona people", "I think @JakeStateFarm is my type", "I didn’t expect to get on Twitter and cry tears of empathetic sadness today, but here we are", "@krisis86 Hey neither do I! Let’s be sick friends!", "Listening to \"Everyone's a Little Bit Racist\" from Avenue Q in 2021 hits different", "Why does YouTube think I'm remotely interested in listening to EXTREMELY right-leaning politics", "The internet knows how to fuck up your day doesn't it", "RT @levarburton: Happy Birthday, Fred! He would have been 93years old today... #bydhttmwfi https://t.co/odBR6bKHUX", "The one superhero universe I want explored more is The Incredibles and you can fight me on that", "I might be very gay but a good hetero meetcute still is enjoyable", "Why does anyone like Reagan and wear his campaign shirts?", "I'm still mad that I was in NYC and was so close to Stonewall during pride month on the 50th anniversary of the riots and I didn't go\n\nAll I got were the playbills with brick-rainbows and many pictures of pride flags everywhere\n\nI think I was also late or early to world pride", "I would just like to say that I still think it’s a trip that collectively the entire theatre world was shaken by a musical based on a Nickelodeon cartoon that had no right to be as amazing as it was", "I watched one video about the Equality house next to a specific Church and next thing you know I'm looking on Spotify to see if they have any of their dumb parodies only to find that people have created playlists named this church but with pride anthems and I'm living for it", "Not me accidentally just unmuting myself instead of turning off my camera to then blow my nose", "The scene from Victorious right before Jade and Tori sing \"Take a Hint\" is probably what lesbians go through when some men are trying to hit on them\n\nAlso one of the creepy guys' name is Chad", "We all know the people who cut themselves off in Zoom by only unmuting for the words they say and then immediately muting themselves right at the end", "Not me spending my time I should be doing homework printing off NASA coloring pages and coloring them", "Hey Google, how do I join the #TwitterBookClub?", "Not my astronomy class getting existential", "Reading scholarly fights is my new favorite thing, especially when people attempt to do them in a public forum and then some bozo comes along with something dumb, which makes it even better.", "The best thing about being 20 is forgetting to get K.K. Birthday on your birthday in Animal Crossing", "The dark recesses of my mind scare me with what random thing they can make me go find on the internet from whatever fucked up thing I watched as a kid and forgot and now research instead of being normal", "RT @OriginalFunko: RT &amp; follow @OriginalFunko for the chance TO WIN this @HotTopic exclusive Scarlet Witch Pop! #WandaVision #ScarletWitch…", "Hey, guess who already knew that this was a thing because that day has significance to them very personally.... ;) https://t.co/qzaB9Kv5D4", "Happy Mar10 day!", "@OriginalFunko What's the best selling figure?", "My catharsis for the day was flipping off a house with a T***p flag", "@MessyPod Victorious bb", "RT @MoveOn: Democrats in Congress just passed one of the most significant economic packages in American history.\n\nThese are just a few of t…", "At the Pretzelmaker where I am at rn grabbing Postmates a group of girls ran in screamed \"red alert\" to their friend and they all left in a hurry", "@govkristinoem stop discriminating against LGBTQ South Dakotans and VETO HB 1217 and SB124.", "Why are like 15 individual states trying to shove trans kids back into the closets all at once", "I stopped myself from sinking further into this toxic wasteland but thankfully most comments were positive", "I'm probably preaching to the choir with my followers, but for the love of God, do NOT fucking call a black person a monkey!!!! Are you fucking kidding me!\n\n(I reported that comment which was on a post about Michelle Obama)", "There's so much shit out there that is just cesspools of toxicity and hatred and they are the reasons that I need to be a teacher... To protect all my vulnerable future students", "The dates in astronomy are crazy! Like NASA sends something up in 2017 to get something done and return and it takes until 2020 just to get there and then 2023 to get back!", "Did anybody else wanna make out with someone underwater after watching Leonardo di Caprio's Romeo and Juliet?", "So I might be depressed because some wonderful people made Disney World in Minecraft and I don't want to do anything else", "RT @OriginalFunko: RT &amp; follow @OriginalFunko for the chance to WIN this Spring Convention exclusive Yoda Pop! #FunkoVirtualCon #FunkoECCC…", "I need everyone to see what comments I got when I shared the Y being lit up\n\n(top comment is a good friend, the bottom comment is an old director who is a fabulous older gay gentleman - for context) https://t.co/PWMizvwKRR", "We love that DC comics has a gay character no one has heard about since 2000 named Rick Stone", "TIL: there are transphobic and homophobic gay and trans people", "I just sent an urgent message telling UT Gov. @SpencerJCox to VETO Stand Your Ground and guns on campus bills: Send your message now &gt;&gt; https://t.co/t8EKCBhOTj #UTPol @MomsDemand", "@RMP_Utah wants to make rooftop #solar more expensive, again. Only the #Utah PSC can stop the monopoly utility from taking our power!", "I’m adding to the list the older white gentleman who show support for the LGBTQ+ community on Twitter", "Utahns will obsess about a show about a fabulous Old Testament guy wearing a technicolor dream coat but get mad when some people hold up LEDs around a letter on a mountain", "Gay BYU students are actually the reason I haven’t offed myself yet", "I have the strange need to keep reading the toxic comments from this news source, but QUEER PEOPLE HAVE QUEER PEOPLE'S BACKS BB! I love you all!", "RT @OriginalFunko: Hope you are enjoying #FunkoVirtualCon! RT &amp; follow @OriginalFunko for the chance to WIN this Spring Convention exclusiv…", "Did I have to subtly figure out if my friend had a baby or was just posting about a niece or nephew... yes", "The way you somehow connect with people in a class to feel comfortable with them over time is kinda powerful", "So every day in my English classes is the confirmation that gays are successful and will always be successful in literature", "2) This story was about a South Korean Military trans-woman being found dead in her home. The top comments were people sharing love and if people commented under those comments bad things, people came right back and fought their negativity. This made me happy. RIP to her though", "1) Here is why the LGBTQ+ community is tight-knit and won't take your bullshit. I saw a story on a news site that has a comments section that I always doom-read because people spend their time commenting on news sources they disagree with terrible things.", "The Senate must act urgently: Pass Biden's COVID relief bill w/o delay, obstruction, or watering down essential policies. Anything removed from the bill means more will suffer. #OurSurvivalAtStake", "A year into this pandemic, we still don't have the support needed. It's beyond relief; it's about survival. #OurSurvivalAtStake", "RT @OriginalFunko: Happy #FunkoVirtualCon! RT &amp; follow @OriginalFunko for the chance to WIN this Spring Convention exclusive Jackie Chun Po…", "RT @OriginalFunko: RT &amp; follow @OriginalFunko for the chance to WIN this #TargetCon exclusive Star Wars™ - Jumbo StormTrooper (Artist Serie…", "@savotteson As I Pisces, I will", "But like, what if we actually all believed in global warming and didn’t politicize it?", "RT @GeorgiaBridgers: i. love. my. grandma. https://t.co/ubladRHDCj", "RT @Daniela_A_Wolfe: Beware the lure of heterosexuality. https://t.co/UQGlsWJFA8", "RT @Nintendo_NWR: We're giving away tickets to the biggest \"Dodgebrawl\" event around - this weekend's Closed PC Beta for the newly revealed…", "RT @annarpeacock: Nick Miller               Spencer Shay\n                      🤝          \n      Hot funny man who dropped\n            out…", "RT @sesamestreet: Groovin' right into the weekend with @Grover 💙 #FridayFeeling https://t.co/gXTxCh0EFP", "Who wants to go on a literary tour of famous American authors and visit their historical homes?", "@drjenniferkokai https://t.co/KSGc6MKLLC", "I dyed my hair for the first time in my life today! https://t.co/wV7uvWL33l", "RT @the_hipp0: Aight... Time to put the Biden/Harris on blast. Close them camps and abolish ICE #BidenTakeAction", "Thinking about how I used to watch Duck Dynasty and Last Man Standing", "RT @BetteMidler: He got away with murder.  Let that sink in.", "Why does theatre have to be so goddamn powerful?!?!", "The cultural phenomenon that we all are listening to Taylor Swift's new version of old music and feeling like children is pleasant. The little gay soul I had when I was young that I suffocated until it \"died\" until coming back like a sexy vampire at 17 is happy and fulfilled", "RT @OriginalFunko: RT &amp; follow @OriginalFunko for the chance to WIN this Funko exclusive Sheriff Deadpool Riding Horsey Pop! Rides! https:/…", "I googled myself and there is a far more interesting person with my name so hopefully that will give me job benefits", "RT @SuperMarioOOC85: https://t.co/4L7nnyNyBW", "@savotteson YES!!!!!!!!!!", "RT @_davidtitan: Angola just decriminalized homosexually and evening passed a law that discrimination based on sexual orientation can land…", "We can't heal as a country without accountability. Convicting Trump names his active role in the attack. We must not let this violent pattern continue. #ConvictTrump", "I never got a coming out party so I think I'm gonna hold one when this shit ends", "How do these kids know how to work Zoom so well?\n\nAlso they all like Fortnite or anime", "RT @mollypdf: when my nephew steals the phone during facetime #PepsiHalftime https://t.co/hOPd1hRLX4", "Maybe I'm just gay, but why do a bunch of psychoanalytical theorists think that everyone wants to have sex with their mom?", "In my internship some of the kids were using chat to say things in French so I screenshotted them so I could translate and maybe it's just Google translate but so far it's about radioactive cookies", "RT @onewiththehair: His face is like is political views: moderate. @adamdoestw", "Hey @ellieryanh, Thank you for the follow!", "Turns out that parents in the school district I grew up with are mad at \"The Diary of Anne Frank\" and for one girl mentioning she has a crush on another girl in another story...\n\nWTF", "RT @latimes: For over 30 years, Hashem Ahmad Alshilleh helped to bury a generation of Muslims across SoCal.\n\nHe never charged for his servi…", "RT @whatitd0babey: I FORGOT TO EDIT MY NOTEBOOK TO SUBMIT TO CLASS AND SAID ONE OF DICKINSON’S POEMS HAD “big gay energy” my professor said…", "RT @nooksstyles: 🦆GIVEAWAY🦆 \n\nim giving away another custom ac embroidered sweater ! \n\nto enter : follow me, rt/like this tweet (no qrt), r…", "RT @theodd1sout: In hindsight 'Robin Hood' was not the best name to go with", "RT @SenSanders: The business model of Wall Street is fraud.", "RT @calvinjburke: Reddit trolling Wall Street has restored my faith in humanity", "RT @jon_actual: This is bullshit. The Redditors aren't cheating, they're joining a party Wall Street insiders have been enjoying for years.…", "Is there ever a sound in a song that you enjoy for some weird reason and you wish you could find it in other songs?", "Sometimes the internet surprises me with how nice it can be. Whenever I see a thing that talks about strong queer, black, and/or female voices I’m always checking the comments like the crazy person I am and surprisingly sometimes it’s not hate fueled", "Oh God, am I Chrissy Teigen? https://t.co/RGMh0SXhi8", "RT @PinkNews: Joe Biden signs 'most substantive LGBT+ executive order in history' as America quickly moves away from Trump's dystopia https…", "Basically what I am learning in American Literature is that to be a successful poet you had to secretly be gay and sometimes let that out in your poems", "So my mom’s friend shared a news story saying that Joe Biden swore in on the communist manifesto and didn’t read it because it literally was from an Onion-like news source and I’m dead", "Help: how do you either convince or stop thinking about the people who still think Tr*mp didn't commit an insurrection?", "I felt really old when I helped with an audition for a community theatre youth camp and one of the girl's made a comment that her sister pranked her with the \"Who sings this song? (insert artist name) Good, keep it that way\" joke and she had never had that happen", "So sometimes when I'm on mute in classes I'll talk to myself and today some ok-looking guy made a joke that his wife didn't get an attractive husband and out loud (on mute) I said, \"I'm gay and I think you're alright\" and was mortified if I was on mute or not", "You can just tell that a lot of old classical literature was written by men", "I feel called out by Dracula in how I write long texts to my friends", "Who remembers when my entire personality was theatre?", "Imagine committing treason and walking home and having to deal with that (if you didn’t get caught)", "Whoever didn’t told me that DaVinci was flamboyantly gay can stop talking to me forever", "I wish I had the confidence I do now when my sister dared to me run into a room full of my extended family say \"Troll, Troll in the dungeon. I thought you ought to know\" and then pretend faint because I would do that now in a heartbeat", "I can't be the only queer person who sometimes gets morbidly curious and researches the ideals of anti-queer groups. Not out of self-hatred, because f#@k them, I love me, but because you want to feel some anxiety and also wanna see how f#@king dumb they are.", "If my Spotify friends see I'm listening to \"Grown-Up Christmas List\" know that I am not ok and I need this right now", "Sometimes when I'm feeling morbid and down because the world has hate groups against me and my friends, I just remember that there are a ton of people like me and our existence is resistance so then I realize that me not existing would be what they want, so I exist harder.", "RT @nooksstyles: 🍭 GIVEAWAYYY 🍭\n\nto celebrate my website relaunch im giving away a custom ac embroidered sweater ! \n\nto enter : follow me,…", "One of my theatre friends knew I was sad and tagged me in a cute animal photo.", "Weber State University students who have scholarships, remember to pay tuition today as the scholarships are now in!", "It took 6 days for 2021 to disappoint", "RT @HayleyTakeuchi: I said the f word a lot today and I have no regrets", "RT @UtterPWNedNoob: This is without a doubt the shittiest production of Les Mis I've ever seen.", "If I was over 21, didn't live in a pretty against drinking household, and could get access to weed I would've been very high or very drunk today", "I think people will understand why I stopped \"uncensoring\" myself tonight", "RT @nathanallebach: 🛑 STOP 🛑\n\nyou've reached the doomscrolling checkpoint. this is your reminder to take a break from doomscrolling", "The fact that it's being spun in the other direction baffles me. That's the most unbelievable lie to try and spin https://t.co/VbnSZRKJ5H", "RT @closetmormon: So..... my mom's saying there were antifa and BLM protestors disguised as Trump supporters and chanting and stirred up th…", "The actual irony of antifa being literally against this (it's in the name)\nThey aren't sounding so bad rn https://t.co/dIg8mDk0ab", "RT @JoeBiden: Today is a reminder, a painful one, that democracy is fragile. To preserve it requires people of good will, leaders with the…", "RT @ellle_em: What Trump has meant for the people currently storming the Capitol is and endorsement from the highest level of their worst i…", "RT @JelaniAlladin: COULD YOU IMAGINE THE BRUTALITY IF IT WERE BLACK PEOPLE  SCALING THE CAPITAL BUILDING?!?.....do y’all see this?!", "I wish (famous) people with tons of influence over young minds would do something good with that power", "So I guess this is my first tweet of 2021 \n\nI spent the last minutes of 2021 trying to put in contacts while listening to \"The Final Countdown\"", "So a Republican representative from Louisiana died from coronavirus and the comments on that post on a pretty left leaning news source were mostly nice but some made me kinda upset at humanity so that's fun", "Remember when every person and their mother (or other parental figure 😉) lost their minds to the “shipping your pants” commercial", "The people who bullied Karofsky in Glee even after he tried to kill himself and weren’t deeply ashamed or regretful deserve the real hell", "I can also not stress enough that many are now on LDS missions (which they went on shortly after this experience our senior year)", "thinking about the times in high school when these white boys would do the Hitler salute and start saying some Nazi shit in German", "RT @Slimecicle: Slimecicle Plushies are dropping December 22nd!\n\nRetweet and follow @youtooz and I will choose 2 lucky winners to receive T…", "Thinking about when in elementary school this kid took my pen that my dad got me from his company and pretended his dad gave it to him when his father worked at a high school", "If you know you know. https://t.co/Q9YghGTTy3", "Charlie Brown directing is the energy I'm bringing into the first school year I am a teacher.", "Plus when I was little all throughout the year (and mostly when it was late at night during winter) I would watch our VCR recording of A Charlie Brown Christmas and honestly that's probably why I didn't feel super depressed during SAD time until recently.", "So for my friends who have Season Affective Disorder (which the acronym is SAD so I'm calling it The Big SAD), A Charlie Brown Christmas is on Apple TV for free rn and it's bringing me joy. And we can all relate to sad Charlie Brown.", "RT @MacDoesIt: Let’s just forget all pronouns and call each other Kronk", "Can someone homophobic tell me why you give a f#@k?", "Someone commented under a news community post on a YouTube news channel \"Trump hurted AmErIcA\" and I can't stop thinking about it", "Hey @the_noracle, Thank you for the follow!", "Thinking about the time that I got a copyright claim on an audition video when my voice teacher was playing the piano", "RT @AustinOnTwitter: I'm so gay lol", "@Geodude25trade @NVIDIAGeForce Yo! This was a great surprise!! Those were great times!", "#wewerehere “Purging Our Sins with a Neti Pot”", "RT @ElateLemming: #unusannusweknowwhatitis we know", "Wow, I joined a cult. #UnusAnnus #UnusAnnusisoverparty", "Hey @alidryg1, Thank you for the follow!", "RT @MacDoesIt: I’m gay", "Did you also know that you can register to be a poll worker and get paid?\n\n(Side note - if you're in Davis County, it's full - hopefully with the good people - so just register to vote and vote as well instead)", "If your voting for the next Minecraft mob and aren’t registered to vote in America (if you can) then you should", "The world needs more lesbians", "White people be like “enough is enough” when we are asked to recognize privilege seriously for a few months \n\nBut BIPOC have been saying “enough is enough” for literally hundreds of years", "So an 11 year old asked me if I knew the WAP dance....", "RT @adidasUS: Real change requires action. We have work to do, but we remain committed. Here are the actions adidas is taking: https://t.co…", "Insecurity is feeling like every time a higher-up talks to you at work that you're getting fired...", "RT @2K19Grads: Hardest pill I’ve ever had to swallow was accepting the fact that, I CAN’T do everything, I CAN’T make everyone happy, and I…", "So umm I Stan this girl who I haven’t talked to in person since I was like 12 and in the closet https://t.co/NH0VTdI3XV", "RT @PeytDavis: Due to unforeseen circumstances (he got a new boyfriend) I’m in need of someone to complete my couples costume this Hallowee…", "“Wake me up, when all this shit ends”", "I just noticed that my customer service voice is my normal gay voice but to an extreme.", "RT @ecareyo: When the high school play starts with the cast coming down the aisles in character https://t.co/zJt5qE4lKD", "To the white man who threatened protestors with a gun, sprayed them and tazed them in West Valley tonight\n\nYou deserve more of a punishment then you are likely to get and you should see that that's your white privilege and stop doing what you're doing and reconsider being violent", "Black Lives Matter is NOT a domestic terrorist group.", "Here’s you reminder to vote and to register to do so.", "ABCDEFGHIJKLMNOPQRSTUVWXYZ https://t.co/p5HqwETEKF", "If you send death threats to people... you're not cool and are a criminal\n\nbye.", "This is how I’m sharing my picture for a theatre history project. https://t.co/AfCZxWmUBc", "My advice to anyone just graduating (or anyone) is to get your own opinions. Feel free to disagree with your upbringing and their opinions. If you find you agree with them after you figure it out yourself, cool. (Don't hurt others). You can change your parents to be better.", "https://t.co/81dx2tVXxl", "Hey @savotteson, Thank you for the follow!", "thinking about the time i straight up told my straight friend he was a hunk after he asked what gay type he would be", "#ifirstknewIwasLGBTQ when I went and saw Star Trek: Into Darkness on a friend date with the attractive guy friend in my group and enjoyed the date along with the fact that Sulu was gay in it.", "We Stan the internet fighting the bad people.\n\nIt gives me hope and helps with the anxiety.", "We love when presumably white people put up a we support and pray for our police sign not understanding the entire situation in the world because of their privileged white world view\n\n(Sarcasm btw)", "RT @Swilua: Heather: you know the weirdest thing about you \n\nme: idk babe there are so many options here \n\nH: you went your WHOLE LIFE not…", "This should probably go without saying but fuck the KKK", "I felt so cool answering this survey in my AP English class and getting to fill in the \"identify as gay\" bubble.", "RT @Pokemon: ...ahem.\n\nMr. Mime will only let you see this post if you promise to behave, Trainers. 😒 https://t.co/yEPDR6Qdj4", "RT @SenKamalaHarris: September is Suicide Prevention Awareness Month. To anyone who is struggling: please know that you are not alone.\n\nTo…", "Getting ready to bond with my coworkers over the great internet outage that is not letting us work at 5 am", "The day I figured out that my work lets me kindly tell people they are being mean with their language was the best day", "I'm proud that my attempts to use more gender-neutral language has become far easier and has rubbed off on my family", "This was genuinely cool. Even if I literally didn't say anything, everyone else's comments were just amazing! https://t.co/enPc5kUuZL", "Invite me to your virtual weddings, please! :)", "So I don't know why I thought of the phrase, \"I'm gonna go all Wii Sports on your ass,\" but now I want to know what that would even mean.", "@SlackHQ #WhenRemoteWorks (this is for a good cause so I think it’s cute)\n\nMy new job as an alarm monitor works pretty well from home, especially working grave shifts where I literally just go to bed right after.", "Weber's online campus store service isn't working for me so I'm ready to have my first panic attack of the semester.", "RT @Chrish_the_fish: If God exists, he WITHOUT A DOUBT wants me to marry a handsome successful and caring man", "@saintlystel My gay male ass didn't realize what this meant until just know.", "All these Mormons be moving at lesbian speeds", "Did I just comment on my education class that we should teach things like taxes and how to sew a button and figure out how to include the fact we should teach about sex more...\n\nYES AND I'M SO PROUD!", "Science is kinda crazy ngl.", "I have a conspiracy theory that the reason I didn't make it to state solo and ensemble in choir my senior year is I picked a song that was 7 minutes long.", "I wanna do things because we're in quarantine, but I still can't get myself to do the things available", "I have a memory of learning how to eject a USB drive in elementary school.", "Plants be kinda freaky!", "I would've been a herbology professor at Hogwarts.", "I just finished the 3rd season of Glee and started crying...\n\nso I guess I'm ready to be an educator", "Guess who made a healthy decision and deleted the Facebook app?!!?!?!?!?!?!?!?!?", "@IMLIBERTEA_ I was so good at this game!!!!", "RT @TheRealCoolmath: Reply for a free hoodie👇", "Hey @Landry_Thomas, Thank you for the follow!", "I've officially had Twitter feud in my Twitter replies and I can't help but feel proud", "The best version of Robin Hood is the Disney version with the animals", "Do straight men still think that women do everything just to impress them?", "If you're a straight guy who thinks he's hot enough to make queer women straight...\n\nThen you're probably too ugly for straight women you know", "Racist white people wanting black people gone forget that there's a chance their ancestor brought black people over in slavery, who could even be this person's ancestor.", "RT @muyskerm: If you are a teacher or know a teacher in the US who needs supplies please fill out or share this form! \n\nAll stars donated d…", "Who wants to start an internet hoax with me?", "All these straight boys on TikTok be dancing like they're at the casting call for Magic Mike 3.", "Botony is reminding me when I threw up in Biology from just doing jumping jacks", "I'm proud to be part of gay Twitter and TikTok because dang if we aren't supportive and defensive of each other", "RT @itsmarkyoung: @kingdeficit The comments have me SCREAMING https://t.co/l54DS0BunA", "RT @chrispena_16: @kingdeficit buckle up because this video is even worse https://t.co/7Mc04K5oO5", "Guys TikTok is for the gays because his comments are gold", "Yo this is the type of guy you're gay best friend tells you to break up with https://t.co/NQAwXrRLbu", "Raise your hand if this pandemic has brought out the crazy in your otherwise mostly sane family 🖐️", "So all these girls I knew from high school are getting married and I'm prepared to be the token gay at their weddings.", "My friend @annarpeacock got proposed to onstage and I've never had more serotonin in the past 4 months.", "Hey all. After my crazy rants last night I've decided to use scheduled tweets so I'm not tweet bombing y'all. I've set a reminder when they all go off that I will update if I have more thoughts that can wait a while. You're all great (well, most of you who interact with me). :)", "RT @Fby541: https://t.co/CzKenL5cVT", "Also this lady who’s my neighbor just shared a thing saying that positive test results might be from having some similar antibodies to COVID and I want to say, “so.” Because I don’t see how that proves any point.", "I’m ready to bring back “ok boomer” as a valid response when I don’t have enough energy to call out people with wack-ass conspiracy theories and hateful stuff.", "I love my friends so much!", "The fact that heterosexual men sexual lesbians makes me really mad", "I got on Twitter for like 10 minutes today to check notifications and I'm already mad. Are you happy Twitter?!", "I’ve been thinking about the power of theatre as an art form as a way that creatives cope with tragedies or historical events that are quite intense and I think it’s so cool. Every Wikipedia article I’ve read about some big tragedy has theatre under its popular culture category.", "Is it bad that I fantasize about some homophobe or some bully in the future when I'm an educator who I get to tell to knock it off?\n\nOr have I just been watching too much Glee?", "I can't wait to find love and prove to everyone I graduated with who is getting married that I could be happier and more fabulous than them.", "What if we in the world did the \"ouch\" \"oops\" thing that all those theatres in Chicago did?", "We love when you get a group email from work saying you need to improve, and then a follow-up email from your manager saying, \"except you, you're doing great\"\n\nThis is feeding my already very big ego.", "Why did America decide masks needed to be a political issue and to conspiracy theorize about it when it's harmful to not wear one?", "Update: I just told the person I snoozed that their petition to make masks NOT mandatory for schools was anti-vax level dangerous and unfounded so...\n\nhere's to possibly losing some dumbass on Facebook as a friend", "The Snooze for 30 days option on Facebook is my version of giving people on Facebook a time out for the stupid s#!t they say.", "very, every is also hilarious", "sometimes i think i might be straight/bisexual and then i see a gorgeous man and my brain reminds me saying \"hey adam, remember you're every gay\"", "i tried that name + color aesthetic facebook thing and all i found was vibrators", "RT @iashmcknight: I'm pissed at all of you selfish pricks who made it so now my education and career are at risk. Don't be selfish and just…", "here's some wholesomeness:\n\nbe like a Bristlecone pine\n\nthey can live to 4,600 years, but only in the harshest of climates", "tonight is a listen to breakaway and cry kinda night", "having two older sisters and mostly female friends showed me how easy being a man is and how the patriarchy needs to be dismantled", "thinking about my theatrical past and all the cringy stuff I did", "is anyone who makes those how to approach women videos actually in a healthy stable relationship?\n\nasking for a straight person", "here's your wholesomeness for the day:\n\nmy dad just taught me how to unclog a drain today", "Confession time:\n\nI can't do downward facing dog in a relaxed way without feeling kinda sweaty", "watch me single ladies myself into the ideal male body", "Some of us be allergic to plant semen", "The Hate U Give is on HBOMax.", "I finished The Hate U Give. I cried so hard. Watch it! If you want to know even an ounce of how the black community is hurting (to my friends who don't get it) just watch it.\nAlso, I signed up for the Utah chapter of Black Lives Matter. I'm mad I missed the protests, but I'm here", "I would like to reiterate that this isn't about me. These are my thoughts. It is my experience that gives me empathy for SOME of the bad things that black people can and have experienced. I'm fine. I'm privileged. Time to use it for good. https://t.co/Y0nVPCmlb8", "I posted these to my Snapchat. Please read the reply to this with the last two before making any comments. https://t.co/aUfbqjSyZH", "thinking about how many people on Facebook probably unfollowed me because they’re too afraid to unfriend me", "Me to all the toxic people in high-school https://t.co/NIC5gdTPIS", "Do you think straight men will ever understand the relationship between gay men and straight women?", "What are the realistic expectations of owning Clifford the Big Red Dog?", "i'm 99% sure that the cause of my sexual confusion growing up was Glee", "The fact that literally children are allowed on social media scares the feck out of me", "All these people be out here proudly shouting how they aren't wearing masks and are taking the chance like real proud in all these Facebook posts and I be out here just wanting school to start in the fall", "thinking about the irony of being cast as Sir Galahad in a script reading of Monty Python as a gay man", "RT @seywarddarby: This is my friend Ethan. He lost sight in one eye when a police officer shot a tear gas canister directly into his face w…", "and that not everyone will like me and that history is kinda fecked up", "I'm coming to the healthy realization that I can't please everyone", "thinking about how the high school in love, Simon was performing Cabaret", "Yo, it’s been over a year since I’ve come out and holy s#!t that was the hardest thing I think I’ve ever done", "So Love, Victor exists and I’m dying", "i might just be a good person but I don't get how people ever thought that another human was lesser", "old women being kinda horny for old attractive male actors is the aesthetic I need", "The fact that Idina Menzel doesn’t sing in Enchanted is a crime in of itself", "the first crime I'm commiting in the purge is tax fraud", "thinking about how I'm older than the actor who played Myron in Glee", "If Wicked exists in the Glee universe, why do both Kristin Chenoweth and Idina Mendel not appear as themselves??", "Albus Severus Potter and Scorpius Malfoy are gay... no debate (maybe Scorpius is bi)", "thinking about when Julie Andrews says \"shut up\" in The Princess Diaries 2: A Royal Engagement", "RT @Nickelodeon: we are all part of the change #blacklivesmatter\n✊🏿✊🏾✊🏽✊🏼✊🏻 https://t.co/Y3Fzvob54X", "have you ever thought about how much money you've wasted?", "it's bad that i could see myself owning every LEGO game made for the Xbox 360 within the next few months", "Hey you, yeah you, scrolling rn. Take a moment and either take a break or take a breath. You got this. Slow down. Take care of yourself. And maybe call your parents. They miss you and they're worried.", "RT @topher_skies: It’s been a while since I’ve taken time to appreciate my life and privilege. I don’t know a thing about how to help the m…", "when people text with extra consonants at the end what is that supposed to sound like? i'm curiousssssssssss", "catch me naming my first child after a Pokemon https://t.co/R6FTvhgxNx", "Hey @JaredDomino7, Thank you for the follow!", "let people learn from their past mistakes", "RT @madddiexo: i love when guys on dating apps ask  “how is a gorgeous girl like you single” I’m mentally ill, brandon", "RT @acnhtortuga: ✨ Star Fragments Giveaway ✨\n\n✨ regular &amp; large star fragments (25 each)\n\n2 winners will be chosen in 16 hours! \nto enter:…", "the fact you can't delete Facebook signs constantly reminds me when I made a whole page for turbo the snail", "I'm conflicted on whether or not the girl who tipped me $15 for delivering Postmates meant to do it or is very nice", "catch me in 2029 being depressed until the late 2030s", "my claim to fame when I was younger was knowing the rap part of \"Hasta La Vista\" from Camp Rock", "RT @acnhtortuga: ✨ small catalog party ✨\n\n✨ simple panels\n✨ soft-serve lamps\n✨ floor lights\n\nI'm excited to finally host a catalog party! j…", "RT @marshalsmaid: i'm bored so this is a\n\n⚡️flash giveaway⚡️\n\n1200 nook miles tickets ❤️\n3 winners ❤️\n\nrt + follow + tag a friend!\nends in…", "how do people get all those filters that tell them what they are? asking for a friend", "I'm crying https://t.co/CpMi08sI69", "@astro_chica 😎", "I would like having this knowledge https://t.co/cO2NlJ78f4", "except no men will do it with me 😩 https://t.co/5xrJAC7m0d", "Daytime-Adam is upset with midnight-Adam who decided that his super funny tweet idea would be better if tweeted in the morning, and now he can’t remember it.", "Did anyone else play a game called Pocket Frogs on the the first iPhone?", "yo, why tf were poe and finn not gay?", "Is performing the Laramie Project a good idea for high-school? Asking for a friend", "the irony of when i texted cute boys during church classes when i was younger", "@Amyjayyyyyyyyyy I get it, 100%", "Hey @that_bitch_1st, Thank you for the follow!", "Hey @not__hunter, Thank you for the follow!", "are straight people ok?", "RT @acnhtortuga: ✨ 100 NMTs Giveaway ✨\n\n1 winner will be chosen in 7 hours! \nto enter:\n🌹 must be following\n🌹 like &amp; rt\n🌹 reply your fave sh…", "Everyone to me before I was out: \"We've heard say, you are gay, night and day.\"\n\nMe: \"You go 'way\"", "All these boys asking about dream first dates. I haven't gone on too many because none of y'all will go so how TF am I supposed to know.", "Hey @nick_p_warner14, Thank you for the follow!", "RT @JaiLenJosey_: Ain’t nobody want this. https://t.co/FWDY5glNZE", "tonight's a listen to the \"pretend I'm something other than these broken parts\" part of \"Words Fail\" and cry kinda nights", "@LilliCooper @CBS @TheTonyAwards PLEASE!", "RT @LilliCooper: Hey @CBS Instead of a singalong, I’d LOVE to see a lineup of prior @TheTonyAwards performances. Anyone else?", "y'all, Disney didn't listen to 1920s musical theatre telling you to not get married after meeting a man for the first time and it shows", "Do I really have to be your dad and tell you to meet people you met on dating apps in public places ON THE DATING APP IN QUESTION?!", "Does any other out gay person love the feeling of having someone who doesn't know you're gay find out?", "if y'all haven't seen the Netflix movie The Half of It, then wtf are you doing rn?!?!?!", "today is a listen to the Glee version of \"cough syrup\" and cry in you bed kind a day", "klaine messed with my hopes of finding a soulmate at a young age", "the glow up that Blaine and Kurt had proved that queer people glow up after high school more than anyone else", "glee single-handedly made me think that i was the center of attention at all times", "is any other gay person jealous of the friendship that blaine and sam had in glee?", "the feelings I'm feeling from accidentally swiping left on tinder are making me consider buying tinder premium or whatever tf it is", "sometimes I turn from flirt to therapist in dating apps", "Hey @kenzma_12, Thank you for the follow!", "how did none of y'all know that C3-PO was gay", "thinking about Anakin killing an entire group because of his mother #MayThe4thBeWithYou", "Do you ever just think about Order 66?", "RT @onewiththehair: @adamdoestw just told me I am a comedic genius and honestly I have never felt SO validated 😭😤 https://t.co/Tv467y6aj3", "@roey_howell YESSSSSSSSS!!!!!!!!!!", "All these straight f-boys I graduated with be SUPER HORNY with each other.", "today's the day I need my entire family to get on TikTok so we can become a famous TikTok family", "I'm upgrading myself from gay best friend to gay husband with all this loyalty and support I've been giving", "I just got sad because some of my high school friends aren't friends with me anymore on social media and I want to talk to them.", "Hey @DevonOltmanns, Thank you for the follow!", "Quarantine got me almost adding women to the dating pool on my dating apps", "Sometimes I have to remember the words of my favorite stage manager:\n\"I just pretend like every decision I made was the right decision or I'm going to overthink it all\"", "You Can't Stop the Beat (Music Video)| #IsolatedNotAlone https://t.co/A3HwfZohE1 via @YouTube\n\nIf you were wondering I posted that video on here now you know. @waitwings", "So this might be old news but if you haven't ever watched @somegoodnews by @johnkrasinski then you freakin' better!", "I want to be the textbook author who thought of saying that Titanic the Musical \"sailed off with five Tonys.\"", "Yo, can we all learn how grammar works during this quarantine? Thank you.", "What if I find a boyfriend using Animal Crossing?", "A girl online from the southern hemisphere in Animal Crossing might be flirting with me and I'm too gay to know if she is and I'm scared.", "I'm watching a Broadway documentary and I started crying so that's my mental state.", "RT @DnDeej: Before you tweet, reply, or engage, consider the Craig Ferguson method and ask yourself these three things:\n\n- \"Does this need…", "Some people my age don't know how to use Zoom and I'm shook.", "So I'm posting this because I just got recommended a video on YouTube that makes me quite upset but people should know\nSchool shooter jokes, memes, videos where you're hiding and then there are gunshots and cries and pleads for life AREN'T FUNNY and are gross and disgusting. Stop", "RT @claudmp3: happy trans visibility day you’re valid af and don’t let anyone tell you otherwise!!!!!!", "@ma3chapman Dad and old man", "Am I the only one who takes off one ear-bud/half of the headphone when I'm trying to focus and listen to something at the same time.", "Hey update time: I'm feeling so much better. Sometimes anxieties about the world tend to excite all the other possibilities, plus I've been alone with my thoughts for too long. So that technically means I need to play more Animal Crossing or else I'll explode.", "@CoryThomps The small things.", "Quarantine Adam is not ok", "In the midst of the anxieties of the end of the world, I have to deal with the anxiety of wondering if I'm doing what I really want to do with my life and if I'm choosing the right major. I'm having a fun time in quarantine. 😟🙄😣", "So like I don't like to get political but even if you think it's not the truth or whatever you believe, understand that Coronavirus is affecting people. People can have mild causes, sure. But just like other illnesses we shouldn't try and spread it. There is no conspiracy so stop", "RT @Wordsmith161: So apparently one of my favorite YouTubers, @WaitWings , is making a video about Beetlejuice the Musical (the Musical the…", "@ABrightMonster #FindAlexBrightman2020 https://t.co/o5AUwGY4i4", "Hey @ABrightMonster make a NEW BEST FRIEND in @WaitWings and let us hear your Beetlejuice Story! #FindAlexBrightman2020", "My new goal in life is to be a part of a group of mom friends that sit around and drink wine and wear gorgeous sun hats and dresses sitting in lawn furniture in one of our rich husband's backyards.", "RT @colindross: Im really about to comment on EVERY SINGLE PERSONS SNAP STORY idc anymore", "I've shared too many of those Facebook sharing things for the entire time we'll be in this pandemic.", "The sheer anxiety that @onewiththehair had for me while I was having allergies randomly hit me like a truck is the type of anxious energy I need from all of my friends.\n\nSo step up!", "https://t.co/gOpyryydCA\n\nUm don't watch this unless you're @WaitWings \nThanks", "Why am I  jealous of those people that get mentioned in their friends' stories? Do I need to pick better friends?", "Stay safe and wash yo hands!", "I'm coining the term SFF for straight female friend.", "Does anyone know a job that needs someone who knows every American folk song?", "Does anyone know if I'm qualified for unemployment if I still live with my parents?", "I ordered Animal Crossing on Amazon cuz I thought it'd be here today...", "Today can officially stop existing.", "Today's list of offenses from the world to me:\nWoke up to an effing earthquake!\nCOVID-19 already got me having to stay inside\nAnxiety\nMy body effing hates me rn\n\nGuys my head hurt real bad and now my jaw hurts (I think I got some sinus problems) and now my stomach hurts", "Who wants to make \"It's The End Of The World As We Know It (And I Feel Fine)\" a chart-topper with me?", "So I think I made everything get worse with Coronavirus because my birthday wish was more sleep and now I get that because everything is canceled...", "BTW today was my birthday!", "I'm only getting on Twitter rn after not being on to tell my Script Analysis friends to DO YOUR DESIGN ANALYSIS ASSIGNMENTS LIKE RN!\n\nbye, luv you\nthanks for being awesome twitter\n(also my thank you for the follows and liking youtube videos are automatic) 🤘🖐️", "Hey @hyperhoff, Thank you for the follow!", "Hey @GladdenGracie, Thank you for the follow!", "If you've noticed all my tweets are gone, don't worry, it's for my own good. I'm starting over, but first I'm taking a break for my mental health. Thanks for actually reading my dumb too-frequent tweets. (If you want any of my pictures I tweeted DM me and when I get on I'll reply", "@ellieryanh I would say I'd take them, but I bought myself Oreos after my coworkers started talking about them Saturday and have already probably eaten a whole thing by myself.\n\nBut still..."]}