{"tweets": "#TheMaskedSinger is back tonight, and I can’t get over how talented this cast is. Kelly Marie Tran made history as the first Southeast Asian Disney princess. https://t.co/Ne5ynGhF7n .@MadisonBeer performed a dreamy cover for our #UndercoverCovers https://t.co/G1iqCCj1gN https://t.co/UFqIluefsr He may be retired from football, but @DrewBrees is about to be the GOAT of a totally new sport. https://t.co/SUwIqyrktj You’ll never guess which of these things is actually true about @UzoAduba. https://t.co/3g6sIWBmUA You've heard of \"Snakes on a Plane,\" I now present to you the sequel \"Snakes from the Ceiling.\" https://t.co/wacnf41dnJ @MahoneyEb I wish I could do something to take some of this pain away. Sending you all my love. This incredible couple left everything behind to be together, so we wanted to help them with their fresh start. https://t.co/RDes5qPcis Happy #NationalPuppyDay! This is the montage we all needed. https://t.co/1Lpd6npaWx Thank you to everyone who sent messages of love and support. Portia is doing much better and doesn’t miss that appendix at all. https://t.co/NMVhNFDODx As hard as @IAmSteveHarvey tries, he can’t find anything wrong with @MichaelB4Jordan. https://t.co/9IiqoxPS3E Happy birthday, @ReeseW. You make me so happy. https://t.co/Ww9xNfnIgq You, me, #GameofGames. 9/8c tonight. Do you have a gay headache? Have no fear, #TylenolGay is here. https://t.co/ywfy4Ie4eL If you’ve ever wondered what @TheKalenAllen would think about Chocolate Pasta, today is your day. #OMK https://t.co/4i8oVXa4Ht Hey, @LadyGaga and Bradley – @GarthBrooks and @TrishaYearwood still haven’t heard from you. https://t.co/FXdFbHnStZ You’ve seen her in #GinnyandGeorgia, now get to know the real Antonia Gentry. https://t.co/31NFaD6EBE This #MarchMadness, I’m rooting for Oregon, 'cause I love ducks. (The Kittens aren’t playing right?) Gotta get down on Friday. #TGIF https://t.co/GAhWHbDO2N My producer thinks she has a ghost in her house, so I sent my favorite ghostbuster... Andy. https://t.co/f0iuVzmXdt Happy birthday, @AdamLevine! Love from me and your girlfriend. https://t.co/CsYNhlb2ye .@KatieCouric slid into Speidi's DMs to meet their hummingbirds. @spencerpratt @heidimontag https://t.co/mpIpNpsco9 It's official – at @GwenStefani and @BlakeShelton's wedding, I'm the maid of honor and @MileyCyrus is gonna perform. https://t.co/2k8NAmxR18 Stop AAPI hate. Please watch my conversation with the incredible Moonlynn Tsai &amp; Yin Chang, then go to https://t.co/X3y29zuGtg to find out how you can help. #StopAsianHate https://t.co/KQOeFUAg6Y We cannot stand by and let this kind of hatred take more innocent lives. Recognize what’s happening. Stand up against it. #StopAsianHate https://t.co/8Gosx1m2RO Last week, the show lost our audio engineer, Terry Fountain. He worked with us every day for nearly two decades. He was one of the very best. Sending love to his family and ours. https://t.co/BpHRusYikb .@MichelleObama’s daughters are home, and all of her things are missing. https://t.co/LOUiKqdQnV I read somewhere that gay people are more prone to headaches. #TylenolGay https://t.co/E4D1O3VVXt Tomorrow, @MichelleObama is on. Hallelujah. https://t.co/dA1Ktip9BZ We didn’t need People magazine to tell us that @KyleChandler is sexy at every age. https://t.co/TEuCBmQn6u @Ashleyoutloud This is a very special young man. Good work, mom. We’re going live on YouTube during the taping of my show right now! Don’t miss us in the commercial breaks. https://t.co/6pDA5TSMzp An incredible performance of #Monsters by @AllTimeLow. https://t.co/Gyta6gUVzv You’ve all seen 8-year-old Alan Kim’s incredible #CriticsChoice acceptance speech, and now you can meet him on my show. https://t.co/gNGdMxTLwg I have so much love and respect for my friend, @DrewBrees. Congratulations on an amazing career. You made New Orleans very proud. #GameofGames is all new tonight! This is how I feel about it: 🤩🥳💃🏼 It’s 9am. It should be 8am. Why, why, why, why, why? #DaylightSavingsTime “Working in health care is so rewarding. It makes me feel so happy when I know I’ve made a difference in someone else’s life.” – #BreonnaTaylor\nBreonna should still be here. We honor her today and every day. https://t.co/ehBPFe1uVV Well, #LightningCrotch was definitely not on my bingo card of what our guest host @BrookeBaldwin would be discussing with @HilaryDuff. https://t.co/I4F890z55E .@MarenMorris is always fighting for what's right. https://t.co/jOy9oVUxPk It’s been 14 years since this happened, and it always makes me laugh. https://t.co/n90BuVSgrZ Jennifer Garner finally got her ears pierced! https://t.co/cZ7tJSXQjl If you’ve ever signed up for a game so your friend could get five gold coins or a ruby prize box, I see you. You are the true spirit of friendship. Have you ever regretted a tattoo? I bet not as much as these people have. https://t.co/tmEQmBXotz We have so far to go, but how far we’ve come is incredible. Thank you to all the nurses, doctors, scientists, delivery drivers, volunteers, and more who got us here. https://t.co/uFa0YiIPtM If you wanna know why Andy said, “Justin Bieber has a beautiful tooth, but he’s weak,” watch this. https://t.co/MA4yWWHUi8 It’s raining in Los Angel––nope, it’s over. #LARain RT @andylassner: Reminder that people with mental health issues can carry on and function and appear to you like nothing is wrong. Rosamund Pike buries her awards in her backyard. You heard me. https://t.co/HEqvJhcGRs @TerrieRucker1 Hey that’s my mom’s name, too! Happy birthday, Betty❤️ I got to meet the woman who found an apartment behind her mirror… and I had a surprise for her behind my mirror. https://t.co/StWcJVOpGT https://t.co/z17GsIDTWW .@TaylorSwift13 got @JesseTyler quite the baby gift. https://t.co/wHFGvKB7Y7 There is absolutely no filter on our show #LadyParts. A new episode will be live on Wednesday with @KourtneyKardash and @KhloeKardashian. https://t.co/ugG8g22lLc https://t.co/0cfrrvEyvx We’ve been having so much fun on set going live on YouTube during commercial breaks! It’s my new favorite. Catch us on YouTube on Mondays to win prizes and see us live behind the scenes. https://t.co/sYFTTW90H2 https://t.co/mbEF1uO72v Happy #InternationalWomensDay. I feel so lucky to have met and spoken with some incredible women. https://t.co/afEM1JvLbC .@Pascual777 tweeted me, and I had him on the show. I didn’t realize he would end up being one of my favorite teachers of all time. https://t.co/XdynQCwg6v .@JheneAiko and @BigSean are #Grammys couple goals. https://t.co/lzHvIytnCv #InternationalWomensDay ❤️ https://t.co/aO3df6oBWc Come for the slime, stay for the crime. #GameofGames and #GoodGirls are back to back tonight starting at 9pm. https://t.co/PFxymxtkYC What’s everybody watching right now? Look What You’ve Done, @ZaraLarsson. Blown us all away. https://t.co/mO7Q01dkg2 Randall Park doesn’t know why there was an alpaca at the Emmys either. https://t.co/3clF03tfZn My anaconda don’t. #TBT https://t.co/Xme56Z5Xwf #GameofGames is all-new on Sundays! So I played #BurstOfKnowledge on the show today with 3 of my favorite people. https://t.co/ELv2SWnsZq Who’s watching the #WandaVisionFinale? Not even @Paul_Bettany fully understands #WandaVision. https://t.co/L8R3PBOezb I want to live on @Maluma’s farm. https://t.co/jfpdrc1Vdq .@Maluma is here tomorrow to discuss his showering habits. Don't miss it. https://t.co/NKQ7ZGOIjd Best friends @MelissaMcCarthy and @OctaviaSpencer tricked these two best friends. They tricked ‘em good. https://t.co/8E4uMSZQlO Do you wanna play games with @KristenBell and @DaxShepard? Apply to be on #FamilyGameFight here: https://t.co/yAPu6lRwhp https://t.co/fKHOd3e4EW Happy #WorldWildlifeDay! Meeting Jane Goodall is still one of the highlights of my life. https://t.co/yplMYbkwko .@MelissaMcCarthy and @OctaviaSpencer are best friends in this new movie, and I get to show you the trailer! Here's #ThunderForce! https://t.co/h8AJn1uSla I love how much Eddie Murphy’s daughters love @LeoDiCaprio. https://t.co/MoaORKXC6J I met a couple who opened their home to a stranded delivery driver for five nights during the winter storm in Texas, and I had to share it with you. https://t.co/9Vb9HUUI1k Thanks for taking over hosting duties today, @HowieMandel! The #HowieDoesStuff Podcast hosted by Howie and @JackelynShultz premieres Tuesday, March 16 and is available on all platforms. We’re live on YouTube right now from the set of my show during our commercial breaks! https://t.co/nHotHjp7lY ❤️ @TheLeslieJordan, I’m glad you were on my show then, and I’m glad you’re on my show today. https://t.co/jT0vzObcyy .@HeidiKlum’s daughter is following in her footsteps. https://t.co/ipVrdQ6Z4h https://t.co/nUEPoQgXyl .@HowieMandel guest hosted my show today. From his driveway. I’m not kidding. https://t.co/Gbz6nFfl3M Happy birthday @JustinBieber! https://t.co/pdKuBZva7t .@theLeslieJordan is going to be here tomorrow! You really don’t wanna miss it. https://t.co/vdGA7eWVpG .@TheKalenAllen is back with Part 2 of Giving Back While Buying Black, with a VERY special healthcare worker! https://t.co/wnJDbOXGol You just made my day❤️ https://t.co/bEDw8FwrVG .@TiffanyHaddish asked @TayeDiggs some pretty racy stuff on today’s show. So this is what goes on when I’m not around. #BurningQuestions https://t.co/MeKHkt1ul8 @USCSchPharmacy @andylassner Thank you so much for all that you do❤️ I love @ArianaGrande, and her favorite cafe is my new favorite too. They’re doing the most incredible things for their community. @southlacafe https://t.co/Li2uZlR3ur Who wants pancakes? Use code ELLEN to get a free stack of pancakes at https://t.co/frLhIB63N4 this weekend! I went to Dodger Stadium this week to surprise these incredible frontline workers – with the help of some friends. https://t.co/ZP2A1mdt7l .@JaneFonda is vaccinated, glowing, and only getting better with age. https://t.co/7gn1IAWM48 I wasn’t done surprising this incredible principal. https://t.co/xP9eKRnh8i Founder of @ItCosmetics @JamieKernLima's incredible story is the motivation you need this week. https://t.co/M58M9DjnSS Everything is bigger in Texas, even the checks. Thank you so much for this incredible donation, @HEB. #ThanksSponsor https://t.co/azuW1yFPs7 @pascual777 Show your students this tweet and let them know that Ellen is a personal friend😉 .@ColinJost told me about the effect that @RegeJean had on the #SNL audience. https://t.co/ni4lmbbIAu If I can get @MaryJBlige to say “cactus” during our interview, the audience gets a prize. https://t.co/j5zfU57HhZ I found “I Don’t Know How But They Found Me”! They were right here on my show. #IDKHOWONELLEN @idkhow https://t.co/I8RxHqGee7 NASA lands a rover on Mars, I land a joke. Potato Po-tah-to. https://t.co/DbvnBQR6Ni Not to be Blunt, but it’s a very special Emily’s birthday today! https://t.co/X3olEgGztI Congratulations! Did I miss my chance to get a croissant? https://t.co/CRFQA1Sf7A .@DDLovato is no longer dating the person who convinced her to go skydiving. https://t.co/jpTRN4CcAH #GameofGames is back tonight! This is a really good one. We should all try to love ourselves the way this 3-year-old does. https://t.co/8eSIMj1CbF https://t.co/ucprAVTv9O @news8michelle I’m glad you learned something. Consider yourself one of the #GameofGames alumnuses. It's #NationalMargaritaDay! I'm celebrating a little early... and by early, I mean I started in June. .@DDLovato is honest and brave, and I can’t wait to watch her new docuseries. https://t.co/NPMwenfRFQ Happy birthday, @Rihanna! I love you more and more each year. https://t.co/REb7Y1H5JB Happy Black History Month! @theKalenAllen is Giving Back While Buying Black, this week on #OMKalen. https://t.co/tW4QlPBMHx Today is #NationalLoveYourPetDay, and I’ll use any excuse to show mine off. https://t.co/IeASsjdJ4z .@TracyMorgan does not like being impersonated, which @TiffanyHaddish and @IAmDeanEdwards found out the hard way. https://t.co/rOGIeDwOIA What are we all supposed to do with all of these coloring books we colored at the beginning of the pandemic? .@TiffanyHaddish and @YO_RandyJackson discussed their dramatic weight loss. https://t.co/bERfhMlgFt I’m so glad that was a magic trick... @ActuallyNPH #DrawerDash https://t.co/xMRr2nxs2q The secret is out – @GabrielleDoug is #CottonCandyMask and the winner of #TheMaskedDancer! https://t.co/2jAQ7H6Km3 My show does not have enough dinosaur facts. I can’t think of two women I respect more than @SerenaWilliams and @NaomiOsaka. Congratulations Naomi! #ausopen #TulipMask has been a great dancer through and through. #TheMaskedDancer Who’s it going to be? I’m so excited. #TheMaskedDancer .@MariaBakalova96 from #Borat is bravely breaking boundaries, one follicle at a time. https://t.co/jxprQgVNaM Tonight is #TheMaskedDancer finale! Don’t miss it, because I’ll have the winner on my show tomorrow. Happy birthday and congratulations, @ParisHilton! It feels like just yesterday we were two girls up in the club. https://t.co/6Xo15ejPmP .@KenanThompson gave us some news about @JustinBieber today. https://t.co/bDpZaEPY1c “I forget that I have cancer when I see those smiling faces.” –Kelly Klein https://t.co/xgejS9DtPs Congratulations, @Meghan_Trainor and @DarylSabara, on your new little spy kid! .@AllisonBJanney would like to touch a man, a dog, and a pie. Who can relate? #5SecondRule https://t.co/GeMqJ0YjlW So many people are without power because of the storms. Check on your neighbors. If you can help someone in need, I hope you will. We can’t hold each other’s hands right now, but I hope this rendition of “I Wanna Hold Your Hand” will help tide you over. https://t.co/AsNILegnIB I finally got @TheKalenAllen and my producer Matt to play #TasteBuds today. Don’t miss a new episode of #GameofGames tonight on NBC. https://t.co/NlJfJqHNIP 5-year-old JJ Kim asks Alexa for @Lin_Manuel’s phone number every day. Today, I finally connected them. https://t.co/rpQXXcJfju Please join me for a game of \"Did @OfficialKat Tweet That?\" https://t.co/k0BsmfQXAY Portia was born in Australia, and I was born in New Orleans on Australia Day. I knew we were meant to be together. I love you, @PortiaDeRossi #HappyValentinesDay https://t.co/AZwm2xwAfk Whoever gets @TheKalenAllen and @Bomanizer as their Valentine is VERY lucky! https://t.co/niZuG83Dh3 Sending love to Ashley Judd. I love the work you’re doing and I’m praying for your recovery. Now this is a love story to get you into the Valentine’s Day spirit. https://t.co/90KJiw1YaO .@Ciara and @DangeRussWilson are the definition of a power couple. https://t.co/1b7Y5DO7pV You don’t invest in a new mattress if you aren’t feeling good about your marriage. – @IamWandaSykes wisdom https://t.co/TgI3aisNh3 Jennifer Aniston, you are one of a kind. I love you. Happy birthday. https://t.co/52hi0Zt7WT This is one of my favorite “how it started/how it’s going” stories yet. @Jax https://t.co/SpPRf3uZsM Happy #WomenInScience Day! https://t.co/Qf27iLh3js @Jax I really loved meeting you. #TheMaskedDancer is on tonight, so today I decided to premiere my new show called #TheMaskedZoomer. Any guesses? https://t.co/GigAaEr3Wt I can’t wait for @AndersonCooper’s little guy to grow up and look just like him. https://t.co/xDnjhLpVyE https://t.co/M6bWIMM3qv Happy birthday to my friend @LauraDern! Why are you so dern cool? https://t.co/QYM49qi39n This is me the whole time when I watch @Jeopardy: @AndersonCooper https://t.co/ThorCTwqkF This was a lot of fun. Thanks for having us, @People magazine. https://t.co/Nb8haByjCy What do you get when you have a mom who is a frontline worker and a dad who is dedicated to community outreach? Two incredible kids and a surprise from us at the Ellen Show.❤️ https://t.co/S3eq76OMIf Mila Kunis told me how her #SuperBowl commercial with @AplusK happened. https://t.co/UDhz7f1Pds Business on top, PJs on the bottom. #WFH https://t.co/ISScL0VD1o Happy birthday, @MichaelB4Jordan! I love you, and I know I’m not alone. https://t.co/F79QksKq3A #GameofGames is on tonight! I couldn’t wait, so I played #DangerWord with my producers today. https://t.co/qOPFM0VsI2 @ChrystalWRox I’m so sorry. Sometimes coming out doesn’t go the way you want, but that doesn’t mean that the rest of your life can’t. I’m standing with you. I know lots of other people will too. This principal goes all out for his school, so we went all out for him. https://t.co/3qIvflBmoT https://t.co/zAlvn3hzJO .@ChrissyTeigen and I talked about grief and the ways it changes you.❤️ https://t.co/Yu6bejp8tP Pregame #SuperBowl https://t.co/SqnPr6xBFy Saturdays belong to @TheKalenAllen. #OMK https://t.co/IgEbuv8HRk .@HarryMack can freestyle rap about anything, no matter what I pull out of this basket. https://t.co/bm3Kam9m2x I remember talking with Christopher Plummer about his film “Beginners.” I’m so glad I had the chance to offer him this toast. Sending love to his family. https://t.co/PxcxVtxMBo RT @BerniceKing: Praying for Trayvon Martin’s parents, Sybrina Fulton and Tracy Martin. 🙏🏾 https://t.co/o6HR5hti0l Happy #NationalWeatherpersonsDay to all of my meteorologists out there holding it together. #WFH https://t.co/tko13iIM4A #KansasCityChiefs fan @EricStonestreet and I surprised this #Buccaneers superfan teacher with #SuperBowl tickets. Oh, it’s on. https://t.co/oAkvpmVwUa Meg @TheeStallion didn’t stop at surprising my audience – she went above and beyond to help me surprise this frontline worker too. https://t.co/ScQoG81fMB I loved talking with TJ Osbourne❤️ @brothersosborne https://t.co/FhNQViAO7T #ExoticBirdMask might have been my favorite performance of the night. #TheMaskedDancer These #ZebraMask clues aren’t helping me narrow it down… any ideas? #TheMaskedDancer It makes me sore just watching #TulipMask do the splits. #TheMaskedDancer Who will be unmasked next? Don’t miss the @MaskedDancerFOX tonight at 8/7c! #TheMaskedDancer The #SuperBowl just won’t be the same this year. Partially because of COVID-19, partially because Andy won’t be there to perform. https://t.co/bHyS5WCgX2 #NGWSD National Girls &amp; Women in Sports Day reminded me of these incredible athletes today. https://t.co/sPRpYYl0bw @TiffanyDCross To be fair, I never call your mom during your show. @kirstin_97 Happy birthday Claire❤️❤️❤️ The arrival of Eric and Amanda Stevens’ baby girl sure was a moment worth celebrating. I love you both.❤️ #AxeALS @stevens_nation https://t.co/P8fikThE8W Rachel @Maddow told me about competing against Meryl Streep for a Grammy. https://t.co/KOhhQAlbTX Kane from #BlingEmpire told me about mouth massages and the Chinese zodiac today. https://t.co/KVzKJomsGn @LunaAmore14 ❤️ @mrhappyjoeyy ❤️ #GameofGames is on tonight! It’s a really good one. @keishalayne3 @Harry_Styles ❤️ I love @TraceeEllisRoss almost as much as she loves #Bridgerton. https://t.co/mjwKdJygGA Today marks the day we received the gift of @Harry_Styles. And what a gift it is. #HappyBirthdayHarry https://t.co/rx4fyP2zZ3 RT @aarutura: 9 ways you can celebrate Black History Month in 2021\n*While we are in a pandemic - A thread. .@KerryWashington, you are a light! Happy birthday! There are many great lakes, but none as great as @JTimberlake! Happy birthday, my friend.❤️ https://t.co/wYWGSIY1BZ Happy birthday to my favorite person in our quarantine bubble. I love you @portiaderossi❤️ https://t.co/oPunkoktUG It’s Saturday, y’all. @Official_tWitch @TheAmandaGorman https://t.co/G3qHvpOIiK Two Truths and a Lie: \n1. The @BellaTwins had their babies at the same time. \n2. The Bella Twins may come out of #WWE retirement.\n3. The Bella Twins switched names halfway through their lives. https://t.co/YXxhYJUu9N Happy birthday, @Oprah! My friendship with you is always one of my favorite things. https://t.co/oPlqIw3WOH Now @GarcelleB is 'The Real'-est Housewife. #RHOBH https://t.co/1OYlTT1idj The incredible UCLA gymnast @DennisNia talked to me about her viral video and it being posted by @MichelleObama. https://t.co/FPJ3xR9qpj I was so glad to give Skylar The Ellen DeGeneres Show &amp; Shutterfly Scholarship for Incredible Young Women from Loganville, Georgia Who Get into Duke with a 4.2 GPA and Want to Be a Marine Biotechnologist. https://t.co/c90TRETqPj .@LaverneCox found love in quarantine❤️ https://t.co/uA7z85cyzn For everyone who retweets this, Bell will donate 5 cents to Canadian Mental Health. I love that they do this every year. #BellLetsTalk I love this dad so much. https://t.co/Cqsos0FyEF https://t.co/l6gKH7Mv4y I loved that #ZebraMask performance! I also really love zebras, so I may be biased. #TheMaskedDancer #SlothMask is definitely a leading man of some sort. Not sure who just yet. #TheMaskedDancer Who does everyone think #ExoticBirdMask is?? I’m stuck between two people... #TheMaskedDancer Wear masks when you go out, and watch masks while staying in – #TheMaskedDancer is on Fox at 8/7c! Cloris Leachman played my mother on my second sitcom. I always considered myself lucky for having the chance to work with her. She will be missed. .@TedDanson is on my show today! It is NOT his birthday. (thanks, @TedDansonBday) https://t.co/Yx2IkgYT1d RT @HolocaustMuseum: Eight decades after the Holocaust began, people worldwide pause today—International #HolocaustRemembranceDay, the anni… .@TheAmandaGorman tells us everything we wanted to know... in #TheInternetNeedstoKnow https://t.co/882zUX1fhW Why haven’t we done this before?! #5SecondRule https://t.co/jvHC2Ou6hh This tweet is for @Lilly’s mom. https://t.co/E4dO7jtXb0 @meganmahaffey21 Happy birthday❤️ @bohemRhap Thank you❤️❤️❤️ @CCastelline Happy birthday❤️ I love @DaxShepard. I love his honesty. https://t.co/faWzJvDPLC @TheKalenAllen Thanks, Kalen! Please don’t make me a hotdog cake. Happy Birthday, George. He’s a nurse in Portland. Thanks for all you do. https://t.co/yevmAuHq3i @mrhappyjoeyy @TheAmandaGorman Thank you❤️ @tinkfly88 @TheAmandaGorman Thank you Susan❤️ @Brittan21552311 @TheAmandaGorman ❤️ .@TheAmandaGorman told me about running for president in 2036❤️ https://t.co/4kkJotlUj5 @lemos_day ❤️ @mascruggs3 ❤️ @eli_carr ❤️ @LeeWestwick Happy birthday❤️ @SavingGorillas ❤️ @StormyClaussen ❤️ @jenny_dachel Happy birthday!❤️ @youcanneverb ❤️ I wanna help parents explain to their kids what’s been going on, so I rewrote some classic children’s books. https://t.co/bqslqwkIve Don’t miss my new episode of #GameofGames tonight! Here’s a sneak peek. https://t.co/3fhmj9almR .@PriyankaChopra told me who her favorite Jonas Brother on TikTok is…and it’s not @NickJonas. https://t.co/MijvHYZX6U I am so excited that #OMKalen is back with all-new episodes, and this is the perfect week to have @Nabela! https://t.co/zg0YBZKIb4 I can think of few people in the world of television more iconic than Larry King. Sending love to his family and fans. @itsjojosiwa ❤️ The hilarious @MichelleButeau told me all about her standup special, her book, and the time she had to lie to @JLo. https://t.co/fKIP3chpXM It’s Aquarius season! I have no idea what that means. It definitely happened and it was definitely wonderful. https://t.co/jDOuNVHXxo Charles Barkley has a hot take on @Shaq. https://t.co/kuH6dMMJo0 RT @jtimberlake: Tonight, @AntClemons and I were deeply honored to perform our new song, BETTER DAYS, as a celebration of everything this a… When you have the perfect amount of milk and cereal left for one last bowl: https://t.co/VVajZFz0Yg Nothing like having sports announcer @Buck narrate viral videos. https://t.co/FshOD2z7Z8 I’m starting to understand why @Pharrell’s skincare line is sold out... https://t.co/iEKTX45ZOQ https://t.co/6OcTdwfY4d It’s the 21st day of the 21st year of the 21st century. Who wants to play some blackjack? Congratulations, Madam Vice President Kamala Harris, on making history. @VP https://t.co/OHejFs6CpR .@TheAmandaGorman’s words are still resonating in my mind. What an incredible moment. RT @JoeBiden: It’s a new day in America. These are some of my favorite kids we’ve had on the show. https://t.co/ak8jIMAabe This is one of the most impressive 15-year-olds I have ever met. #TIMEskidoftheyear @GitanjaliaRao https://t.co/z9pOV8eTHz Happy birthday, @DollyParton! I love you, and thanks for everything you’re doing to save our world. https://t.co/jBCSZ216iE .@HowieMandel actually took a call from his doctor in the middle of our interview. https://t.co/JbW3Zx95eQ #GameofGames is on tonight! Don’t miss the fun at 8/7c on NBC. You might’ve seen these incredible dancers around New York City during the pandemic. I love them. https://t.co/gQzNMK1Gx8 #MLKDay https://t.co/PaEXj6wpzn .@JTimberlake told me the name of his new baby! Don’t miss the full interview on my show tomorrow. https://t.co/grBQ9sls0S See you tomorrow. https://t.co/CWcL1aKABe Happy birthday, @BettyMWhite! You’re a miracle in every way. Happy birthday, @MichelleObama❤️. I miss you every single day. https://t.co/Ag8dVgPN9Q To start your weekend the right way, here’s @Official_tWitch surprising @Malik_Books. #SupportBlackOwnedBusinesses https://t.co/vRlkMnTOAk Sending you lots of birthday magic, @DrewBrees. I hope it carries through to this weekend. Anyone else? https://t.co/ltW4VBI0ta I met Kasen today. He gave me THAT look, and so much more. https://t.co/lIw98CKDeL https://t.co/KNFMAs0YcC Sharing this clip for anyone who’s in the pits. https://t.co/DmCy5H7MQF When he shows up as a paramedic, he can say, “I’m here, there’s noooooothing to fear.” Have you ever gotten drunk and legally changed your name to Celine Dion? Well, my guest today has. https://t.co/DFqdkp7Hdn Anybody else think they’re having a great hair day until they see themselves on Zoom? #MothMask has me completely stumped. Anyone have any thoughts? #TheMaskedDancer #CottonCandyMask is adorable. #TheMaskedDancer Loving all of the clues for #ZebraMask! Who could it be? It’s got to be either an athlete or a zebra... #TheMaskedDancer @1986Webber ❤️ #TheMaskedDancer is back! Tune in tonight at 8/7c on FOX. @Ghost_Voices ❤️❤️❤️ Happy birthday, @OfficialJLD. I hope it’s a peach. We didn’t finish my #12DaysofGiveaways last year, but nothing was gonna stop me! https://t.co/V1ViTbPrVp I’d like to talk about something positive… my COVID test. https://t.co/GaxsYekS2z @jerseyborn111 @nbcgameofgames Happy Birthday❤️ Here's a meme to brighten your Monday. #GameofGames is on tonight! https://t.co/KoXwmVb2Wl I hope you’re all doing okay and hanging in there the best you can.❤️ In the midst of a tragedy, so many incredible people stood up to help. #EugeneGoodmanIsAHero https://t.co/1257vclIOF Praying for Dre Happy birthday, @Diane_Keaton. I’m pretty sure I love you more than you love ice-cold red wine. https://t.co/T9aR9lksbw There are TWO new episodes of #GameofGames tonight. We’ve been training for this all year. https://t.co/xrgSpZ8NY9 @yessiem48 @TheKalenAllen Happy Birthday❤️ Happy birthday, @TheKalenAllen! The world is a better place with you in it. I love you. https://t.co/qhm0pjjWlk Two new episodes of #GameofGames are on tomorrow night. Set your DVR. Thanks, Portia. https://t.co/5NY04ZmCdu Happy birthday, @DaxShepard! I made this for you. https://t.co/DSmKOrY3Ki @pegvande ❤️❤️❤️ Happy New Year❤️\nI send you all love and good wishes for a safe and healthy 2021. RT @MaskedDancerFOX: Beak-cause we need to brush up on the clues, we're watching an encore presentation of #TheMaskedDancer tonight! 🦜 http…", "bag_of_tweets": ["#TheMaskedSinger is back tonight, and I can’t get over how talented this cast is.", "Kelly Marie Tran made history as the first Southeast Asian Disney princess. https://t.co/Ne5ynGhF7n", ".@MadisonBeer performed a dreamy cover for our #UndercoverCovers https://t.co/G1iqCCj1gN https://t.co/UFqIluefsr", "He may be retired from football, but @DrewBrees is about to be the GOAT of a totally new sport. https://t.co/SUwIqyrktj", "You’ll never guess which of these things is actually true about @UzoAduba. https://t.co/3g6sIWBmUA", "You've heard of \"Snakes on a Plane,\" I now present to you the sequel \"Snakes from the Ceiling.\" https://t.co/wacnf41dnJ", "@MahoneyEb I wish I could do something to take some of this pain away. Sending you all my love.", "This incredible couple left everything behind to be together, so we wanted to help them with their fresh start. https://t.co/RDes5qPcis", "Happy #NationalPuppyDay! This is the montage we all needed. https://t.co/1Lpd6npaWx", "Thank you to everyone who sent messages of love and support. Portia is doing much better and doesn’t miss that appendix at all. https://t.co/NMVhNFDODx", "As hard as @IAmSteveHarvey tries, he can’t find anything wrong with @MichaelB4Jordan. https://t.co/9IiqoxPS3E", "Happy birthday, @ReeseW. You make me so happy. https://t.co/Ww9xNfnIgq", "You, me, #GameofGames. 9/8c tonight.", "Do you have a gay headache? Have no fear, #TylenolGay is here. https://t.co/ywfy4Ie4eL", "If you’ve ever wondered what @TheKalenAllen would think about Chocolate Pasta, today is your day. #OMK https://t.co/4i8oVXa4Ht", "Hey, @LadyGaga and Bradley – @GarthBrooks and @TrishaYearwood still haven’t heard from you. https://t.co/FXdFbHnStZ", "You’ve seen her in #GinnyandGeorgia, now get to know the real Antonia Gentry. https://t.co/31NFaD6EBE", "This #MarchMadness, I’m rooting for Oregon, 'cause I love ducks. (The Kittens aren’t playing right?)", "Gotta get down on Friday. #TGIF https://t.co/GAhWHbDO2N", "My producer thinks she has a ghost in her house, so I sent my favorite ghostbuster... Andy. https://t.co/f0iuVzmXdt", "Happy birthday, @AdamLevine! Love from me and your girlfriend. https://t.co/CsYNhlb2ye", ".@KatieCouric slid into Speidi's DMs to meet their hummingbirds. @spencerpratt @heidimontag https://t.co/mpIpNpsco9", "It's official – at @GwenStefani and @BlakeShelton's wedding, I'm the maid of honor and @MileyCyrus is gonna perform. https://t.co/2k8NAmxR18", "Stop AAPI hate. Please watch my conversation with the incredible Moonlynn Tsai &amp; Yin Chang, then go to https://t.co/X3y29zuGtg to find out how you can help. #StopAsianHate https://t.co/KQOeFUAg6Y", "We cannot stand by and let this kind of hatred take more innocent lives. Recognize what’s happening. Stand up against it. #StopAsianHate https://t.co/8Gosx1m2RO", "Last week, the show lost our audio engineer, Terry Fountain. He worked with us every day for nearly two decades. He was one of the very best. Sending love to his family and ours. https://t.co/BpHRusYikb", ".@MichelleObama’s daughters are home, and all of her things are missing. https://t.co/LOUiKqdQnV", "I read somewhere that gay people are more prone to headaches. #TylenolGay https://t.co/E4D1O3VVXt", "Tomorrow, @MichelleObama is on. Hallelujah. https://t.co/dA1Ktip9BZ", "We didn’t need People magazine to tell us that @KyleChandler is sexy at every age. https://t.co/TEuCBmQn6u", "@Ashleyoutloud This is a very special young man. Good work, mom.", "We’re going live on YouTube during the taping of my show right now! Don’t miss us in the commercial breaks. https://t.co/6pDA5TSMzp", "An incredible performance of #Monsters by @AllTimeLow. https://t.co/Gyta6gUVzv", "You’ve all seen 8-year-old Alan Kim’s incredible #CriticsChoice acceptance speech, and now you can meet him on my show. https://t.co/gNGdMxTLwg", "I have so much love and respect for my friend, @DrewBrees. Congratulations on an amazing career. You made New Orleans very proud.", "#GameofGames is all new tonight! This is how I feel about it: 🤩🥳💃🏼", "It’s 9am. It should be 8am. Why, why, why, why, why? #DaylightSavingsTime", "“Working in health care is so rewarding. It makes me feel so happy when I know I’ve made a difference in someone else’s life.” – #BreonnaTaylor\nBreonna should still be here. We honor her today and every day. https://t.co/ehBPFe1uVV", "Well, #LightningCrotch was definitely not on my bingo card of what our guest host @BrookeBaldwin would be discussing with @HilaryDuff. https://t.co/I4F890z55E", ".@MarenMorris is always fighting for what's right. https://t.co/jOy9oVUxPk", "It’s been 14 years since this happened, and it always makes me laugh. https://t.co/n90BuVSgrZ", "Jennifer Garner finally got her ears pierced! https://t.co/cZ7tJSXQjl", "If you’ve ever signed up for a game so your friend could get five gold coins or a ruby prize box, I see you. You are the true spirit of friendship.", "Have you ever regretted a tattoo? I bet not as much as these people have. https://t.co/tmEQmBXotz", "We have so far to go, but how far we’ve come is incredible. Thank you to all the nurses, doctors, scientists, delivery drivers, volunteers, and more who got us here. https://t.co/uFa0YiIPtM", "If you wanna know why Andy said, “Justin Bieber has a beautiful tooth, but he’s weak,” watch this. https://t.co/MA4yWWHUi8", "It’s raining in Los Angel––nope, it’s over. #LARain", "RT @andylassner: Reminder that people with mental health issues can carry on and function and appear to you like nothing is wrong.", "Rosamund Pike buries her awards in her backyard. You heard me. https://t.co/HEqvJhcGRs", "@TerrieRucker1 Hey that’s my mom’s name, too! Happy birthday, Betty❤️", "I got to meet the woman who found an apartment behind her mirror… and I had a surprise for her behind my mirror. https://t.co/StWcJVOpGT https://t.co/z17GsIDTWW", ".@TaylorSwift13 got @JesseTyler quite the baby gift. https://t.co/wHFGvKB7Y7", "There is absolutely no filter on our show #LadyParts. A new episode will be live on Wednesday with @KourtneyKardash and @KhloeKardashian. https://t.co/ugG8g22lLc https://t.co/0cfrrvEyvx", "We’ve been having so much fun on set going live on YouTube during commercial breaks! It’s my new favorite. Catch us on YouTube on Mondays to win prizes and see us live behind the scenes. https://t.co/sYFTTW90H2 https://t.co/mbEF1uO72v", "Happy #InternationalWomensDay. I feel so lucky to have met and spoken with some incredible women. https://t.co/afEM1JvLbC", ".@Pascual777 tweeted me, and I had him on the show. I didn’t realize he would end up being one of my favorite teachers of all time. https://t.co/XdynQCwg6v", ".@JheneAiko and @BigSean are #Grammys couple goals. https://t.co/lzHvIytnCv", "#InternationalWomensDay ❤️ https://t.co/aO3df6oBWc", "Come for the slime, stay for the crime. #GameofGames and #GoodGirls are back to back tonight starting at 9pm. https://t.co/PFxymxtkYC", "What’s everybody watching right now?", "Look What You’ve Done, @ZaraLarsson. Blown us all away. https://t.co/mO7Q01dkg2", "Randall Park doesn’t know why there was an alpaca at the Emmys either. https://t.co/3clF03tfZn", "My anaconda don’t. #TBT https://t.co/Xme56Z5Xwf", "#GameofGames is all-new on Sundays! So I played #BurstOfKnowledge on the show today with 3 of my favorite people. https://t.co/ELv2SWnsZq", "Who’s watching the #WandaVisionFinale?", "Not even @Paul_Bettany fully understands #WandaVision. https://t.co/L8R3PBOezb", "I want to live on @Maluma’s farm. https://t.co/jfpdrc1Vdq", ".@Maluma is here tomorrow to discuss his showering habits. Don't miss it. https://t.co/NKQ7ZGOIjd", "Best friends @MelissaMcCarthy and @OctaviaSpencer tricked these two best friends. They tricked ‘em good. https://t.co/8E4uMSZQlO", "Do you wanna play games with @KristenBell and @DaxShepard? Apply to be on #FamilyGameFight here: https://t.co/yAPu6lRwhp https://t.co/fKHOd3e4EW", "Happy #WorldWildlifeDay! Meeting Jane Goodall is still one of the highlights of my life. https://t.co/yplMYbkwko", ".@MelissaMcCarthy and @OctaviaSpencer are best friends in this new movie, and I get to show you the trailer! Here's #ThunderForce! https://t.co/h8AJn1uSla", "I love how much Eddie Murphy’s daughters love @LeoDiCaprio. https://t.co/MoaORKXC6J", "I met a couple who opened their home to a stranded delivery driver for five nights during the winter storm in Texas, and I had to share it with you. https://t.co/9Vb9HUUI1k", "Thanks for taking over hosting duties today, @HowieMandel! The #HowieDoesStuff Podcast hosted by Howie and @JackelynShultz premieres Tuesday, March 16 and is available on all platforms.", "We’re live on YouTube right now from the set of my show during our commercial breaks! https://t.co/nHotHjp7lY", "❤️ @TheLeslieJordan, I’m glad you were on my show then, and I’m glad you’re on my show today. https://t.co/jT0vzObcyy", ".@HeidiKlum’s daughter is following in her footsteps. https://t.co/ipVrdQ6Z4h https://t.co/nUEPoQgXyl", ".@HowieMandel guest hosted my show today. From his driveway. I’m not kidding. https://t.co/Gbz6nFfl3M", "Happy birthday @JustinBieber! https://t.co/pdKuBZva7t", ".@theLeslieJordan is going to be here tomorrow! You really don’t wanna miss it. https://t.co/vdGA7eWVpG", ".@TheKalenAllen is back with Part 2 of Giving Back While Buying Black, with a VERY special healthcare worker! https://t.co/wnJDbOXGol", "You just made my day❤️ https://t.co/bEDw8FwrVG", ".@TiffanyHaddish asked @TayeDiggs some pretty racy stuff on today’s show. So this is what goes on when I’m not around. #BurningQuestions https://t.co/MeKHkt1ul8", "@USCSchPharmacy @andylassner Thank you so much for all that you do❤️", "I love @ArianaGrande, and her favorite cafe is my new favorite too. They’re doing the most incredible things for their community. @southlacafe https://t.co/Li2uZlR3ur", "Who wants pancakes? Use code ELLEN to get a free stack of pancakes at https://t.co/frLhIB63N4 this weekend!", "I went to Dodger Stadium this week to surprise these incredible frontline workers – with the help of some friends. https://t.co/ZP2A1mdt7l", ".@JaneFonda is vaccinated, glowing, and only getting better with age. https://t.co/7gn1IAWM48", "I wasn’t done surprising this incredible principal. https://t.co/xP9eKRnh8i", "Founder of @ItCosmetics @JamieKernLima's incredible story is the motivation you need this week. https://t.co/M58M9DjnSS", "Everything is bigger in Texas, even the checks. Thank you so much for this incredible donation, @HEB. #ThanksSponsor https://t.co/azuW1yFPs7", "@pascual777 Show your students this tweet and let them know that Ellen is a personal friend😉", ".@ColinJost told me about the effect that @RegeJean had on the #SNL audience. https://t.co/ni4lmbbIAu", "If I can get @MaryJBlige to say “cactus” during our interview, the audience gets a prize. https://t.co/j5zfU57HhZ", "I found “I Don’t Know How But They Found Me”! They were right here on my show. #IDKHOWONELLEN @idkhow https://t.co/I8RxHqGee7", "NASA lands a rover on Mars, I land a joke. Potato Po-tah-to. https://t.co/DbvnBQR6Ni", "Not to be Blunt, but it’s a very special Emily’s birthday today! https://t.co/X3olEgGztI", "Congratulations! Did I miss my chance to get a croissant? https://t.co/CRFQA1Sf7A", ".@DDLovato is no longer dating the person who convinced her to go skydiving. https://t.co/jpTRN4CcAH", "#GameofGames is back tonight! This is a really good one.", "We should all try to love ourselves the way this 3-year-old does. https://t.co/8eSIMj1CbF https://t.co/ucprAVTv9O", "@news8michelle I’m glad you learned something. Consider yourself one of the #GameofGames alumnuses.", "It's #NationalMargaritaDay! I'm celebrating a little early... and by early, I mean I started in June.", ".@DDLovato is honest and brave, and I can’t wait to watch her new docuseries. https://t.co/NPMwenfRFQ", "Happy birthday, @Rihanna! I love you more and more each year. https://t.co/REb7Y1H5JB", "Happy Black History Month! @theKalenAllen is Giving Back While Buying Black, this week on #OMKalen. https://t.co/tW4QlPBMHx", "Today is #NationalLoveYourPetDay, and I’ll use any excuse to show mine off. https://t.co/IeASsjdJ4z", ".@TracyMorgan does not like being impersonated, which @TiffanyHaddish and @IAmDeanEdwards found out the hard way. https://t.co/rOGIeDwOIA", "What are we all supposed to do with all of these coloring books we colored at the beginning of the pandemic?", ".@TiffanyHaddish and @YO_RandyJackson discussed their dramatic weight loss. https://t.co/bERfhMlgFt", "I’m so glad that was a magic trick... @ActuallyNPH #DrawerDash https://t.co/xMRr2nxs2q", "The secret is out – @GabrielleDoug is #CottonCandyMask and the winner of #TheMaskedDancer! https://t.co/2jAQ7H6Km3", "My show does not have enough dinosaur facts.", "I can’t think of two women I respect more than @SerenaWilliams and @NaomiOsaka. Congratulations Naomi! #ausopen", "#TulipMask has been a great dancer through and through. #TheMaskedDancer", "Who’s it going to be? I’m so excited. #TheMaskedDancer", ".@MariaBakalova96 from #Borat is bravely breaking boundaries, one follicle at a time. https://t.co/jxprQgVNaM", "Tonight is #TheMaskedDancer finale! Don’t miss it, because I’ll have the winner on my show tomorrow.", "Happy birthday and congratulations, @ParisHilton! It feels like just yesterday we were two girls up in the club. https://t.co/6Xo15ejPmP", ".@KenanThompson gave us some news about @JustinBieber today. https://t.co/bDpZaEPY1c", "“I forget that I have cancer when I see those smiling faces.” –Kelly Klein https://t.co/xgejS9DtPs", "Congratulations, @Meghan_Trainor and @DarylSabara, on your new little spy kid!", ".@AllisonBJanney would like to touch a man, a dog, and a pie. Who can relate? #5SecondRule https://t.co/GeMqJ0YjlW", "So many people are without power because of the storms. Check on your neighbors. If you can help someone in need, I hope you will.", "We can’t hold each other’s hands right now, but I hope this rendition of “I Wanna Hold Your Hand” will help tide you over. https://t.co/AsNILegnIB", "I finally got @TheKalenAllen and my producer Matt to play #TasteBuds today. Don’t miss a new episode of #GameofGames tonight on NBC. https://t.co/NlJfJqHNIP", "5-year-old JJ Kim asks Alexa for @Lin_Manuel’s phone number every day. Today, I finally connected them. https://t.co/rpQXXcJfju", "Please join me for a game of \"Did @OfficialKat Tweet That?\" https://t.co/k0BsmfQXAY", "Portia was born in Australia, and I was born in New Orleans on Australia Day. I knew we were meant to be together. I love you, @PortiaDeRossi #HappyValentinesDay https://t.co/AZwm2xwAfk", "Whoever gets @TheKalenAllen and @Bomanizer as their Valentine is VERY lucky! https://t.co/niZuG83Dh3", "Sending love to Ashley Judd. I love the work you’re doing and I’m praying for your recovery.", "Now this is a love story to get you into the Valentine’s Day spirit. https://t.co/90KJiw1YaO", ".@Ciara and @DangeRussWilson are the definition of a power couple. https://t.co/1b7Y5DO7pV", "You don’t invest in a new mattress if you aren’t feeling good about your marriage. – @IamWandaSykes wisdom https://t.co/TgI3aisNh3", "Jennifer Aniston, you are one of a kind. I love you. Happy birthday. https://t.co/52hi0Zt7WT", "This is one of my favorite “how it started/how it’s going” stories yet. @Jax https://t.co/SpPRf3uZsM", "Happy #WomenInScience Day! https://t.co/Qf27iLh3js", "@Jax I really loved meeting you.", "#TheMaskedDancer is on tonight, so today I decided to premiere my new show called #TheMaskedZoomer. Any guesses? https://t.co/GigAaEr3Wt", "I can’t wait for @AndersonCooper’s little guy to grow up and look just like him. https://t.co/xDnjhLpVyE https://t.co/M6bWIMM3qv", "Happy birthday to my friend @LauraDern! Why are you so dern cool? https://t.co/QYM49qi39n", "This is me the whole time when I watch @Jeopardy: @AndersonCooper https://t.co/ThorCTwqkF", "This was a lot of fun. Thanks for having us, @People magazine. https://t.co/Nb8haByjCy", "What do you get when you have a mom who is a frontline worker and a dad who is dedicated to community outreach? Two incredible kids and a surprise from us at the Ellen Show.❤️ https://t.co/S3eq76OMIf", "Mila Kunis told me how her #SuperBowl commercial with @AplusK happened. https://t.co/UDhz7f1Pds", "Business on top, PJs on the bottom. #WFH https://t.co/ISScL0VD1o", "Happy birthday, @MichaelB4Jordan! I love you, and I know I’m not alone. https://t.co/F79QksKq3A", "#GameofGames is on tonight! I couldn’t wait, so I played #DangerWord with my producers today. https://t.co/qOPFM0VsI2", "@ChrystalWRox I’m so sorry. Sometimes coming out doesn’t go the way you want, but that doesn’t mean that the rest of your life can’t. I’m standing with you. I know lots of other people will too.", "This principal goes all out for his school, so we went all out for him. https://t.co/3qIvflBmoT https://t.co/zAlvn3hzJO", ".@ChrissyTeigen and I talked about grief and the ways it changes you.❤️ https://t.co/Yu6bejp8tP", "Pregame #SuperBowl https://t.co/SqnPr6xBFy", "Saturdays belong to @TheKalenAllen. #OMK https://t.co/IgEbuv8HRk", ".@HarryMack can freestyle rap about anything, no matter what I pull out of this basket. https://t.co/bm3Kam9m2x", "I remember talking with Christopher Plummer about his film “Beginners.” I’m so glad I had the chance to offer him this toast. Sending love to his family. https://t.co/PxcxVtxMBo", "RT @BerniceKing: Praying for Trayvon Martin’s parents, Sybrina Fulton and Tracy Martin. 🙏🏾 https://t.co/o6HR5hti0l", "Happy #NationalWeatherpersonsDay to all of my meteorologists out there holding it together. #WFH https://t.co/tko13iIM4A", "#KansasCityChiefs fan @EricStonestreet and I surprised this #Buccaneers superfan teacher with #SuperBowl tickets. Oh, it’s on. https://t.co/oAkvpmVwUa", "Meg @TheeStallion didn’t stop at surprising my audience – she went above and beyond to help me surprise this frontline worker too. https://t.co/ScQoG81fMB", "I loved talking with TJ Osbourne❤️ @brothersosborne https://t.co/FhNQViAO7T", "#ExoticBirdMask might have been my favorite performance of the night. #TheMaskedDancer", "These #ZebraMask clues aren’t helping me narrow it down… any ideas? #TheMaskedDancer", "It makes me sore just watching #TulipMask do the splits. #TheMaskedDancer", "Who will be unmasked next? Don’t miss the @MaskedDancerFOX tonight at 8/7c! #TheMaskedDancer", "The #SuperBowl just won’t be the same this year. Partially because of COVID-19, partially because Andy won’t be there to perform. https://t.co/bHyS5WCgX2", "#NGWSD", "National Girls &amp; Women in Sports Day reminded me of these incredible athletes today. https://t.co/sPRpYYl0bw", "@TiffanyDCross To be fair, I never call your mom during your show.", "@kirstin_97 Happy birthday Claire❤️❤️❤️", "The arrival of Eric and Amanda Stevens’ baby girl sure was a moment worth celebrating. I love you both.❤️ #AxeALS @stevens_nation https://t.co/P8fikThE8W", "Rachel @Maddow told me about competing against Meryl Streep for a Grammy. https://t.co/KOhhQAlbTX", "Kane from #BlingEmpire told me about mouth massages and the Chinese zodiac today. https://t.co/KVzKJomsGn", "@LunaAmore14 ❤️", "@mrhappyjoeyy ❤️", "#GameofGames is on tonight! It’s a really good one.", "@keishalayne3 @Harry_Styles ❤️", "I love @TraceeEllisRoss almost as much as she loves #Bridgerton. https://t.co/mjwKdJygGA", "Today marks the day we received the gift of @Harry_Styles. And what a gift it is. #HappyBirthdayHarry https://t.co/rx4fyP2zZ3", "RT @aarutura: 9 ways you can celebrate Black History Month in 2021\n*While we are in a pandemic - A thread.", ".@KerryWashington, you are a light! Happy birthday!", "There are many great lakes, but none as great as @JTimberlake! Happy birthday, my friend.❤️ https://t.co/wYWGSIY1BZ", "Happy birthday to my favorite person in our quarantine bubble. I love you @portiaderossi❤️ https://t.co/oPunkoktUG", "It’s Saturday, y’all. @Official_tWitch @TheAmandaGorman https://t.co/G3qHvpOIiK", "Two Truths and a Lie: \n1. The @BellaTwins had their babies at the same time. \n2. The Bella Twins may come out of #WWE retirement.\n3. The Bella Twins switched names halfway through their lives. https://t.co/YXxhYJUu9N", "Happy birthday, @Oprah! My friendship with you is always one of my favorite things. https://t.co/oPlqIw3WOH", "Now @GarcelleB is 'The Real'-est Housewife. #RHOBH https://t.co/1OYlTT1idj", "The incredible UCLA gymnast @DennisNia talked to me about her viral video and it being posted by @MichelleObama. https://t.co/FPJ3xR9qpj", "I was so glad to give Skylar The Ellen DeGeneres Show &amp; Shutterfly Scholarship for Incredible Young Women from Loganville, Georgia Who Get into Duke with a 4.2 GPA and Want to Be a Marine Biotechnologist. https://t.co/c90TRETqPj", ".@LaverneCox found love in quarantine❤️ https://t.co/uA7z85cyzn", "For everyone who retweets this, Bell will donate 5 cents to Canadian Mental Health. I love that they do this every year. #BellLetsTalk", "I love this dad so much. https://t.co/Cqsos0FyEF https://t.co/l6gKH7Mv4y", "I loved that #ZebraMask performance! I also really love zebras, so I may be biased. #TheMaskedDancer", "#SlothMask is definitely a leading man of some sort. Not sure who just yet. #TheMaskedDancer", "Who does everyone think #ExoticBirdMask is?? I’m stuck between two people... #TheMaskedDancer", "Wear masks when you go out, and watch masks while staying in – #TheMaskedDancer is on Fox at 8/7c!", "Cloris Leachman played my mother on my second sitcom. I always considered myself lucky for having the chance to work with her. She will be missed.", ".@TedDanson is on my show today! It is NOT his birthday. (thanks, @TedDansonBday) https://t.co/Yx2IkgYT1d", "RT @HolocaustMuseum: Eight decades after the Holocaust began, people worldwide pause today—International #HolocaustRemembranceDay, the anni…", ".@TheAmandaGorman tells us everything we wanted to know... in #TheInternetNeedstoKnow https://t.co/882zUX1fhW", "Why haven’t we done this before?! #5SecondRule https://t.co/jvHC2Ou6hh", "This tweet is for @Lilly’s mom. https://t.co/E4dO7jtXb0", "@meganmahaffey21 Happy birthday❤️", "@bohemRhap Thank you❤️❤️❤️", "@CCastelline Happy birthday❤️", "I love @DaxShepard. I love his honesty. https://t.co/faWzJvDPLC", "@TheKalenAllen Thanks, Kalen! Please don’t make me a hotdog cake.", "Happy Birthday, George. He’s a nurse in Portland. Thanks for all you do. https://t.co/yevmAuHq3i", "@mrhappyjoeyy @TheAmandaGorman Thank you❤️", "@tinkfly88 @TheAmandaGorman Thank you Susan❤️", "@Brittan21552311 @TheAmandaGorman ❤️", ".@TheAmandaGorman told me about running for president in 2036❤️ https://t.co/4kkJotlUj5", "@lemos_day ❤️", "@mascruggs3 ❤️", "@eli_carr ❤️", "@LeeWestwick Happy birthday❤️", "@SavingGorillas ❤️", "@StormyClaussen ❤️", "@jenny_dachel Happy birthday!❤️", "@youcanneverb ❤️", "I wanna help parents explain to their kids what’s been going on, so I rewrote some classic children’s books. https://t.co/bqslqwkIve", "Don’t miss my new episode of #GameofGames tonight! Here’s a sneak peek. https://t.co/3fhmj9almR", ".@PriyankaChopra told me who her favorite Jonas Brother on TikTok is…and it’s not @NickJonas. https://t.co/MijvHYZX6U", "I am so excited that #OMKalen is back with all-new episodes, and this is the perfect week to have @Nabela! https://t.co/zg0YBZKIb4", "I can think of few people in the world of television more iconic than Larry King. Sending love to his family and fans.", "@itsjojosiwa ❤️", "The hilarious @MichelleButeau told me all about her standup special, her book, and the time she had to lie to @JLo. https://t.co/fKIP3chpXM", "It’s Aquarius season! I have no idea what that means.", "It definitely happened and it was definitely wonderful. https://t.co/jDOuNVHXxo", "Charles Barkley has a hot take on @Shaq. https://t.co/kuH6dMMJo0", "RT @jtimberlake: Tonight, @AntClemons and I were deeply honored to perform our new song, BETTER DAYS, as a celebration of everything this a…", "When you have the perfect amount of milk and cereal left for one last bowl: https://t.co/VVajZFz0Yg", "Nothing like having sports announcer @Buck narrate viral videos. https://t.co/FshOD2z7Z8", "I’m starting to understand why @Pharrell’s skincare line is sold out... https://t.co/iEKTX45ZOQ https://t.co/6OcTdwfY4d", "It’s the 21st day of the 21st year of the 21st century. Who wants to play some blackjack?", "Congratulations, Madam Vice President Kamala Harris, on making history. @VP https://t.co/OHejFs6CpR", ".@TheAmandaGorman’s words are still resonating in my mind. What an incredible moment.", "RT @JoeBiden: It’s a new day in America.", "These are some of my favorite kids we’ve had on the show. https://t.co/ak8jIMAabe", "This is one of the most impressive 15-year-olds I have ever met. #TIMEskidoftheyear @GitanjaliaRao https://t.co/z9pOV8eTHz", "Happy birthday, @DollyParton! I love you, and thanks for everything you’re doing to save our world. https://t.co/jBCSZ216iE", ".@HowieMandel actually took a call from his doctor in the middle of our interview. https://t.co/JbW3Zx95eQ", "#GameofGames is on tonight! Don’t miss the fun at 8/7c on NBC.", "You might’ve seen these incredible dancers around New York City during the pandemic. I love them. https://t.co/gQzNMK1Gx8", "#MLKDay https://t.co/PaEXj6wpzn", ".@JTimberlake told me the name of his new baby! Don’t miss the full interview on my show tomorrow. https://t.co/grBQ9sls0S", "See you tomorrow. https://t.co/CWcL1aKABe", "Happy birthday, @BettyMWhite! You’re a miracle in every way.", "Happy birthday, @MichelleObama❤️. I miss you every single day. https://t.co/Ag8dVgPN9Q", "To start your weekend the right way, here’s @Official_tWitch surprising @Malik_Books. #SupportBlackOwnedBusinesses https://t.co/vRlkMnTOAk", "Sending you lots of birthday magic, @DrewBrees. I hope it carries through to this weekend.", "Anyone else? https://t.co/ltW4VBI0ta", "I met Kasen today. He gave me THAT look, and so much more. https://t.co/lIw98CKDeL https://t.co/KNFMAs0YcC", "Sharing this clip for anyone who’s in the pits. https://t.co/DmCy5H7MQF", "When he shows up as a paramedic, he can say, “I’m here, there’s noooooothing to fear.”", "Have you ever gotten drunk and legally changed your name to Celine Dion? Well, my guest today has. https://t.co/DFqdkp7Hdn", "Anybody else think they’re having a great hair day until they see themselves on Zoom?", "#MothMask has me completely stumped. Anyone have any thoughts? #TheMaskedDancer", "#CottonCandyMask is adorable. #TheMaskedDancer", "Loving all of the clues for #ZebraMask! Who could it be? It’s got to be either an athlete or a zebra... #TheMaskedDancer", "@1986Webber ❤️", "#TheMaskedDancer is back! Tune in tonight at 8/7c on FOX.", "@Ghost_Voices ❤️❤️❤️", "Happy birthday, @OfficialJLD. I hope it’s a peach.", "We didn’t finish my #12DaysofGiveaways last year, but nothing was gonna stop me! https://t.co/V1ViTbPrVp", "I’d like to talk about something positive… my COVID test. https://t.co/GaxsYekS2z", "@jerseyborn111 @nbcgameofgames Happy Birthday❤️", "Here's a meme to brighten your Monday. #GameofGames is on tonight! https://t.co/KoXwmVb2Wl", "I hope you’re all doing okay and hanging in there the best you can.❤️", "In the midst of a tragedy, so many incredible people stood up to help. #EugeneGoodmanIsAHero https://t.co/1257vclIOF", "Praying for Dre", "Happy birthday, @Diane_Keaton. I’m pretty sure I love you more than you love ice-cold red wine. https://t.co/T9aR9lksbw", "There are TWO new episodes of #GameofGames tonight. We’ve been training for this all year. https://t.co/xrgSpZ8NY9", "@yessiem48 @TheKalenAllen Happy Birthday❤️", "Happy birthday, @TheKalenAllen! The world is a better place with you in it. I love you. https://t.co/qhm0pjjWlk", "Two new episodes of #GameofGames are on tomorrow night. Set your DVR. Thanks, Portia. https://t.co/5NY04ZmCdu", "Happy birthday, @DaxShepard! I made this for you. https://t.co/DSmKOrY3Ki", "@pegvande ❤️❤️❤️", "Happy New Year❤️\nI send you all love and good wishes for a safe and healthy 2021.", "RT @MaskedDancerFOX: Beak-cause we need to brush up on the clues, we're watching an encore presentation of #TheMaskedDancer tonight! 🦜 http…"]}