{"tweets": "A SAVEIRO DOS SONHOS 👉🏻 https://t.co/bsklnuJma5 RT @emillyav_: Vão lá ver o júlio reagindo aos primeiros vídeos dele KKKKKKKKKKKKKK\n@cocielo\n\nhttps://t.co/bQN7aZMue8 RT @romenodefante: videoclip nou de tati piroca cu @cocielo ! Fericire!!!! \n\nhttps://t.co/mSlw8hvmCs RT @omarcelofaria: T3STICUL0 ELETRIZANTE!!! - SINUCASTIGO COM DIOGO DEFANTE! https://t.co/8t4DzxkUbE via @YouTube RT @AlemaoDefante: NEUES VIDEO MIT MEINEM FREUND @cocielo \n\nhttps://t.co/beJnf2C56B RT @InspiroTacielo: VÍDEO NOVO NO CANAL CANALHA!! (T3STICUL0 ELETRIZANTE!!! - SINUCASTIGO COM DIOGO DEFANTE!)\n\nAcho que nesse momento a Ter… RT @Law_Mateus42: T3STICUL0 ELETRIZANTE!!! - SINUCASTIGO COM DIOGO DEFANTE! https://t.co/aFMalQAzwn via @YouTube RT @mynameisCami_la: Esse vídeo ISHSUSJWKAKAJJAJAJAJAJAJAKQLAHWBZJAJ eu tô passando mal https://t.co/pQR3MARl7t RT @yGabiGol: T3STICUL0 ELETRIZANTE!!! - SINUCASTIGO COM DIOGO DEFANTE! https://t.co/TdDZibKgNZ via @YouTube \n\ntoda vez que eu vejo um víde… RT @kp_menez: Nunca ri tanto com um vídeo.\n@cocielo é fera d+ tu uma inspiração real. Te admiro muito. \nJá deixem seu like e se inscrevam l… RT @sennacamy: O @cocielo arrasou mais uma vez!\nVão no Canal Canalha e assistam  O Encontro de Away, Dileira &amp; Psiu- Tourettcast #2,está di… RT @yGabiGol: mais uma vez Júlio trazendo um conteúdo diferenciado para nossa alegria! outro obra prima para os melhores vídeos da internet… RT @GabrielnBoldo: O ENCONTRO DE AWAY, DILEIRA &amp; PSIU - TOURETTCAST #2 https://t.co/avTjttVA6k via @YouTube provavelmente se não for a melh… TCHÊ LENGO LENGO DO AMOR ❤️ https://t.co/zCUebEuDR6 RT @Matheus18658736: Aaaaah mano eu amo o @cocielo Puta que pariu https://t.co/DLbd4GjnQZ RT @Raqu3ls: Eu nunca falei mas uma das minhas maiores inspirações é o @cocielo,  sendo no futebol ou na vida. ele é um maluco incrível e i… RT @pedroripis: @cocielo,tá aí um cara que eu respeito demais, além de sempre fazer vídeos incríveis,também batalhou demais e sempre fez qu… RT @MateusRochaa3: @cocielo parabéns pelas suas conquistas, tô aqui a mó cota, na suavidade, vc é pika, vc merece @cocielo\n\nhttps://t.co/gZ… RT @emillyav_: Vão lá ver vídeo do Maior gamer do mundo KKKKKKKKKKKKKKKKKK\n@cocielo \nhttps://t.co/8LSjsS1NJj VÍDEO NOVO NO MEU CANAL DE FUTEBOL! LETÍCIA DESABAFOU E ME DEIXOU EMOCIONADO 🥺 https://t.co/BZmLmXLZK0 RT @brun0birk: Mano, melhor video da internet!! \n@cocielo  \nhttps://t.co/QmEYqCNj1y RT @yGabiGol: O ENCONTRO DE ALEK FUMASA, DILEIRA &amp; PSIU - TOURETTCAST #1 https://t.co/BVNrbnW96w via @YouTube  junto com \"O ÚLTIMO PRÍNCIPE… RT @Covalskii: Haushsushshsjsjahahahsu\nUauahahahauauusua\nHausjauauaua\nHauajauahahaua\nHauauauauauuajw\nHahahahahahahahahahahahahahahahhahahah… RT @Caio18Castro: Obrigado mestre @cocielo pelo melhor vídeo que já vi 🙌🙌🙌 https://t.co/ibtJSu4hi8 RT @IzidoroJu: pérola do YouTube \n\nhttps://t.co/WvsT1J4NAq RT @GaruMatheus: Hahaha genial\nhttps://t.co/UlBL0qPucU RT @Vxvsk: tenho que compartilhar essa obra de arte, não tem como kkkkkkkkkk https://t.co/LHn1FPukmh RT @jot2_: moleque não da com esses 3 cara KKKKKKKKKKKK https://t.co/3gjygDMKNd RT @pkmoret: velho esse encontro kajdjajdkkk\n\nhttps://t.co/irbJn823cS RT @RaulzM_: https://t.co/hKXFykJUJj\n\nMelhor vídeo do YouTube mundial by far \nKkkkkkkkkkkk RT @Allyzon__: https://t.co/ow3oZWYh3T\nNão tem como não rir com esse vídeo KSKSKSKSKSKSM RT @LmChizzotti: ISSO É MUITO BOM KKKKKK\nhttps://t.co/lCZJf4ycHl RT @NotLifas: https://t.co/LrxQnxGVOx\nMelhor podcast de sempre e so tem 1 episódio RT @RaulFagundes11: CARALHO MUITO BOM NÃO PARO DE RIR KKKKKKKKKKKKKLK\n\nhttps://t.co/fVtBmAMAq0 RT @didistpx: https://t.co/nROrOyfvyf\n\nEu não acredito que esse vídeo existe.\nEu não acredito noque eu acabei de ver.\nAcho que zerei a vida… VÍDEO NOVO! O ENCONTRO DE ALEK, DILEIRA E PSIU! O MELHOR CROSSOVER DA INTERNET BRASILEIRA: https://t.co/BS7N06odlb 😂🎥🎙 #TouretteCast RT @emillyav_: Passei mal com esse vídeo,vai lá ver pelo amor de Deus KKKKKKKKKKKKKKKKKKKKKK https://t.co/iKoHL5r5lI\n@cocielo VIDEO NOVO! Demonião pervertido: https://t.co/r5R2tIBAP5 corre pra assistir e deixa o like lá 😂🎥🙏🏻 RT @whoiscarol2: Impossível juntar Among Us  o @cocielo e não sair do vídeo chorando de ri \nO IMPOSTOR MAIS BURRO DA HISTÓRIA DO AMONG KKKK… RT @emillyav_: Genteeee vão lá ver o júlio jogar among us KKKKKKKKKKKKK https://t.co/O2eCLGdYCT\n@cocielo VÍDEO NOVO! O IMPOSTOR MAIS BURRO DA HISTÓRIA DO AMOUNG KKKKKKKKKKKKKKKKKK: https://t.co/sh0V6HKvKf Corre pra ver e deixa o like lá 😂😂😂😂🙌🏻 RT @Juliofortin1: Melhor video do canal do @cocielo   to rindo pra caralho por conta desses dois o @dileraOficial e o @Leandropsiu KKKKKKKK… VÍDEO NOVO! TOCANDO BANDA DJAVÚ E BARÕES DA PISADINHA NO GUITAR HERO 🎮🎬\nhttps://t.co/LWd5hichxx RT @joycemilla_: https://t.co/XW8vYzPoPb\nO vídeo tem 55 minutos e eu morri de rir do começo ao fim KKKKKKKKKKKKKKK Por mim esse vídeo teria… RT @sennacamy: O @cocielo se supera e arrasa á cada vídeo que posta!Vídeo novo no Canal Canalha,O Encontro de Dilera &amp; Psiu!Sinucastigo da… RT @VxtinFN: Melhor vídeo de 2020  tô chorando de rir KKKKKKKKKK @cocielo\nhttps://t.co/xxJaMTl4DD https://t.co/iG4pYel3sJ 😂🙌🏻 https://t.co/3s1UBmKaBR https://t.co/iG4pYel3sJ 🙌🏻 https://t.co/AC6GCuI4Xv RT @LuisGNoel_FFC: https://t.co/vs0IpSfapQ\no melhor vídeo da história do youtube @cocielo @igorcavalari @Leandropsiu @dileraOficial RT @ga221162: https://t.co/OX644rxegj\n\nesse é o melhor video de 2020 facil \nolhei so 5 minutos e to chorando de tanto rir \ne o video tem 55… RT @BynowHu3: Mano!!! \nPQP como o Julio Cocielo é foda HAHAHA\nJuntou o @dileraOficial e o @Leandropsiu  pra fazer um sinucastigo HAHAHA FOD… https://t.co/iG4pYel3sJ https://t.co/lPkciUOG2A https://t.co/iG4pYel3sJ https://t.co/2XV6m7RaEz RT @yGabiGol: O ENCONTRO DE DILERA &amp; PSIU - SINUCASTIGO DA TOURETTE!!! https://t.co/Fy1sfCsoYx via @YouTube \nse esse não é um dos melhores… RT @jotapef_: véi sem condições alguma, esse vídeo é o melhor da história do youtube 😂😂😂🤣\n\nhttps://t.co/ysjz2Oejsa @cocielo VÍDEO NOVO!!!!!!\nO ENCONTRO DE DILERA &amp; PSIU! SINUCASTIGO DA TOURETTE 🎱😂 https://t.co/iG4pYel3sJ RT @fpsmackz: Valorize as coisas pequenas, pra gente ter sempre combustível para seguir em frente. \n\n@cocielo  \nhttps://t.co/pYPCUcCnze\n\nNã… RT @BarbosaWildes: especial de 20 milhões do @cocielo  é um baita motivacional RT @David_Peres1903: Nu que vídeo foda do @cocielo, especial de 20M, me emocionei tio kkkkkkkkkkkk https://t.co/bnT9kTylib RT @BChaves_01: Uma grande inspiração pra mim sou grato por tudo que me proporcionou esse cara merece tudo que conquistou e muito mais ....… RT @gois_bruno1: Um dos melhores vídeos que já vi, por isso sempre fui fã desse cara 😍 ⁦@cocielo⁩  https://t.co/PwxBCF6DEU RT @LeonanTV: Um exemplo de na vida, vc é foda @cocielo \n\nhttps://t.co/Xvl6gLWE1F RT @Sillas__: @cocielo me fez chorar no video de 10 milhões, no pedido de casamento, no video de casamento, e no video de nascimento da Bia… RT @pedro_tirico: \"O medo de errar, numk pode ser maior que a vontade de conseguir\" by: @cocielo \n\nLevarei isso pra vida... seus vídeos sem… RT @Mr_JoaoGoulart: Chorei real vendo o vídeo de 20 milhões do @cocielo que muleque foda, sou fã demais RT @Luiz_EduardoVR: Que vídeo foda de 20 milhões do @cocielo, mlk é monstro mano RT @MimihPurdy_: Estou completamente desidratada de tanto chorar pós vídeo de 20 milhões do @cocielo 😭😭😭\nCaralho meu, te amo forte! Obrigad… RT @fer_hardmann: o @cocielo é o melhor youtuber de todos, tô chorando pra caralho no especial de 20 milhões RT @Luiss_hq: @cocielo é brabo, n tem como... humildade em pessoa, merecedor de tudo que conquistou e vai conquistar, ícone do youtube bras… VÍDEO NOVO JOGANDO CS: https://t.co/qy77k45ADl deixa o like lá 🤣🙌🏻🎥 RT @Caulls_: Já pode ir lá ver o vídeo do @cocielo \nhttps://t.co/mz9kDvs7TS RT @sennacamy: Mano, eu ADOREI o novo vídeo do @cocielo sobre Os Palpiteiros Digitais! Isso me irrita demais também! O bom do Cocielo que e… VÍDEO NOVOOOOO! fruit ninja das rave: https://t.co/10FmH9SEnu corre pra assistir e deixa o like lá 😂🎥🙌🏻 RT @reason_tacielo: Saiu vídeo novo no canal do @cocielo \nCorram pra ver!!!!\n\nhttps://t.co/zBpyvZ848T https://t.co/tjgWROMclE RT @sennacamy: Saiu vídeo novo no canal de Games do @cocielo !\nVão conferir, está demais! \nAdoro ver o Cocielo jogando no VR! É mto engraça… VÍDEO NOVOOOOO! o dia em que a minha filha nasceu: https://t.co/0BIp32FMgW corre pra assistir de deixa o like lá 😂🎥🙌🏻 VÍDEO NOVO! A INGRATIDÃO MALÍGNA: https://t.co/7A9emtMMMw 😱🙌🏻🎥😂 corre pra assistir! VÍDEO NOVOOOOO!!!! DE CUECA E CROCS CAUSANDO NA QUEBRADA: https://t.co/soF3lbYwnm corre pra assistir e deixa o like lá 🙌🏻🎥😂 VÍDEO NOVOOOOO! NUNCA MEXA COM BAIANINHO DE MAUÁ: https://t.co/7UvtNRTKBw corre pra assistir e deixa o like lá 🧙‍♂️🎥😂🙌🏻🎱 vídeo novo! COMO COCIELO E IGÃO  SE APAIXONARAM... PELO FUTEBOL! https://t.co/I2BOqmVm3n corre pra assistir e deixa o like ⚽️🙌🏻🎥 SAIU VÍDEO NOVO! O PISTOLEIRO DO SLOW MOTION: https://t.co/zoNZ015WrD corre pra assistir e deixa o like lá 🎥🙌🏻😂 RT @vitor_zordan: Man tava vendo um vídeo do @cocielo \nQue saiu hj \nQue nostalgia do WINING elevem 🌚\nr6 robaaaado \nR7 é meu ovo \nRoberto Ca… VÍDEO NOVO! ROBERTO CARLOS NO ATAQUE É APELAÇÃO! https://t.co/JFSprseUpQ corre pra assistir e deixa o like lá 🙌🏻😂🎥 RT @Aninha_Mattioli: Pqp, o melhor mano kkkkk.   @cocielo                                       https://t.co/Nazcmb635z RT @yanrochaaa: kkkkkkkkkk muito bom, tá doido @cocielo\nhttps://t.co/brlr936psV VÍDEO NOVOOOOOO! tédio entediante da quarentena: https://t.co/X1zYnOumTy corre pra assistir e deixa o like lá 😂🙌🏻🎥 VÍDEO NOVO!!! realizando o sonho de ser um rato 😂🐀 https://t.co/G7U5qL5SdZ corre pra assistir e deixa o like lá 🙌🏻🎥 ACABOU DE SAIR VIDEO NOVOOOO! porrada em realidade virtual! https://t.co/Uxk3rcg0vm 🥊 corre pra assistir e deixa o like lá 😂🎥🙌🏻 AAAAAAA SAIU VÍDEO NOVO! SINUCASTIGO COM ANDRÉ VILÃO: https://t.co/kkRAjTTvHU corre pra assistir e deixa o like lá 🎱😂🎥🙌🏻 RT @luluisfernando2: Que vídeo pala kkkkkkkk @cocielo     O ASSUSTADOR CORONAVÍRUS https://t.co/4zBWChA2x1 via @YouTube RT @larissakonrath: vídeo novo do @cocielo tá mt bom vai se foder JSNSSJISJSISKSOKAeu amo esse homem\nhttps://t.co/J3tn2KSmv8 VÍDEO NOVO!!! O ASSUSTADOR CORONAVÍRUS: https://t.co/9ZCy9Xf3dY corre pra assistir e deixa o like lá 😂🎥🙌🏻 VÍDEO NOVOOOOO! com muito Rage 😂🔥 https://t.co/qsKvEhDgan corre pra assistir e deixa o like lá 🎥🙌🏻 RT @Locutador: COMO VOCÊ LIMPA A BUNDA??? - INDEBATIVEIS DEBATES https://t.co/fWOdWrgEOc via @YouTube RT @tributehunter: KKKKKKKKKKK eu nunca ri tanto vendo um vídeo \nCOMO VOCÊ LIMPA A BUNDA??? - INDEBATIVEIS DEBATES https://t.co/0MFKoIorc4 RT @jessiclim: Estou de folga, deixa eye ver o YouTube:     COMO VOCÊ LIMPA A BUNDA??? - INDEBATIVEIS DEBATES https://t.co/YENQ7ulzEv @coci… VÍDEO NOVO! como você limpa a bunda? https://t.co/VYCMrqHPfZ 😂😂😂😂🎥💩 corre pra assistir e deixa o like lá 🙌🏻 SAIU VÍDEO NOVO NO CANAL! Reagindo a versão japonesa dos super heróis: https://t.co/2T8naTuEUw corre pra assistir e deixa o like lá 🙌🏻😂🎥 VÍDEO NOVOOOOO! avestruzes x dinossauros: https://t.co/wcdHFMU33K corre pra assistir e deixa o like lá 🦖⚽️😂🎥 RT @Camisrussiandol: CHORA QUE ELE NÃO VEM MAIS ♫ ft AFONSO PADILHA | Paródia Anitta e Marili... https://t.co/J6sFjIhdNI via @YouTube \n@coc… RT @lucxspereira: @cocielo lansou a braba \nkkkkkk\nhttps://t.co/J3omPxXEOZ RT @imarianalves: Alooooooo @cocielo essa paródia tá sensacional demais av https://t.co/Uzay3VOTXb RT @Giovanny5Campos: https://t.co/Q3oekA9sqX\nQue paródia foda hein @afonsopadilha_  é @cocielo RT @jellieljamerson: Kkkkkkkkkkkkk queria mostrar esse vídeo para meus amigos que o pai saiu pra comprar cigarro kkkkkkkkkkkkkk eu num tô a… RT @karynemoura_: VÍDEO NOVOOOOO! CHORA QUE ELE NÃO VEM MAIS 🎵 https://t.co/nLCL0W3ILz corre pra assistir e deixa o like lá  euuuuuu ameiii… RT @Clebinho_Smith: Valeu @cocielo tu fez uma musica pra mim kkkkkkkkkkkkkkkkkkkkkkkkkkkkii https://t.co/rqxPFpHNk8 RT @coci3ar: Dois ícones da comédia com uma paródia sensacional, mostrando como um problema pode ser transformado em brincadeira! \n\n@cociel… VÍDEO NOVOOOOO! CHORA QUE ELE NÃO VEM MAIS 🎵 https://t.co/YQoBcUx6kC corre pra assistir e deixa o like lá 😂🙌🏻🎥 HOJE TEM VÍDEO NOVO! 😂🎥🙌🏻 https://t.co/oGYjVt2RKV VÍDEO NOVOOOOOO! MINHA MARAVILHOSA COLEÇÃO DE SONIC: https://t.co/jOCWl1CZ9k corre pra assistir e deixa o like lá 🎥😂🙌🏻🕹 VÍDEO NOVO! criando uma batalha de aspiradores: https://t.co/0IVw3LCUtj corre pra assistir e deixa o like lá 🎥🙌🏻😂🎉 RT @MrPoladoful: MANO esse video do @cocielo 😂😂😂😂😂😂😂😂😂😂🤣🤣🤣🤣🤣vtnc raxei o biko\n\nEU NO BIG BROTHER BRASIL 2020 https://t.co/uigFjUEGk9 via @Y… VÍDEO NOVOOOOO: https://t.co/xt7HfYMePc corre pra assistir e deixa o like lá 😂🙌🏻🎥 VÍDEO NOVOOOO! o dia em que eu fui um taco humano: https://t.co/zwfmZPMH92 corre pra assistir e deixa o like lá 🎥😂🎱🙌🏻 VÍDEO NOVOOOOOO: https://t.co/mDfqwcVdLl VÍDEO NOVOOOO! QUERO UM NATAL DIFERENTE 🎵https://t.co/lusDGkq7Rv corre pra assistir e deixa o like lá 🎄😂☝🏻 PRA QUEM SEMPRE PEDIU, TÁ AÍ O SEGUNDO VÍDEO JOGANDO GUITAR HEROOOOO: https://t.co/GXvvT566mh 🙌🏻🎸😂 VÍDEO NOVOOOOO! PENALIDADES ENSABOADAS 3: https://t.co/xBCHG2F4NP corre pra assistir e deixa o like lá 😂⚽️🎥🧼 VÍDEO NOVOOOOO! conheça a história do bomba patch: https://t.co/Er0y88BUhL deixa o like lá, corre pra assistir 🙌🏻🎥 RT @Brun0MM: O @cocielo fez um brega funk de cavaleiros do Zodíaco, puta pariu q foda sksksk\n\nhttps://t.co/gzYcBYUABu RT @cameron_santos_: Depois da música do Melot do DragonBall em 2015 temos agora o Ritmo do zodíaco Kkkkkkkkk\n\nhttps://t.co/xNI8BeCgHx RT @sseiiya: Mano kkkkkkkkkkkkkkkkkkkkkkkkkkkkkkkkkkkkkkk RITMO DO ZODÍACO ♫ KOTZ 2019 (DJ Junior Santorini) https://t.co/rZkgELX6Nb via @Y… VÍDEO NOVOOOOO! RITIMO DO ZODÍACO 🎵 https://t.co/kIiPKxxHGL deixa o like la 😂🙌🏻 VÍDEO NOVOOOOO: os bastidores do zodíaco: https://t.co/y5Nf1mOM0I corre pra assistir e deixa o like lá 🙌🏻😂 FUTEBOL DE SALTO ALTO 👠 https://t.co/F3WioJy1aB corre pra assistir e deixa o like lá RT @SPQR_Diego1: o @cocielo não da hahaahahahhhahha genio \n\nhttps://t.co/a5FlkJEVgc RT @iamcatatau: JOGANDO FUTEBOL DE SALTO ALTO!!! https://t.co/xvrfSvkjsG via @YouTube ahahhahahahahahahah pqp mt bom. Mas Deus me dibre faz… RT @brenamaiaa: O video mais esperado nesse fim de semana kkkkk @cocielo\n\nhttps://t.co/ST5jMMZgwZ VÍDEO NOVOOOOOO! Jogando futebol de salto alto: https://t.co/F3WioJy1aB corre pra assistir e deixa o like lá 😂👠⚽️🎥 VÍDEO NOVOOOO! tiringa em realidade virtual: https://t.co/ySNAgUXNEl corre pra assistir e deixa o like lá 😂🎮🙌🏻 VIDEO NOVOOOO! GANHEI DE UM PROFISSIONAL?! https://t.co/e6Qi8DMulG corre pra assistir e deixa o like lá 🏆🙌🏻🎮😂🎥 RT @DaudHenrique: Ou geral vê esse vídeo é  muito bom TIRINGA ELETROCUTADO - SINUCASTIGO!!! https://t.co/heGGKy91oo via @cocielo @YouTubeBr… VIDEO NOVOOOOO! TIRINGA ELETROCUTADO: https://t.co/5wTXuHIroT corre pra assistir e deixa o like lá, tá engraçado demais 😂🙌🏻🎉🎥 HOJE AS 19:00h TEM VIDEO NOVO! https://t.co/53QU7xD6kC 🙌🏻😂🎥 https://t.co/tu5jtqpqnS VÍDEO NOVOOOOOOO https://t.co/rWEvqaJCFt 🙌🏻🤣🎮 VÍDEO NOVOOOOO! a batalha mais eletrizante e alucinante da galáxia: https://t.co/rWEvqaJCFt corre pra assistir e deixa o like lá 🎥🎮🎉😂 VÍDEO NOVOOOOO! VOU SER PAI, TIOZÃO &amp; STRESS FEMININO: https://t.co/kE7FfmCHKL deixa o like lá! corre pra assistir 🙌🏻😂🎥🎉 VÍDEO NOVOOOO! JOGANDO JOGO DE TERROR EM REALIDADE VIRTUAL E CAGANDO DE MEDO: https://t.co/YdBS3OHtcq corre pra assistir e deixa o like lá 😢🎮🙌🏻😂🎥 VÍDEO NOVOOOOO https://t.co/YM0gfbKWyp 😂🎮🙌🏻 VÍDEO NOVO! X1 COM O DEMONIÃO ENORME: https://t.co/YM0gfbKWyp corre pra assistir e deixa o like lá 😂🎥🎮🙌🏻🔥 VÍDEO NOVOOOOOOO! DESAFIO ALEATÓRIO IMPROVISATOR DO TRAVESSÃO: https://t.co/N0eIDFJmK9 corre pra assistir e deixa o like lá 🎥🙌🏻⚽️🔥 VÍDEO NOVOOOOO! TREINANDO PARA SER PAI: https://t.co/qJXHskkDQX corre pra assistir e deixa o like lá 😂🎥🙌🏻 VÍDEO NOVOOOOO https://t.co/Kpno1o3hEm VÍDEO NOVO COM O MAIOR CLÁSSICO ESPORTIVO DA HISTÓRIA DOS GAMES! PINGUINS X DINOSSAUROS: https://t.co/Kpno1o3hEm corre pra assistir e deixa o like lá 🎥😂🙌🏻 VÍDEO NOVOOOOO! GANHEI DO BAININHO DE MAUÁ: https://t.co/AjC17LR3rF corre pra assistir e deixa o like lá 🎱😂🙌🏻🔥🎥 VÍDEO NOVOOOOOO! PÕE A MONTANHA RUSSA NO MEU NOME 😂: https://t.co/z3iLbj1ZJJ corre pra assistir, deixa o like lá e da rt aqui pra geral assistir também 🎥😂🙌🏻 VÍDEO NOVO NOSTÁLGICO! BOMBA PATCH ATUALIZADO É O 4.1 🎵 https://t.co/ggg7BmWfYo corre pra assistir, deixa o like lá, e da rt pra geral ver também 🎥😂🙌🏻🔥⚽️ VÍDEO NOVOOOO! o dia em que quase matei meu cachorro: https://t.co/0vg4SrHOdF corre pra assistir e deixa o like lá 🔥🙌🏻🎥 VÍDEO NOVOOOO! segundo diário de viagem da Disney: https://t.co/SKNPG8Q19K deixa o like lá, é nóis 😂🎥🙌🏻 VÍDEO NOVOOOOO! https://t.co/MMj58xglfU corre pra assistir e deixa o like lá 🙌🏻🔥😂🎥 RT @KauaGammerBr: https://t.co/GaWs7oSUCs\n\n\"Vc vai bater o recorde do quadro que ninguém nunca fez\" kkkkkkkkkkkkkkkk\n\nEsse @cocielo É muito… VIDEO NOVOOOOO!!!! BANHO DE EXTINTOR NA COPA CIRROSE: https://t.co/u4UqDsmILm deixa o like lá e da rt aqui pra geral assistir também 🙌🏻🔥🥃😂🎥 COPA CIRROSE HOJE, as 18:30h! https://t.co/53QU7xD6kC 😂🎥🔥😂 https://t.co/skI9ozFEHj VÍDEO NOVOOOO! primeiro diário de viagem da disney: https://t.co/GO7plOSx4f deixa o likeeee 🙌🏻🎥🔥 VÍDEO NOVOOOOOOO! https://t.co/CNYpjc6rxU 🎥😂🎱 VÍDEO NOVOOOO ft @gustastockler! QUADRO NOVO!!!! SINUCASTIGO!!! 🎱 https://t.co/CNYpjc6rxU corre pra assistir, deixa o like e da RT pra geral assistir também 🎥😂🔥 VÍDEO NOVOOOOO!!! a corrida mais competitiva do século ft @t3ddyyyyy: https://t.co/8o4hPjhvtq 👈🏻 deixa o likeeeee, e da rt pra geral ver também 🎮😂❤️⚡️ O jogo que eu falei no vídeo novo foi esse aqui: TALES OF WIND! o melhor MMORPG mobile do momento. Download aqui: https://t.co/rLdEGfy123 #Ad 🕹📱 https://t.co/fP9L1abA7F VÍDEO NOVOOOOOO! ZICO ODEIA O DESAFIO DO TRAVESSÃO: https://t.co/t1NLQONe8y corre pra assistir, deixa o like e da rt pra geral ver também 🙌🏻🎥🔥⚽️😂 RT @TigraoDaMooca: MÃE DA MULA (sei lá se era esse o nome)\n https://t.co/Zz3kx8jhz2  @cocielo RT @jellieljamerson: Kkkkkkkkk que sdds eu tava de assistir um vlog desses! Não dá, ele sabe alegrar seu público.\nSó falo uma coisa kkkkkkk… VIDEO NOVOOOOO! AS OFENSIVAS BRINCADEIRAS DA MINHA INFÂNCIA: https://t.co/q7Ig4UGrtA corre pra assistir e deixa o like lá 🎥😂🔥🙌🏻 HOJE TEM VIDEO NOVO!!! https://t.co/PyT7iYwJp8 🙌📹🤣 https://t.co/ttS1uCcGRQ VÍDEO NOVOOOOO! INDO DE ENCONTRO ÀS BOLAS! https://t.co/42SFYDLnMt deixa o like e lá e da rt aqui pra geral assistir também 🎮⚽️😂🎥 HOJE TEM VÍDEO NOVO! https://t.co/1AZ86ez9JP 😂🔥🎥 https://t.co/EQX05WIBzy SAIU VÍDEO NOVO!!! O QUE TEM NA CAIXA ADIVINHANDO PRODUTOS ERÓTICOS: https://t.co/1WYc03EDAb corre pra assistir, deixa o like lá, e da rt aqui pra geral assistir também 😂🙌🏻🎥🔞 PREPARA AÍ QUE HOJE TEM VIDEO NOVO NO CANAL!!! https://t.co/PyT7iYwJp8 😹🎥 https://t.co/UAi1444Sj2 VÍDEO NOVO COM UMA DAS MAIORES DÚVIDAS DA HUMANIDADE! COMO VOLTAMOS PRA CASA DEPOIS DE UMA COPA COROTE?! https://t.co/u942FizT4b deixa o like e da rt aqui pra geral ver também 😂🎥🔥🙌🏻 O REVERSÃO TA CHEGANDO! https://t.co/Vq93oJCx1J VÍDEO NOVOOOOO!!!! ROLOU ATÉ UFC NA COPA COROTE 😂 https://t.co/Xk15ZLXaIv deixa o like e da rt pra geral ver também 🙌🏻🎥 COPA COROTEEEE! VÍDEO NOVO! https://t.co/Xk15ZLXaIv 😂🎥🔥🙌🏻 RT @Andersonjr012: Nmrl ta muito FODA e engraçado esse video pqp a cada copa corote só melhora pqp KKKKKKKKKK @cocielo https://t.co/ZVH3qoZ… VÍDEO NOVO JOGANDO FUTEBOL BEBAÇO! COPA COROTE!!! https://t.co/Xk15ZLXaIv deixa o like lá e da rt aqui pra geral assistir também 🎥😂 VÍDEO NOVO JOGANDO AGARIO CHEIO DE RAGE: https://t.co/3UhvBkWOwc VÊ AÍ 😂🎥🔥 AMANHÃ ⚠️ VOCÊ NÃO PODE PERDER!!! O VÍDEO MAIS PEDIDO DO CANAL! VARIOS AMIGOS BÊBADOS REUNIDOS DENTRO DE CAMPO! COPA COROTE SOCIETY ⚽️🔥 A MAIOR COMPETIÇÃO ESPORTIVA E ALCOÓLICA DE TODA A GALÁXIA!!! TOTALMENTE PROIBIDO PARA MENORES DE 18 ANOS 🚫 PREPARE O SEU LIKE 🎥 https://t.co/ZXElwJBETw VIDEO NOVO PASSANDO RAIVA PRA PORRA https://t.co/3UhvBkWOwc corre pra assistir e deixa o like lá 😂🎥🔥 VÍDEO NOVO!!! comendo uma par de coisa nojenta - https://t.co/ByGt6aIyEN deixa o like lá, e da rt aqui pra geral assistir também 🙌🏻😂🎥🔥 HOJE TEM VÍDEO NOVO! https://t.co/PyT7iYwJp8 😂🙌🏻🔥 https://t.co/I7J133M0CW VÍDEO NOVOOOOOO https://t.co/JJ1siz7Mw1 🎥😂🙌🏻 VÍDEO NOVOOOOOOO!  JOGANDO JOB SIMULATOR! https://t.co/JJ1siz7Mw1 da rt pra geral ver, corre pra assistir e deixa o like lá 🙌🏻🎥😂 RT @rogeriolopes09: Assistam e fiquem com essa lição de moral \n\n@cocielo https://t.co/f4TADxbYPT VÍDEO NOVOOOO! minha coleção de tênis maluco https://t.co/mblhtIXJzC 😂🎥🙌🏻 RT @t4mi__: se você ficar alegre só com as coisas grandes da vida, é capaz que você se decepcione demais consigo mesmo\nvalorizem as pequena… VÍDEO NOVOOOOO! minha coleção de tênis maluco: https://t.co/mblhtIXJzC corre pra assistir, e da rt pra geral ver também 🙌🏻🎥😂🔥 VÍDEO NOVOOOOOOOOOO https://t.co/BcHHbpBFiq VÍDEO NOVOOOO! OS DIFERENTES COSTUMES MUNDIAIS: https://t.co/BcHHbpBFiq corre pra assistir, deixa o like, e da RT pros amigos verem tbm 😂🎥🙌🏻❤️ VÍDEO NOVO!!! REVELADA A NOVA APARÊNCIA DO SONIC: https://t.co/mxxivX6hsf deixa o like e da rt pra geral ver também 🙌🏻😂🎥 RT @RoniGirardi: https://t.co/0Qv50fmfIT \n@cocielo que vídeo engraçado 😂😂😂😂 VÍDEO NOVOOOO! https://t.co/GqUPECLOCb 😂🎥🙌🏻 RT @t4mi__: e essa voadora que o murilo deu no cocielo, vei kkkkkkkkkkkkkkkkk \nah nem \n@cocielo\nhttps://t.co/rd1OhKAT10 ACABOU DE SAIR VÍDEO NOVOOOO! https://t.co/GqUPECLOCb deixa o like e da rt pra geral assistir também 🎥❤️⚽️🙌🏻 VÍDEO NOVOOOO https://t.co/jq1MdfIa4C 😂🎥🙌🏻 VÍDEO NOVOOO! SHREK TIRANDO SATISFAÇÃO NA QUEBRADA: https://t.co/jq1MdfIa4C deixa o like e da rt pra geral ver também 🎥😂🙌🏻 VÍDEO NOVOOOOOO https://t.co/aUliUhGF5q 🎥💉🙏🏻 RT @Raelblck: O @cocielo fez um vídeo sobre Benzetacil acho que a coisa que mais usa no EB hoje em dia kkk, se o soldado ta com febre é Ben… RT @thiirodrigs: Cê não tem plano de saude? Kkkkkkkkk to morrendo https://t.co/7L06nQQJyJ @cocielo RT @kaahcarolinyy: Quando eu morava  SP eles não receitava antibiótico de 12/12 hr é  benzetacil 3 vezes ao dia kkkkkkkk  https://t.co/mRfp… RT @Thiagom_95: https://t.co/JYtNBDrvjC    @cocielo \nNem fudendo q eu tomava benzetacil kkkk tenho medo até hj RT @help_tami: https://t.co/hsG0jP47UL\n@cocielo\nbenzetacil é agro\nbenzetacil é tech\nbenzentacil é pop \nbenzentacil é tudo RT @help_tami: https://t.co/hsG0jP47UL\n@cocielo\ndepois desse vídeo do julio, tô pensando seriamente em me mudar pra osasco pra trabalhar no… RT @andrezabittenc: Pra me fazer rir do bagulho que me deixa aleijada só o @cocielo KKKKKKKKKKKKKKK \nhttps://t.co/mp5RJxmVKS RT @jellieljamerson: Ainda perguntam o pq eu sou fã dele HAHAHAHAHAHAHAH assiste esse vídeo e terá a resposta! \n@cocielo\n#benzentacil\nhttps… VÍDEO NOVOOOOOO! AS SAUDADES DA BENZETACIL ❤️ https://t.co/aUliUhGF5q corre pra assistir, deixa o like, e da rt pra geral assistir também 💉😂🙌🏻🎥 HOJE TEM VÍDEO NOVO! https://t.co/PyT7iYwJp8 💉😂🎥 https://t.co/vk6nJ7CdG2 RT @Luiss_hq: Mano chorei de rir vendo vídeo de @cocielo @fred_b12 @EversonZoio e da Alê Xavier kkkkkk mano KKKKKKKKKKKKKKK tô chorando de… RT @LucasAz73298603: Que vídeo sensacional né @cocielo!!!\n https://t.co/ClojUKc6P2 RT @help_tami: mano, eu tô chorando aq e minha barriga tá doendo de tanto rir kkkkkkkkkkkkkkkk\n @cocielo \nhttps://t.co/77DaaEq985 RT @JoawPadilha: https://t.co/8JIm6Ljljl to chorando de rir com esse video do @cocielo smcd RT @Eliza8174: Que vidão gostoso de assistir #copacirrose https://t.co/ODTSB1yM0Q 😂😂\n@cocielo RT @TiagoGz19: https://t.co/YIA2BfuPQa\nIsto está muito bom 😂😂\n@cocielo RT @mariana_talita1: Desculpa, mas é muito engraçado. Rindo alto até agr, vou assistir dnv😂😂😂😂\n#copacirrose\n 😂😂😂😂😂😂😂\n@cocielo\n\nhttps://t.co… VÍDEO NOVOOOO! TODO MUNDO CHAPADO E SEM LIMITES: https://t.co/Zv8o8cxmPv deixa o like e da rt pra geral ver também🔥🎥🙌🏻 HOJE TEM VÍDEO NOVO, COPA CIRROSE!!! https://t.co/PyT7iYf80y 🙌🏻😂🎥 https://t.co/wR53ZEmKFk vídeo novoooooo https://t.co/UQD7rZiAYi 😂🎥🔥 VÍDEO NOVO CHEIO DE RAGE 😂🔥🎥 A PIOR PARTIDA DE COD QUE JÁ EXISTIU: https://t.co/UQD7rZiAYi corre pra assistir, deixa o like e da rt pra geral ver também! RT @leodommarco: Mano KKKKKKKKKK que vídeo sensacional do @cocielo https://t.co/eAsx2RsxVh VÍDEO NOVOOOOOO\nhttps://t.co/KhQzW8SCY8 SAIU VÍDEO NOVO!!!! TENTEI SER FAMILY FRIENDLY SÓ PARA ME ADEQUAR AOS PADRÕES DO YOUTUBE! https://t.co/KhQzW8SCY8 CORRE PRA ASSISTIR E DEIXA O LIKE LÁ 🎦🔥🙌🏻😂 HOJE TEM VIDEO NOVO! https://t.co/PyT7iYwJp8 😂💥 https://t.co/UnhQrOfS1A VÍDEO NOVOOOOO! ROLÊ NA ESPANHA E CT DO BARÇA! https://t.co/usWXKAaSZI deixa o like e da rt pra geral ver tbm 🙌🏻🔥 RT @_pesampa: https://t.co/oXA5TAug9w\n\nMais um trampo feito com sucesso!\nDeixa o like pra ajudar o @cocielo (e o rt pra eu ter mais trampo… RT @brenamaiaa: mano, como assim o @cocielo gravou com o @Phil_Coutinho ? pqp\n\nhttps://t.co/TKN58IByAR ACABEI DE POSTAR VÍDEO NOVO! DESAFIO DO TRAVESSÃO ALEATÓRIO COM COUTINHO: https://t.co/lyUPxMjzav DEIXA O LIKE E DA RT PRA GERAL ASSISTIR TAMBÉM! 🎥💥⚽️ HOJE TEM VÍDEO NOVO! https://t.co/PyT7iYwJp8 💥⚽️ https://t.co/A9uTXzXhaW VÍDEO NOVOOOOO https://t.co/1UdcySOJLo 🙌🏻🎥😂 VÍDEO NOVOOO! AS FREQUENTES INSATISFAÇÕES HUMANAS: https://t.co/1UdcySOJLo deixa o like e compartilha pra geral 😂🔥🎥 RT @maantooani: @cocielo  https://t.co/M7OPBPWQBS corre pra assistir e deixa o like KKKKKKkkkk,pinto grande e gordo maravilhoso KKKKKKKKKKK… SAIU VÍDEO NOVO NO CANAL! https://t.co/eAySHDEOMD corre pra assistir e deixa o like lá 😂🎥🔥 RT @clubedopairico: Vai por mim: este será o melhor clip que você verá no ano !!\n\n(assista até o fim, sem pular nada ... prestando atenção… RT @FortunatoFranc0: A nova música do @cocielo é envolvente demais e ao mesmo tempo ela da lição de vida 💚💚 https://t.co/zR9J35P4G6 RT @Nicolas997: Será que essa música vai salvar o carnaval desse ano?\n@cocielo https://t.co/qG9ms1ODkE RT @PierryV13: Hite do carnaval do @cocielo https://t.co/KEJgDHefAp RT @CarolCa82690541: E hit que fala ne. AMEI a música MUITO TOP. Parabens @cocielo @Christian_fig estava top a música o clipe eu amei mesmo… RT @jellieljamerson: Pra mim lançou a hit do ano HAUHAUHAUHAUAHHAHAIHAUABJAJAJAJJJA cê louco a cena do acidente merece um Oscar kkkkkkkkkkk… RT @besidesthiago: toma toma toma toma toma sem cair no chão, eu sei que cê aguenta a pinga de peão \n\nHIT DO CARNAVAL QUE FALA, NÉ?\n\nhttps:… RT @sennacamy: Saiu mais um videoclipe MC Rozi e Capitão Fake: Pinga de Peão do @cocielo cm a @tata @Christian_fig @MrPoladoful Phill Pirad… VÍDEO NOVO! PINGA DE PEÃO 🎵: https://t.co/NYay8Rn52X deixa o like lá, da rt pra geral ver, e corre pra assistir 🔥🎥 RT @Luli_oiback: https://t.co/CLowniuVmU eu ri muito do “baaaaaaaaah” torcendo o pescoço OSJDJSJDJSJSJSJDJAJDJSJS @cocielo socorro RT @Edsonpgj: quero que cantem o meu parabéns igual esse do @cocielo\n\nhttps://t.co/hy2mYJcULG RT @DuaLipa_ofc: Esse video do @cocielo ta muito bom kkkkkk gente eu ri demais !!!\n\nhttps://t.co/QSZpkBvHSi RT @JlioCsa56389225: Mano do céu vídeo foda pra caralho se e Loko @cocielo https://t.co/7Y2uAbx1NO RT @dehzinha_h: Meu Deus @cocielo obrigada por me tirar da fossa emocional que eu estava!  https://t.co/EkjdM55DqV RT @NOMECOMUM_: Manooo do céu, esse vídeo ta foda! Ri do começo ao fim vei kkkj @cocielo\nhttps://t.co/PnMXCIhEQl RT @laariisssaaaaa: vídeo novo no canal do @cocielo sobre gírias (espero q no próximo ele fale sobre as gírias do oeste catarinense UANSJSN… VÍDEO NOVO! AS CONFUSAS GÍRIAS REGIONAIS: https://t.co/fHMuzzEW47 corre pra assistir, deixa o like, e da rt pra geral ver tbm 😂🎥 HOJE TEM VIDEO NOVO! https://t.co/PyT7iYwJp8 🎥🔥 https://t.co/JOLnOH1vRj VÍDEO NOVO! BEER PONG QUASE GIGANTE DE POBRE: https://t.co/fao5ISyDrk DEIXA O LIKE LÁ E DA RT AQUI PRA GERAL VER TAMBÉM! 🔥🎥😂 BEER PONG QUASE GIGANTE DE POBRE - (ft. Muca, Igão, Fred): https://t.co/gZLYKnf6Uw via @YouTube HOJE TEM VÍDEO NOVO AS 19:00h! https://t.co/PyT7iYwJp8 🔥🎥 https://t.co/JUqdL3LPDv RT @thuany24k: Muito top essa paródia do @cocielo\nhttps://t.co/f9B8o8qMB4 RT @jellieljamerson: Chamaaaaaaaa!!! Aí vc tá falando de uma paródia de respeito né caraio KAKSKSKSKSKKSKSKSKSKK @cocielo\nhttps://t.co/IgTX… RT @Brunaakailane: Essa paródia ta maravilhosa KKkkkkllkkkk @cocielo https://t.co/XNMuO1ZMdR RT @Lelebernardo2: Alegrou meu sábado com o vídeo novo do @cocielo o Júlio tornou meu dia mais alegre!!! Corre lá pra ver o vídeo dele \nEss… RT @Bruninho019_: @cocielo não erra uma paródia pqp KKKKK\n\nhttps://t.co/sOZIvM96BJ RT @nawollff: Na moral o @cocielo era o cara que tinha o apelido de Fábio Assunção KKKKKKKKKLKK melhooooor vídeo não foi atoa que eu entrei… RT @laariisssaaaaa: video novo no canal do @cocielo convertido\nhttps://t.co/bnEWD6PVHq RT @preta88preta: Esse novo vídeo/quadro do @cocielo é claramente eu quando to cantando funk proibidao e minha mãe chega kkkkk assiste q ta… VÍDEO NOVOOOO!!! CONVERTENDO FUNKS - PARADO NO BAILÃO 🔊https://t.co/8X0R8wS2md deixa o like e da rt pra geral assistir também 😂🎥🔥 CONVERTENDO FUNKS - PARADO NO BAILÃO ♫: https://t.co/IMq5hYaTk0 via @YouTube HOJE TEM VIDEO NOVO AS 18:00!!! https://t.co/PyT7iYwJp8 🔥🎥😂 https://t.co/IzLtpjwVAW RT @Lelebernardo2: SAIU VIDEO NOVO NO CANAL DO MAIS FODÃO QUE EXISTE O @cocielo corre lá não perde não!! Compartilha pra geral!! Até a Jenn… RT @marimaoli: @cocielo mais uma vez ultrapassando as barreiras da ciência KKKKKKKK \n\nobrigada\nobrigada\nobrigada\n\nhttps://t.co/mVui45sLwK RT @um_dole: Mano, eu amo o @Cocielo o cara é um dos mais engraçados do YouTube, pra mim o mais engraçado, esse vídeo ficou muito bom kkkkk… MINHA CONSTRANGEDORA HEMORROIDA: https://t.co/xPdTWUmIDQ via @YouTube VÍDEO NOVOOOO! MINHA CONSTRANGEDORA HEMORROIDA: https://t.co/vMwiq1QRLh DEIXA O LIKE LÁ E DA RT PRA GERAL ASSISTIR TAMBÉM 🙌🏻🔥😂🎥 HOJE TEM VÍDEO NOVO! https://t.co/PyT7iYwJp8 🔥🎥 https://t.co/Gx0bF49Ua4 VÍDEO NOVO!!! BASTIDORES CHAMA PEIPEIPEI RESPEITA! https://t.co/QE6eVeVJMu DEIXA O LIKE E DA RT PRA GERAL ASSISTIR TAMBÉM! 🔥🎥😂 BASTIDORES CHAMA RESPEITA PEIPEIPEI DA COPA YOUTUBERS: https://t.co/B3DmWrj7iU via @YouTube RT @mariannajf1: gente namoral esse video salvou meu último sábado de 2018 KKKKKKKKKKK muito obrigada @cocielo @WhoIsCarlos \n\nhttps://t.co/… RT @TiagoribeiroTRP: Copa cirrose foi um curta metragem do meu 2018 cara kkkkkkk @cocielo  é foda #copacirrose https://t.co/J47X1Aosyj RT @tel200240: Manoooo que vídeo do caralho de tão foda kkkkk o Caio Lo parece eu na quadrilha da escola no ano passado kkkkk @cocielo faz… RT @MauroJunior___: Kkkkkk melhor intro e cara vocês são foda! Na moral... @cocielo \nSó acho que podia fazer uma copa cirrose com os inscri… RT @JaianeBruna2: Na virada meus familares estarão tipo o Caio Lo na copa cirrose KKKKKKKKKKKKKKK MANOOO VÍDEO MARAVILHOSO KKKKKKKKKKKK\n@co… RT @mariana_talita1: Mano kkkkk 😅😂😅😂, coitado dos meninos 😂😅 https://t.co/79QOE1Gq8w\n@cocielo like total🖒🖒👏 RT @VictorPimenta14: https://t.co/zPDWKqgdtl\n\nCopa Cirrose, a melhor do Youtube. @cocielo o canal mais foda. 👏👏👏 RT @mermaid_ferraz: https://t.co/q0joSxRfFp \n\nAssistam, ta sensacional  KKLKKKKLK\nMeu sonho fazer uma copa cirrose com os amigos que eu gos… RT @gomescharlesrc: @cocielo mano queria muito um dia beber com esse mlq, ele é foda demais!\n\nhttps://t.co/gj3VRJIN7y RT @Gabriel35962226: https://t.co/8GfU19ATRB\n@cocielo sempre mita na copa cirrose, Mlk bebe pá Caraí e ainda fica suavão tio kkkk RT @brenamaiaa: Mano, meu sonho é fazer uma copa cirrose KKKKKKKK @cocielo\n\nhttps://t.co/UZ0Fivhm3V RT @gTavinhoo: coitado dos mlks kkkkkkkkkk @cocielo\n\nLOUCOS DE COROTE - COPA CIRROSE https://t.co/JqDNii69OT via @YouTube RT @narizinhox: Mal chegou a notificação e eu ja corri.\nÉ COPA CIRROSE CUZAO\n@cocielo\nhttps://t.co/BEMzcQgCcv VÍDEO NOVO! loucos de corote! https://t.co/g8NX8JJa7t deixa o like e da rt pra todo mundo assistir também 🙌🏻🍻🔥🎥 LOUCOS DE COROTE - COPA CIRROSE: https://t.co/KGTYjgZdwn via @YouTube HOJE TEM COPA CIRROSE! https://t.co/PyT7iYwJp8 🍻 https://t.co/4xPtv1TxJi VÍDEO NOVO COM OS PIORES MOMENTOS DA COPA YOUTUBERS: https://t.co/xuaIzLZyVx corre pra assistir, deixa o like e da rt pra geral assistir também 🎥🔥 MELHORES PIORES MOMENTOS - COPA YOUTUBERS 2018: https://t.co/CYLNG52Ssd via @YouTube VÍDEO NOVOOOO https://t.co/fX7i7bfA8e TOMEI LEITINHO DE CAMELO E PULEI DE PARAQUEDAS EM DUBAI: https://t.co/fX7i7bfA8e via @YouTube COPA YOUTUBERS - AO VIVO: https://t.co/1JMnJMx0FA via @YouTube RT @Gabilp7: Quem sou eu segurando pra não dar risada alta 1h da manhã com esse vídeo @cocielo https://t.co/gPRNAgLYIR VÍDEO NOVOOOOO! CORRE PRA ASSISTIR! https://t.co/ZAwDE5G8Bt deixa o like e da rt pra geral assistir também! 😂🎥🔥 EXAME DE PRÓSTATA! #CANALHARESPONDE 27: https://t.co/5yTuhIPI42 via @YouTube VÍDEO NOVO HOJE AS 18:30 HEIN!!! https://t.co/MeYaOJVt2b 🎥😂 https://t.co/y4XLL1lrgz VÍDEO NOVOOOO! PENALIDADES ENSABOADAS 2: https://t.co/uqaWtVtgyG DEIXA O LIKE, E DA RT AQUI PRA TODO MUNDO ASSISTIR  TAMBÉM 🙌🏻🎥😂 PENALIDADES ENSABOADAS 2: https://t.co/GvaHgp85TQ via @YouTube VÍDEO NOVO!!! RELEMBRANDO AS ORIGENS - PES 2019: https://t.co/TghJICpOcY DEIXA O LIKE E DA RT PRA GERAL ASSISTIR TAMBÉM 🎥🔥😂 RELEMBRANDO AS ORIGENS - PES 2019: https://t.co/AZv48NBPjv via @YouTube RT @laariisssaaaaa: momentos antes da desgraça acontecer HAAUHEUEHSUSHS \nhttps://t.co/nJ6FBCmGQQ\nvídeo novo no canal do @cocielo  corre laa… FUTEBOL COM BOLA DE FUTEBOL AMERICANO: https://t.co/M1mhlcEihV via @YouTube VÍDEO NOVO! FUTEBOL COM BOLA DE FUTEBOL AMERICANO! https://t.co/K5BWZ7aNtG CORRE PRA ASSISTIR, DEIXA O LIKE E DA RT AQUI PRA DAR UMA MORAL 🔥🎥😂 VÍDEO NOVO JA JÁ! AS 18:30h TEM! https://t.co/oBNZVGxSZQ 🔥😂 https://t.co/pYhLvSxVcM RT @brenamaiaa: Eu não sei olho pro jogo, pra ver se ele tá acertando ou pra cara dele   KKKKKK @cocielo\n\nhttps://t.co/w5wV2MTQrn O MELHOR JOGADOR DE GUITAR HERO DA HUMANIDADE!: https://t.co/uGsxyIqDvj via @YouTube VIDEO NOVOOOOO! O MELHOR JOGADOR DE GUITAR HERO DA HUMANIDADE! https://t.co/PKEVMPM98u DEIXA O LIKE LÁ E DA RT AQUI PRA GERAL ASSISTIR TAMBÉM! 🔥 HOJE TEM VÍDEO NOVO JOGANDO GUITAR HERO! https://t.co/1AZ86ez9JP https://t.co/exBQwokMrB VÍDEO NOVOOOOO https://t.co/AztushMz5r O DIA EM QUE EU TIREI O DENTE DO SISO: https://t.co/AztushMz5r via @YouTube VIDEO NOVOOOO! O DIA EM QUE EU TIREI O DENTE DO SISO! https://t.co/MFFm0I0SUE DEIXA O LIKE E DA RT PRA TODO MUNDO ASSISTIR TBM 😂🎥❤️ HOJE TEM VLOG NOVO, AS 19:00h https://t.co/PyT7iYwJp8 🔥🎥 https://t.co/trqtuPcOEY VÍDEO NOVOOOOOO https://t.co/E0CBNoYxQU VÍDEO NOVO!!! PRIMEIRO JOGO BENEFICENTE SÓ DE YOUTUBERS: https://t.co/E0CBNoYxQU deixa o like e da rt pra todo mundo ver ❤️🔥🙏🏻 1º JOGO BENEFICENTE SÓ DE YOUTUBERS: https://t.co/6svj9ccnYQ via @YouTube RT @sennacamy: Adoro os vídeos do Mc Rozi do @cocielo! Cara, vc é uma figura, é único, tú é O Cara 😁😁😁😁😁 Vão conferir o vídeo novo no Canal… RT @CorotesDoJulio: MC ROZI DE VOLTA!!!\nMais um hit lançado com sucesso, e pra melhorar com participações sensacionais!!!\nClica aqui em bai… VÍDEO NOVOOOOOO https://t.co/7g0a5cNqO3 RT @WtfGabrieu: https://t.co/94EMUASun1 clipe e música fodaaaa aa aa\n@cocielo MC ROZI, MC WM, OS CRETINOS &amp; DJ GEGE - MEU VENENO!: https://t.co/gW0RDrUERR via @YouTube VIDEO NOVOOOOO! \nMC ROZI, MC WM, OS CRETINOS &amp; DJ GEGE - MEU VENENO ♫ https://t.co/7g0a5cNqO3 \nDEIXA O LIKE NO VÍDEO E DA RT AQUI PRA GERAL VER TAMBÉM 🔥🎥😂 HOJE TEM VIDEO NOVO COM A MUSICA PERFEITA PARA A SEXTA FEIRA! https://t.co/PyT7iYwJp8 🔥🎥😂 https://t.co/ozfvMZ2iHL ME QUEIMANDO DE ÓDIO NO FIFA 19: https://t.co/QjA91RT7uO via @YouTube SAIU VÍDEO NOVO JOGANDO FIFA 19 E PASSANDO MUITA RAIVA\nhttps://t.co/56P9cSGbVJ\nDEIXA O LIKE E DA RT PRA GERAL VER! TEM VÍDEO NOVO NO CANAL! \nhttps://t.co/AkxeiONhmk\nDA RT PRA TODO MUNDO VER! 🎥🔥 VÍDEO NOVOOOOOO https://t.co/AkxeiONhmk RT @WesleyVS97: os caras do posto urraram muito 😂😂😂😂😂😂😂😂😂😂😂😂😂😂😂😂😂😂😂😂😂😂😂😂😂\n\n@cocielo \n\nhttps://t.co/GSAbTnTMvC RT @LuiZinKomS: @cocielo tem que fazer mais vídeos desse tipo, racho de rir com ele dançando com roupa de homaranha e fazendo coisas normai… RT @chainsflop: Meu eu to chorando de rir com o vídeo novo do @cocielo O NOVO JOGO DO HOMARANHA: https://t.co/bs4crMSFSr via @YouTube RT @dehzinha_h: Eu tô só o tiozinho do posto rachando o bico com o @cocielo\nde homem aranha. Ô bicho retardado 😂\nhttps://t.co/dHIGmQBG7t RT @Viih_Sud: O NOVO JOGO DO HOMARANHA https://t.co/AMF6IgAbhl via @YouTube\nEsse video ta muito bom kkkkkkkk @cocielo \nCara é fodaaaaaa VÍDEO NOVO SOBRE O JOGO DO HOMARANHA! DEIXA O LIKE LÁ E DA RT PRA TODO MUNDO VER!!!! https://t.co/AkxeiONhmk 🔥🎥😂 O NOVO JOGO DO HOMARANHA: https://t.co/pE9d1qKn47 via @YouTube VÍDEO NOVO SOBRE O JOGO DO HOMARANHA! DEIXA O LIKE LÁ!!!! https://t.co/ngjMoiwRx0 🔥🎥😂 HOJE TEM VIDEO NOVOOOO! https://t.co/PyT7iYwJp8 https://t.co/gpdmo0VGbs VÍDEO NOVOOOO! DA LIKE PRA FORTALECER! 🎥 https://t.co/RgeqNhkwTn VÍDEO NOVO! https://t.co/RgeqNhkwTn deixa o like! 👊🏻🎥 HIPER MEGA HARD DESAFIO MISTÃO DO TRAVESSÃO: https://t.co/vUECiMZODW via @YouTube VÍDEO NOVOOO! HIPER MEGA HARD DESAFIO MISTÃO DO TRAVESSÃO -&gt; https://t.co/RgeqNhkwTn deixa o like e da rt pra geral assistir também! 🎥😂❤️ HOJE TEM VÍDEO NOVO! https://t.co/PyT7iYwJp8 https://t.co/Z46THv3sko VÍDEO NOVOOOOOO https://t.co/TN6YK59hcE RT @joaopaulod97: HAUSHAUSHAUS \"AI TA DOENDO TUDO, CALCANHAR, CABELO HAUAHAUAHAUAH\"https://t.co/1Z86RZYZnc\nPassei mal de rir com esse video… RT @Nathantham12: https://t.co/eSTNGo3XzE @cocielo mano eu te amo por me fazer rir todos os dias❤️❤️ RT @vitorio998: UM DIA SELVAGEM COM RICHARD SELVAGEM! https://t.co/Jm2GM8spQ4 via @YouTube  foda pra carai kskskssksks @cocielo RT @larissatopz: caralho eu rachei com esse vídeo do @cocielo KKSKSKSKSKSKSJJSJDJDWNSJBSJD\nhttps://t.co/KzZs2wAacN VÍDEO NOVO! UM DIA COM RICHARD SELVAGEM! https://t.co/TN6YK59hcE DEIXA O LIKE E DA RT PRA TODO MUNDO VER TBM ❤️😂🎥 UM DIA SELVAGEM COM RICHARD SELVAGEM!: https://t.co/3g1MBJuOtq via @YouTube VÍDEO NOVOOOO https://t.co/rjAALvo890 RT @GaabDelOlmo: Que saudade que eu tava de um vlogguesão TOP! @cocielo\n\nhttps://t.co/9GT1PLV81S RT @larissatopz: vídeo novo do @cocielo tá muito bom ahbsudndisndj assiste lá e deixa o like\nhttps://t.co/0kwxX9SNJP RT @coci3ar: cara, ficou sensacional esse vídeo! Haha sério, assistam que com certeza vão dar risada! @cocielo você é demais! https://t.co/… VIDEO NOVOOOO! FILMES VS VIDA REAL: https://t.co/rjAALvo890 deixa o like e compartilha pra geral assistir também! &lt;3 FILMES vs VIDA REAL: https://t.co/ytOrL9P2tA via @YouTube HOJE TEM!!! https://t.co/PyT7iYwJp8 https://t.co/EBtIUzt0Ss RT @Felps_Zero944: https://t.co/SF8BPVdhXo via @youtube @cocielo  \nCARA KKKKKK \neu nunca ri tanto na minha vida kkkkkkkkk\nParabens mano hsu… RT @well_knupp: To quase tendo um infarto de tantp rir com isso mano kkkkkkkkkk https://t.co/miYBHnUj0c     @cocielo RT @HenquePedro: https://t.co/vnx82LqlwB\nNunca ri tanto sério!!!!!! @cocielo vc é foda demais RT @Berirainha: MANO KKKKKKKKK assustei minha mãe de madrugada de tanto que eu ri kkkkkk. Melhor vídeo👏 @cocielo faz outro pfff https://t.c… RT @LuanSouza181: https://t.co/8RWMiEezIL\n____________________\n\nPQP vídeo topzeradabalada  vídeo quando é bom dura pouco,fiquei pelo triz p… TEM VÍDEO NOVO NO CANAL E É O MAIS ENGRAÇADO DE TODOS HAUAHAUAHAUAHAUAH https://t.co/7kmcvqgpUe deixa o like lá! 😂🎥 RT @apqp_Gui: https://t.co/CoLpJN7C3w KKKKKKKKKKKK minha mãe quase me bateu porque eu quase me mijei de dar risada e não conseguia falar pr… RT @soyramos_: Por favor... Façam um bem para a humanidade e assistam o vídeo do @cocielo pq tá muitoooo foda, sério kkkkk https://t.co/5Qe… RT @emillesantossa1: https://t.co/yVjp9Bbypj  \nMano a pala da minha tarde foi esse video @cocielo  nunca vi uma pessoa tão engraçada igual… RT @Gabrielbbzin: Pqp @cocielo vó infartar kkkkkkkkkkkkk salvo meu dia vei https://t.co/W8VDfFiGP7 RT @brenamaiaa: Eu to mandando o video pra todo mundo pq as pessoas merecem assistir isso KKKKKKKK @cocielo https://t.co/l0sgoz5aw5 RT @LuuhSousaah: Boooooooy, um dos vídeos que eu mais ri em toda minha vida KKKKKKKKKKKKKKKKK\n@cocielo Manooooo faz mais, sério, eu to rind… RT @o_serjo: Melhor video do ano @cocielo mito. https://t.co/Z6MmEcALLL RT @Gustavoo_Origin: Me mijei de rir😂🤣😂muito bom @cocielo https://t.co/85u3n460iR RT @MatheusIludido: https://t.co/yPj1Z9MOsq\nMano q vídeo bom namoral xkwmmxmekd\nri pra ele\nrecomendo\n@cocielo RT @KauaGammerBr: https://t.co/7cJAnZYWyM\n\nEu ri tanto desse vídeo que minha mãe até brigou comig9 kkkkk kkkkk\nMuito engraçado \n@cocielo RT @ithierry_pommot: https://t.co/qXzlH9vCQ0 kkkkkkkkkkkkkkkk to rindo dms, kkk esse @cocielo  é o bixo kkkkkkkkkkkkkk RT @jeibsonC: https://t.co/5yhWQrf1w7\nQue vídeo maravilhoso kkkkkkkkkkkkkkkkkkkk, eu acho que eu acabei me mijando por causa do vídeo kkkk… RT @mauricioschell: Melhor coisa que tu pode ver nesse domingo é: https://t.co/gWNGDswNdi @cocielo \nUDAHSDUHASUD to chorando de rir RT @Italo_Bulhoes: Mano melhor vídeo do cocielo pqp tô morrendo kkkkkkkkkkkkkkk\n@cocielo\nhttps://t.co/tCFrP70Ktd RT @MiguelGC180: Acho que nunca ri tanto na minha vida😂😂😂😂😂 @cocielo \nhttps://t.co/1T1pCpW1Ed RT @Caioocarvalho1: SUPER COPA OLHOS VENDADOS DE FUTEBOL DE SALÃO https://t.co/85iNoNy8Ae via @YouTube @cocielo que video engraçado da poha… RT @narizinhox: até agora eu to tentando entender o moleque com o pé virado akkakakakakskakkakaka\n@cocielo @igorcavalari\nhttps://t.co/cvWJU… RT @KaykeFortuna: https://t.co/ZOgja6wqTM\nQue vídeo maravilhoso kkkkkkkkkkkkkkk @cocielo braboo RT @ayru_souzaa16: Kkkkkkkkkkkkkkk senhorrr melhor vídeo do @cocielo malukooo 😂😂🤙🏻 https://t.co/rKEeh21zJj RT @fluwins: passei mal de tanto rir @cocielo !! que vídeo incrível, assistammmm 🏃‍♂️\n\nhttps://t.co/4XhvcZYfnF SUPER COPA OLHOS VENDADOS DE FUTEBOL DE SALÃO: https://t.co/ryeJi0lr8F via @YouTube SAIU VÍDEO NOVO NO CANAL! SUPER COPA OLHOS VENDADOS DE FUTEBOL DE SALÃO https://t.co/7kmcvqgpUe\nDEIXA O LIKE E DA RT PRA GERAL ASSISTIR TAMBÉM! HOJE TEM VIDEO NOVO! https://t.co/PyT7iYwJp8 &lt;3 https://t.co/hT9FYH021o RT @VictorPimenta14: PARÓDIA | Marília Mendonça - Estranho (Agora Que São Elas 2) https://t.co/npWaSMzcUG via @YouTube\nMELHOR PARÓDIA!! KKK… RT @Jhonemarti: Mano esse @cocielo é doido pprt 😂😂https://t.co/AyXuMcsByI\nEssa paródia tá o bixo pprt 😂😂😂😂 RT @arturhenrique96: https://t.co/WXdEsHV8fC Paródia nova do mito, o indivíduo mais extraordinário desse planeta! kkkkkk 🎶 @cocielo RT @Luiz_Martins28: É o melhor canal do youtube que vc quer? então tomaaa😂😂❤\n@cocielo  https://t.co/6Cpfb2R2ZJ RT @ThiagoR19875051: Kkkkkkk mlr que estranho seria cagaaaaando, mais uma paródia do mito @cocielo\n\nhttps://t.co/NbyZgirtot RT @larissaaagr: vídeo novo do @cocielo, corre lá assistir rsrsrrsdeixaolikersrsrsrsrs\nhttps://t.co/iGMTXJUPDI RT @lollyputaa: KKKKKKKKKKKKKKK MUITO BOM @COCIELO\n'' E UM PEIDO ALTO FAZ TODO MUNDO RIR DE DESESPERO '' PARÓDIA | Marília Mendonça - Estra… RT @GaabDelOlmo: PUTA PARÓDIA FODAAAA KKKKK\n@cocielo \n https://t.co/K7TZs9e92l VÍDEO NOVOOOO! PARÓDIA ESTRANHO MARÍLIA MENDONÇA: https://t.co/9aY9p2C5Tu marca aqui o seu amigo que ri de qualquer besteira 😂😂😂 deixa o like lá e da RT pra geral assistir também 🎥 PARÓDIA | Marília Mendonça - Estranho (Agora Que São Elas 2): https://t.co/UrS3KQQPPD via @YouTube HOJE TEM VIDEO NOVO HEIN! PREPARA O LIKE! https://t.co/PyT7iYwJp8 &lt;3 https://t.co/hxSyAl44rb RT @JovemCacheado: “Continue fazendo as pessoas felizes e apenas seja você mesmo.”\n\n– Zlatan Ibrahimovic. \n\n@cocielo\nhttps://t.co/bYl5h74qh5 RT @GabriiielMelo: Na moral, to felizão pelo @cocielo por causa desse video. Entendo ele, também sou fã demais do @Ibra_official!!! Queria… RT @careolioti: que vídeo incrível e que cara sensacional é ibrahimovic !!!\n@cocielo fico feliz de ver você realizando seus sonhos, merece… RT @xSamuellMC_: Que Video do karalho @cocielo https://t.co/a8I42pR43n RT @GaabDelOlmo: Puta encontro foda cara, fora do comum!!\n@cocielo \nhttps://t.co/rHt6WzbvHG IBRAHIMOVIC ASSINOU MINHA COLEÇÃO DE CAMISAS!!! #CANALHARESPONDE 26: https://t.co/it79sxI3jC via @YouTube SAIU VIDEO NOVO NO CANAL COM @IBRA_OFFICIAL ASSINANDO MINHA COLEÇÃO DE CAMISAS! https://t.co/94cYBbWgUa DEIXA O LIKE LÁ E DA RT AQUI PRA GERAL ASSISTIR &lt;3 HOJE TEM VIDEO NOVO E MUITO ESPECIAL NO CANAL! https://t.co/PyT7iYwJp8 https://t.co/LrviRfvyQ7 RT @vinicuinhos: esse foi o video que eu mais ri na minha vida, obrigado @cocielo \nhttps://t.co/bmod2Tc5Op COPA CIRROSE DA DESTRUIÇÃO!!!: https://t.co/lCsqPW7HWg via @YouTube VÍDEO NOVO!!! COPA CIRROSE DA DESTRUIÇÃO https://t.co/WT1nTjHeQW deixa o like e da te pra todo mundo assistir também! 😂🎉🙏🏻 RT @gomezjuligor: saiu vídeo novo no canal do @cocielo https://t.co/sQX3Ov76pl corre pra assistir e não esquece de deixar o belíssimo like… VÍDEO NOVO!!!! EU NÃO SEI NADAR: https://t.co/iNvdrQyBun DEIXA O LIKE! 😂🎥 EU NÃO SEI NADAR: https://t.co/wGVYcL09zv via @YouTube IGNORÂNCIA: https://t.co/evgnC62RVQ via @YouTube -&gt; https://t.co/ArPdW4LBy4 sobre tudo que tá rolando https://t.co/siQUpz8tC9 RT @brunakailanee: https://t.co/cUoemMHkJR vídeo novo do @cocielo deixem o like se inscrevam no canal e compartilha com geral ❤ RT @TathiAndraade: Amo quando o @juliococielo faz esses tipo de vídeo. 😂❤️ https://t.co/AYgrFr7m99 RT @Febatista: Gostei de um vídeo @YouTube de @juliococielo https://t.co/TDRhSwfXUP 10 MILHÕES DE INSCRITOS!!! RT @bruninhasilva61: https://t.co/XrL0LCT5BJ video novo do @juliococielo ,asssistam que ta fodaa ❤❤,deixa o like e se inscreva no canal RT @sullivanmaicon_: kkkkkkkkkkkkkkkkkkkkkkkkkkkkkk muito bom, na moral!\n\nPLAYLIST DE FUNK EXTRAORDINÁRIA https://t.co/n8Hgb2XZ3X via @YouT… RT @bruninhasilva61: ARANHAS QUE LATEM DOBRADINHA CUP: https://t.co/5k02MVEJ6a via @YouTube vidhao novo do @juliococielo ❤ deixa o like e s… RT @L3DDYRINE: QUANDO NÃO TEM NINGUÉM EM CASA #RewindBr https://t.co/QAC2kQe4t8 RT @Leh_Marchesi: @juliococielo se liga nessa montagem, seloko https://t.co/WGTbke4Hw8 RT @drallpicsters: É de avisos e tal, mas pelo menos é vídeo novo hujbvwqyucivqw @juliococielo https://t.co/JTUjo4iPpg RT @jcocielosz: COOOORRRE QUE TEM VÍDEO NOVO GALEROUS @juliococielo http://t.co/MD89wem3WN RT @FC_dosFcs: #CanalCanalha2Milhoes é tetraaaaa é tetraaaa 2 milhões caralhooooo http://t.co/WQuFWt6Ncq RT @feer_raissa: Vídeo novo do maravilhoso @juliococielo auehuehuaeh muito foda https://t.co/8N4X9TB6Cz vale a pena ver! auehueh scrr &lt;3 RT @EuSarrii: @juliococielo vc só fala merda fera RT @Eriic_Galliano: @juliococielo http://t.co/nZ1GvrTBQP RT @_Este9Ester: Nunca vou comprar um filme do Shrek pros meus filhos em uma feira\n@juliococielo- AMBULANTES E O SHREK ERÓTICO https://t.co… RT @sexyblondehoran: AE CARAI VIDEO NOVO! SEMPRE ASSIM! KKKKK AMBULANTES E O SHREK ERÓTICO @juliococielo  http://t.co/P0eseAainM RT @olocoziam: NOSSA QUE MEDO PARECE SER MUITO FEROZ MESMO @juliococielo http://t.co/m1WdmGGa1P RT @millenagui: @juliococielo sla, achei parecido HAUAHAUAHAUAHAUAHAUAHUAHAUAHAUAHHAUAHAUAHUAHAUAHAUAHUAH (eu n sou mto normal) http://t.co… RT @fuckingslimshad: GARÇONS E A MALIGNA TAXA DE SERVIÇO - gostei de mais viu 😍👏 ri de mais ❤️ Ta bonito hein Julio 🌚 @juliococielo  http:/… RT @euvirtua: FDP ASUIODHUIDHSAUIHDASUIHDUISAH - @juliococielo RÉ NO QUIBE SEM QUERER! #CANALHARESPONDE 13: http://t.co/9E4Curfn35 via @You… RT @directiornah: COMO EU AMO ESSE HOMEM http://t.co/1cem7bQvU1 assistam ao novo video do @juliococielo e me digam o que acharam RT @euvirtua: revendo o vídeo da semana @JulioCocielo #CANALHARESPONDE 12 DE ROCKY BALBOA: http://t.co/e9mbVwnvGj via @YouTube RT @distturbs: eu acho que já voltei no inicio do video do @juliococielo umas cinco vezes só pra ver aquele lindo twerk que ele faz (tô enc… RT @euvirtua: ASDUOIHADUSAIDISAHDIUSAHDOI fdp @juliococielo #CANALHARESPONDE 12 DE ROCKY BALBOA: http://t.co/e9mbVwnvGj via @YouTube RT @Emanuel_XY: @juliococielo http://t.co/m7O2omhdrP RT @Emanuel_XY: @juliococielo não ta fácil pra ninguém™ RT @_moreiralice: @juliococielo Falai ze droguinha RT @About_A_Giirl: kkkkkkkkkkkkkkkkkkkkkkkkkkkkkkkkkkkk https://t.co/IVyvpVXQiy me tirou da deprê @juliococielo RT @luizotaviocdz: HOJE TEM VIDEO NOVO DO @juliococielo  PORRA RT @pfvraffa: @juliococielo vai dormir caralho RT @pfvraffa: https://t.co/oEpA0FJzMn\n\n@juliococielo  HAUAHUAH o melhor vei RT @MicheleShiba: Cocielo best mendigueiro BR RT @lisagiovana: @juliococielo aqui em Brasília é din din... RT @MicheleShiba: Beijim no ombro, 50 QU3M F3CH4 C0M 0 80ND3 RT @magicstoran: Vao ali rapidinho no youtube ver o video novo do @juliococielo http://t.co/JOWrUHH1Ed RT @MicheleShiba: Sobre: RT @juliococielo: eaí seus cone http://t.co/AfcfFIPWXv RT @magicstoran: ATENÇÃO: @juliococielo inova transando com um ps3 http://t.co/ensMpaOZEP RT @magicstoran: @juliococielo nao, voce é um principe, super simpatico. Super apaixonantezinho RT @koeanaa: cara dou mt risada com os videos do @juliococielo RT @magicstoran: MANOO VOCE É FODA http://t.co/OhPoLbhStz @juliococielo RT @magicstoran: Assistam http://t.co/OhPoLbhStz do @juliococielo e me falem o que voces acharam rawn RT @lisagiovana: @juliococielo racho a conta e vivo dando presente-surpresa... Acho q sou o macho da relação :s RT @Neguinhamesmo: @juliococielo  Na Boa a maioria dos negros ta pouco se fudendo pra esse dia ¬¬' RT @felipesales1: Tive que parar no meio do video pra ir no banheiro de tanto rir uashhsuah#CANALHARESPONDE : http://t.co/sVQbV7Ftq6 via @j… RT @falaeju: #CitePessoasLindasDoTwitter @juliococielo RT @VsfDj: Gostei de um vídeo @YouTube de @juliococielo http://t.co/Z5TzkRLAfU 10 MANDAMENTOS DO REI DO BAILE FUNK RT @felipesales1: @juliococielo agregando valor ao camarote! 10 MANDAMENTOS DO REI DO BAILE FUNK: http://t.co/KrW8ZhtE7P via @youtube RT @Thiago_Idalgo: minhas 2 vós só serve memo pra eu quebrar o braço delas as vezes na hora da raiva RT @CarolSerikyaku: Mostrei o Canal do @juliococielo pro meu irmão, e agora é Canal Canalha 24 horas por dia...hahahahah RT @alocarneiro: Gostei de um vídeo @YouTube de @juliococielo http://t.co/f0yoK1WJCn ENCONTRO COM OS INSCRITOS - YOUPIX 2013 RT @Somente1Garota_: Se eu chorei e ri com o novo video do @juliococielo ? Não magina &lt;3 Perfeito http://t.co/QFQpbuQ8tk RT @MarcosRLJ: @juliococielo Pegaria, só não ia conseguir pegar ela pelo braço. RT @MarcosRLJ: @juliococielo quem te bateu? RT @MarcosRLJ: To rindo demais com o vídeo do @juliococielo, assiste isso na boa! http://t.co/gvGMRwES RT @Somente1Garota_: \"Vi um filminho da minha vida passar\" aushuahs @juliococielo é foda :) x : http://t.co/xjbsn0Qg RT @Somente1Garota_: @juliococielo Siiiim \\õ :) x ♥ RT @Somente1Garota_: \"Estou pensando em me matar para não morrer \" Só o @juliococielo pra fazer mais um video Foda com sabias palavras . ... RT @Somente1Garota_: @juliococielo Upaa \\oo/ Pelamor RT @matheusramone10: Ace Of Spades é a música perfeita pra sair atropelando pessoas Se precisar estamos aí @taynadoll, IUHEIAHEUIHEUIHAUIE RT @leosirotheau: Vi Romário ser artilheiro no fim da carreira. Vi #ronaldo SEM GOLS no fim da carreira. Vi Rivaldo marcando golaço aos  ...", "bag_of_tweets": ["A SAVEIRO DOS SONHOS 👉🏻 https://t.co/bsklnuJma5", "RT @emillyav_: Vão lá ver o júlio reagindo aos primeiros vídeos dele KKKKKKKKKKKKKK\n@cocielo\n\nhttps://t.co/bQN7aZMue8", "RT @romenodefante: videoclip nou de tati piroca cu @cocielo ! Fericire!!!! \n\nhttps://t.co/mSlw8hvmCs", "RT @omarcelofaria: T3STICUL0 ELETRIZANTE!!! - SINUCASTIGO COM DIOGO DEFANTE! https://t.co/8t4DzxkUbE via @YouTube", "RT @AlemaoDefante: NEUES VIDEO MIT MEINEM FREUND @cocielo \n\nhttps://t.co/beJnf2C56B", "RT @InspiroTacielo: VÍDEO NOVO NO CANAL CANALHA!! (T3STICUL0 ELETRIZANTE!!! - SINUCASTIGO COM DIOGO DEFANTE!)\n\nAcho que nesse momento a Ter…", "RT @Law_Mateus42: T3STICUL0 ELETRIZANTE!!! - SINUCASTIGO COM DIOGO DEFANTE! https://t.co/aFMalQAzwn via @YouTube", "RT @mynameisCami_la: Esse vídeo ISHSUSJWKAKAJJAJAJAJAJAJAKQLAHWBZJAJ eu tô passando mal https://t.co/pQR3MARl7t", "RT @yGabiGol: T3STICUL0 ELETRIZANTE!!! - SINUCASTIGO COM DIOGO DEFANTE! https://t.co/TdDZibKgNZ via @YouTube \n\ntoda vez que eu vejo um víde…", "RT @kp_menez: Nunca ri tanto com um vídeo.\n@cocielo é fera d+ tu uma inspiração real. Te admiro muito. \nJá deixem seu like e se inscrevam l…", "RT @sennacamy: O @cocielo arrasou mais uma vez!\nVão no Canal Canalha e assistam  O Encontro de Away, Dileira &amp; Psiu- Tourettcast #2,está di…", "RT @yGabiGol: mais uma vez Júlio trazendo um conteúdo diferenciado para nossa alegria! outro obra prima para os melhores vídeos da internet…", "RT @GabrielnBoldo: O ENCONTRO DE AWAY, DILEIRA &amp; PSIU - TOURETTCAST #2 https://t.co/avTjttVA6k via @YouTube provavelmente se não for a melh…", "TCHÊ LENGO LENGO DO AMOR ❤️ https://t.co/zCUebEuDR6", "RT @Matheus18658736: Aaaaah mano eu amo o @cocielo Puta que pariu https://t.co/DLbd4GjnQZ", "RT @Raqu3ls: Eu nunca falei mas uma das minhas maiores inspirações é o @cocielo,  sendo no futebol ou na vida. ele é um maluco incrível e i…", "RT @pedroripis: @cocielo,tá aí um cara que eu respeito demais, além de sempre fazer vídeos incríveis,também batalhou demais e sempre fez qu…", "RT @MateusRochaa3: @cocielo parabéns pelas suas conquistas, tô aqui a mó cota, na suavidade, vc é pika, vc merece @cocielo\n\nhttps://t.co/gZ…", "RT @emillyav_: Vão lá ver vídeo do Maior gamer do mundo KKKKKKKKKKKKKKKKKK\n@cocielo \nhttps://t.co/8LSjsS1NJj", "VÍDEO NOVO NO MEU CANAL DE FUTEBOL! LETÍCIA DESABAFOU E ME DEIXOU EMOCIONADO 🥺 https://t.co/BZmLmXLZK0", "RT @brun0birk: Mano, melhor video da internet!! \n@cocielo  \nhttps://t.co/QmEYqCNj1y", "RT @yGabiGol: O ENCONTRO DE ALEK FUMASA, DILEIRA &amp; PSIU - TOURETTCAST #1 https://t.co/BVNrbnW96w via @YouTube  junto com \"O ÚLTIMO PRÍNCIPE…", "RT @Covalskii: Haushsushshsjsjahahahsu\nUauahahahauauusua\nHausjauauaua\nHauajauahahaua\nHauauauauauuajw\nHahahahahahahahahahahahahahahahhahahah…", "RT @Caio18Castro: Obrigado mestre @cocielo pelo melhor vídeo que já vi 🙌🙌🙌 https://t.co/ibtJSu4hi8", "RT @IzidoroJu: pérola do YouTube \n\nhttps://t.co/WvsT1J4NAq", "RT @GaruMatheus: Hahaha genial\nhttps://t.co/UlBL0qPucU", "RT @Vxvsk: tenho que compartilhar essa obra de arte, não tem como kkkkkkkkkk https://t.co/LHn1FPukmh", "RT @jot2_: moleque não da com esses 3 cara KKKKKKKKKKKK https://t.co/3gjygDMKNd", "RT @pkmoret: velho esse encontro kajdjajdkkk\n\nhttps://t.co/irbJn823cS", "RT @RaulzM_: https://t.co/hKXFykJUJj\n\nMelhor vídeo do YouTube mundial by far \nKkkkkkkkkkkk", "RT @Allyzon__: https://t.co/ow3oZWYh3T\nNão tem como não rir com esse vídeo KSKSKSKSKSKSM", "RT @LmChizzotti: ISSO É MUITO BOM KKKKKK\nhttps://t.co/lCZJf4ycHl", "RT @NotLifas: https://t.co/LrxQnxGVOx\nMelhor podcast de sempre e so tem 1 episódio", "RT @RaulFagundes11: CARALHO MUITO BOM NÃO PARO DE RIR KKKKKKKKKKKKKLK\n\nhttps://t.co/fVtBmAMAq0", "RT @didistpx: https://t.co/nROrOyfvyf\n\nEu não acredito que esse vídeo existe.\nEu não acredito noque eu acabei de ver.\nAcho que zerei a vida…", "VÍDEO NOVO! O ENCONTRO DE ALEK, DILEIRA E PSIU! O MELHOR CROSSOVER DA INTERNET BRASILEIRA: https://t.co/BS7N06odlb 😂🎥🎙 #TouretteCast", "RT @emillyav_: Passei mal com esse vídeo,vai lá ver pelo amor de Deus KKKKKKKKKKKKKKKKKKKKKK https://t.co/iKoHL5r5lI\n@cocielo", "VIDEO NOVO! Demonião pervertido: https://t.co/r5R2tIBAP5 corre pra assistir e deixa o like lá 😂🎥🙏🏻", "RT @whoiscarol2: Impossível juntar Among Us  o @cocielo e não sair do vídeo chorando de ri \nO IMPOSTOR MAIS BURRO DA HISTÓRIA DO AMONG KKKK…", "RT @emillyav_: Genteeee vão lá ver o júlio jogar among us KKKKKKKKKKKKK https://t.co/O2eCLGdYCT\n@cocielo", "VÍDEO NOVO! O IMPOSTOR MAIS BURRO DA HISTÓRIA DO AMOUNG KKKKKKKKKKKKKKKKKK: https://t.co/sh0V6HKvKf Corre pra ver e deixa o like lá 😂😂😂😂🙌🏻", "RT @Juliofortin1: Melhor video do canal do @cocielo   to rindo pra caralho por conta desses dois o @dileraOficial e o @Leandropsiu KKKKKKKK…", "VÍDEO NOVO! TOCANDO BANDA DJAVÚ E BARÕES DA PISADINHA NO GUITAR HERO 🎮🎬\nhttps://t.co/LWd5hichxx", "RT @joycemilla_: https://t.co/XW8vYzPoPb\nO vídeo tem 55 minutos e eu morri de rir do começo ao fim KKKKKKKKKKKKKKK Por mim esse vídeo teria…", "RT @sennacamy: O @cocielo se supera e arrasa á cada vídeo que posta!Vídeo novo no Canal Canalha,O Encontro de Dilera &amp; Psiu!Sinucastigo da…", "RT @VxtinFN: Melhor vídeo de 2020  tô chorando de rir KKKKKKKKKK @cocielo\nhttps://t.co/xxJaMTl4DD", "https://t.co/iG4pYel3sJ 😂🙌🏻 https://t.co/3s1UBmKaBR", "https://t.co/iG4pYel3sJ 🙌🏻 https://t.co/AC6GCuI4Xv", "RT @LuisGNoel_FFC: https://t.co/vs0IpSfapQ\no melhor vídeo da história do youtube @cocielo @igorcavalari @Leandropsiu @dileraOficial", "RT @ga221162: https://t.co/OX644rxegj\n\nesse é o melhor video de 2020 facil \nolhei so 5 minutos e to chorando de tanto rir \ne o video tem 55…", "RT @BynowHu3: Mano!!! \nPQP como o Julio Cocielo é foda HAHAHA\nJuntou o @dileraOficial e o @Leandropsiu  pra fazer um sinucastigo HAHAHA FOD…", "https://t.co/iG4pYel3sJ https://t.co/lPkciUOG2A", "https://t.co/iG4pYel3sJ https://t.co/2XV6m7RaEz", "RT @yGabiGol: O ENCONTRO DE DILERA &amp; PSIU - SINUCASTIGO DA TOURETTE!!! https://t.co/Fy1sfCsoYx via @YouTube \nse esse não é um dos melhores…", "RT @jotapef_: véi sem condições alguma, esse vídeo é o melhor da história do youtube 😂😂😂🤣\n\nhttps://t.co/ysjz2Oejsa @cocielo", "VÍDEO NOVO!!!!!!\nO ENCONTRO DE DILERA &amp; PSIU! SINUCASTIGO DA TOURETTE 🎱😂 https://t.co/iG4pYel3sJ", "RT @fpsmackz: Valorize as coisas pequenas, pra gente ter sempre combustível para seguir em frente. \n\n@cocielo  \nhttps://t.co/pYPCUcCnze\n\nNã…", "RT @BarbosaWildes: especial de 20 milhões do @cocielo  é um baita motivacional", "RT @David_Peres1903: Nu que vídeo foda do @cocielo, especial de 20M, me emocionei tio kkkkkkkkkkkk https://t.co/bnT9kTylib", "RT @BChaves_01: Uma grande inspiração pra mim sou grato por tudo que me proporcionou esse cara merece tudo que conquistou e muito mais ....…", "RT @gois_bruno1: Um dos melhores vídeos que já vi, por isso sempre fui fã desse cara 😍 ⁦@cocielo⁩  https://t.co/PwxBCF6DEU", "RT @LeonanTV: Um exemplo de na vida, vc é foda @cocielo \n\nhttps://t.co/Xvl6gLWE1F", "RT @Sillas__: @cocielo me fez chorar no video de 10 milhões, no pedido de casamento, no video de casamento, e no video de nascimento da Bia…", "RT @pedro_tirico: \"O medo de errar, numk pode ser maior que a vontade de conseguir\" by: @cocielo \n\nLevarei isso pra vida... seus vídeos sem…", "RT @Mr_JoaoGoulart: Chorei real vendo o vídeo de 20 milhões do @cocielo que muleque foda, sou fã demais", "RT @Luiz_EduardoVR: Que vídeo foda de 20 milhões do @cocielo, mlk é monstro mano", "RT @MimihPurdy_: Estou completamente desidratada de tanto chorar pós vídeo de 20 milhões do @cocielo 😭😭😭\nCaralho meu, te amo forte! Obrigad…", "RT @fer_hardmann: o @cocielo é o melhor youtuber de todos, tô chorando pra caralho no especial de 20 milhões", "RT @Luiss_hq: @cocielo é brabo, n tem como... humildade em pessoa, merecedor de tudo que conquistou e vai conquistar, ícone do youtube bras…", "VÍDEO NOVO JOGANDO CS: https://t.co/qy77k45ADl deixa o like lá 🤣🙌🏻🎥", "RT @Caulls_: Já pode ir lá ver o vídeo do @cocielo \nhttps://t.co/mz9kDvs7TS", "RT @sennacamy: Mano, eu ADOREI o novo vídeo do @cocielo sobre Os Palpiteiros Digitais! Isso me irrita demais também! O bom do Cocielo que e…", "VÍDEO NOVOOOOO! fruit ninja das rave: https://t.co/10FmH9SEnu corre pra assistir e deixa o like lá 😂🎥🙌🏻", "RT @reason_tacielo: Saiu vídeo novo no canal do @cocielo \nCorram pra ver!!!!\n\nhttps://t.co/zBpyvZ848T https://t.co/tjgWROMclE", "RT @sennacamy: Saiu vídeo novo no canal de Games do @cocielo !\nVão conferir, está demais! \nAdoro ver o Cocielo jogando no VR! É mto engraça…", "VÍDEO NOVOOOOO! o dia em que a minha filha nasceu: https://t.co/0BIp32FMgW corre pra assistir de deixa o like lá 😂🎥🙌🏻", "VÍDEO NOVO! A INGRATIDÃO MALÍGNA: https://t.co/7A9emtMMMw 😱🙌🏻🎥😂 corre pra assistir!", "VÍDEO NOVOOOOO!!!! DE CUECA E CROCS CAUSANDO NA QUEBRADA: https://t.co/soF3lbYwnm corre pra assistir e deixa o like lá 🙌🏻🎥😂", "VÍDEO NOVOOOOO! NUNCA MEXA COM BAIANINHO DE MAUÁ: https://t.co/7UvtNRTKBw corre pra assistir e deixa o like lá 🧙‍♂️🎥😂🙌🏻🎱", "vídeo novo! COMO COCIELO E IGÃO  SE APAIXONARAM... PELO FUTEBOL! https://t.co/I2BOqmVm3n corre pra assistir e deixa o like ⚽️🙌🏻🎥", "SAIU VÍDEO NOVO! O PISTOLEIRO DO SLOW MOTION: https://t.co/zoNZ015WrD corre pra assistir e deixa o like lá 🎥🙌🏻😂", "RT @vitor_zordan: Man tava vendo um vídeo do @cocielo \nQue saiu hj \nQue nostalgia do WINING elevem 🌚\nr6 robaaaado \nR7 é meu ovo \nRoberto Ca…", "VÍDEO NOVO! ROBERTO CARLOS NO ATAQUE É APELAÇÃO! https://t.co/JFSprseUpQ corre pra assistir e deixa o like lá 🙌🏻😂🎥", "RT @Aninha_Mattioli: Pqp, o melhor mano kkkkk.   @cocielo                                       https://t.co/Nazcmb635z", "RT @yanrochaaa: kkkkkkkkkk muito bom, tá doido @cocielo\nhttps://t.co/brlr936psV", "VÍDEO NOVOOOOOO! tédio entediante da quarentena: https://t.co/X1zYnOumTy corre pra assistir e deixa o like lá 😂🙌🏻🎥", "VÍDEO NOVO!!! realizando o sonho de ser um rato 😂🐀 https://t.co/G7U5qL5SdZ corre pra assistir e deixa o like lá 🙌🏻🎥", "ACABOU DE SAIR VIDEO NOVOOOO! porrada em realidade virtual! https://t.co/Uxk3rcg0vm 🥊 corre pra assistir e deixa o like lá 😂🎥🙌🏻", "AAAAAAA SAIU VÍDEO NOVO! SINUCASTIGO COM ANDRÉ VILÃO: https://t.co/kkRAjTTvHU corre pra assistir e deixa o like lá 🎱😂🎥🙌🏻", "RT @luluisfernando2: Que vídeo pala kkkkkkkk @cocielo     O ASSUSTADOR CORONAVÍRUS https://t.co/4zBWChA2x1 via @YouTube", "RT @larissakonrath: vídeo novo do @cocielo tá mt bom vai se foder JSNSSJISJSISKSOKAeu amo esse homem\nhttps://t.co/J3tn2KSmv8", "VÍDEO NOVO!!! O ASSUSTADOR CORONAVÍRUS: https://t.co/9ZCy9Xf3dY corre pra assistir e deixa o like lá 😂🎥🙌🏻", "VÍDEO NOVOOOOO! com muito Rage 😂🔥 https://t.co/qsKvEhDgan corre pra assistir e deixa o like lá 🎥🙌🏻", "RT @Locutador: COMO VOCÊ LIMPA A BUNDA??? - INDEBATIVEIS DEBATES https://t.co/fWOdWrgEOc via @YouTube", "RT @tributehunter: KKKKKKKKKKK eu nunca ri tanto vendo um vídeo \nCOMO VOCÊ LIMPA A BUNDA??? - INDEBATIVEIS DEBATES https://t.co/0MFKoIorc4", "RT @jessiclim: Estou de folga, deixa eye ver o YouTube:     COMO VOCÊ LIMPA A BUNDA??? - INDEBATIVEIS DEBATES https://t.co/YENQ7ulzEv @coci…", "VÍDEO NOVO! como você limpa a bunda? https://t.co/VYCMrqHPfZ 😂😂😂😂🎥💩 corre pra assistir e deixa o like lá 🙌🏻", "SAIU VÍDEO NOVO NO CANAL! Reagindo a versão japonesa dos super heróis: https://t.co/2T8naTuEUw corre pra assistir e deixa o like lá 🙌🏻😂🎥", "VÍDEO NOVOOOOO! avestruzes x dinossauros: https://t.co/wcdHFMU33K corre pra assistir e deixa o like lá 🦖⚽️😂🎥", "RT @Camisrussiandol: CHORA QUE ELE NÃO VEM MAIS ♫ ft AFONSO PADILHA | Paródia Anitta e Marili... https://t.co/J6sFjIhdNI via @YouTube \n@coc…", "RT @lucxspereira: @cocielo lansou a braba \nkkkkkk\nhttps://t.co/J3omPxXEOZ", "RT @imarianalves: Alooooooo @cocielo essa paródia tá sensacional demais av https://t.co/Uzay3VOTXb", "RT @Giovanny5Campos: https://t.co/Q3oekA9sqX\nQue paródia foda hein @afonsopadilha_  é @cocielo", "RT @jellieljamerson: Kkkkkkkkkkkkk queria mostrar esse vídeo para meus amigos que o pai saiu pra comprar cigarro kkkkkkkkkkkkkk eu num tô a…", "RT @karynemoura_: VÍDEO NOVOOOOO! CHORA QUE ELE NÃO VEM MAIS 🎵 https://t.co/nLCL0W3ILz corre pra assistir e deixa o like lá  euuuuuu ameiii…", "RT @Clebinho_Smith: Valeu @cocielo tu fez uma musica pra mim kkkkkkkkkkkkkkkkkkkkkkkkkkkkii https://t.co/rqxPFpHNk8", "RT @coci3ar: Dois ícones da comédia com uma paródia sensacional, mostrando como um problema pode ser transformado em brincadeira! \n\n@cociel…", "VÍDEO NOVOOOOO! CHORA QUE ELE NÃO VEM MAIS 🎵 https://t.co/YQoBcUx6kC corre pra assistir e deixa o like lá 😂🙌🏻🎥", "HOJE TEM VÍDEO NOVO! 😂🎥🙌🏻 https://t.co/oGYjVt2RKV", "VÍDEO NOVOOOOOO! MINHA MARAVILHOSA COLEÇÃO DE SONIC: https://t.co/jOCWl1CZ9k corre pra assistir e deixa o like lá 🎥😂🙌🏻🕹", "VÍDEO NOVO! criando uma batalha de aspiradores: https://t.co/0IVw3LCUtj corre pra assistir e deixa o like lá 🎥🙌🏻😂🎉", "RT @MrPoladoful: MANO esse video do @cocielo 😂😂😂😂😂😂😂😂😂😂🤣🤣🤣🤣🤣vtnc raxei o biko\n\nEU NO BIG BROTHER BRASIL 2020 https://t.co/uigFjUEGk9 via @Y…", "VÍDEO NOVOOOOO: https://t.co/xt7HfYMePc corre pra assistir e deixa o like lá 😂🙌🏻🎥", "VÍDEO NOVOOOO! o dia em que eu fui um taco humano: https://t.co/zwfmZPMH92 corre pra assistir e deixa o like lá 🎥😂🎱🙌🏻", "VÍDEO NOVOOOOOO: https://t.co/mDfqwcVdLl", "VÍDEO NOVOOOO! QUERO UM NATAL DIFERENTE 🎵https://t.co/lusDGkq7Rv corre pra assistir e deixa o like lá 🎄😂☝🏻", "PRA QUEM SEMPRE PEDIU, TÁ AÍ O SEGUNDO VÍDEO JOGANDO GUITAR HEROOOOO: https://t.co/GXvvT566mh 🙌🏻🎸😂", "VÍDEO NOVOOOOO! PENALIDADES ENSABOADAS 3: https://t.co/xBCHG2F4NP corre pra assistir e deixa o like lá 😂⚽️🎥🧼", "VÍDEO NOVOOOOO! conheça a história do bomba patch: https://t.co/Er0y88BUhL deixa o like lá, corre pra assistir 🙌🏻🎥", "RT @Brun0MM: O @cocielo fez um brega funk de cavaleiros do Zodíaco, puta pariu q foda sksksk\n\nhttps://t.co/gzYcBYUABu", "RT @cameron_santos_: Depois da música do Melot do DragonBall em 2015 temos agora o Ritmo do zodíaco Kkkkkkkkk\n\nhttps://t.co/xNI8BeCgHx", "RT @sseiiya: Mano kkkkkkkkkkkkkkkkkkkkkkkkkkkkkkkkkkkkkkk RITMO DO ZODÍACO ♫ KOTZ 2019 (DJ Junior Santorini) https://t.co/rZkgELX6Nb via @Y…", "VÍDEO NOVOOOOO! RITIMO DO ZODÍACO 🎵 https://t.co/kIiPKxxHGL deixa o like la 😂🙌🏻", "VÍDEO NOVOOOOO: os bastidores do zodíaco: https://t.co/y5Nf1mOM0I corre pra assistir e deixa o like lá 🙌🏻😂", "FUTEBOL DE SALTO ALTO 👠 https://t.co/F3WioJy1aB corre pra assistir e deixa o like lá", "RT @SPQR_Diego1: o @cocielo não da hahaahahahhhahha genio \n\nhttps://t.co/a5FlkJEVgc", "RT @iamcatatau: JOGANDO FUTEBOL DE SALTO ALTO!!! https://t.co/xvrfSvkjsG via @YouTube ahahhahahahahahahah pqp mt bom. Mas Deus me dibre faz…", "RT @brenamaiaa: O video mais esperado nesse fim de semana kkkkk @cocielo\n\nhttps://t.co/ST5jMMZgwZ", "VÍDEO NOVOOOOOO! Jogando futebol de salto alto: https://t.co/F3WioJy1aB corre pra assistir e deixa o like lá 😂👠⚽️🎥", "VÍDEO NOVOOOO! tiringa em realidade virtual: https://t.co/ySNAgUXNEl corre pra assistir e deixa o like lá 😂🎮🙌🏻", "VIDEO NOVOOOO! GANHEI DE UM PROFISSIONAL?! https://t.co/e6Qi8DMulG corre pra assistir e deixa o like lá 🏆🙌🏻🎮😂🎥", "RT @DaudHenrique: Ou geral vê esse vídeo é  muito bom TIRINGA ELETROCUTADO - SINUCASTIGO!!! https://t.co/heGGKy91oo via @cocielo @YouTubeBr…", "VIDEO NOVOOOOO! TIRINGA ELETROCUTADO: https://t.co/5wTXuHIroT corre pra assistir e deixa o like lá, tá engraçado demais 😂🙌🏻🎉🎥", "HOJE AS 19:00h TEM VIDEO NOVO! https://t.co/53QU7xD6kC 🙌🏻😂🎥 https://t.co/tu5jtqpqnS", "VÍDEO NOVOOOOOOO https://t.co/rWEvqaJCFt 🙌🏻🤣🎮", "VÍDEO NOVOOOOO! a batalha mais eletrizante e alucinante da galáxia: https://t.co/rWEvqaJCFt corre pra assistir e deixa o like lá 🎥🎮🎉😂", "VÍDEO NOVOOOOO! VOU SER PAI, TIOZÃO &amp; STRESS FEMININO: https://t.co/kE7FfmCHKL deixa o like lá! corre pra assistir 🙌🏻😂🎥🎉", "VÍDEO NOVOOOO! JOGANDO JOGO DE TERROR EM REALIDADE VIRTUAL E CAGANDO DE MEDO: https://t.co/YdBS3OHtcq corre pra assistir e deixa o like lá 😢🎮🙌🏻😂🎥", "VÍDEO NOVOOOOO https://t.co/YM0gfbKWyp 😂🎮🙌🏻", "VÍDEO NOVO! X1 COM O DEMONIÃO ENORME: https://t.co/YM0gfbKWyp corre pra assistir e deixa o like lá 😂🎥🎮🙌🏻🔥", "VÍDEO NOVOOOOOOO! DESAFIO ALEATÓRIO IMPROVISATOR DO TRAVESSÃO: https://t.co/N0eIDFJmK9 corre pra assistir e deixa o like lá 🎥🙌🏻⚽️🔥", "VÍDEO NOVOOOOO! TREINANDO PARA SER PAI: https://t.co/qJXHskkDQX corre pra assistir e deixa o like lá 😂🎥🙌🏻", "VÍDEO NOVOOOOO https://t.co/Kpno1o3hEm", "VÍDEO NOVO COM O MAIOR CLÁSSICO ESPORTIVO DA HISTÓRIA DOS GAMES! PINGUINS X DINOSSAUROS: https://t.co/Kpno1o3hEm corre pra assistir e deixa o like lá 🎥😂🙌🏻", "VÍDEO NOVOOOOO! GANHEI DO BAININHO DE MAUÁ: https://t.co/AjC17LR3rF corre pra assistir e deixa o like lá 🎱😂🙌🏻🔥🎥", "VÍDEO NOVOOOOOO! PÕE A MONTANHA RUSSA NO MEU NOME 😂: https://t.co/z3iLbj1ZJJ corre pra assistir, deixa o like lá e da rt aqui pra geral assistir também 🎥😂🙌🏻", "VÍDEO NOVO NOSTÁLGICO! BOMBA PATCH ATUALIZADO É O 4.1 🎵 https://t.co/ggg7BmWfYo corre pra assistir, deixa o like lá, e da rt pra geral ver também 🎥😂🙌🏻🔥⚽️", "VÍDEO NOVOOOO! o dia em que quase matei meu cachorro: https://t.co/0vg4SrHOdF corre pra assistir e deixa o like lá 🔥🙌🏻🎥", "VÍDEO NOVOOOO! segundo diário de viagem da Disney: https://t.co/SKNPG8Q19K deixa o like lá, é nóis 😂🎥🙌🏻", "VÍDEO NOVOOOOO! https://t.co/MMj58xglfU corre pra assistir e deixa o like lá 🙌🏻🔥😂🎥", "RT @KauaGammerBr: https://t.co/GaWs7oSUCs\n\n\"Vc vai bater o recorde do quadro que ninguém nunca fez\" kkkkkkkkkkkkkkkk\n\nEsse @cocielo É muito…", "VIDEO NOVOOOOO!!!! BANHO DE EXTINTOR NA COPA CIRROSE: https://t.co/u4UqDsmILm deixa o like lá e da rt aqui pra geral assistir também 🙌🏻🔥🥃😂🎥", "COPA CIRROSE HOJE, as 18:30h! https://t.co/53QU7xD6kC 😂🎥🔥😂 https://t.co/skI9ozFEHj", "VÍDEO NOVOOOO! primeiro diário de viagem da disney: https://t.co/GO7plOSx4f deixa o likeeee 🙌🏻🎥🔥", "VÍDEO NOVOOOOOOO! https://t.co/CNYpjc6rxU 🎥😂🎱", "VÍDEO NOVOOOO ft @gustastockler! QUADRO NOVO!!!! SINUCASTIGO!!! 🎱 https://t.co/CNYpjc6rxU corre pra assistir, deixa o like e da RT pra geral assistir também 🎥😂🔥", "VÍDEO NOVOOOOO!!! a corrida mais competitiva do século ft @t3ddyyyyy: https://t.co/8o4hPjhvtq 👈🏻 deixa o likeeeee, e da rt pra geral ver também 🎮😂❤️⚡️", "O jogo que eu falei no vídeo novo foi esse aqui: TALES OF WIND! o melhor MMORPG mobile do momento. Download aqui: https://t.co/rLdEGfy123 #Ad 🕹📱 https://t.co/fP9L1abA7F", "VÍDEO NOVOOOOOO! ZICO ODEIA O DESAFIO DO TRAVESSÃO: https://t.co/t1NLQONe8y corre pra assistir, deixa o like e da rt pra geral ver também 🙌🏻🎥🔥⚽️😂", "RT @TigraoDaMooca: MÃE DA MULA (sei lá se era esse o nome)\n https://t.co/Zz3kx8jhz2  @cocielo", "RT @jellieljamerson: Kkkkkkkkk que sdds eu tava de assistir um vlog desses! Não dá, ele sabe alegrar seu público.\nSó falo uma coisa kkkkkkk…", "VIDEO NOVOOOOO! AS OFENSIVAS BRINCADEIRAS DA MINHA INFÂNCIA: https://t.co/q7Ig4UGrtA corre pra assistir e deixa o like lá 🎥😂🔥🙌🏻", "HOJE TEM VIDEO NOVO!!! https://t.co/PyT7iYwJp8 🙌📹🤣 https://t.co/ttS1uCcGRQ", "VÍDEO NOVOOOOO! INDO DE ENCONTRO ÀS BOLAS! https://t.co/42SFYDLnMt deixa o like e lá e da rt aqui pra geral assistir também 🎮⚽️😂🎥", "HOJE TEM VÍDEO NOVO! https://t.co/1AZ86ez9JP 😂🔥🎥 https://t.co/EQX05WIBzy", "SAIU VÍDEO NOVO!!! O QUE TEM NA CAIXA ADIVINHANDO PRODUTOS ERÓTICOS: https://t.co/1WYc03EDAb corre pra assistir, deixa o like lá, e da rt aqui pra geral assistir também 😂🙌🏻🎥🔞", "PREPARA AÍ QUE HOJE TEM VIDEO NOVO NO CANAL!!! https://t.co/PyT7iYwJp8 😹🎥 https://t.co/UAi1444Sj2", "VÍDEO NOVO COM UMA DAS MAIORES DÚVIDAS DA HUMANIDADE! COMO VOLTAMOS PRA CASA DEPOIS DE UMA COPA COROTE?! https://t.co/u942FizT4b deixa o like e da rt aqui pra geral ver também 😂🎥🔥🙌🏻", "O REVERSÃO TA CHEGANDO! https://t.co/Vq93oJCx1J", "VÍDEO NOVOOOOO!!!! ROLOU ATÉ UFC NA COPA COROTE 😂 https://t.co/Xk15ZLXaIv deixa o like e da rt pra geral ver também 🙌🏻🎥", "COPA COROTEEEE! VÍDEO NOVO! https://t.co/Xk15ZLXaIv 😂🎥🔥🙌🏻", "RT @Andersonjr012: Nmrl ta muito FODA e engraçado esse video pqp a cada copa corote só melhora pqp KKKKKKKKKK @cocielo https://t.co/ZVH3qoZ…", "VÍDEO NOVO JOGANDO FUTEBOL BEBAÇO! COPA COROTE!!! https://t.co/Xk15ZLXaIv deixa o like lá e da rt aqui pra geral assistir também 🎥😂", "VÍDEO NOVO JOGANDO AGARIO CHEIO DE RAGE: https://t.co/3UhvBkWOwc VÊ AÍ 😂🎥🔥", "AMANHÃ ⚠️ VOCÊ NÃO PODE PERDER!!! O VÍDEO MAIS PEDIDO DO CANAL! VARIOS AMIGOS BÊBADOS REUNIDOS DENTRO DE CAMPO! COPA COROTE SOCIETY ⚽️🔥 A MAIOR COMPETIÇÃO ESPORTIVA E ALCOÓLICA DE TODA A GALÁXIA!!! TOTALMENTE PROIBIDO PARA MENORES DE 18 ANOS 🚫 PREPARE O SEU LIKE 🎥 https://t.co/ZXElwJBETw", "VIDEO NOVO PASSANDO RAIVA PRA PORRA https://t.co/3UhvBkWOwc corre pra assistir e deixa o like lá 😂🎥🔥", "VÍDEO NOVO!!! comendo uma par de coisa nojenta - https://t.co/ByGt6aIyEN deixa o like lá, e da rt aqui pra geral assistir também 🙌🏻😂🎥🔥", "HOJE TEM VÍDEO NOVO! https://t.co/PyT7iYwJp8 😂🙌🏻🔥 https://t.co/I7J133M0CW", "VÍDEO NOVOOOOOO https://t.co/JJ1siz7Mw1 🎥😂🙌🏻", "VÍDEO NOVOOOOOOO!  JOGANDO JOB SIMULATOR! https://t.co/JJ1siz7Mw1 da rt pra geral ver, corre pra assistir e deixa o like lá 🙌🏻🎥😂", "RT @rogeriolopes09: Assistam e fiquem com essa lição de moral \n\n@cocielo https://t.co/f4TADxbYPT", "VÍDEO NOVOOOO! minha coleção de tênis maluco https://t.co/mblhtIXJzC 😂🎥🙌🏻", "RT @t4mi__: se você ficar alegre só com as coisas grandes da vida, é capaz que você se decepcione demais consigo mesmo\nvalorizem as pequena…", "VÍDEO NOVOOOOO! minha coleção de tênis maluco: https://t.co/mblhtIXJzC corre pra assistir, e da rt pra geral ver também 🙌🏻🎥😂🔥", "VÍDEO NOVOOOOOOOOOO https://t.co/BcHHbpBFiq", "VÍDEO NOVOOOO! OS DIFERENTES COSTUMES MUNDIAIS: https://t.co/BcHHbpBFiq corre pra assistir, deixa o like, e da RT pros amigos verem tbm 😂🎥🙌🏻❤️", "VÍDEO NOVO!!! REVELADA A NOVA APARÊNCIA DO SONIC: https://t.co/mxxivX6hsf deixa o like e da rt pra geral ver também 🙌🏻😂🎥", "RT @RoniGirardi: https://t.co/0Qv50fmfIT \n@cocielo que vídeo engraçado 😂😂😂😂", "VÍDEO NOVOOOO! https://t.co/GqUPECLOCb 😂🎥🙌🏻", "RT @t4mi__: e essa voadora que o murilo deu no cocielo, vei kkkkkkkkkkkkkkkkk \nah nem \n@cocielo\nhttps://t.co/rd1OhKAT10", "ACABOU DE SAIR VÍDEO NOVOOOO! https://t.co/GqUPECLOCb deixa o like e da rt pra geral assistir também 🎥❤️⚽️🙌🏻", "VÍDEO NOVOOOO https://t.co/jq1MdfIa4C 😂🎥🙌🏻", "VÍDEO NOVOOO! SHREK TIRANDO SATISFAÇÃO NA QUEBRADA: https://t.co/jq1MdfIa4C deixa o like e da rt pra geral ver também 🎥😂🙌🏻", "VÍDEO NOVOOOOOO https://t.co/aUliUhGF5q 🎥💉🙏🏻", "RT @Raelblck: O @cocielo fez um vídeo sobre Benzetacil acho que a coisa que mais usa no EB hoje em dia kkk, se o soldado ta com febre é Ben…", "RT @thiirodrigs: Cê não tem plano de saude? Kkkkkkkkk to morrendo https://t.co/7L06nQQJyJ @cocielo", "RT @kaahcarolinyy: Quando eu morava  SP eles não receitava antibiótico de 12/12 hr é  benzetacil 3 vezes ao dia kkkkkkkk  https://t.co/mRfp…", "RT @Thiagom_95: https://t.co/JYtNBDrvjC    @cocielo \nNem fudendo q eu tomava benzetacil kkkk tenho medo até hj", "RT @help_tami: https://t.co/hsG0jP47UL\n@cocielo\nbenzetacil é agro\nbenzetacil é tech\nbenzentacil é pop \nbenzentacil é tudo", "RT @help_tami: https://t.co/hsG0jP47UL\n@cocielo\ndepois desse vídeo do julio, tô pensando seriamente em me mudar pra osasco pra trabalhar no…", "RT @andrezabittenc: Pra me fazer rir do bagulho que me deixa aleijada só o @cocielo KKKKKKKKKKKKKKK \nhttps://t.co/mp5RJxmVKS", "RT @jellieljamerson: Ainda perguntam o pq eu sou fã dele HAHAHAHAHAHAHAH assiste esse vídeo e terá a resposta! \n@cocielo\n#benzentacil\nhttps…", "VÍDEO NOVOOOOOO! AS SAUDADES DA BENZETACIL ❤️ https://t.co/aUliUhGF5q corre pra assistir, deixa o like, e da rt pra geral assistir também 💉😂🙌🏻🎥", "HOJE TEM VÍDEO NOVO! https://t.co/PyT7iYwJp8 💉😂🎥 https://t.co/vk6nJ7CdG2", "RT @Luiss_hq: Mano chorei de rir vendo vídeo de @cocielo @fred_b12 @EversonZoio e da Alê Xavier kkkkkk mano KKKKKKKKKKKKKKK tô chorando de…", "RT @LucasAz73298603: Que vídeo sensacional né @cocielo!!!\n https://t.co/ClojUKc6P2", "RT @help_tami: mano, eu tô chorando aq e minha barriga tá doendo de tanto rir kkkkkkkkkkkkkkkk\n @cocielo \nhttps://t.co/77DaaEq985", "RT @JoawPadilha: https://t.co/8JIm6Ljljl to chorando de rir com esse video do @cocielo smcd", "RT @Eliza8174: Que vidão gostoso de assistir #copacirrose https://t.co/ODTSB1yM0Q 😂😂\n@cocielo", "RT @TiagoGz19: https://t.co/YIA2BfuPQa\nIsto está muito bom 😂😂\n@cocielo", "RT @mariana_talita1: Desculpa, mas é muito engraçado. Rindo alto até agr, vou assistir dnv😂😂😂😂\n#copacirrose\n 😂😂😂😂😂😂😂\n@cocielo\n\nhttps://t.co…", "VÍDEO NOVOOOO! TODO MUNDO CHAPADO E SEM LIMITES: https://t.co/Zv8o8cxmPv deixa o like e da rt pra geral ver também🔥🎥🙌🏻", "HOJE TEM VÍDEO NOVO, COPA CIRROSE!!! https://t.co/PyT7iYf80y 🙌🏻😂🎥 https://t.co/wR53ZEmKFk", "vídeo novoooooo https://t.co/UQD7rZiAYi 😂🎥🔥", "VÍDEO NOVO CHEIO DE RAGE 😂🔥🎥 A PIOR PARTIDA DE COD QUE JÁ EXISTIU: https://t.co/UQD7rZiAYi corre pra assistir, deixa o like e da rt pra geral ver também!", "RT @leodommarco: Mano KKKKKKKKKK que vídeo sensacional do @cocielo https://t.co/eAsx2RsxVh", "VÍDEO NOVOOOOOO\nhttps://t.co/KhQzW8SCY8", "SAIU VÍDEO NOVO!!!! TENTEI SER FAMILY FRIENDLY SÓ PARA ME ADEQUAR AOS PADRÕES DO YOUTUBE! https://t.co/KhQzW8SCY8 CORRE PRA ASSISTIR E DEIXA O LIKE LÁ 🎦🔥🙌🏻😂", "HOJE TEM VIDEO NOVO! https://t.co/PyT7iYwJp8 😂💥 https://t.co/UnhQrOfS1A", "VÍDEO NOVOOOOO! ROLÊ NA ESPANHA E CT DO BARÇA! https://t.co/usWXKAaSZI deixa o like e da rt pra geral ver tbm 🙌🏻🔥", "RT @_pesampa: https://t.co/oXA5TAug9w\n\nMais um trampo feito com sucesso!\nDeixa o like pra ajudar o @cocielo (e o rt pra eu ter mais trampo…", "RT @brenamaiaa: mano, como assim o @cocielo gravou com o @Phil_Coutinho ? pqp\n\nhttps://t.co/TKN58IByAR", "ACABEI DE POSTAR VÍDEO NOVO! DESAFIO DO TRAVESSÃO ALEATÓRIO COM COUTINHO: https://t.co/lyUPxMjzav DEIXA O LIKE E DA RT PRA GERAL ASSISTIR TAMBÉM! 🎥💥⚽️", "HOJE TEM VÍDEO NOVO! https://t.co/PyT7iYwJp8 💥⚽️ https://t.co/A9uTXzXhaW", "VÍDEO NOVOOOOO https://t.co/1UdcySOJLo 🙌🏻🎥😂", "VÍDEO NOVOOO! AS FREQUENTES INSATISFAÇÕES HUMANAS: https://t.co/1UdcySOJLo deixa o like e compartilha pra geral 😂🔥🎥", "RT @maantooani: @cocielo  https://t.co/M7OPBPWQBS corre pra assistir e deixa o like KKKKKKkkkk,pinto grande e gordo maravilhoso KKKKKKKKKKK…", "SAIU VÍDEO NOVO NO CANAL! https://t.co/eAySHDEOMD corre pra assistir e deixa o like lá 😂🎥🔥", "RT @clubedopairico: Vai por mim: este será o melhor clip que você verá no ano !!\n\n(assista até o fim, sem pular nada ... prestando atenção…", "RT @FortunatoFranc0: A nova música do @cocielo é envolvente demais e ao mesmo tempo ela da lição de vida 💚💚 https://t.co/zR9J35P4G6", "RT @Nicolas997: Será que essa música vai salvar o carnaval desse ano?\n@cocielo https://t.co/qG9ms1ODkE", "RT @PierryV13: Hite do carnaval do @cocielo https://t.co/KEJgDHefAp", "RT @CarolCa82690541: E hit que fala ne. AMEI a música MUITO TOP. Parabens @cocielo @Christian_fig estava top a música o clipe eu amei mesmo…", "RT @jellieljamerson: Pra mim lançou a hit do ano HAUHAUHAUHAUAHHAHAIHAUABJAJAJAJJJA cê louco a cena do acidente merece um Oscar kkkkkkkkkkk…", "RT @besidesthiago: toma toma toma toma toma sem cair no chão, eu sei que cê aguenta a pinga de peão \n\nHIT DO CARNAVAL QUE FALA, NÉ?\n\nhttps:…", "RT @sennacamy: Saiu mais um videoclipe MC Rozi e Capitão Fake: Pinga de Peão do @cocielo cm a @tata @Christian_fig @MrPoladoful Phill Pirad…", "VÍDEO NOVO! PINGA DE PEÃO 🎵: https://t.co/NYay8Rn52X deixa o like lá, da rt pra geral ver, e corre pra assistir 🔥🎥", "RT @Luli_oiback: https://t.co/CLowniuVmU eu ri muito do “baaaaaaaaah” torcendo o pescoço OSJDJSJDJSJSJSJDJAJDJSJS @cocielo socorro", "RT @Edsonpgj: quero que cantem o meu parabéns igual esse do @cocielo\n\nhttps://t.co/hy2mYJcULG", "RT @DuaLipa_ofc: Esse video do @cocielo ta muito bom kkkkkk gente eu ri demais !!!\n\nhttps://t.co/QSZpkBvHSi", "RT @JlioCsa56389225: Mano do céu vídeo foda pra caralho se e Loko @cocielo https://t.co/7Y2uAbx1NO", "RT @dehzinha_h: Meu Deus @cocielo obrigada por me tirar da fossa emocional que eu estava!  https://t.co/EkjdM55DqV", "RT @NOMECOMUM_: Manooo do céu, esse vídeo ta foda! Ri do começo ao fim vei kkkj @cocielo\nhttps://t.co/PnMXCIhEQl", "RT @laariisssaaaaa: vídeo novo no canal do @cocielo sobre gírias (espero q no próximo ele fale sobre as gírias do oeste catarinense UANSJSN…", "VÍDEO NOVO! AS CONFUSAS GÍRIAS REGIONAIS: https://t.co/fHMuzzEW47 corre pra assistir, deixa o like, e da rt pra geral ver tbm 😂🎥", "HOJE TEM VIDEO NOVO! https://t.co/PyT7iYwJp8 🎥🔥 https://t.co/JOLnOH1vRj", "VÍDEO NOVO! BEER PONG QUASE GIGANTE DE POBRE: https://t.co/fao5ISyDrk DEIXA O LIKE LÁ E DA RT AQUI PRA GERAL VER TAMBÉM! 🔥🎥😂", "BEER PONG QUASE GIGANTE DE POBRE - (ft. Muca, Igão, Fred): https://t.co/gZLYKnf6Uw via @YouTube", "HOJE TEM VÍDEO NOVO AS 19:00h! https://t.co/PyT7iYwJp8 🔥🎥 https://t.co/JUqdL3LPDv", "RT @thuany24k: Muito top essa paródia do @cocielo\nhttps://t.co/f9B8o8qMB4", "RT @jellieljamerson: Chamaaaaaaaa!!! Aí vc tá falando de uma paródia de respeito né caraio KAKSKSKSKSKKSKSKSKSKK @cocielo\nhttps://t.co/IgTX…", "RT @Brunaakailane: Essa paródia ta maravilhosa KKkkkkllkkkk @cocielo https://t.co/XNMuO1ZMdR", "RT @Lelebernardo2: Alegrou meu sábado com o vídeo novo do @cocielo o Júlio tornou meu dia mais alegre!!! Corre lá pra ver o vídeo dele \nEss…", "RT @Bruninho019_: @cocielo não erra uma paródia pqp KKKKK\n\nhttps://t.co/sOZIvM96BJ", "RT @nawollff: Na moral o @cocielo era o cara que tinha o apelido de Fábio Assunção KKKKKKKKKLKK melhooooor vídeo não foi atoa que eu entrei…", "RT @laariisssaaaaa: video novo no canal do @cocielo convertido\nhttps://t.co/bnEWD6PVHq", "RT @preta88preta: Esse novo vídeo/quadro do @cocielo é claramente eu quando to cantando funk proibidao e minha mãe chega kkkkk assiste q ta…", "VÍDEO NOVOOOO!!! CONVERTENDO FUNKS - PARADO NO BAILÃO 🔊https://t.co/8X0R8wS2md deixa o like e da rt pra geral assistir também 😂🎥🔥", "CONVERTENDO FUNKS - PARADO NO BAILÃO ♫: https://t.co/IMq5hYaTk0 via @YouTube", "HOJE TEM VIDEO NOVO AS 18:00!!! https://t.co/PyT7iYwJp8 🔥🎥😂 https://t.co/IzLtpjwVAW", "RT @Lelebernardo2: SAIU VIDEO NOVO NO CANAL DO MAIS FODÃO QUE EXISTE O @cocielo corre lá não perde não!! Compartilha pra geral!! Até a Jenn…", "RT @marimaoli: @cocielo mais uma vez ultrapassando as barreiras da ciência KKKKKKKK \n\nobrigada\nobrigada\nobrigada\n\nhttps://t.co/mVui45sLwK", "RT @um_dole: Mano, eu amo o @Cocielo o cara é um dos mais engraçados do YouTube, pra mim o mais engraçado, esse vídeo ficou muito bom kkkkk…", "MINHA CONSTRANGEDORA HEMORROIDA: https://t.co/xPdTWUmIDQ via @YouTube", "VÍDEO NOVOOOO! MINHA CONSTRANGEDORA HEMORROIDA: https://t.co/vMwiq1QRLh DEIXA O LIKE LÁ E DA RT PRA GERAL ASSISTIR TAMBÉM 🙌🏻🔥😂🎥", "HOJE TEM VÍDEO NOVO! https://t.co/PyT7iYwJp8 🔥🎥 https://t.co/Gx0bF49Ua4", "VÍDEO NOVO!!! BASTIDORES CHAMA PEIPEIPEI RESPEITA! https://t.co/QE6eVeVJMu DEIXA O LIKE E DA RT PRA GERAL ASSISTIR TAMBÉM! 🔥🎥😂", "BASTIDORES CHAMA RESPEITA PEIPEIPEI DA COPA YOUTUBERS: https://t.co/B3DmWrj7iU via @YouTube", "RT @mariannajf1: gente namoral esse video salvou meu último sábado de 2018 KKKKKKKKKKK muito obrigada @cocielo @WhoIsCarlos \n\nhttps://t.co/…", "RT @TiagoribeiroTRP: Copa cirrose foi um curta metragem do meu 2018 cara kkkkkkk @cocielo  é foda #copacirrose https://t.co/J47X1Aosyj", "RT @tel200240: Manoooo que vídeo do caralho de tão foda kkkkk o Caio Lo parece eu na quadrilha da escola no ano passado kkkkk @cocielo faz…", "RT @MauroJunior___: Kkkkkk melhor intro e cara vocês são foda! Na moral... @cocielo \nSó acho que podia fazer uma copa cirrose com os inscri…", "RT @JaianeBruna2: Na virada meus familares estarão tipo o Caio Lo na copa cirrose KKKKKKKKKKKKKKK MANOOO VÍDEO MARAVILHOSO KKKKKKKKKKKK\n@co…", "RT @mariana_talita1: Mano kkkkk 😅😂😅😂, coitado dos meninos 😂😅 https://t.co/79QOE1Gq8w\n@cocielo like total🖒🖒👏", "RT @VictorPimenta14: https://t.co/zPDWKqgdtl\n\nCopa Cirrose, a melhor do Youtube. @cocielo o canal mais foda. 👏👏👏", "RT @mermaid_ferraz: https://t.co/q0joSxRfFp \n\nAssistam, ta sensacional  KKLKKKKLK\nMeu sonho fazer uma copa cirrose com os amigos que eu gos…", "RT @gomescharlesrc: @cocielo mano queria muito um dia beber com esse mlq, ele é foda demais!\n\nhttps://t.co/gj3VRJIN7y", "RT @Gabriel35962226: https://t.co/8GfU19ATRB\n@cocielo sempre mita na copa cirrose, Mlk bebe pá Caraí e ainda fica suavão tio kkkk", "RT @brenamaiaa: Mano, meu sonho é fazer uma copa cirrose KKKKKKKK @cocielo\n\nhttps://t.co/UZ0Fivhm3V", "RT @gTavinhoo: coitado dos mlks kkkkkkkkkk @cocielo\n\nLOUCOS DE COROTE - COPA CIRROSE https://t.co/JqDNii69OT via @YouTube", "RT @narizinhox: Mal chegou a notificação e eu ja corri.\nÉ COPA CIRROSE CUZAO\n@cocielo\nhttps://t.co/BEMzcQgCcv", "VÍDEO NOVO! loucos de corote! https://t.co/g8NX8JJa7t deixa o like e da rt pra todo mundo assistir também 🙌🏻🍻🔥🎥", "LOUCOS DE COROTE - COPA CIRROSE: https://t.co/KGTYjgZdwn via @YouTube", "HOJE TEM COPA CIRROSE! https://t.co/PyT7iYwJp8 🍻 https://t.co/4xPtv1TxJi", "VÍDEO NOVO COM OS PIORES MOMENTOS DA COPA YOUTUBERS: https://t.co/xuaIzLZyVx corre pra assistir, deixa o like e da rt pra geral assistir também 🎥🔥", "MELHORES PIORES MOMENTOS - COPA YOUTUBERS 2018: https://t.co/CYLNG52Ssd via @YouTube", "VÍDEO NOVOOOO https://t.co/fX7i7bfA8e", "TOMEI LEITINHO DE CAMELO E PULEI DE PARAQUEDAS EM DUBAI: https://t.co/fX7i7bfA8e via @YouTube", "COPA YOUTUBERS - AO VIVO: https://t.co/1JMnJMx0FA via @YouTube", "RT @Gabilp7: Quem sou eu segurando pra não dar risada alta 1h da manhã com esse vídeo @cocielo https://t.co/gPRNAgLYIR", "VÍDEO NOVOOOOO! CORRE PRA ASSISTIR! https://t.co/ZAwDE5G8Bt deixa o like e da rt pra geral assistir também! 😂🎥🔥", "EXAME DE PRÓSTATA! #CANALHARESPONDE 27: https://t.co/5yTuhIPI42 via @YouTube", "VÍDEO NOVO HOJE AS 18:30 HEIN!!! https://t.co/MeYaOJVt2b 🎥😂 https://t.co/y4XLL1lrgz", "VÍDEO NOVOOOO! PENALIDADES ENSABOADAS 2: https://t.co/uqaWtVtgyG DEIXA O LIKE, E DA RT AQUI PRA TODO MUNDO ASSISTIR  TAMBÉM 🙌🏻🎥😂", "PENALIDADES ENSABOADAS 2: https://t.co/GvaHgp85TQ via @YouTube", "VÍDEO NOVO!!! RELEMBRANDO AS ORIGENS - PES 2019: https://t.co/TghJICpOcY DEIXA O LIKE E DA RT PRA GERAL ASSISTIR TAMBÉM 🎥🔥😂", "RELEMBRANDO AS ORIGENS - PES 2019: https://t.co/AZv48NBPjv via @YouTube", "RT @laariisssaaaaa: momentos antes da desgraça acontecer HAAUHEUEHSUSHS \nhttps://t.co/nJ6FBCmGQQ\nvídeo novo no canal do @cocielo  corre laa…", "FUTEBOL COM BOLA DE FUTEBOL AMERICANO: https://t.co/M1mhlcEihV via @YouTube", "VÍDEO NOVO! FUTEBOL COM BOLA DE FUTEBOL AMERICANO! https://t.co/K5BWZ7aNtG CORRE PRA ASSISTIR, DEIXA O LIKE E DA RT AQUI PRA DAR UMA MORAL 🔥🎥😂", "VÍDEO NOVO JA JÁ! AS 18:30h TEM! https://t.co/oBNZVGxSZQ 🔥😂 https://t.co/pYhLvSxVcM", "RT @brenamaiaa: Eu não sei olho pro jogo, pra ver se ele tá acertando ou pra cara dele   KKKKKK @cocielo\n\nhttps://t.co/w5wV2MTQrn", "O MELHOR JOGADOR DE GUITAR HERO DA HUMANIDADE!: https://t.co/uGsxyIqDvj via @YouTube", "VIDEO NOVOOOOO! O MELHOR JOGADOR DE GUITAR HERO DA HUMANIDADE! https://t.co/PKEVMPM98u DEIXA O LIKE LÁ E DA RT AQUI PRA GERAL ASSISTIR TAMBÉM! 🔥", "HOJE TEM VÍDEO NOVO JOGANDO GUITAR HERO! https://t.co/1AZ86ez9JP https://t.co/exBQwokMrB", "VÍDEO NOVOOOOO https://t.co/AztushMz5r", "O DIA EM QUE EU TIREI O DENTE DO SISO: https://t.co/AztushMz5r via @YouTube", "VIDEO NOVOOOO! O DIA EM QUE EU TIREI O DENTE DO SISO! https://t.co/MFFm0I0SUE DEIXA O LIKE E DA RT PRA TODO MUNDO ASSISTIR TBM 😂🎥❤️", "HOJE TEM VLOG NOVO, AS 19:00h https://t.co/PyT7iYwJp8 🔥🎥 https://t.co/trqtuPcOEY", "VÍDEO NOVOOOOOO https://t.co/E0CBNoYxQU", "VÍDEO NOVO!!! PRIMEIRO JOGO BENEFICENTE SÓ DE YOUTUBERS: https://t.co/E0CBNoYxQU deixa o like e da rt pra todo mundo ver ❤️🔥🙏🏻", "1º JOGO BENEFICENTE SÓ DE YOUTUBERS: https://t.co/6svj9ccnYQ via @YouTube", "RT @sennacamy: Adoro os vídeos do Mc Rozi do @cocielo! Cara, vc é uma figura, é único, tú é O Cara 😁😁😁😁😁 Vão conferir o vídeo novo no Canal…", "RT @CorotesDoJulio: MC ROZI DE VOLTA!!!\nMais um hit lançado com sucesso, e pra melhorar com participações sensacionais!!!\nClica aqui em bai…", "VÍDEO NOVOOOOOO https://t.co/7g0a5cNqO3", "RT @WtfGabrieu: https://t.co/94EMUASun1 clipe e música fodaaaa aa aa\n@cocielo", "MC ROZI, MC WM, OS CRETINOS &amp; DJ GEGE - MEU VENENO!: https://t.co/gW0RDrUERR via @YouTube", "VIDEO NOVOOOOO! \nMC ROZI, MC WM, OS CRETINOS &amp; DJ GEGE - MEU VENENO ♫ https://t.co/7g0a5cNqO3 \nDEIXA O LIKE NO VÍDEO E DA RT AQUI PRA GERAL VER TAMBÉM 🔥🎥😂", "HOJE TEM VIDEO NOVO COM A MUSICA PERFEITA PARA A SEXTA FEIRA! https://t.co/PyT7iYwJp8 🔥🎥😂 https://t.co/ozfvMZ2iHL", "ME QUEIMANDO DE ÓDIO NO FIFA 19: https://t.co/QjA91RT7uO via @YouTube", "SAIU VÍDEO NOVO JOGANDO FIFA 19 E PASSANDO MUITA RAIVA\nhttps://t.co/56P9cSGbVJ\nDEIXA O LIKE E DA RT PRA GERAL VER!", "TEM VÍDEO NOVO NO CANAL! \nhttps://t.co/AkxeiONhmk\nDA RT PRA TODO MUNDO VER! 🎥🔥", "VÍDEO NOVOOOOOO https://t.co/AkxeiONhmk", "RT @WesleyVS97: os caras do posto urraram muito 😂😂😂😂😂😂😂😂😂😂😂😂😂😂😂😂😂😂😂😂😂😂😂😂😂\n\n@cocielo \n\nhttps://t.co/GSAbTnTMvC", "RT @LuiZinKomS: @cocielo tem que fazer mais vídeos desse tipo, racho de rir com ele dançando com roupa de homaranha e fazendo coisas normai…", "RT @chainsflop: Meu eu to chorando de rir com o vídeo novo do @cocielo O NOVO JOGO DO HOMARANHA: https://t.co/bs4crMSFSr via @YouTube", "RT @dehzinha_h: Eu tô só o tiozinho do posto rachando o bico com o @cocielo\nde homem aranha. Ô bicho retardado 😂\nhttps://t.co/dHIGmQBG7t", "RT @Viih_Sud: O NOVO JOGO DO HOMARANHA https://t.co/AMF6IgAbhl via @YouTube\nEsse video ta muito bom kkkkkkkk @cocielo \nCara é fodaaaaaa", "VÍDEO NOVO SOBRE O JOGO DO HOMARANHA! DEIXA O LIKE LÁ E DA RT PRA TODO MUNDO VER!!!! https://t.co/AkxeiONhmk 🔥🎥😂", "O NOVO JOGO DO HOMARANHA: https://t.co/pE9d1qKn47 via @YouTube", "VÍDEO NOVO SOBRE O JOGO DO HOMARANHA! DEIXA O LIKE LÁ!!!! https://t.co/ngjMoiwRx0 🔥🎥😂", "HOJE TEM VIDEO NOVOOOO! https://t.co/PyT7iYwJp8 https://t.co/gpdmo0VGbs", "VÍDEO NOVOOOO! DA LIKE PRA FORTALECER! 🎥 https://t.co/RgeqNhkwTn", "VÍDEO NOVO! https://t.co/RgeqNhkwTn deixa o like! 👊🏻🎥", "HIPER MEGA HARD DESAFIO MISTÃO DO TRAVESSÃO: https://t.co/vUECiMZODW via @YouTube", "VÍDEO NOVOOO! HIPER MEGA HARD DESAFIO MISTÃO DO TRAVESSÃO -&gt; https://t.co/RgeqNhkwTn deixa o like e da rt pra geral assistir também! 🎥😂❤️", "HOJE TEM VÍDEO NOVO! https://t.co/PyT7iYwJp8 https://t.co/Z46THv3sko", "VÍDEO NOVOOOOOO https://t.co/TN6YK59hcE", "RT @joaopaulod97: HAUSHAUSHAUS \"AI TA DOENDO TUDO, CALCANHAR, CABELO HAUAHAUAHAUAH\"https://t.co/1Z86RZYZnc\nPassei mal de rir com esse video…", "RT @Nathantham12: https://t.co/eSTNGo3XzE @cocielo mano eu te amo por me fazer rir todos os dias❤️❤️", "RT @vitorio998: UM DIA SELVAGEM COM RICHARD SELVAGEM! https://t.co/Jm2GM8spQ4 via @YouTube  foda pra carai kskskssksks @cocielo", "RT @larissatopz: caralho eu rachei com esse vídeo do @cocielo KKSKSKSKSKSKSJJSJDJDWNSJBSJD\nhttps://t.co/KzZs2wAacN", "VÍDEO NOVO! UM DIA COM RICHARD SELVAGEM! https://t.co/TN6YK59hcE DEIXA O LIKE E DA RT PRA TODO MUNDO VER TBM ❤️😂🎥", "UM DIA SELVAGEM COM RICHARD SELVAGEM!: https://t.co/3g1MBJuOtq via @YouTube", "VÍDEO NOVOOOO https://t.co/rjAALvo890", "RT @GaabDelOlmo: Que saudade que eu tava de um vlogguesão TOP! @cocielo\n\nhttps://t.co/9GT1PLV81S", "RT @larissatopz: vídeo novo do @cocielo tá muito bom ahbsudndisndj assiste lá e deixa o like\nhttps://t.co/0kwxX9SNJP", "RT @coci3ar: cara, ficou sensacional esse vídeo! Haha sério, assistam que com certeza vão dar risada! @cocielo você é demais! https://t.co/…", "VIDEO NOVOOOO! FILMES VS VIDA REAL: https://t.co/rjAALvo890 deixa o like e compartilha pra geral assistir também! &lt;3", "FILMES vs VIDA REAL: https://t.co/ytOrL9P2tA via @YouTube", "HOJE TEM!!! https://t.co/PyT7iYwJp8 https://t.co/EBtIUzt0Ss", "RT @Felps_Zero944: https://t.co/SF8BPVdhXo via @youtube @cocielo  \nCARA KKKKKK \neu nunca ri tanto na minha vida kkkkkkkkk\nParabens mano hsu…", "RT @well_knupp: To quase tendo um infarto de tantp rir com isso mano kkkkkkkkkk https://t.co/miYBHnUj0c     @cocielo", "RT @HenquePedro: https://t.co/vnx82LqlwB\nNunca ri tanto sério!!!!!! @cocielo vc é foda demais", "RT @Berirainha: MANO KKKKKKKKK assustei minha mãe de madrugada de tanto que eu ri kkkkkk. Melhor vídeo👏 @cocielo faz outro pfff https://t.c…", "RT @LuanSouza181: https://t.co/8RWMiEezIL\n____________________\n\nPQP vídeo topzeradabalada  vídeo quando é bom dura pouco,fiquei pelo triz p…", "TEM VÍDEO NOVO NO CANAL E É O MAIS ENGRAÇADO DE TODOS HAUAHAUAHAUAHAUAH https://t.co/7kmcvqgpUe deixa o like lá! 😂🎥", "RT @apqp_Gui: https://t.co/CoLpJN7C3w KKKKKKKKKKKK minha mãe quase me bateu porque eu quase me mijei de dar risada e não conseguia falar pr…", "RT @soyramos_: Por favor... Façam um bem para a humanidade e assistam o vídeo do @cocielo pq tá muitoooo foda, sério kkkkk https://t.co/5Qe…", "RT @emillesantossa1: https://t.co/yVjp9Bbypj  \nMano a pala da minha tarde foi esse video @cocielo  nunca vi uma pessoa tão engraçada igual…", "RT @Gabrielbbzin: Pqp @cocielo vó infartar kkkkkkkkkkkkk salvo meu dia vei https://t.co/W8VDfFiGP7", "RT @brenamaiaa: Eu to mandando o video pra todo mundo pq as pessoas merecem assistir isso KKKKKKKK @cocielo https://t.co/l0sgoz5aw5", "RT @LuuhSousaah: Boooooooy, um dos vídeos que eu mais ri em toda minha vida KKKKKKKKKKKKKKKKK\n@cocielo Manooooo faz mais, sério, eu to rind…", "RT @o_serjo: Melhor video do ano @cocielo mito. https://t.co/Z6MmEcALLL", "RT @Gustavoo_Origin: Me mijei de rir😂🤣😂muito bom @cocielo https://t.co/85u3n460iR", "RT @MatheusIludido: https://t.co/yPj1Z9MOsq\nMano q vídeo bom namoral xkwmmxmekd\nri pra ele\nrecomendo\n@cocielo", "RT @KauaGammerBr: https://t.co/7cJAnZYWyM\n\nEu ri tanto desse vídeo que minha mãe até brigou comig9 kkkkk kkkkk\nMuito engraçado \n@cocielo", "RT @ithierry_pommot: https://t.co/qXzlH9vCQ0 kkkkkkkkkkkkkkkk to rindo dms, kkk esse @cocielo  é o bixo kkkkkkkkkkkkkk", "RT @jeibsonC: https://t.co/5yhWQrf1w7\nQue vídeo maravilhoso kkkkkkkkkkkkkkkkkkkk, eu acho que eu acabei me mijando por causa do vídeo kkkk…", "RT @mauricioschell: Melhor coisa que tu pode ver nesse domingo é: https://t.co/gWNGDswNdi @cocielo \nUDAHSDUHASUD to chorando de rir", "RT @Italo_Bulhoes: Mano melhor vídeo do cocielo pqp tô morrendo kkkkkkkkkkkkkkk\n@cocielo\nhttps://t.co/tCFrP70Ktd", "RT @MiguelGC180: Acho que nunca ri tanto na minha vida😂😂😂😂😂 @cocielo \nhttps://t.co/1T1pCpW1Ed", "RT @Caioocarvalho1: SUPER COPA OLHOS VENDADOS DE FUTEBOL DE SALÃO https://t.co/85iNoNy8Ae via @YouTube @cocielo que video engraçado da poha…", "RT @narizinhox: até agora eu to tentando entender o moleque com o pé virado akkakakakakskakkakaka\n@cocielo @igorcavalari\nhttps://t.co/cvWJU…", "RT @KaykeFortuna: https://t.co/ZOgja6wqTM\nQue vídeo maravilhoso kkkkkkkkkkkkkkk @cocielo braboo", "RT @ayru_souzaa16: Kkkkkkkkkkkkkkk senhorrr melhor vídeo do @cocielo malukooo 😂😂🤙🏻 https://t.co/rKEeh21zJj", "RT @fluwins: passei mal de tanto rir @cocielo !! que vídeo incrível, assistammmm 🏃‍♂️\n\nhttps://t.co/4XhvcZYfnF", "SUPER COPA OLHOS VENDADOS DE FUTEBOL DE SALÃO: https://t.co/ryeJi0lr8F via @YouTube", "SAIU VÍDEO NOVO NO CANAL! SUPER COPA OLHOS VENDADOS DE FUTEBOL DE SALÃO https://t.co/7kmcvqgpUe\nDEIXA O LIKE E DA RT PRA GERAL ASSISTIR TAMBÉM!", "HOJE TEM VIDEO NOVO! https://t.co/PyT7iYwJp8 &lt;3 https://t.co/hT9FYH021o", "RT @VictorPimenta14: PARÓDIA | Marília Mendonça - Estranho (Agora Que São Elas 2) https://t.co/npWaSMzcUG via @YouTube\nMELHOR PARÓDIA!! KKK…", "RT @Jhonemarti: Mano esse @cocielo é doido pprt 😂😂https://t.co/AyXuMcsByI\nEssa paródia tá o bixo pprt 😂😂😂😂", "RT @arturhenrique96: https://t.co/WXdEsHV8fC Paródia nova do mito, o indivíduo mais extraordinário desse planeta! kkkkkk 🎶 @cocielo", "RT @Luiz_Martins28: É o melhor canal do youtube que vc quer? então tomaaa😂😂❤\n@cocielo  https://t.co/6Cpfb2R2ZJ", "RT @ThiagoR19875051: Kkkkkkk mlr que estranho seria cagaaaaando, mais uma paródia do mito @cocielo\n\nhttps://t.co/NbyZgirtot", "RT @larissaaagr: vídeo novo do @cocielo, corre lá assistir rsrsrrsdeixaolikersrsrsrsrs\nhttps://t.co/iGMTXJUPDI", "RT @lollyputaa: KKKKKKKKKKKKKKK MUITO BOM @COCIELO\n'' E UM PEIDO ALTO FAZ TODO MUNDO RIR DE DESESPERO '' PARÓDIA | Marília Mendonça - Estra…", "RT @GaabDelOlmo: PUTA PARÓDIA FODAAAA KKKKK\n@cocielo \n https://t.co/K7TZs9e92l", "VÍDEO NOVOOOO! PARÓDIA ESTRANHO MARÍLIA MENDONÇA: https://t.co/9aY9p2C5Tu marca aqui o seu amigo que ri de qualquer besteira 😂😂😂 deixa o like lá e da RT pra geral assistir também 🎥", "PARÓDIA | Marília Mendonça - Estranho (Agora Que São Elas 2): https://t.co/UrS3KQQPPD via @YouTube", "HOJE TEM VIDEO NOVO HEIN! PREPARA O LIKE! https://t.co/PyT7iYwJp8 &lt;3 https://t.co/hxSyAl44rb", "RT @JovemCacheado: “Continue fazendo as pessoas felizes e apenas seja você mesmo.”\n\n– Zlatan Ibrahimovic. \n\n@cocielo\nhttps://t.co/bYl5h74qh5", "RT @GabriiielMelo: Na moral, to felizão pelo @cocielo por causa desse video. Entendo ele, também sou fã demais do @Ibra_official!!! Queria…", "RT @careolioti: que vídeo incrível e que cara sensacional é ibrahimovic !!!\n@cocielo fico feliz de ver você realizando seus sonhos, merece…", "RT @xSamuellMC_: Que Video do karalho @cocielo https://t.co/a8I42pR43n", "RT @GaabDelOlmo: Puta encontro foda cara, fora do comum!!\n@cocielo \nhttps://t.co/rHt6WzbvHG", "IBRAHIMOVIC ASSINOU MINHA COLEÇÃO DE CAMISAS!!! #CANALHARESPONDE 26: https://t.co/it79sxI3jC via @YouTube", "SAIU VIDEO NOVO NO CANAL COM @IBRA_OFFICIAL ASSINANDO MINHA COLEÇÃO DE CAMISAS! https://t.co/94cYBbWgUa DEIXA O LIKE LÁ E DA RT AQUI PRA GERAL ASSISTIR &lt;3", "HOJE TEM VIDEO NOVO E MUITO ESPECIAL NO CANAL! https://t.co/PyT7iYwJp8 https://t.co/LrviRfvyQ7", "RT @vinicuinhos: esse foi o video que eu mais ri na minha vida, obrigado @cocielo \nhttps://t.co/bmod2Tc5Op", "COPA CIRROSE DA DESTRUIÇÃO!!!: https://t.co/lCsqPW7HWg via @YouTube", "VÍDEO NOVO!!! COPA CIRROSE DA DESTRUIÇÃO https://t.co/WT1nTjHeQW deixa o like e da te pra todo mundo assistir também! 😂🎉🙏🏻", "RT @gomezjuligor: saiu vídeo novo no canal do @cocielo https://t.co/sQX3Ov76pl corre pra assistir e não esquece de deixar o belíssimo like…", "VÍDEO NOVO!!!! EU NÃO SEI NADAR: https://t.co/iNvdrQyBun DEIXA O LIKE! 😂🎥", "EU NÃO SEI NADAR: https://t.co/wGVYcL09zv via @YouTube", "IGNORÂNCIA: https://t.co/evgnC62RVQ via @YouTube", "-&gt; https://t.co/ArPdW4LBy4", "sobre tudo que tá rolando https://t.co/siQUpz8tC9", "RT @brunakailanee: https://t.co/cUoemMHkJR vídeo novo do @cocielo deixem o like se inscrevam no canal e compartilha com geral ❤", "RT @TathiAndraade: Amo quando o @juliococielo faz esses tipo de vídeo. 😂❤️ https://t.co/AYgrFr7m99", "RT @Febatista: Gostei de um vídeo @YouTube de @juliococielo https://t.co/TDRhSwfXUP 10 MILHÕES DE INSCRITOS!!!", "RT @bruninhasilva61: https://t.co/XrL0LCT5BJ video novo do @juliococielo ,asssistam que ta fodaa ❤❤,deixa o like e se inscreva no canal", "RT @sullivanmaicon_: kkkkkkkkkkkkkkkkkkkkkkkkkkkkkk muito bom, na moral!\n\nPLAYLIST DE FUNK EXTRAORDINÁRIA https://t.co/n8Hgb2XZ3X via @YouT…", "RT @bruninhasilva61: ARANHAS QUE LATEM DOBRADINHA CUP: https://t.co/5k02MVEJ6a via @YouTube vidhao novo do @juliococielo ❤ deixa o like e s…", "RT @L3DDYRINE: QUANDO NÃO TEM NINGUÉM EM CASA #RewindBr https://t.co/QAC2kQe4t8", "RT @Leh_Marchesi: @juliococielo se liga nessa montagem, seloko https://t.co/WGTbke4Hw8", "RT @drallpicsters: É de avisos e tal, mas pelo menos é vídeo novo hujbvwqyucivqw @juliococielo https://t.co/JTUjo4iPpg", "RT @jcocielosz: COOOORRRE QUE TEM VÍDEO NOVO GALEROUS @juliococielo http://t.co/MD89wem3WN", "RT @FC_dosFcs: #CanalCanalha2Milhoes é tetraaaaa é tetraaaa 2 milhões caralhooooo http://t.co/WQuFWt6Ncq", "RT @feer_raissa: Vídeo novo do maravilhoso @juliococielo auehuehuaeh muito foda https://t.co/8N4X9TB6Cz vale a pena ver! auehueh scrr &lt;3", "RT @EuSarrii: @juliococielo vc só fala merda fera", "RT @Eriic_Galliano: @juliococielo http://t.co/nZ1GvrTBQP", "RT @_Este9Ester: Nunca vou comprar um filme do Shrek pros meus filhos em uma feira\n@juliococielo- AMBULANTES E O SHREK ERÓTICO https://t.co…", "RT @sexyblondehoran: AE CARAI VIDEO NOVO! SEMPRE ASSIM! KKKKK AMBULANTES E O SHREK ERÓTICO @juliococielo  http://t.co/P0eseAainM", "RT @olocoziam: NOSSA QUE MEDO PARECE SER MUITO FEROZ MESMO @juliococielo http://t.co/m1WdmGGa1P", "RT @millenagui: @juliococielo sla, achei parecido HAUAHAUAHAUAHAUAHAUAHUAHAUAHAUAHHAUAHAUAHUAHAUAHAUAHUAH (eu n sou mto normal) http://t.co…", "RT @fuckingslimshad: GARÇONS E A MALIGNA TAXA DE SERVIÇO - gostei de mais viu 😍👏 ri de mais ❤️ Ta bonito hein Julio 🌚 @juliococielo  http:/…", "RT @euvirtua: FDP ASUIODHUIDHSAUIHDASUIHDUISAH - @juliococielo RÉ NO QUIBE SEM QUERER! #CANALHARESPONDE 13: http://t.co/9E4Curfn35 via @You…", "RT @directiornah: COMO EU AMO ESSE HOMEM http://t.co/1cem7bQvU1 assistam ao novo video do @juliococielo e me digam o que acharam", "RT @euvirtua: revendo o vídeo da semana @JulioCocielo #CANALHARESPONDE 12 DE ROCKY BALBOA: http://t.co/e9mbVwnvGj via @YouTube", "RT @distturbs: eu acho que já voltei no inicio do video do @juliococielo umas cinco vezes só pra ver aquele lindo twerk que ele faz (tô enc…", "RT @euvirtua: ASDUOIHADUSAIDISAHDIUSAHDOI fdp @juliococielo #CANALHARESPONDE 12 DE ROCKY BALBOA: http://t.co/e9mbVwnvGj via @YouTube", "RT @Emanuel_XY: @juliococielo http://t.co/m7O2omhdrP", "RT @Emanuel_XY: @juliococielo não ta fácil pra ninguém™", "RT @_moreiralice: @juliococielo Falai ze droguinha", "RT @About_A_Giirl: kkkkkkkkkkkkkkkkkkkkkkkkkkkkkkkkkkkk https://t.co/IVyvpVXQiy me tirou da deprê @juliococielo", "RT @luizotaviocdz: HOJE TEM VIDEO NOVO DO @juliococielo  PORRA", "RT @pfvraffa: @juliococielo vai dormir caralho", "RT @pfvraffa: https://t.co/oEpA0FJzMn\n\n@juliococielo  HAUAHUAH o melhor vei", "RT @MicheleShiba: Cocielo best mendigueiro BR", "RT @lisagiovana: @juliococielo aqui em Brasília é din din...", "RT @MicheleShiba: Beijim no ombro, 50 QU3M F3CH4 C0M 0 80ND3", "RT @magicstoran: Vao ali rapidinho no youtube ver o video novo do @juliococielo http://t.co/JOWrUHH1Ed", "RT @MicheleShiba: Sobre: RT @juliococielo: eaí seus cone http://t.co/AfcfFIPWXv", "RT @magicstoran: ATENÇÃO: @juliococielo inova transando com um ps3 http://t.co/ensMpaOZEP", "RT @magicstoran: @juliococielo nao, voce é um principe, super simpatico. Super apaixonantezinho", "RT @koeanaa: cara dou mt risada com os videos do @juliococielo", "RT @magicstoran: MANOO VOCE É FODA http://t.co/OhPoLbhStz @juliococielo", "RT @magicstoran: Assistam http://t.co/OhPoLbhStz do @juliococielo e me falem o que voces acharam rawn", "RT @lisagiovana: @juliococielo racho a conta e vivo dando presente-surpresa... Acho q sou o macho da relação :s", "RT @Neguinhamesmo: @juliococielo  Na Boa a maioria dos negros ta pouco se fudendo pra esse dia ¬¬'", "RT @felipesales1: Tive que parar no meio do video pra ir no banheiro de tanto rir uashhsuah#CANALHARESPONDE : http://t.co/sVQbV7Ftq6 via @j…", "RT @falaeju: #CitePessoasLindasDoTwitter @juliococielo", "RT @VsfDj: Gostei de um vídeo @YouTube de @juliococielo http://t.co/Z5TzkRLAfU 10 MANDAMENTOS DO REI DO BAILE FUNK", "RT @felipesales1: @juliococielo agregando valor ao camarote! 10 MANDAMENTOS DO REI DO BAILE FUNK: http://t.co/KrW8ZhtE7P via @youtube", "RT @Thiago_Idalgo: minhas 2 vós só serve memo pra eu quebrar o braço delas as vezes na hora da raiva", "RT @CarolSerikyaku: Mostrei o Canal do @juliococielo pro meu irmão, e agora é Canal Canalha 24 horas por dia...hahahahah", "RT @alocarneiro: Gostei de um vídeo @YouTube de @juliococielo http://t.co/f0yoK1WJCn ENCONTRO COM OS INSCRITOS - YOUPIX 2013", "RT @Somente1Garota_: Se eu chorei e ri com o novo video do @juliococielo ? Não magina &lt;3 Perfeito http://t.co/QFQpbuQ8tk", "RT @MarcosRLJ: @juliococielo Pegaria, só não ia conseguir pegar ela pelo braço.", "RT @MarcosRLJ: @juliococielo quem te bateu?", "RT @MarcosRLJ: To rindo demais com o vídeo do @juliococielo, assiste isso na boa! http://t.co/gvGMRwES", "RT @Somente1Garota_: \"Vi um filminho da minha vida passar\" aushuahs @juliococielo é foda :) x : http://t.co/xjbsn0Qg", "RT @Somente1Garota_: @juliococielo Siiiim \\õ :) x ♥", "RT @Somente1Garota_: \"Estou pensando em me matar para não morrer \" Só o @juliococielo pra fazer mais um video Foda com sabias palavras . ...", "RT @Somente1Garota_: @juliococielo Upaa \\oo/ Pelamor", "RT @matheusramone10: Ace Of Spades é a música perfeita pra sair atropelando pessoas", "Se precisar estamos aí @taynadoll, IUHEIAHEUIHEUIHAUIE", "RT @leosirotheau: Vi Romário ser artilheiro no fim da carreira. Vi #ronaldo SEM GOLS no fim da carreira. Vi Rivaldo marcando golaço aos  ..."]}