{"tweets": "Ten more lives have been stolen by gun violence. \n\nThe grief we feel is heartbreakingly familiar, but we cannot become numb to it.  We must act now. Food insecurity plagues every corner of our country and we are working hard to address it. #HelpIsHere to put food on the table through the American Rescue Plan. It’s the stoic mother who says she’s not hungry at dinner so her kids won’t feel bad when she gives them her share. Or maybe it’s the person who lives half an hour from a grocery store, but can’t afford to get there. It’s the parent who just lost their job and quietly visits the food bank for groceries to get by. Or the child whose stomach growls until the teacher slips them a granola bar or apple to eat. It’s possible you may not even realize your friends and family could be suffering — because hunger is a silent agony. Millions of Americans, including millions of children, don’t have enough food to eat.  Some, because of the economic effects of COVID, are experiencing hunger for the very first time in their lives. Good luck to @NovaMBB! I’m cheering you on! 👏👏 #LetsMarchNova 🎉 100 million shots in arms…Hugs are coming.💕 To the families of the shooting victims in Atlanta last night and those in the Asian-American community who are hurting, my heart is with you. \n\nI hope that everyone will join me in praying for all those touched by this senseless tragedy. Said a quick ‘hi’ yesterday to the virtual students. Though with the American Rescue Plan, we’re going to open schools for in-person learning – and do it safely. https://t.co/bSbskKaAmE With the American Rescue Plan, #HelpIsHere. We’re going to open schools—and we’re going to do it safely. https://t.co/GuN0RlY4e5 Military families’ devotion to our country is unshakeable and it’s vital that our work to support them is shaped by their voices. This week, I visited three U.S. military bases to hear directly from military families about what they’re facing and how we can help. https://t.co/3EbjIKeY3b 50 days. Help is here. RT @POTUS: Help is here — and brighter days lie ahead. https://t.co/HSp8rPBxty It’s more important than ever that we take steps to lift up and empower women and girls everywhere. \n\nOn #InternationalWomensDay, we are celebrating the establishment of the Gender Policy Council that will do just that. https://t.co/3nfq3zxGqk On this #InternationalWomensDay,  we celebrate the resilience and courage of women everywhere. \n\n“Each time a woman stands up for herself...she stands up for all women.” - Maya Angelou We all want to get our kids back to school. @SecCardona and I got to see first-hand today what safety measures schools in CT and PA have implemented to stay open during COVID. https://t.co/R9sooCHddS Last week in Texas, the President and I saw the best of the American people. Watching everyone come together to support one another in times of crisis gave me so much hope. https://t.co/whjOiJWxTe Join us here for our first performance in the White House in honor of Black History Month. https://t.co/hEA3SPCG5D 500,000 lives lost to COVID-19. Please join us in a moment of silence to honor and remember those who were taken from us too soon. https://t.co/CMAl2hVFbw The #NASAPerseverance has officially landed on Mars! Congratulations to everyone involved. You’ve showed us today that anything is possible. My heart is with you. Today, it’s more important than ever for us to support one another. If you’re able, please check in on friends and family and lend a hand wherever you can. https://t.co/Q1kBAxxmcM Can’t wait to see you @kellyclarkson! https://t.co/Xr98w0ocd2 All that he does, he does for you. Happy #PresidentsDay. https://t.co/tYcdN2Zv29 Dropped by @TheSweetLobby earlier to pick up some Valentine’s treats for the weekend. Shhh – don’t tell Joe! 💕 https://t.co/YXmtLciuws Wishing you and your family a very happy #LunarNewYear! May this year bring happiness, health and prosperity. https://t.co/HAyGgAOMz7 Healing\nCourage\nLove\nCompassion\nGratitude \nPeace\nAmor\nStrength\nKindness\nFamily\nUnity \n\nLove, Jill https://t.co/y5Y6BDGHUT On #WomenInScience Day, I’m thinking of Dr. Mae Jemison – the first Black woman in space. She pushes us to believe we are capable of more than we know: “I had to learn very early not to limit myself due to others' limited imaginations.” Everyone should have access to free community college. I’m cheering you on today, Sarah Thomas! 🎉 #SuperBowl https://t.co/eh2XCjBWxq Let’s go FLYERS 👏👏👏👏👏 Don’t forget to mask up – even when you’re out walking your dog. (P.S. – Champ and Major agree!) https://t.co/Ovedz4CdiQ Cancer can be such a lonely, difficult journey for patients, loved ones who care for them, and the providers and researchers who work hard for them. \n\nOn #WorldCancerDay, I want you to know Joe and I are here for you and will never stop fighting for you. https://t.co/UL9QZtGEgC RT @POTUS: Officer Brian Sicknick was a hero who died in the line of duty defending our democracy and the citadel of liberty itself. To his… “While we have our eyes on the future, history has its eyes on us.” – @TheAmandaGorman #BlackHistoryMonth Military children serve, too. That’s what student mentors from @MilitaryChild shared with me. From helping new students feel welcome with virtual game nights to sharing snacks after school, these resilient kids are using their own experiences as military children to help others. RT @POTUS: America has never lived up to its founding promise of equality for all, but we’ve never stopped trying. Today, I’ll take action… Meeting today with the spouses of Democratic and Republican governors gave me so much hope for our future. \n\nI know we can – and will – heal our country together. https://t.co/WDg0ga8gmW RT @POTUS: Today, I repealed the discriminatory ban on transgender people serving in the military. It’s simple: America is safer when every… Champ and Major have joined us in the White House! 💕🐾 https://t.co/R035YnavVo This is an important step in supporting our veterans and their families. https://t.co/SYWI4ymXey With all my heart — thank you to the National Guard for your continuous commitment to keeping our nation safe. https://t.co/L7VRqWTfyc Cancer touches so many families. \n\nThank you @whitmanwalker and @cancersupporthq for hosting me today to talk about support for cancer patients and caregivers, as well as the impact of COVID-19 on access to health care, screenings, and prevention efforts. https://t.co/IUO7JODLxE I couldn’t wait one more day to have this meeting, to say thank you on behalf of a grateful nation, to educators for their heroic commitment to students during this pandemic.  \n\nYou’ve been so strong; and we will be strong in our support for you. https://t.co/wtxJkoBNwJ Every four years, we celebrate the beginning of a new administration.  It’s the start of a bright new chapter. A time for us all to come together. I’m so grateful to all who worked to create an incredible day – especially in this uniquely difficult year. https://t.co/P3L7OYoANR Thank you for your faith in something that is bigger than all of us: that we will build a better world because we’re going to do it together. https://t.co/k6JT7Os92N", "bag_of_tweets": ["Ten more lives have been stolen by gun violence. \n\nThe grief we feel is heartbreakingly familiar, but we cannot become numb to it.  We must act now.", "Food insecurity plagues every corner of our country and we are working hard to address it. #HelpIsHere to put food on the table through the American Rescue Plan.", "It’s the stoic mother who says she’s not hungry at dinner so her kids won’t feel bad when she gives them her share. Or maybe it’s the person who lives half an hour from a grocery store, but can’t afford to get there.", "It’s the parent who just lost their job and quietly visits the food bank for groceries to get by. Or the child whose stomach growls until the teacher slips them a granola bar or apple to eat.", "It’s possible you may not even realize your friends and family could be suffering — because hunger is a silent agony.", "Millions of Americans, including millions of children, don’t have enough food to eat.  Some, because of the economic effects of COVID, are experiencing hunger for the very first time in their lives.", "Good luck to @NovaMBB! I’m cheering you on! 👏👏 #LetsMarchNova 🎉", "100 million shots in arms…Hugs are coming.💕", "To the families of the shooting victims in Atlanta last night and those in the Asian-American community who are hurting, my heart is with you. \n\nI hope that everyone will join me in praying for all those touched by this senseless tragedy.", "Said a quick ‘hi’ yesterday to the virtual students. Though with the American Rescue Plan, we’re going to open schools for in-person learning – and do it safely. https://t.co/bSbskKaAmE", "With the American Rescue Plan, #HelpIsHere. We’re going to open schools—and we’re going to do it safely. https://t.co/GuN0RlY4e5", "Military families’ devotion to our country is unshakeable and it’s vital that our work to support them is shaped by their voices. This week, I visited three U.S. military bases to hear directly from military families about what they’re facing and how we can help. https://t.co/3EbjIKeY3b", "50 days. Help is here.", "RT @POTUS: Help is here — and brighter days lie ahead. https://t.co/HSp8rPBxty", "It’s more important than ever that we take steps to lift up and empower women and girls everywhere. \n\nOn #InternationalWomensDay, we are celebrating the establishment of the Gender Policy Council that will do just that. https://t.co/3nfq3zxGqk", "On this #InternationalWomensDay,  we celebrate the resilience and courage of women everywhere. \n\n“Each time a woman stands up for herself...she stands up for all women.” - Maya Angelou", "We all want to get our kids back to school. @SecCardona and I got to see first-hand today what safety measures schools in CT and PA have implemented to stay open during COVID. https://t.co/R9sooCHddS", "Last week in Texas, the President and I saw the best of the American people. Watching everyone come together to support one another in times of crisis gave me so much hope. https://t.co/whjOiJWxTe", "Join us here for our first performance in the White House in honor of Black History Month. https://t.co/hEA3SPCG5D", "500,000 lives lost to COVID-19. Please join us in a moment of silence to honor and remember those who were taken from us too soon. https://t.co/CMAl2hVFbw", "The #NASAPerseverance has officially landed on Mars! Congratulations to everyone involved. You’ve showed us today that anything is possible.", "My heart is with you. Today, it’s more important than ever for us to support one another. If you’re able, please check in on friends and family and lend a hand wherever you can. https://t.co/Q1kBAxxmcM", "Can’t wait to see you @kellyclarkson! https://t.co/Xr98w0ocd2", "All that he does, he does for you. Happy #PresidentsDay. https://t.co/tYcdN2Zv29", "Dropped by @TheSweetLobby earlier to pick up some Valentine’s treats for the weekend. Shhh – don’t tell Joe! 💕 https://t.co/YXmtLciuws", "Wishing you and your family a very happy #LunarNewYear! May this year bring happiness, health and prosperity. https://t.co/HAyGgAOMz7", "Healing\nCourage\nLove\nCompassion\nGratitude \nPeace\nAmor\nStrength\nKindness\nFamily\nUnity \n\nLove, Jill https://t.co/y5Y6BDGHUT", "On #WomenInScience Day, I’m thinking of Dr. Mae Jemison – the first Black woman in space. She pushes us to believe we are capable of more than we know: “I had to learn very early not to limit myself due to others' limited imaginations.”", "Everyone should have access to free community college.", "I’m cheering you on today, Sarah Thomas! 🎉 #SuperBowl https://t.co/eh2XCjBWxq", "Let’s go FLYERS 👏👏👏👏👏", "Don’t forget to mask up – even when you’re out walking your dog. (P.S. – Champ and Major agree!) https://t.co/Ovedz4CdiQ", "Cancer can be such a lonely, difficult journey for patients, loved ones who care for them, and the providers and researchers who work hard for them. \n\nOn #WorldCancerDay, I want you to know Joe and I are here for you and will never stop fighting for you. https://t.co/UL9QZtGEgC", "RT @POTUS: Officer Brian Sicknick was a hero who died in the line of duty defending our democracy and the citadel of liberty itself. To his…", "“While we have our eyes on the future, history has its eyes on us.” – @TheAmandaGorman #BlackHistoryMonth", "Military children serve, too. That’s what student mentors from @MilitaryChild shared with me. From helping new students feel welcome with virtual game nights to sharing snacks after school, these resilient kids are using their own experiences as military children to help others.", "RT @POTUS: America has never lived up to its founding promise of equality for all, but we’ve never stopped trying. Today, I’ll take action…", "Meeting today with the spouses of Democratic and Republican governors gave me so much hope for our future. \n\nI know we can – and will – heal our country together. https://t.co/WDg0ga8gmW", "RT @POTUS: Today, I repealed the discriminatory ban on transgender people serving in the military. It’s simple: America is safer when every…", "Champ and Major have joined us in the White House! 💕🐾 https://t.co/R035YnavVo", "This is an important step in supporting our veterans and their families. https://t.co/SYWI4ymXey", "With all my heart — thank you to the National Guard for your continuous commitment to keeping our nation safe. https://t.co/L7VRqWTfyc", "Cancer touches so many families. \n\nThank you @whitmanwalker and @cancersupporthq for hosting me today to talk about support for cancer patients and caregivers, as well as the impact of COVID-19 on access to health care, screenings, and prevention efforts. https://t.co/IUO7JODLxE", "I couldn’t wait one more day to have this meeting, to say thank you on behalf of a grateful nation, to educators for their heroic commitment to students during this pandemic.  \n\nYou’ve been so strong; and we will be strong in our support for you. https://t.co/wtxJkoBNwJ", "Every four years, we celebrate the beginning of a new administration.  It’s the start of a bright new chapter. A time for us all to come together. I’m so grateful to all who worked to create an incredible day – especially in this uniquely difficult year. https://t.co/P3L7OYoANR", "Thank you for your faith in something that is bigger than all of us: that we will build a better world because we’re going to do it together. https://t.co/k6JT7Os92N"]}