{"tweets": "30 days #forStJude. September is Childhood Cancer Awareness Month, and I’m proud to be supporting the kids of @stjude this month. Learn more about how to help cure childhood cancer. 👉🏼 https://t.co/YZW3UEQfGP\nLet’s cure childhood cancer. Together. https://t.co/BrzCm4lLLB What can I say, I was always so fashion forward. And yes @gucci I am available for this campaign 😂 bringing back my 2005 looks https://t.co/SMr92U7JYQ Every time this day comes there’s always a heaviness I feel. Remembering all those we lost on September 11th #neverforget https://t.co/EQXRWW2Ec2 https://t.co/RcIUqm7MpF @TisdalesDaily @tizziexoxo @Laura_New @VanessaHudgens @sammydroke @shelleybuckner @kimdaugherty_ I know that when did she post it lol @tizziexoxo @Laura_New @VanessaHudgens @sammydroke @shelleybuckner @kimdaugherty_ Omg when was this lol https://t.co/JgRLJMrJP7 Really happy with how this kitchen turned out. My dad bringing all my kitchen dreams to life 😍 I found my inspo on Pinterest and of course then I made it my own. The reclaimed ceiling was my dads idea! Also I have all my favorite stores In this kitchen! @michael.j.tisdale https://t.co/lItvtUfgXO Morning stretch 🧘🏼‍♀️ https://t.co/tuD5gQC36h https://t.co/mAUGh2CW5x Only @RealAdamRose could make sense of all these tiktok moves 😂 https://t.co/8SGpsBwNmx Setting intentions for this new week. Practicing gratitude. Sending love to whoever needs it the most ❤️ https://t.co/EBZMxV7tnG I have to do an appreciation post on just how cute my dogs are. These little cuties came into Chris and my life when we needed them the most. I feel like Maui sent them to us. Dogs are the best thing in the world, they force you to be present in the moment. https://t.co/S1Y8kkNPNE @bre_ashley87 Love!! 😊😊 #CandaceAgainstTheUniverse https://t.co/e1Omm8hpGe Candaces big moment is finally here!! https://t.co/Fws82mXdP9 MOM PHINEASE AND FERB MADE A MOVIE AND ITS ALL ABOUT ME!!! Watch now on @disneyplus #PhineasAndFerbMovie https://t.co/gXxj9mFfEy Just a little #electriccateye done by #jennakristina. Hair by #bridgetbragerhair🧡💛💖 https://t.co/vsGckMX0sd Where I start my mornings https://t.co/RZKix9ThFp Had some fun with @maneaddicts_ in my backyard and talked all things #frenshe. Check out the full article here 👉🏼 https://t.co/cMSpdfdJab https://t.co/52U5AITsWw So @lifeinjeneral came by and took our kitchen from mess to completely organized. Swipe through to see the magic. Also have a post up on #frenshe giving you tips on how to achieve this yourself! https://t.co/fyCMUqvxXI https://t.co/rhyNVlMXze Self care Sunday 🧖🏼‍♀️ I would love to hear what your self care looks like. Comment below 👇🏼 https://t.co/ojdfoPwPUc Ending this week with a little tie dye 🧡\nHair: #bridgetbragerhair \nMakeup: #jennakristina https://t.co/6UVmqjoThu Another day, another zoom interview 💻 \nHair: @bridgetbragerhair \nMakeup: @jennakristina https://t.co/eutGRzstG9 How you guys liking #frenshe so far? Comment on what you want to read more about 👇🏼 https://t.co/Mh6GFdplhx Frenshe is now LIVE! https://t.co/zDxIDy7dMC https://t.co/TrhQx7GXNK I miss farmers markets and Sunday brunch 🥂 https://t.co/2i1tfBqECH Saturday’s am I right? https://t.co/k64ZUSgDBG WE’RE BACK!! https://t.co/OClTmCOMYh Today’s press look ✨ \n💄: @jennakristina \n💁🏼‍♀️: @bridgetbragerhair https://t.co/cguCghkDe4 🙌🏼🙌🏼🙌🏼 https://t.co/ga2icXrjh6 Love how easy it is to pick up coffee @starbucks using the Starbucks App. It’s so fast (I even picked up in the drive thru), and super delicious!! #StarbucksAmbassador #ad https://t.co/JkUWIyRxiT I love beauty tools! Especially in this time where we can be stressed are jaws might get right and in the past I’ve suffered from tmj. It’s not only doing something for your skin but the massaging aspect deeply relaxes me! What are your favorites? https://t.co/57KVkh5JhF SOMETHING IS COMING.... 8.17.20 follow here 👉🏼 https://t.co/AOHMG7YYUU Truth! https://t.co/b5OwdKztMf Sunday Sitting Pretty ☀️ https://t.co/QsjuEKMYpD All dressed up and no where to go. However I do find when I get ready in the morning and put clothes on vs sweats I’m way more productive with my day! Anyone else feel this? https://t.co/8lzE7tliay Just dancing through the week like.. https://t.co/06Y0Eju8UL No makeup no filter just ME ☺️I’ve always taken care of my skin but especially now that we’re home so much I try not to spend all my days in the sun. Shoot on over to my IG for any skin care questions! https://t.co/zpBNSPXMEL Living room complete 👌🏼 now on to the Master Bedroom Reno. Check out my stories for a before and after! https://t.co/HVOgUPaINB Wow I picked a good one @cmfrench https://t.co/rRhJGMBB0f #tbt when I was a @fordmodels. I had to retire early when I realized I was only gonna be 5’3 https://t.co/A45EcZoe5C La La Land 🌴 https://t.co/fYhBfm55ks I love women supporting women. Thank you for the nomination @andrea_tiller. Keep being beautiful, powerful, badass bosses ladies ❤️ #challengeaccepted https://t.co/O36F637h53 I’m on a Nancy Meyer binge and I can’t decide whose house I want to live in. Meryl Streep’s in Its Complicated or Resse Witherspoons in Home Again Vogue and VOTE! We have 100 days until Election Day. Join me, @realadamrose and @iamavoter in our mission to register 100,000 voters on this #RegisterAFriendDay. Step 1:Text FRIENDS to 26797 to make sure you are registered to vote. Step 2:Share this post and tag 5 friends! https://t.co/InqsIMmgyV YOU GUYS!! Here’s a first look at #CandaceAgainsttheUniverse Oh how I’ve missed you Candace!! https://t.co/iMPaHDPb3F My costar these days... https://t.co/G4bcDOvUhH Happy Friday y’all 🤠 https://t.co/tdf6vKOAav #tbt I bet you didn’t know I was on Sesame Street 😂 also who knew my letter was later going to be the first letter of my married name, French. Also I couldn’t pronounce my R’s but look at me now! https://t.co/kjSttk5b2i https://t.co/AeFibDc9R0 https://t.co/5BclEIgZob It’s a vibe ☀️🌴 https://t.co/h5jBU2EcbD Need some suggestions! Through out quarantine I’ve really given me hair a break. Been masking, letting it air dry. Now I’m looking for non toxic hair products.. comment below which are your faves!! 👇🏼 https://t.co/sKHuA9OcmL I miss traveling ... https://t.co/GQe9BkuDen It took me a minute to get in the groove of working at home and realizing this is my new normal.. for now. But I wake up, have my coffee and start writing. I can’t wait to share what I’ve been working on. It’s been years in the making without even knowing it. #comingsoon https://t.co/wDiRFIiGEb Quarantine vibes ✌🏼 https://t.co/goQq42FalB What day is it? https://t.co/OyjVtVJQ8r https://t.co/j0uZZFCVxs 🌵☀️🔥 https://t.co/eOj3lhPbgw A lil getaway 🌴 https://t.co/Jp6QfsDLAr @RealAdamRose Ohhh now you’re back since you heard tiktok might be banned in the us?? Tuesday vibes https://t.co/sO28YMNO6y https://t.co/tqKxquLvfa Sunday morning feels ✨ https://t.co/UCgVgcX4OE This is 35!! #wearamask #savelives https://t.co/WSCIdbiFZf MOM PHINEAS AND FERB ARE DOING A MOVIEEEEEE..... About MEEEEEEEE!Coming to ya August 28th on @disneyplus https://t.co/xqdzL5KJsD Sunny side up https://t.co/Fn1b3D3gle Birthday week got me dressing cute 🌻 https://t.co/YXG0jPyuZN Mood knowing my birthday is next week 🎂 https://t.co/WMi7Rn7aGY I ❤️ a stripe! Living room complete by @pierceandward https://t.co/bs8rIRbS4h You asked for my skincare routine and here it is! Loving an at home #SelfCare moment with this easy 3 mega wonders set by @olehenriksen. Not only does it work wonders, but it’s also super affordable! Check it out at https://t.co/MzZpxb0S8J and @sephora #MoreGlowLessDough #OleGlow https://t.co/xtWONTHnsQ Be kind to each other. Everyone is going through a lot right now. Make an effort to do something for someone else today. https://t.co/d4G1LJQzFf Shine bright like a diamond 💎 https://t.co/DJ6TYXF9IQ Happy Father’s Day daddy!! Thank you for always making my homes so special and taking care of the whole family. We love you!! @michael.j.tisdale https://t.co/aljkn6BuF6 Easy breezy beautiful Quarantine girl 😂 https://t.co/uBakngX5RE My fans are amazing! They know it’s a tough week for me and Chris with Maui’s one year anniversary being gone and they made this video for me. This put a huge smile on my face, I can’t thank you guys enough! I love you all &amp; your support helps me through everything ❤️ https://t.co/CKz4HESje2 Wow! I love you LA ❤️🧡💛💚💙💜 https://t.co/h435HcmWZi https://t.co/odQuXL3Pw1 Sunday’s... am I right? https://t.co/F87syHckET Just realized I haven’t worn makeup for three months 😳 https://t.co/hvzGXLFtnb https://t.co/18dbDe4aMJ RT @aliciakeys: Do you know what happened to #BreonnaTaylor? https://t.co/uinwcCKqld 🥀 https://t.co/yfQOEUVYXe Happy birthday my beautiful angel. You would have been 13 years old today. I miss you everyday Maui but I feel you around us all the time ❤️ https://t.co/lt7UciJaE7 https://t.co/h3DQjrGkRo I LOVE YOU KEKE https://t.co/IIhwplUH1H #blacklivesmatter #blackouttuesday https://t.co/wsO9Oo8O7k Every time I watch this I cry, NO ONE should ever have to feel this way. #blacklivesmatter https://t.co/iBNCqod1r6 https://t.co/eCYpZ3tj8l I shared it in my igstory with a swipe but I’ll share again here! https://t.co/Zj5PIa5R7p RT @iamfrench: This is important.\n\ncc @CNN @MSNBC @NBCNews @ABC \n\nPlease RT RT @Alyssa_Milano: White Extremists Terrorize and Loot: 10 Videos of Destruction Black People Will Be Blamed For https://t.co/sWyMMJSTkQ Thanks sissy https://t.co/qg0DxxB3tL 🍋🍋 https://t.co/8wR1AVU4NR ❤️❤️ https://t.co/1eb23p4M9B 🙌🏼🙌🏼 https://t.co/mHSF6fY0yP Means so much to me! https://t.co/Fh7T8ey9Uk Thank you for loving it! 🍋 https://t.co/G0ctzbT0If 😍😍 https://t.co/y7wjcXOFOm Thank you!! https://t.co/RpzesrAmNO Thank you so much!! https://t.co/nJIaIbr4To You’re the best! Thanks for loving it 🍋🍋 https://t.co/e5ON7Do718 Thank you!! 🍋🍋 https://t.co/bEXEzHZDNM 😍😍🍋 https://t.co/ihiSEY52oz 🙌🏼🍋🍋 https://t.co/niRSZmO62m Haha thanks! https://t.co/V25AUmDIB3 Thank you!! https://t.co/nUZfh8buTa WOW!! I love you Brazil!! https://t.co/spJuxoc3pK So glad you’re happy!! 🍋 https://t.co/UXJ5cNP1bS Thank you for loving it!! https://t.co/qw4t3w5aXW 🥰🥰🍋🍋 https://t.co/KFiMVlnoYC Thank you!!! https://t.co/UZxIFeiTeQ So glad you love it!! https://t.co/f3MmEBBMRx ITS HERE!! Listen to #Lemons to brighten your day!! https://t.co/YzK9J4gnMr https://t.co/57qZlBmFY1 TOMORROW!! #LEMONS 5.29 🍋 🍋 https://t.co/q9fesfJR25 SNEAK PEEK 2 more days!!! #LEMONS 5.29 🔊 https://t.co/2455EVOlzT Just the two of us (Sheila) https://t.co/hQHJpG7Esr Every morning when I look at my couch... #mondaymotivation 😂 https://t.co/n8AQNs208b I’m thinking of cutting my hair... thoughts? Is this quarantine talk? Who am I? https://t.co/xTYdXMB6Hw @FernandoCandiaT Oh good I thought I was the only one 🙈 so snapchat is cancelled? Tiktok is where we have fun. Instagram is where we all fake our reality. Snapchat is where we find a different face. And Twitter is where everyone takes out their anger on the world. GET READY! #lemons drops on the 29th!! https://t.co/C14GIsaPFG #Lemons 🍋 announcement coming later today! https://t.co/TPvDoskXHV RIP to my body before quarantine https://t.co/yssyQBIotc #tbt At much music, remember when this hair color was a thing. Blonde with black stripes 😂 https://t.co/Ed0qWEnmc2 https://t.co/e1uX445OXw When we give love to ourselves, we eat better choices, we stress less (which produces oil)we accept ourselves and our flaws fully. I’m not perfect but I love myself enough to take this video and share with you all, Unfiltered. It’s taken me a long time to love myself. You try it! https://t.co/MkDnEFj8y1 @hjs_xo Meditation and reaching out to friends and communicating how I’m feeling! Also books are really good, check out attacking anxiety and depression by Lucinda Bassett Happy Mother’s Day Mom!! I love you so much, thanks for always being there for me and supporting me in everything I do. Sorry I couldn’t do the same for you when you were stuck on Sheila last year 😂. All jokes aside you give me strength when I need it the most, I LOVE YOU https://t.co/rOM7Kb4gOr HA! I would have made an interesting Troy. https://t.co/F9uxHvLTlo Weekend vibes. But can we even it call it a weekend when everyday feels like Saturday all over again. 📸: @rileytaylor https://t.co/h91ab7xcqK I feel the most beautiful with no makeup, in a bathing suit swimming. Something about the water just makes me so present and allows me to just be. No pressure, nothing to prove, just me. ☀️ what makes you feel the most beautiful? I want to hear your thoughts 👇🏼 https://t.co/M2du6KuWT4 5.22 LEMONS 🍋 One of my favorite songs I’ve co-written and recorded. Music always makes me feel better and I love being able to express myself through it. https://t.co/bjfB0HbQaB LEMONS 5/22 🍋 https://t.co/truPoIPCKx 🍋🍋🍋 #comingsoon https://t.co/opu6LS0pj7 Who wants new music? 🤔 you better start posting 🍋 https://t.co/kH9GdlFIbs https://t.co/SwfEHQCQKM Sheila doesn’t get it https://t.co/Y5kT1UObBE What would Britney do? https://t.co/svbedQ9rrC 👽 https://t.co/H65i57yrHe A connection like no other 😂 https://t.co/KSUfllzsar https://t.co/6UDYKdTJtL She looks like a farmer in those clothes. https://t.co/6M5GPdI10w One thing my dogs have taught me during this time is to be present and enjoy the most simplest things. My motto is Be Like Sushi https://t.co/Dk4Chw6KlK https://t.co/5yaKyiY7bB A love story 💕 Sheila + I https://t.co/Yax2cuDOOo Sheila is thriving. https://t.co/YJ03ieQp9i Blue skies ☀️ https://t.co/hosX0L8Adj https://t.co/b6NE251k0x HAPPY EARTH DAY 🌍 I hope today we can all reflect on our time inside and find better ways to treat our planet. It’s not about being perfect it’s just about being better. What can you do to help? #happyearthday https://t.co/maOMOq8O42 Cheers to coffee bringing me life during this quarantine ☕️ https://t.co/WqgiE0bXgH https://t.co/4OUEPhVMvF Here’s some bloopers for y’all. We had so much fun filming We’re All In This Together but definitely had some technical difficulties (🙋🏼‍♀️ me) https://t.co/v6iHHDg9Hi Quarantine check https://t.co/vdfojHVQcr https://t.co/SiBQDx2bmL Happy Easter 🐇 I know this year is a lil different for everyone but I hope you find some peace and happiness. Sending love + light to anyone who needs it ❤️ https://t.co/VpiZogIakh What I wear to do laundry 🧺 https://t.co/zOC4VK2lWd I love you sister. Idk what I would do without you!! @jenkellytisdale #happynationalsiblingsday https://t.co/dFu1nlDcCm Remember when we were able to touch things without washing our hands right after? https://t.co/cKuHqbAGcZ My Everyday Self Quarantine Makeup ✨ https://t.co/l6Ajarm1d4 This is how I’m getting through quarantine, hbu? @tiktok https://t.co/YWAZTsTxNl #444sugarchallenge #sucroseintolerance https://t.co/kFbVJsCZ5S Saturday’s vibe be butterflies 🦋 https://t.co/AfP5wCAYqD When the Quaranteam starts falling apart on day 159374645 😂 https://t.co/ntsH8oPMfu Come join me on @tiktok at 5pm PT 🎉🎉 https://t.co/iY41FzItJQ Going live on #tiktok at 5pm! Come hang with me. https://t.co/nrrCRRie8N MOOD https://t.co/9bteku5mlK What day is it? https://t.co/uInNxqMmRW Wondering if I should do a makeup tutorial for you guys ton my Igtv this week. You know.. since I have the time 💋comment below on👇🏼 https://t.co/d2L1PDkoLs Quarantine #ootd 🔥 https://t.co/IsrOMqysGx Taking this time to reflect. This has been humbling for sure, thinking of the little things we all took for granted like hugging each other. I know this is only temporary but since we have the time maybe we can look at ourselves and see where we can grow and be better than before https://t.co/ZVecT0spsz Sheila knows how to #socialdistance https://t.co/rtFfCIrTa1 Killing time @tiktok https://t.co/6kcjJroK3N My husband likes to drop these in my DM’s.... thanks babe! https://t.co/pqhk5gLUiq All dressed up and no where to go? I recommend putting a schedule together during the week so there’s a bit of normalcy. Maybe learn something new to keep your brain active. I know these times are hard, but know that you are not alone. Love you guys! https://t.co/CgeWbpkFpl All dressed up an no where to go! Today I started my morning with meditation to help ease the fear and anxiety we are all going through. Next up is yoga and then reading. Stepping away from the news and just going to be in the moment. #selfcareday https://t.co/eMOxrOIp3m I keep dancing on my own 😂 https://t.co/4WOGuYHeMP Just interrupting your feed with some wholesome puppy content @sushisuefrench 💕 https://t.co/WsCb66GLNs If you need to work out while on #selfquarantine try this 😂 hopefully this will brighten your day a little! https://t.co/4eVYPHYRim Double the pups, double the love ❤️❤️ https://t.co/4KbzboPjWU Thank you #AlcoholicsAnonymous for having a streaming service at your meetings. My husband was able to stream his favorite meeting. Anyone else who doesn’t feel great about leaving the house check out the zoom app @iamfrench Yes it’s true! I have the most iconic tv actors playing my parents. Also thanks for watching our season finale!!! @cbstv tops Thursday in total viewers!!!! @carolssecondact https://t.co/J1PDmhTrhH 🙌🏼🙌🏼🙌🏼 https://t.co/ojv1Ptx1ym EAST COAST Season Finale #CarolsSecondAct is on NOW!! Take your mind off of everything right now and enjoy some comedy!#CarolsSecondAct in @CBS in ONE HOUR Oh how I wish I was here in this moment. I feel at peace when by the ocean 🌊 https://t.co/rJzkL4fsXZ YOU GUYS!!!! The season finale of @carolssecondact is on TONIGHT!! Don’t miss it on @cbstv 9:30!! https://t.co/RNrNsQ1gZu Learning to love every side of me. It’s not easy because we all like to pick out our own imperfections but we are not meant to be perfect. As I get older I find myself loving the things that make me different and unique. Stop beating yourself up and love yourself. https://t.co/oFISGJfN2a Our empire is ready to bloom https://t.co/f8ZIfNXxD1 Hahaha I miss you!! I can’t wait to see you!!! https://t.co/ZiB3DZNN4P At the eye doctor and my eyes are getting better each time. So I’m LITERALLY getting better with age 🤓 This is so true! My mom always taught me to support my friends, let go of comparison and competition. When you can do that and be happy for others it means you are truly happy yourself! https://t.co/0GGAjdvdIm Trying to catch that magic hour ✨📷: @joe_mazzelo https://t.co/kkcjUYGTRP 🙌🏼🙌🏼 #CarolsSecondAct https://t.co/GaD9DRlvuA Date night!! #CarolsSecondAct https://t.co/8JSNLDU5nV I love this episode!! #CarolsSecondAct https://t.co/wFuMSmA9em Soo funny! https://t.co/0wH9IhJAMy 😊😊 https://t.co/ju3T8LEP87 EAST COAST #CarolsSecondAct is on!!! Turn it up! @CBS I wonder what Coachella is gonna be like this year... fashion wise... like will masks go with the boho look?? YOU GUYS!!! Only two more episodes of @carolssecondact!! Tune in TONIGHT at 9:30 on @cbstv. Honestly I say one of my funniest/favorite lines tonight 😂 watch with me! https://t.co/bqCsAUlefv 😊 you’re sweet https://t.co/fmCvvo2YYQ Hahaha thanks https://t.co/yFyP5Zh2p4 Yaaassss girl!!! https://t.co/wzpssySTI6 I’m really living up that Farm life on set 🎥 https://t.co/WIldvYK3y7 The older I get the the more I appreciate how young I look 😂 https://t.co/Wdx3GTsKOB In order to feel pure joy you have to let go. https://t.co/uY10aQgkXf Missing LA nights 🌴 https://t.co/zEU7Os7rPM 😊😊 https://t.co/XQ5lwJOKrV Oh geez @sushisuefrench is a belieber 😂 https://t.co/XF0z4lSMbJ Using my natural curl for this movie and I’m very excited 🎥 https://t.co/4QLa2XDB2e OMG! How come he hasn’t asked us to be IN IT?!! https://t.co/UHJqD4Tb6k Learning to just be in the moment https://t.co/yRVA7JTf42 Look at that talent 👀 https://t.co/l91DowTj2u Our Malibu adventure has come to an end. Today we move back home! Until next time... 🌊 https://t.co/gSPl8lPu04 Back to blonde and back to having fun 💁🏼‍♀️ https://t.co/5c0j4gELcu Jenny is the best #CarolsSecondAct https://t.co/qF8bbkwjhA Why thank you!! #CarolsSecondAct https://t.co/Xt3QBHku1l 🤔🤔 #CarolsSecondAct https://t.co/PTUXdNyOki This is great! #CarolsSecondAct https://t.co/9gNLhfFo8D Yay!!! #CarolsSecondAct https://t.co/oI7VdTHXwB I do 2! #CarolsSecondAct https://t.co/CpZVFWej8o 💋 #CarolsSecondAct https://t.co/eUz1IvNAVF Thank you!! #CarolsSecondAct https://t.co/3hKRojuMbj 😊😊😊 #CarolsSecondAct https://t.co/2lXyffj3tr 🙌🏼🙌🏼🙌🏼 #CarolsSecondAct https://t.co/D05Qa6qbVL Woo hoo!! https://t.co/rxBfwOtSln You guys we’re on!!! #CarolsSecondAct east coast turn @CBS on! New movie new hair...or old hair.. 😜 @traceycunningham1 @buddywporter https://t.co/kYoMJ9h6c3 Jenny and Daniel are back but does mom know??! Your favorite show #carolssecondact is on TONIGHT 9:30 @cbstv https://t.co/yRusJ6vfNu I LOVE the visit California commercials, it’s the weirdest thing.. I’m like I wanna go there!! Skin never looked so good ✨ I would love to say it’s just the products I use but I’ve been dairy free for 5 years and I swear it changed everything with my skin. I know it’s hard to give up something but when you do after awhile you barely crave it and I feel healthier. https://t.co/dhE75KJba2 Missing this weather, can’t wait for summer. Am I right? Shout out to @gibsontuttle for introducing me to this lovely brand 👗 https://t.co/fQGkvws33I Thanks @DebbyRyan https://t.co/DlQvfA3ufC https://t.co/Qu1xdLSeRg Wait how did this happen?! She’s 10 ALREADY??! The happiest birthday to my Lil princess @mikayladawntisdale. I love you so much!!! You are such a bright light and so smart, I’m so proud to be your aunt! ❤️❤️❤️ https://t.co/LncED24RvN Happy Valentine’s Day my love ❤️ @cmfrench https://t.co/IpStP1Pupz Find your light 💡 https://t.co/TNMUntxHSH The face I make when I want something 😝 https://t.co/lXLqZTCmTQ Gratitude always looks better on you ❤️ https://t.co/E2TG7nXOld When @eminem comes out on stage at the #oscars2020 you can’t help but lose yourself... get it GET IT!!! https://t.co/xB7kVwW9iB Back to life, back to reality.... 📸: @rileytaylor https://t.co/FDJWU9sZMc Last day in Cabo ❤️ que Hermoso tiempo. https://t.co/QEa3HCN1WS Have to interrupt the vaca pictures with an all new episode TONIGHT of #carolssecondact! Jenny and Daniel seem to be discussing something very important and I can’t wait for you to watch!!! @cbstv 9:30 I’ll be watching with you!! https://t.co/etnuY7p1Di Couldn’t stop dancing after visiting @laboticaspeakeasy 💃🏼 pose credit: @VanessaHudgens 😂 https://t.co/8DtUmQMK9R All the hair content of @JLo BTS at the #superbowl is the best thing ever! Work it @ChrisAppleton1 Vacay vibes 🌴 https://t.co/kg5Ps4XgQx My home away from home @lasventanasalparaiso https://t.co/2WRwJYc75l I’m so proud of this man, I wasn’t there to witness him before sobriety but I’ve been able to spend multiple “birthdays” with him and he completely inspires me. He is the strongest person I know and one of the most beautiful souls.❤️ happy 13th baby! @cmfrench https://t.co/AVqRdNKhmo Challenge Time! What are you planning on volunteering for #OneMoreSunday? @verizon #ad Taking the time to give back is easy! I love doing what I can to help the kids @StJude especially bc everything they do is from donations. Just clicking and donating anything you can will help. Pledge #OneMoreSunday with @verizon and do something for someone else!Pick your cause! https://t.co/DK01RkuD7m Having a blonde moment.. kinda miss this hair color 💁🏼‍♀️ should I?? https://t.co/n5W6oC9lz6 Quality me time? Volunteering with @StJude. Retweet and help pledge #OneMoreSunday with @verizon to support further research and funding for children in need or any cause that you feel passionate about! Just an hour of your day can change someone else's life! #ad I hope you’re tuning in #CarolsSecondAct is on RIGHT NOW!!! @CBS EAST COAST #CarolsSecondAct is coming on in 15 minutes!!! Turn on @cbs! Join me and @Verizon to show how you give back! Spread the love and show me your RT! I want to hear how you're going to pledge to volunteer for #OneMoreSunday 😊 #ad https://t.co/Zl6s6EfYy6 TONIGHT!!! #carolssecondact on @cbstv 9:30. One of my favorite episodes!! @PatriciaHeaton @SabrinaJalees https://t.co/mZr6NguvIB It’s on TONIGHT!!! https://t.co/hz4D1bYbQd My heart hurts. It hurts for the Bryant family and also the Altobelli, Chester, Mauser and Zobayan families. Praying and sending all the love and energy to everyone involved in this difficult time. 💔 https://t.co/uLwKG8BjLD I’m devastated. My heart hurts for Vanessa and the rest of the family. @kobebryant and Gianna 💔 Sunday mornings are for PJ’s and no filters☁️ https://t.co/R4LFxuPhJO Today for @TheTalkCBS talking about #CarolsSecondAct https://t.co/sH3AXVdVw0 😊😊 https://t.co/qzgUro2SIl See you soon!!! https://t.co/D42i7YEL7F Find yourself a best friend who doesn’t care what you do or compare themselves to you, who’s confident, who’s creative, who makes you laugh when you’re feeling down and who walks with you to get coffee just so she can get snapped by some paparazzi 😂 https://t.co/zNmUJoJA5y I’m watching #CarolsSecondAct are you?!! Hahaha that suit is one of my faves! #CarolsSecondAct https://t.co/mx6zXH1H2r Aww thanks!! #CarolsSecondAct https://t.co/9hug4NZeeY West coast get ready!!! An all new #CarolsSecondAct is coming on in 10 minutes!!! 😊😊😊 @RealAdamRose https://t.co/hPvVz6MHX8 Love my color + cut ❤️ by @traceycunningham1 and @buddywporter https://t.co/eKoxHWudYL Nm sitting next to you https://t.co/yUj3XlKx26 😝😝 https://t.co/myyDVGZsAU Hahaha yes I am!! https://t.co/YvPWgS5G0g Just booked our vaca. And I’m pretty excited about it 🌴 https://t.co/PYpffW5qnW My mom just told me to send more heart emojis... noted ❤️❤️❤️❤️❤️ So not cool!’ #CarolsSecondAct https://t.co/TTfiblODtG ❤️❤️ #CarolsSecondAct https://t.co/SzehKdaUwG Still can’t believe Daniel left Jenny at the restaurant ☹️ #CarolsSecondAct 😊😊 #CarolsSecondAct https://t.co/0P5aSfvt8F I know! 🤞🏼🤞🏼 #CarolsSecondAct https://t.co/2TvvK0mzzh So much fun! She is genuinely a really nice, hard working person and cares about people. She’s very grounded #CarolsSecondAct https://t.co/LiqWLeu5MM Jenny and Daniels first date! DUH! #CarolsSecondAct https://t.co/06cryQftBV It’s crazy bc it feels so long ago we shot this episode.. almost like last year! #CarolsSecondAct I love @PatriciaHeaton #CarolsSecondAct I know we’re finally BACK!! #CarolsSecondAct https://t.co/0P5aSfvt8F Cutest! But I wonder how their date will go 🤔 #CarolsSecondAct https://t.co/C50Hcm0Aqh Thank you!! #CarolsSecondAct https://t.co/00Q7O9N7uw The coffee? 😝 #CarolsSecondAct https://t.co/HFPehiQt7Q Thank you!! #CarolsSecondAct https://t.co/VEEHcyITmf Bad news Jake!! Welcome to the show @RealAdamRose, I feel like I know you from something else.... #CarolsSecondAct Ooooo Daniel is excited to finally take Jenny out on a date  #CarolsSecondAct 🙌🏼🙌🏼🙌🏼 #CarolsSecondAct https://t.co/auCigpnNVd It’s starting!!! #CarolsSecondAct @CBS 30 MINUTES WEST COAST!! #CarolsSecondAct here we go!! Watch with me! HA! #CarolsSecondAct https://t.co/RehxgLQu1y 😊😊😊 https://t.co/4RV6shagdP Thank you!!! https://t.co/LfqHoHsHIU 🙌🏼🙌🏼 @RealAdamRose is my favorite!! https://t.co/Q8X6UknDsP EAST COAST turn your tvs on to @CBS #carolssecondact is coming on in 20 minutes!!!! https://t.co/A0EGbnBsNK New year, all new @carolssecondact! Things get cozy TONIGHT on CBS at 9:30/8:30c!! https://t.co/rU8CtXHejz Guess what’s back TOMORROW!! Also what is happening between Daniel and Jenny?? Make sure you watch @carolssecondact on @cbs at 9:30!! https://t.co/NbS40RG71I Doing something fun with this girl this week @sabrinajalees. Something we dreamed up in 2019 is finally happening!! FriendCrush EMPIRE on its way 😝 https://t.co/nvI4E4vTUS Oh yay!!  I’m so glad you loved it https://t.co/8A6val5cQB When the holidays are over and you just wanna snapback to this... https://t.co/wt0OEMW2DF Dreaming up my plan for 2020✨\nEvery year I like to vision board and manifest what I want to bring in. It’s crazy how much I look back and see has come true. Be positive, be authentic, and it will happen. https://t.co/1tZpqOnR0O 2020 energy 💥 https://t.co/bmvBz8Nb4t Stepping into my power like.... #2020 👑 https://t.co/mJgOI1tvIc These are 2020 nails 💫 @color_camp https://t.co/8thUWQmtnv Just binged the first season of #YouOnNetflix and now when I see a bookstore I’m creeped out bc I think  of Joe 😳 Let go of being perfect. Nothing in life is perfect, therefor you’re not supposed to be. Love your imperfections, I know it’s hard it’s taken me a long time to love them myself. But I promise you when you let go of it you realize how much happier you are ❤️ https://t.co/XSS5qqwvnu Hahahahaha https://t.co/ZmKNxkWzTV I was sweating watching it with him lol https://t.co/w5l9B5Jad0 😂😂 https://t.co/Va5bGvybi8 Hahaha https://t.co/9zvQFrp8zg Our mornings look like this now 🐶🐶 We can’t tell though....are they playing or fighting? https://t.co/9Emj5daAcf Here is @dennisquaidandthesharks teaching us the ways on set of #merryhappywhatever 😂 https://t.co/AJURwzpEbz I hope your night is filled with love, family and traditions! #merryhappywhatever https://t.co/ZfjIEHXXFO https://t.co/2pgjOPJ5K9 Check out @bridgitmendler and I play Merry Happy Musical Impressions! I think we did a pretty good job 😂😂 @netflix https://t.co/bDIa8bwCRk “I want to make people feel good. I want to make people feel beautiful and love themselves.” @roseandivyjournal check out the interview! https://t.co/Kyx7kL8XTW Such a Kayla face 😂 https://t.co/6UJcvxNh0o Christmas came early 🎁 Me checking my emails https://t.co/nKeHLlZBX3 Home alone 2 night. One of My favorite Christmas movies Loving this new Bright Boost line by @Neutrogena! It’s made by millennials for millennials who love having brighter skin like me…my favs are the Gel Cream and Illuminating Serum!\n#BrightBoost #NeutrogenaPartner https://t.co/L1WobKSx65 Meet Sushi 🍣 our newest lil family member https://t.co/gmNb1h8OlA Monday glam brought to you by @chadwoodhair and @jennakristina. https://t.co/INdAOh6gzt Yes!! Proud to represent on @Netflix https://t.co/oeEKW6vBgd When you’re embarrassing your kid in public 😂 https://t.co/0o3v07uCpG Now they know how close we are @carolssecondact https://t.co/DUoKihLlO5 What happens? Check out #CarolsSecondAct on @CBS https://t.co/zC8oHeAeTe HI! #CarolsSecondAct https://t.co/H6LLl8Y9Gj I love my convos with @PatriciaHeaton #CarolsSecondAct https://t.co/ZmgnvS49HF Hopefully she doesn’t find out 🙈 #CarolsSecondAct https://t.co/H28RvyEECZ Thank you!! #CarolsSecondAct https://t.co/CgvPyYrnyJ This was such a fun episode to shoot! Love Christmas vibes #CarolsSecondAct Thanks! #CarolsSecondAct https://t.co/gzS1fK8LbE My favorite @cedricyarbrough #CarolsSecondAct https://t.co/lzS1Lb1sqH I do! I do! #CarolsSecondAct https://t.co/F5jEQNJPl5 Oh moms! #CarolsSecondAct https://t.co/NjjTfMNuec Why thank you #CarolsSecondAct https://t.co/mp04Sqa75N 30 minutes till #CarolsSecondAct EAST COAST. Turn on your TV @CBS Hahaha yes please S2! #MerryHappyWhatever https://t.co/2wek5jfVSW The best! Love is love, everyone should honor and respect that ❤️ #MerryHappyWhatever https://t.co/CQDzgbtGAf Thank you!! #MerryHappyWhatever https://t.co/hGEaTlZ3FN 🙌🏼🙌🏼 https://t.co/CQDzgbtGAf This was pretty fun! Head over to @cosmopolitan YouTube to see how I did on the Expensive Taste Test 😉 https://t.co/Xo52l17I0p I love them ❤️ @realelizabethho @siobhangmurphy https://t.co/N55PdiQ5dJ Had such a good time celebrating @stjude and seeing some friends. SWIPE for the star of the party ➡️ https://t.co/aP3peUZ0Y5 Why thank you! https://t.co/ea28j3WCzd Outlaws 👊🏼 @RealAdamRose https://t.co/M3BTnZEo5t Yeeeeesssss #MerryHappyWhatever https://t.co/gpibbPY1z2 It would be the BEST Christmas present EVER #MerryHappyWhatever https://t.co/rrqpOQuukG ❤️❤️ #MerryHappyWhatever https://t.co/jN45gTVqzm Love it!! #MerryHappyWhatever https://t.co/XBPTukzkfm THIS is not a drill. THIS is NYC right now!! #merryhappywhatever have you watched it yet? @netflix https://t.co/XoZGYDyWS2 Also THANK you to the fans who keep tweeting me about Kayla, her story is what really should be talked about but instead they talk about dumb stuff like this This clickbait is really gross to me. It was a GAME marry, shag or kill. Tbh all 3 of these guys are like my brothers, also anyone questioning why I didn’t pick Zac is very weird. Y’all know who my best friend is... I would be mortified if this said I wanted to “sleep” with zac https://t.co/tth7lkRdaR I celebrate Christmas year round at work now a days lol #CarolsSecondAct https://t.co/lmNpF2I93F I’m so glad!! #carolssecondact https://t.co/SY9NS8am8b So #Carolssecondact is on tonight. And it involves dogs. I’m THERE! Who’s watching with me? @CBS 9:30 🥰 It’s in the stars ✨ always love seeing @drag_ink ❤️ https://t.co/WxkK0puZmc This is amazing!! https://t.co/CSPdF0mIlQ Thank you 😭😭 https://t.co/gRMt8Pd81x Omg I can’t wait! I love this show!! https://t.co/d0J3YM7eE1 Thank you for watching!!! #MerryHappyWhatever https://t.co/ohjSV35YqI We were clearly having no fun 😂 SWIPE for family photos @buildseriesnyc #merryhappywhatever https://t.co/cYx3l7Ri4N Thank you for this! #merryhappywhatever https://t.co/VAWKobphyb I love you guys!! https://t.co/n72KG0tVAJ 😊😊#merryhappywhatever https://t.co/yP7yHCuj5Z Heck yea!! #merryhappywhatever https://t.co/oAsoJHJhUn Thank you!! #MerryHappyWhatever https://t.co/Rtv2KQPCRC Thanks!! #MerryHappyWhatever https://t.co/bTsxtePziH ❤️❤️ https://t.co/AbbTYxkQyQ Having a magical time in NYC ❄️ https://t.co/27OZRkmlkV When playing a character you can only hope to inspire someone. Thank you for this. Thank you to all the overwhelming support on me playing Kayla. ❤️ #merryhappywhatever https://t.co/d0AxqqLs96 Thank you for this message ❤️ https://t.co/IJ4esXFZBy Shit, you guys are gonna make me cry! Thank you for these words https://t.co/JNIeYO5lMM 😭😭 thank you!! https://t.co/HLjoEQxxEB Hey guys check out my mans score on this soundtrack! So proud of you baby @iamfrench https://t.co/oFo5yNr7sY I’m in a NY state of mind ✈️ https://t.co/5tz70iRBJE Thank you for this! #MerryHappyWhatever https://t.co/X9jAvg1Lj9 Yay Kayla!! #MerryHappyWhatever https://t.co/A7EelpcoAt Thank you #MerryHappyWhatever https://t.co/fJmAIhPVmX Yes!! #MerryHappyWhatever https://t.co/VQhkvE3tHp 🙌🏼🙌🏼 #MerryHappyWhatever https://t.co/wv9R9BEabZ Thank you!! #MerryHappyWhatever https://t.co/lsQh97T656 Yay!!! #MerryHappyWhatever https://t.co/1weKlMPDp6 YES!!! #MerryHappyWhatever https://t.co/xX94Xhoz6u Yes yes yes #MerryHappyWhatever https://t.co/Xz8VjqX1wF Downloading now! https://t.co/Pc2Z1ytPHs Which #MerryHappyWhatever character are you at your family’s Thanksgiving?! Which #MerryHappyWhatever character are you at your family’s Thanksgiving?! I think it is! #MerryHappyWhatever https://t.co/j12PeaZKjO WOW. Thank you @THR ❤️😭 https://t.co/aGMwIXOfZj I know right! #MerryHappyWhatever https://t.co/RZD28GkR5q 😍😍😍 #MerryHappyWhatever https://t.co/HexKOtlP1Q Thank you so much!! #MerryHappyWhatever https://t.co/rN5YNML0qT Thank you!!! #MerryHappyWhatever https://t.co/YkKTWleNdW Wouldn’t they be?? #MerryHappyWhatever https://t.co/s9WimF4b6T DO IT!!! #MerryHappyWhatever https://t.co/v5C8n83YN1 We like being cute 🥰 #MerryHappyWhatever https://t.co/jL56mf1xv1 ☺️☺️☺️ https://t.co/lsnMMjmMLM 😭🙌🏼😭 https://t.co/eDxQOIjk5r Things are getting complicated between Kayla and Alan.... have you seen #MerryHappyWhatever yet?!! If so what’s your favorite episode, comment below👇🏼 https://t.co/uYNFDYthAn I second this!! #merryhappywhatever https://t.co/1FjhTOPeUq RT @Cosmopolitan: Okay, Netflix: I Have So Many Questions About 'Merry Happy Whatever' https://t.co/98e4sW9EP3 Thank you!!! #MerryHappyWhatever https://t.co/qlpxPZmFdf Thanks for watching!! #MerryHappyWhatever https://t.co/nnqa57OkA7 Same same #MerryHappyWhatever https://t.co/KOmTdMc84q It’s WILD!! #MerryHappyWhatever https://t.co/UIEBVstUBV Me 2! Season 2!! @netflix @TuckerCawley1 https://t.co/KJCI3KZNUn I love you for watching it! #MerryHappyWhatever https://t.co/lB04bhODUM I’m back and ready!! #MerryHappyWhatever https://t.co/hFr4FjU782 I know 😭😭 https://t.co/6G8RjFZ2ig Kayla has a secret... find out what it is by watching #MerryHappyWhatever @netflix https://t.co/bsSxPihHWs Yes yes yes #MerryHappyWhatever https://t.co/0z2xyyaBvx Ask @TuckerCawley1 #MerryHappyWhatever https://t.co/E3zgpSFClz This is me. This morning. Seeing myself on @netflix https://t.co/5wkHIaWI57 My favorite role yet #MerryHappyWhatever https://t.co/ydZzW86uu0 I felt super chíc #MerryHappyWhatever https://t.co/FLBAcPqp8Y Yes to your family!! #MerryHappyWhatever https://t.co/dZqPuowgac I love Kayla #MerryHappyWhatever https://t.co/XgqihaRJTn I love it as well!!! So glad u feel the same #MerryHappyWhatever https://t.co/Rf52sKhMQ9 Omg this is so sweet 😭 #MerryHappyWhatever https://t.co/Swc9jRw25C This makes me really happy!! #MerryHappyWhatever https://t.co/qaqHBlW80D Already in episode 3??! Amazing #MerryHappyWhatever https://t.co/B0O9NPl6Bw Yay!!! Glad you’re loving it! #MerryHappyWhatever https://t.co/goTC6wlBzY 🙌🏼🙌🏼 #merryhappywhatever https://t.co/Ex96ObPgCA HAPPY THANKSGIVING from the Quinn family to yours!! Now go binge #MerryHappyWhatever https://t.co/0Badd0rI1U Thank you!!! #MerryHappyWhatever https://t.co/NP8fhSXxpg SPOILER ALERT 🚨 #MerryHappyWhatever https://t.co/2Js3Up32R4 Thank you! Means so much to me ❤️❤️ #MerryHappyWhatever https://t.co/wC6TufY6ac Yay!!!! #MerryHappyWhatever https://t.co/0D7CluSL52 So glad you feel the same way!! #MerryHappyWhatever https://t.co/8H0E7X5zBS Kayla is awesome!!! #MerryHappyWhatever https://t.co/PVcfDjEtmL Thank you!!! #MerryHappyWhatever https://t.co/P6GpGL4PaD I’m so glad you’re watching!! #MerryHappyWhatever https://t.co/xiyLPAtGAX When you realize #Merryhappywhatever is almost HERE!!!!! @netflix HOURS AWAY ⏰ https://t.co/450gVRbDka I loved stepping into her shoes and helping navigate her journey with love and the highest respect. Thank you @tuckercawley for giving me the gift of playing Kayla. #merryhappywhatever https://t.co/wHGhNdYkit TOMORROW!! You get to eat a feast with YOUR family and also meet the Quinn Family! I’m so proud of this show, it’s funny, heartwarming, emotional and relatable. Kayla has many layers and throughout the episodes you’ll understand her a bit more. https://t.co/yBUQwb7J4P Must stop eating the entire bag of starburst on this flight Because someone always ends up at urgent care during the holidays! #Merryhappywhatever THIS THURSDAY on @netflix 😍😍 https://t.co/oXcMn7tDtb Does anyone still do caroling with their family?...Because the Quinn’s do! Comment below on your favorite Christmas Carols 👇🏼 #merryhappywhatever November 28th @netflix https://t.co/Ok0T6JuZSR Stop getting so artsy on me https://t.co/51XyhK9DfZ This Quinn sisters are ready for you, but are you ready for them? #merryhappywhatever Nov. 28th on @netflix https://t.co/z7hsMWvPNN Watch me SLEIGH this @NailedIt baking challenge with @BrentMorin on Netflix’s YT channel! Merry Christmas and you’re welcome. @netflixfamily https://t.co/TFUX7KoSUM I feel the same way 😊 https://t.co/LftFMxbWhf Peace out LA... off to Montreal! https://t.co/M845wvLBhE I am doing a Black Friday sale early! Use code “BOGO” at https://t.co/soxKVrDNLc to get every second product added to cart for FREE! Buy more, get more! + FREE Shipping on all U.S. orders over $35! 💖 8 MORE SLEEPS until you get to binge watch #MerryHappyWhatever on @netflix!!! AAHHHHHH https://t.co/0ZoKv04Vbe The holidays are just around the corner and I've got something huge to share with you guys! 💖 Join me on my FB &amp; IG Live TONIGHT I'll be giving away my @IlluminatebyAT faves and announcing a big special! You don't want to miss this. 💁🏼 https://t.co/3N1fbMAObG Tiz the season for Tree Lighting 🎄 @TheGroveLA https://t.co/fzokLYcKdw FRIENDSGIVING 🍁 https://t.co/uJzKNn49MO Every time... @SabrinaJalees see each other after it’s been a day. Follow us on @tiktok under FriendCrush 💥 https://t.co/ZJoLPDwPGy Who’s ready for CHRISTMAS?? We are!!! 13 more sleeps until you can see #merryhappywhatever on @Netflix 🎁🎄🎅🏽🤶🏼 @bridgitmendler https://t.co/p2O4h7p240 That’s a good one! #carolssecondact https://t.co/nWDEC1Jkdq He’s my red lobster is by far my favorite line #carolssecondact Thank you!! #CarolsSecondAct https://t.co/oQVXA9D542 5 minutes WEST COAST!!! Watch with #carolssecondact on @CBS Jenny is the best! #CarolsSecondAct https://t.co/4qo4LXPILe Thanks girl!!! #CarolsSecondAct https://t.co/vUDMGvdGk1 Face off!!! #CarolsSecondAct https://t.co/nTD7Nix152 Hahaha #carolssecondact https://t.co/U9QKYjqcOX Awww I think so 2! #carolssecondact https://t.co/232bETfhUc So glad you love it!! #CarolsSecondAct https://t.co/HwDeq48Js7 😊😊 #carolssecondact https://t.co/zeNyZIXDGl Hey! I love them 2!! #CarolsSecondAct https://t.co/vO4DFptlcH What can I say? I'm a great saleswoman. Watch me and @Kyle_MacLachlan face off TONIGHT at 9:30pm on #CarolsSecondAct @cbstv https://t.co/M1nOLymQ7e Feelin this look! Can you tell 😂 https://t.co/6LMlQ2e4GC Dear Max G,\nThat photo can definitely be used in place of a W-9 in my eyes. https://t.co/iEAOdr4oRG Curly sue https://t.co/hHGhoeLyJ9 Celebrating my birthday girl @sammydroke https://t.co/WuVT2hDCpV You’re favorite fam. Mom + Dad have joined @tiktok. Go follow us to share in our ultimate @Friendcrush (on TikTok) https://t.co/gGqW05UkQF Thanks girl!! #CarolsSecondAct https://t.co/jT6I92iDXy The feels!!! #CarolsSecondAct https://t.co/Ub2Y2TAAxd Ha! #carolssecondact https://t.co/NZn2bE2nk6 West coast #carolssecondact is ON!! Turn on @CBS GO GO GO ONE HOUR AWAY East Coast!!! #CarolsSecondAct @CBS “The number one priority in life is to take care of yourself and make sure you're happy.” - @SabrinaAnnLynn TONIGHT are they friends? Are they more than friends? Check out @carolssecondact at 9:30 on @cbstv and yes we have our own official Instagram for the show so FOLLOW DUH! https://t.co/1VjaK5wSZr The casting was on point 👌🏼 https://t.co/VfOlH2CkTJ That white eyeliner though... who’s into it? Comment below 👇🏼 https://t.co/ynxf0l8g4Q Felt cute, won’t delete later. 🖤 https://t.co/5DGFFXMLdr So excited for the holidays because 1. duh and 2. Merry Happy Whatever premiers! Cannot wait for everyone to watch this show! Don't forget to tune in on November 28th. #MerryHappyWhatever https://t.co/TIdmNcaLwv Yesterdays press look for #merryhappywhatever @netflix \nHair: Scott King\nMakeup: @amystrozzi \nStyling: Elkin https://t.co/haO8PcO0Q0 Working this Saturday morning but at least I got @selenagomez and @scottkinghair to keep my company 😊 (@amystrozzi not pictured) https://t.co/KD5Ks5G8kl I would say Ziggy had an amazing first Halloween. @Kristin_Ess thanks for an amazing night, Ziggy wouldn’t have wanted to spend it anywhere else! https://t.co/58Dg08Givk BEETLEJUICE BEETLEJUICE BEETLEJUICE https://t.co/01iOrDOTiz Both of my grandfathers have been effected by Alzheimer's - it's a topic that doesn't come easy to me. I encourage you all to join my team and donate at https://t.co/QEhuYtg7zT because memories are worth fighting for. @socalzofficial https://t.co/T5hWkVRZQ2 Happy Halloween 🎃 Missing my Halloween Queen @VanessaHudgens https://t.co/0kW0rG2N9j @saraursum YES GIRL! Proud of you ♥️♥️♥️ @reneemhoff Lake Louise in Canada! Today calls for Symptoms on repeat. Who’s with me?! Listen here!\nhttps://t.co/0WLJb2T2X7 Why she gotta be so cute? #ziggy https://t.co/DArOtmsYf9 We don’t always know where we are going, but that’s what makes it beautiful https://t.co/t19JBwnOi2 Scary movie night! What should I watch? GO! Thank you guys for hanging and tuning in with me!! It’s almost over but I love you all and I love this show! #CarolsSecondAct I love this scene!! #CarolsSecondAct We got picked up for a full season!! #CarolsSecondAct https://t.co/ns9qVhyAGr I am!! #CarolsSecondAct https://t.co/eeEIkvf2yU HA! #CarolsSecondAct https://t.co/lLKyLfs1el 😊😊 #CarolsSecondAct https://t.co/ZxTLQpUzgf You’re so sweet #CarolsSecondAct https://t.co/4nOZJGj2px Thanks!! I think so 2! #CarolsSecondAct https://t.co/DGmZZrJNPD That look lol #CarolsSecondAct https://t.co/EZThH1L9PL @ItoAghayere you are so funny!! #CarolsSecondAct https://t.co/ZZTTOFqT3Z It’s pretty amazing that the show tonight I take the interns to the bar and all of us right now are at a bar lol #CarolsSecondAct https://t.co/JpisRV0SBm I’m glad to be BACK!! I missed this cast #CarolsSecondAct https://t.co/K4zkdomdv8 WEST COAST #CarolsSecondAct IS ON!!! Turn on @CBS Hanging with the cast #CarolsSecondAct https://t.co/vClDkjcU45 It’s the best!! #CarolsSecondAct https://t.co/Yl0fLys9uV @JKimmelG Fun fact! He has one in real life lol #CarolsSecondAct https://t.co/2W2EHl4H8w RT @JKimmelG: Caleb’s flip phone.  Adorable... 😍😍❤️❤️❤️ #carolssecondact We all were so excited to be out of the hospital and in this bar!! #CarolsSecondAct https://t.co/8M53IbkqTC My favorite part!!! #CarolsSecondAct https://t.co/2jHqNwQsHW Yes please!!! #CarolsSecondAct https://t.co/7SeH9NJ4Yi I love you!! #CarolsSecondAct https://t.co/8kQL1rfIlo Me 2!!!! #CarolsSecondAct https://t.co/DrH4M5YHxR EAST COAST we are on!!! #CarolsSecondAct Who's watching tonight's episode?! I'll be taking the gang out of the hospital and to the bar at 9:30PM PST 🍻 #CarolsSecondAct https://t.co/d8q30rqrGn Yay us!!!!!! https://t.co/as25MRQ1Mw Safe to say things are heating up between Jenny and Daniel. Make sure to tune in tomorrow night at 9:30PM PST on @cbstv! #CarolsSecondAct https://t.co/xOjBlb4Oi1 They found out about us lol https://t.co/0OOrrUsqgK “Take it day by day, and don’t stress too much about tomorrow.” Cuz I'm feeling so good! https://t.co/hLBCd25LJq Going into haunted house this weekend like... https://t.co/gR6fK8vKBW Yes I will!! https://t.co/LkvhB7FMnB Happy #CarolsSecondAct DAY!!! Tonight at 9:30 on @CBS 2019 words to live by 😜 https://t.co/08URSnwLg8 Yaaaassss!!! https://t.co/GpGli7EOJ4 “Once you understand that you attract what you think about, you only think about the things you want.” NOVEMBER 28th!!!!! #MerryHappyWhatever coming to @netflix  https://t.co/3ovG5B0CrA Real cute TV mother / daughter photo, right? ♥️ #CarolsSecondAct https://t.co/UKlyMAXPnL Soul work is slow work… 💭 https://t.co/m2fyeFqWQm It’s a supernatural delight 🖤🌙\nSong: Dancing In The Moonlight by @toploaderuk https://t.co/Ez2yN6CYIu You see my essence, you see my glow. #LookingGlass https://t.co/leJ8pbN4a3 Only @DanPovenmire could dream this up!!! \n\nhttps://t.co/nJ07gdEbkS Taking a seat for tonight’s episode, who’s watching with me?! 🎥 #CarolsSecondAct https://t.co/hSZXjTlyMK Focus on the things that bring you closer to your dreams 🤩 https://t.co/7qu0EOKnlt “Tomorrow belongs to those who hear it coming” - David Bowie Sk8er girl. https://t.co/uvctgqHm9b @jonjayharris I’m not in every episode ☹️ Reminiscing on Summer days spent on the beach.\nMusic: Santeria by @sublime https://t.co/llp8cxcoQv Learned from the best. #ItsBritneyBitch https://t.co/Ti7iTrC7Sy &amp; new fear only leads to growth. https://t.co/ziSSL95a4D Hahahaha @SabrinaJalees I’m psychotic https://t.co/CD5JTojr6h Who needs a straightener anyways?! Embracing the curls thanks to you guys 🙏🏼 https://t.co/dkSdqPn7FK I love my tv family #CarolsSecondAct All the work @ItoAghayere just gave @PatriciaHeaton #CAROLSSECONDACT Thank you!! #CarolsSecondAct https://t.co/hLys8itYII Jean Luc and taking blood lol #CarolsSecondAct It’s pretty crazy but how much do I and @PatriciaHeaton look alike? Mother &amp; daughter  #CarolsSecondAct Look how serious I am with the pharmaceutical verbiage #CarolsSecondAct Carols has found a clue!!! #CarolsSecondAct YES!! #CarolsSecondAct https://t.co/hLys8itYII I love watching @PatriciaHeaton she is a TV legend!!  #CarolsSecondAct He’s the best! @cedricyarbrough #CarolsSecondAct https://t.co/ouQFFlje73 HA! #CarolsSecondAct https://t.co/kx7lMC1fmg That’s a good question 🤔 #CarolsSecondAct https://t.co/ZkwzF9RO8o How do you like my office? #CarolsSecondAct I was so jealous @PatriciaHeaton got to eat my potato chips #CarolsSecondAct Did u guys think she died? Because I did lol #CarolsSecondAct We’re all done with the live show watching the new episode in @SabrinaJalees room @ItoAghayere @cedricyarbrough #carlossecondact How funny is @SabrinaJalees #CAROLSSECONDACT 10 minutes west coast!!!! #CAROLSSECONDACT @CBS RT @CBSTVStudios: Here’s a behind-the-scenes look at tonight’s all new #CarolsSecondAct! #CBS https://t.co/GQynFtAS5i Thanks for watching you guys!!! See you next week! #CarolsSecondAct Hell yes!! #CAROLSSECONDACT https://t.co/PKtIhhuXQA Well that’s good! #CarolsSecondAct https://t.co/E321M1Q2KR No I ship us 2!! #CAROLSSECONDACT https://t.co/H069TzuyAa It’s a good one!! #CAROLSSECONDACT https://t.co/wQRYjm3gUt 😜 #CarolsSecondAct https://t.co/nEYFUpqYZ0 I’m so glad!! #CarolsSecondAct https://t.co/pIvoaL1nNR Yay!!! #CAROLSSECONDACT https://t.co/P1EEfbaG9E Thank you!! #CarolsSecondAct https://t.co/2jQ5IAu7Wn What’s been your favorite scene so far? #CarolsSecondAct 🙌🏼🙌🏼 #CAROLSSECONDACT https://t.co/rYEGLBzAZE Ha! #CarolsSecondAct https://t.co/Z2gQa4Cl38 No laugh!! Laugh a lot! #CarolsSecondAct https://t.co/TWR9cLKTCG Me neither! #CarolsSecondAct https://t.co/eECYB9b9e2 It’s a good one!!#CarolsSecondAct https://t.co/i3FJ1RRVFr I know!! We need one @CBS #CarolsSecondAct https://t.co/Ok8r14n7qY Haha Carol would!! #CarolsSecondAct https://t.co/kfdLBI3l0B 🙌🏼🙌🏼🙌🏼 #CarolsSecondAct https://t.co/beHSJEAc4r Also learning the verbiage is so crazy, but it’s so much fun being a pharmaceutical rep! #CarolsSecondAct I love my outfit in this one!! #CarolsSecondAct That i get to work with @PatriciaHeaton #CarolsSecondAct https://t.co/AS8ntj5wH1 Yay!!!!! #CarolsSecondAct https://t.co/ttwNzuoije I’m glad to be BACK #CarolsSecondAct https://t.co/P5ILMQ4pL3 Thanks ❤️❤️ #CarolsSecondAct https://t.co/9AQcenEklw We’re on!!! #CarolsSecondAct who’s watching??!! 1 HOUR AWAY FROM #CarolsSecondAct ON @CBS 😊😊😊😊😊 Yes I will!! While I’m taping the show tonight 😜 https://t.co/FAZOaMnucH Thanks for coming to say Hi!!! https://t.co/crxyfbLVyt 🚨NEW EPISODE ALERT🚨 Stoked for you all to watch my TV mom &amp; I tonight on @cbstv at 9:30PM PST. @PatriciaHeaton #CarolsSecondAct https://t.co/MQtubvC0rW *Me promising you all a good laugh while watching episode 2* 😂 See you tonight on @cbstv at 9:30PM PST! #CarolsSecondAct https://t.co/iEUcFEBwiJ The #1 new series #CarolsSecondAct has an all new episode tomorrow and I just can’t wait! Comment below if you’re tuning in!👇🏼 @cbstv https://t.co/DnOKMWqhwl @cessvillones so many have suggested that, I'll have to watch! @PiidaDiida I've heard that's funny!! Looking for new shows on Netflix… any suggestions? 🙌🏼🙌🏼🙌🏼 My TV mom is killing it!! @PatriciaHeaton https://t.co/br2ghSMGVI Woke up missing the 90s, aka bucket hats &amp; Britney. https://t.co/XgxK5r8F4x Teaching my girl how to do yoga and remain zen 😂 https://t.co/5ykb2P0BGI 😊😊 https://t.co/FAMYtvTXO3 It’s the finishing touches that matter 💄 #BTS #CarolsSecondAct https://t.co/vW2qoiSFBQ Forever cherishing days spent by the pool with my mini me 🖤 https://t.co/s4AFQX7KAb I’ve become one of those people who match their toenail color to their nails. Mood today after finally being able to share what we’ve been working on! 💙🙌🏼 #CarolsSecondAct https://t.co/t4Rrgp6E8M This part is so sad but has so much heart #CarolsSecondAct Hahahaha #CarolsSecondAct https://t.co/Y1TQa73Smd What’s been your fave part of #CarolsSecondAct so far?? I do 🙋🏼‍♀️ #carolssecondact https://t.co/XkTOJTnMSb Have any of you ever had a crush on your nurse? #CarolsSecondAct Omg @SabrinaJalees you’re so funny and you’re sitting right next to me! #carolssecondact 🙌🏼🙌🏼🙌🏼 #CarolsSecondAct https://t.co/hd8vvehQE6 How cute are the interns! #carolssecondact ITS ON!!!!! #CarolsSecondAct 5 MINUTES WEST COAST!!! #CarolsSecondAct @cbs 😊😊 #carolssecondact https://t.co/lTPcJzfz74 She’s amazing and so sweet! A total pro obviously #carolssecondact https://t.co/BfB4IEdpSG Hahaha #CAROLSSECONDACT https://t.co/NDlnciQqJw That makes me happy #CAROLSSECONDACT https://t.co/8RNZEIjSMr Isn’t it crazy how I did an episode of that show with him and now we’re on a series together. Life is crazy #CAROLSSECONDACT https://t.co/VfjHkAkoq4 Funniest man alive #carolssecondact https://t.co/qqyEI7IQ9Q Omg that’s so cool! Thanks for the support #CAROLSSECONDACT https://t.co/LhcWXajIgM Awww yay!! #CAROLSSECONDACT https://t.co/sV320FZQl1 😆😆 and funny!!! #carolssecondact https://t.co/HIjyWx1Y7e Thanks for the shout out #carolssecondact https://t.co/nAphBFpHEw Thanks!!! #CAROLSSECONDACT https://t.co/1PCifS7NeY She’s a BOSS now! #carolssecondact https://t.co/7vrRhSxjIY 💋💋 #CAROLSSECONDACT https://t.co/t0g3NxHaSi Thank you so much!!! I hope you live Jenny! #CAROLSSECONDACT https://t.co/mA6LVmLuT1 😊😊😊 thank you #carolssecondact https://t.co/Y2saMKZKpV Yaaaaaasss https://t.co/fU1OZWaEPj Thank you!!! #carolssecondact https://t.co/iMS2M0PwkR I’m so glad!!! #carolssecondact https://t.co/lQ4l0uCrOY How cute is @PatriciaHeaton she’s so tiny like me!! #CAROLSSECONDACT It’s ON @CBS #CAROLSSECONDACT GO GO GO GO Yay!!!!! https://t.co/9w87Rz0FwH RT @CBS: Get excited—#CarolsSecondAct starts NOW! https://t.co/GCMMO2V06Q 10 MINUTES YOU GUYS!!!! Out on @CBS #CAROLSSECONDACT ONE HOUR TO GO EAST COAST!!!! #carolssecondact @CBS who’s tuning in??! ❤️❤️ https://t.co/IDlD71uTWM TONIGHT TONIGHT TONIGHT!!!! https://t.co/weoUrjK0qK It’s funny when my mom said after watching the show “I had no idea you went to six flags with @TaranKillam, I LOVE HIM!” https://t.co/YJbmZXV6d7 TONIGHT! #CarolsSecondAct ✔️\nWords cannot explain how amazing it’s been playing this role! I’m so excited for you all to watch! Comment below if you’re tuning in tonight on CBS 👇🏼 I’ll be live tweeting back to you guys at 9:30PM PST! https://t.co/EBtViypf3U Accurate representation of today’s excitement level 💯 Still pinching myself over the fact that I get to play @PatriciaHeaton's daughter. Who’s watching tonight on CBS?! #JennyKenney #CarolsSecondAct https://t.co/f4pjdNMwB1 Hell yes I am!!! https://t.co/Yh3bAvKlTr 1-DAY until #CarolsSecondAct ✔️\nGetting into character has always been one of my favorite processes while filming. I’m so excited for you all to see what we’ve been working so hard on tomorrow night! https://t.co/u4uudelQPw Hair ✔️\nLashes ✔️\nJenny ✔️\n#CarolsSecondAct this Thursday on CBS. https://t.co/X3zOvwB1Fo 2-DAY COUNTDOWN to #CarolsSecondAct ✔️\nHolding back tears of joy because we air this Thursday! https://t.co/1svLQL2GcS Who’s tuning in this Thursday on CBS for the premier of #CarolsSecondAct?! I’m so stoked for all of you to meet Jenny Kenney! https://t.co/g2LeLn6fdE Ziggy’s Monday mood 😴\nIf you ever wonder why I’m late… https://t.co/q9f341n6vy September is Childhood Cancer Awareness Month. St. Jude is one of my fav charities bc it’s where families never receive a bill for treatment, travel, housing or food. Please donate anything you can!!! https://t.co/3MuSG6ltRG ❤️❤️ https://t.co/KC82DsWDN5 Yes yes yes yes https://t.co/Isq5OuFr0L Sunday morning note… 💭 https://t.co/k86LFJOBX1 @Sarah_Hyland HA! There's beauty in imperfection. #Sharpay https://t.co/XYDGOOuzvO *click* 15 minutes of fun before we’re live! 🎞 #CarolsSecondAct https://t.co/JYs3v7ewD4 Everyone will tell you otherwise, but your moment is only yours to own. https://t.co/FZ3gkz4vMV It’s not 11 yet!! https://t.co/d2IT23I8Bn @sabrinajalees and I when we have a big day ahead of us and the coffee isn't hitting yet. #CarolsSecondAct https://t.co/747ePWpOBd My girl 😍 This face gets me every time! https://t.co/c8NxR9SfNo Secrets of The Signs ♋️ I’m a firm believer in astrology, is anyone else? https://t.co/SghbmcrP7f In need of yummy Fall recipes, any suggestions? This is amazing https://t.co/oP56zo3Lq8 Sharpay was chasing her dream, Troy and Gabriella were chasing each other 😏 https://t.co/9tTVhSZq66 I always channel Sharpay when I walk into a room https://t.co/nBqqM3DPvl Ha! https://t.co/ymVOplNhGe Finally, y’all are seeing the light https://t.co/46lZeF7xS6 Gracing my face with the best 💋 @IlluminatebyAT #ILLUMINATECOSMETICS https://t.co/80MwnZK1Vc Me when I see a camera: https://t.co/UwzqCqOXhW My favorite thing in life is showing my husband old pictures of me and my style and watching his reaction 😂 I love a good reminder. https://t.co/TWLjTR3nR3 100% walking into the weekend like this 😂 https://t.co/c6lI8KI1sU Step into the daylight. https://t.co/7PbVAOYuCC Can we rewind to the trip of a lifetime with the best travel buddy? ❣️ \u008f#TB https://t.co/0KEZD83E3V @huntyboy1966 HA!! Manifesting what my next chapter will look like... 💌 https://t.co/ywDEerXZSP Apparently there’s was an #earthquake. Ziggy didn’t feel a thing https://t.co/TYcjGBOann “I don't know where I'm going from here, but I promise it won't be boring.” - David Bowie Don't tell Ziggy I posted this. #Sharpay #HSM https://t.co/aYAleW2W72 Mood knowing today is the start of a fresh week. https://t.co/jamQS7AdUC @PatriciaHeaton @CBSTVStudios @cbstv Why you so cool though? Change your thoughts and you change your world. https://t.co/zQEhCgYENQ Counting down the 20 days until the premier of #CarolsSecondAct! Can't wait for you all to meet Jenny 🤗 https://t.co/fkUsuhKMG7 My soul feeds on slow mornings in the kitchen. https://t.co/RBc1bmBsw0 “Confidence is everything in this business.” - Reese Witherspoon Words to live by. https://t.co/WystOtDa5g 🙌🏼🙌🏼🙌🏼 https://t.co/81JHd9Oojl Yes, I was inspired by @victoriabeckham … https://t.co/DYS4Hk9UKP Be a little more you, and a lot less them. https://t.co/VLFpBGVLC5 Gimme all your love. https://t.co/QIAPwsmfQi When in Canada, wear a Canadian tuxedo. @revolve #revolvearoundtheworld https://t.co/RWfhNf56Tl @pico_rose @REVOLVE It’s free people on revolve! A casual morning on Lake Louise. @revolve #revolvearoundtheworld https://t.co/xvwUIR6Jnc @RealAdamRose @BrentMorin Do you even remember us??!! @RealAdamRose @oculus Get the stranger things game!! In complete awe of this beautiful place! 😍 @revolve #revolvearoundtheworld https://t.co/YVZOEHMeRI Sharpay really knew how to de-jitter before a performance. Should I start doing this again? #HSM https://t.co/DDXv2uwxla Hiking in LV boots is harder than it looks @revolve #revolvearoundtheworld https://t.co/UYZbpsNP4j What’s everyone’s favorite song from Symptoms? I wanna know! Check out on Spotify :)  https://t.co/nuAbV5VATF It's only been a day but I'm missing this cute lil face already #ziggy https://t.co/h8pJqZi0VK @IlluminatebyAT ✨ essential for that Summer glow. #ILLUMINATECOSMETICS https://t.co/q8dGJYJtRp Dear younger self. https://t.co/65nRBM9AOw I think I might have to get @disneyplus !!!! https://t.co/NFj22CsUoi On film. https://t.co/18SAps33Pq Love stumbling upon little reminders like this. https://t.co/PKXi8vhjC1 A day spent songwriting &gt; https://t.co/Neys47NJ6t Comment if you tried to recreate these hairstyles in 2006. https://t.co/cuz1YRMJxM To all the ladies in the place with style and grace. https://t.co/kZlrE8wxth Taking @ziggystardustfrench to set today, wish me luck! https://t.co/HaaxAQTsJp Hot girl summer made easy by @illuminatecosmetics. I use them every. damn. day. #ILLUMINATECOSMETICS https://t.co/pH5WDLjwGd The amount of times I’ve had to change my Bitmoji hair color....🙄 So I wanted get more steps in, I decided to walk from the set to my nail place today. It’s amazing how often I drive and not just walk. It felt good 😊 Has so much fun hosting and celebrating my best friend Samantha's baby shower this past weekend. Thanks @jenkellytisdale for the help! I can’t wait to meet this baby 👶🏼 https://t.co/QZbpR1IL58 It’s written in the stars. https://t.co/Sota9zkkrp Saging every damn space I walk into 👑 https://t.co/TcLibOfzVp First live audience taping last night for #CarolsSecondAct. It felt so great to be in front of a audience again especially with this amazing cast. https://t.co/NdnS4bEnmp I’m trying to figure out what’s going on with @NETAPORTER I can’t get a hold of anyone at customer service  and my order from two weeks ago hasn’t come, does anyone know what’s going on? Thinking about what to Postmate for lunch... 🤔 https://t.co/pd34idgyDk COMING September 27th!!! @PatriciaHeaton @CBSTVStudios https://t.co/hQBvWTdH79 Trying to keep my chill after @ziggystardustfrench eats my new slippers. https://t.co/zOI55F4cLc “I been dreamin' wide awake every night and day about you, baby” https://t.co/hsU93D4UyH Be aware of the energy you bring into this space. https://t.co/V6GQPhKeec 😊😊 https://t.co/ZrNXuNG29m @lgbtqvillanelle Reformation! Every woman needs a linen power suit. https://t.co/WHZTLvYqO7 LA summers feed my soul. https://t.co/bD44GQHXih NOOOOOOO https://t.co/p2thya7KE6 Thank you for this! https://t.co/EMlnHGS1qm The state of the world is making me feel down today. Trust me 2!! 🙌🏼🙌🏼 https://t.co/k2ApNGM1Wt ❤️❤️❤️ https://t.co/lq1vDlttEl When you’re shopping and you hear a familiar song..... #insomnia #symptoms https://t.co/alTPWxoYRa OMG it’s Me! 😂 https://t.co/qcJZdWA9vZ You’re the first person I’ve worked with where I didn’t have to prove I could do it over and over in the audition process. You believed in me from the start and I’m so grateful for that and you’re writing ❤️thanks for being a great leader Tucker!! https://t.co/wNMerCMWVu Playing Kayla has been the most rewarding role yet for https://t.co/pirKoJGLNr’s been funny, dramatic and a emotional roller coaster. Tbh I was a little nervous if I could do it,so proud of myself and the work I’ve done.Can’t wait for u to meet Kayla!#MerryHappyWhatever @netflix https://t.co/F2s61NoRVk Let’s do this 💪🏼 Happy Saturday lovers 💕 be good! https://t.co/B21j0ub0Ok @blessedswift I’m talking about how scared I was about the cats... it’s also a dark show. Never said it was cringe worthy. Glad to know what you think of it though! @blessedswift What does that have to do with cats lol @ollivia_anne I actually have ALWAYS been scared of CATS 😳 we have never gotten along and I’m a real animal person! @SamanthaPopstar Yea I never wanted to go see it growing up. I was definitely more a #phantomoftheopera or #LesMiserables fan! @bloomforhugh It’s not shade.. I love the cast but it’s definitely scared me.. it was eerie 😳 The #CatsTrailer solidified why I love dogs and dog movies... https://t.co/ZXoOk2SMas You deserve this!!! I’m so happy for you!! https://t.co/D4WnqVd8iF NOPE! My best friend is!!!!!!!! https://t.co/mJOSMwOxRP Rested and relaxed after a lil weekend vaca! Hope everyone is having a great Sunday ☀️ If you find my crying in my dressing room don’t be alarmed The Notebook is on 😭 Barely slept last night, barely making it through the day. Is this because Mercury is in retrograde? When shit gets scary you need a laugh lol #earthquakeinla https://t.co/k6EnipwOU9 Felt that #earthquake Happy 4th of July!!! HA! ❤️ https://t.co/5jRoLK6pNW Just keep dancing through life 💃🏼 34 Here I Come 🎉🎉 https://t.co/nC1xZe8Gtd I just got a crown redone on a Sunday. Cuz I’m the QUEEN. Get it... What time is it? https://t.co/hbUo9B8xbU Because I knew you I have been changed for good #Maui I love my #merryhappywhatever family. They have been so supportive during this time. @ThePerezHilton Thank you. The support from friends and fans is overwhelming. Thank you for caring so much about me, Chris and my lil Maui. I love you guys. It’s too painful to write again. Head over to my Instagram to read the beautiful post of my baby girl Maui I need time. Thursday, September 26th At 930pm @CBS HERE WE COME!!! #CarolsSecondAct https://t.co/Ub3InwnkJl Alexa play “insomnia” cuz that’s what I dealt with last night! I feel justified 😂 https://t.co/LnccMLPi7R @BrentMorin @chrisdelia https://t.co/rpfNdmeREi Hahaha SO me! https://t.co/rmxlgbcsps https://t.co/ipezeL09L4 You guys.... Maui got a new shirt. I can’t tell how she feels about it 😂 https://t.co/jX85QPc3Io @ThatKevinSmith HA! Apology accepted 😊 Thanks @ThatKevinSmith for scratching my mirror on my car and not stopping. Classy move neighbor! 🙌🏼🙌🏼🙌🏼 https://t.co/Mtk11qj2Hq 😊😊😊 https://t.co/HTAAffReVF Get ready I’m coming to @CBS this fall!! #CarolsSecondAct 🙌🏼🙌🏼 https://t.co/eKtWmQkd56 I am BEYOND excited about this!! Being a fan of yours for years and now getting the opportunity to be your daughter in this show is SO exciting!! Thank you for this ❤️ https://t.co/tCNOREZxQc You guys... can’t wait to share the exciting news. Until then..... 🤐 😊😊 https://t.co/dMyYDY7q0Q After watching the finale of #ChernobylHBO you have some WEIRD dreams... I can’t stop watching @WhenTheySeeUs 😳😳😳 it’s so good but so incredibly sad. Every actor in this show is killing it. I’m def FEELING this as well... 😂😊 https://t.co/EnVjT0vPIO Happy Friday!!! https://t.co/N5ZeG8NdAn 🔥🔥🔥 https://t.co/s47XyhdBTE RT @TIME: Netflix becomes the first major Hollywood studio to pledge to fight Georgia’s abortion bill https://t.co/eGJvZpbAk3 Happy Shopping Day!!! https://t.co/MsayyohL9B Awww yay!! @IlluminatebyAT https://t.co/8pQexsskZ5 Head over to https://t.co/NFwZSn9eis for FREE SHIPPING!! *applies to US customers only https://t.co/XtBV0fYJty Why thank you! https://t.co/x3wUbvKNmC Hahahaha https://t.co/bDLxS926jB They’re here!!!!! https://t.co/XKqAx7BI7f https://t.co/HaxKC5nbPn You guys it was just so sunny and beautiful and now it’s pouring! Make up your mind LA! May Must have!!! The @IlluminatebyAT Pretty In Pink Brush Set is on the list and it’s my favorite number!! https://t.co/NgxdaRS3Ga Yaaaassss https://t.co/AaUWfoVqbM 4 DAYS away!!!! However you can preorder these beauties today! https://t.co/jsfeFAaLpm https://t.co/8R35nmB4FM Whatever you do, don’t forget to laugh! Laughing is the best form of therapy 😁😂 https://t.co/HeqaEqeMrh How beautiful are these?? @IlluminatebyAT Pretty In Pink brush set COMING MAY 23rd!! https://t.co/dq1xylg5gm 😁😁 https://t.co/k7RSoDdZW4 Yes yes yes https://t.co/e0pJR7QY58 You guys.... thank you!! https://t.co/G6kGkhvI44 ❤️❤️ https://t.co/05o3qMb5Nq Thanks!! https://t.co/gzzJw5u7Uj 😊😊 https://t.co/BG8i7t0bs7 First day of rehearsals on #merryhappywhatever @netflix makes me SO happy!!! Something new is coming..... @IlluminatebyAT https://t.co/269MtFirb1 @KyleGallner @MrJakeAbel @sammydroke @shelleybuckner Hahahahahaha And it was @MrJakeAbel who introduced me to my best friends  @sammydroke and @shelleybuckner. 🤯🤯🤯 https://t.co/eXYt13DOjT HAPPY MONDAY!!! I’ve had too much coffee this morning 😝 Moms are the best! YES!!! https://t.co/hZoCFPyaaG Thank you!! https://t.co/MXPUW3rfpB Love this!! https://t.co/pVQIyMJXzO Thanks babe! https://t.co/cQmZJoIzxx #TBT baby Ashley excited for school picture day 😊 ps. That was my favorite too lol https://t.co/A1WFpjlPVo IM BACK! https://t.co/GICgkWu4OD 💗💗 https://t.co/SwctRV82Ux Thank you!! https://t.co/gHcMEdaeVB I’m feeling so good!! https://t.co/KJ6xxtM5CT 🙌🏼🙌🏼 https://t.co/ePWpc1wwOD YES 🙌🏼🙌🏼 https://t.co/NFwZSn9eis https://t.co/WAZv9LwipD Love this! Thank you @billboard https://t.co/OGxfYotwyV My happy dance 😊🙌🏼🙏🏼 https://t.co/k8VyMOkT7I Love this interview ❤️❤️ https://t.co/dW8a5BOrIL Thank you!! https://t.co/6dcmtXxhka Noted!! https://t.co/PuUFK5mYhG Woke up feelin really down down down, In My Head I felt a pound pound pound. Gotta turn this thing around round round..... 🎶 #underpressure #SYMPTOMS Is my #metgala look giving you #SYMPTOMS 😂 https://t.co/BhJmnNArtT Thanks!! https://t.co/ema4NGuC29 Thank you!!! https://t.co/63ZMZsBM1h She’s looking FABULOUS https://t.co/bU7s7M16HM Thanks 😊 https://t.co/rmUDFrEaXj My question is where are you? https://t.co/Y68ZnpMMso Thank ya! https://t.co/zAKgu637ZK Yes yes yes https://t.co/rAbLc8K6OR Thanks girl! https://t.co/EI34wveitH Hitting all the ages 😂 https://t.co/4OtDeGJ6hp If I was there I’d be... #SYMPTOMS https://t.co/Vcwm0LaYhK Thanks girl!! https://t.co/Mvk96nKDqk Watching @LadyGangTV and I’m on it!!! DO IT! You won’t be sorry https://t.co/WrE3g0xwYb 💪🏼 always look at the positive! https://t.co/kTIeUXgOOQ Hahaha truth! https://t.co/0HgkktaTOX 🙌🏼🙌🏼 https://t.co/Q9tMtImlIx That is so sweet 😭😭 https://t.co/wNNJIX1Ei5 Since #SYMPTOMS was released, I feel the chains breaking. I feel like I can breathe. I feel like for the first time I can finally be me. No more self doubt, no more fear, no more shame of what I struggle with.I feel proud, I feel purpose and I feel empowered. https://t.co/gxcDC4e6k6 Thank u!! https://t.co/quv4cGrdxr YEEEESSS https://t.co/RV5sLFINFl Insomnia makes me feel better about experiencing insomnia lol https://t.co/nSESOGLP9j 🙌🏼🙌🏼 https://t.co/kmjFS0lsmW Love Symptoms! https://t.co/JN8uZ98GSG Those are good ones!! https://t.co/tJrnavVIuo Thank you for supporting me! https://t.co/fBIHyxFhXf Thank you! https://t.co/E2cmvj9jWh Ok you guys what’s your favorite song on #SYMPTOMS? GO!!! Love this!! https://t.co/SXwqMiAGCT 🙋🏼‍♀️🙋🏼‍♀️ https://t.co/23ZYsMWxYH 🙏🏼🙏🏼 https://t.co/ABdANQ9YJ9 Thank you for adding me to the list! https://t.co/DVfo0Q4QNV Yes thank you so much! https://t.co/MOHGOJxXta Thank you for sharing! I’m so glad you connect with the music! https://t.co/wcZ8mP7sB0 Thank you so much!! https://t.co/rNNzOzWEm7 🙌🏼🙌🏼🙌🏼 https://t.co/fwOGJaqHSN Yaaaaaaasssss https://t.co/4vDPqNdg7F I love how you all know exactly what I was trying to do! https://t.co/lZph9DeqMv INSOMNIA 🎶 https://t.co/jvCN6Y5vjQ 🙌🏼🙌🏼🙌🏼 https://t.co/9X6ATvqpCl @saadmerzak @Pink @warnermusic Nope! 2009 was my last record with them If you haven’t heard my new album #SYMPTOMS check it out!! \n\nhttps://t.co/T2WRdcIYeg Someone wake me up I think I’m still dreaming!! Still at #3 on the US pop charts sitting next to my hero @pink at #1! And at #14 on the all genre US charts! This is insane!! It’s been 10years u guys and I don’t have major label support. This is all because of you guys.  #symptoms https://t.co/8PzpGoQ2T2 🙌🏼🙌🏼 https://t.co/O2xlR6W5Fp He noticed me 😳 now I just gotta get him the song! https://t.co/siGvX1Y9zN YES!!!! https://t.co/F3FDG2P3Pe I wish there was a slap emoji 😂 https://t.co/ufCxPnCnu0 Yay!!!! I’m so glad you love it! https://t.co/BphBZE6dxP OMG were in the TOP 20 you guys!!!!!! #SYMPTOMS \n\nhttps://t.co/T2WRdcIYeg I think I just got a lot cooler, my husband is the coolest dude around! https://t.co/p7nc5vBEJH RT @JoeTizz2: “ All of the demons, how do you keep’em out. All of the feelings running me round &amp; round “ - @ashleytisdale #SYMPTOMS !! 💛💛💛… Thanks!! https://t.co/i3Lo5wINm9 That’s my best friend 😊 https://t.co/atu0EsqLLS Omg this is SO nice!! https://t.co/PH0GVWigiN It’s here!!! https://t.co/GcYXtodKrC 😭😭😭 https://t.co/atu0Es9aUk 🙌🏼🙌🏼🙌🏼 https://t.co/56Soca2gfU 🙌🏼🙌🏼 https://t.co/1lFZDVvOqv You guys. I’ve never done something so important in my life! Thank you so much, I couldn’t have done this without your support https://t.co/lx7rOTtng2 ❤️❤️ https://t.co/lx7rOTtng2 This mean so much!!! https://t.co/gXJvMtkVRF Hahaha https://t.co/CA98E4ljtv Thanks!!! https://t.co/ijdQsqG3fY Thank you!! https://t.co/T9Nfl99BRA 😊😊😊 https://t.co/a8JPq1CpJI Thank you!!! https://t.co/VETAAdM778 Thank you so much!! https://t.co/BTulCv86uj Yay!!!!!! https://t.co/BYanNsuXH4 Thank you!! https://t.co/KaosrbmIAA Thank you for waiting and supporting me through all the years!!! https://t.co/M71F5OajyF #truth 😂😂 https://t.co/xukZQmhvfn Wow. This is too much. Thank you for listening and thank u for this https://t.co/5ntJ3uoCyu 😊😊😊 https://t.co/BkQoHpIzTD Yes yes yes yes https://t.co/bz9fPIgNPx This means I so much to me https://t.co/TlW7qdkqVi Thank you!! https://t.co/m75ixLcefK Omg YES!! https://t.co/WGQ3mMSFQ2 Yay!!!! https://t.co/IeA2y7iC3c Yes please do!!! https://t.co/PYNThJMHlJ Thank you 😭😭😭 https://t.co/IVzBX0Bj66 😊😊😊 https://t.co/TeMMpGAjNa ITS OUT ITS OUT ITS OUT ITS OUT https://t.co/51yx663cvq\n\n#SYMPTOMS AAAAHHHHHH https://t.co/Q3a4s8Sisa Yea @Zedd hit me up! I’ve got a song for you 😝 https://t.co/JWdHkZYTxP My favorites!! https://t.co/fycSTTj2wG Thank you!! https://t.co/J99wQKDVmU LOVE that song https://t.co/qLxutcVBE0 Yay!!! This makes me so happy https://t.co/2VNwSICIrl 💃🏼 https://t.co/NCpnZG5Xz2 Aww you’re the best!! https://t.co/bx70vgchOn Thank you!!! https://t.co/XvMRFeyObr Check it out!! #SYMPTOMS https://t.co/gJ0reY2O9Z ❤️❤️ https://t.co/85s5Ml0OFq Thank you!! https://t.co/iak2yXsDXW That’s so crazy!! https://t.co/pDYEwysMRk I can’t believe it! TOMORROW! https://t.co/aVrjikOoUu Thank you!! https://t.co/SG4MShhSQn Love this! https://t.co/NqqXcFkfn9 😊😊😊 https://t.co/VPSG1mN8QK Magical @latelateshow ✨✨ https://t.co/B50rrktb4r @ThePerezHilton This is too early for me lol Hahahahaha https://t.co/ZsQG4bheRZ Guys I had so much fun on @latelateshow! Hope you love the performance I was feeling so many emotions but my anxiety didn’t get the best of me 👊🏼 😊😊 https://t.co/ep45jAA5xt 😃😃😃 https://t.co/xNKvO75ArY @konsicantstop That would be the labels decision 😏 I’m too excited for today and the fact #symptoms comes out in TWO DAYS 😊😳🙌🏼💪🏼😍😎😁😃😄😆🥰😘🙂🙃😜😋🤪🤩🥳 “I’ve got a fever, feel a little light in my head. Baby I’ve been burnin up ever since we met” 🎶 #SYMPTOMS 3 DAYS AWAY!!!! 5.3.19 https://t.co/nO5ePl3cb5 Get to know the Music: Looking Glass  #SYMPTOMS 4 days away!! 5.3.19 https://t.co/Pr3XkzGC4p @atisdalesource @rkendall1916 @TisdaleStats This stats are wrong! He said she said has 38 million Get to know the Music 🎶 #SYMPTOMS only 5 days!! 5.3.19 https://t.co/6cR4aecWb0 😊😊 https://t.co/zWnbuat9de We need a team name for me and @itsrachelwest and #scotstewart... give me some ideas!!! Cause we’re just vibin’ @itsrachelwest 😂 #Symptoms 5.3.19 https://t.co/J5TYNOE5Hm I LOVE YOU!! https://t.co/VcsFvCltAy Vibrations 🔊 5.3.19 #Symptoms https://t.co/9eV0T8h3XE @GurrolaGregg @bevhillsdogshow @Purina She isn’t she was a guest in the audience lol Maui is living her best life at the @BevHillsDogShow presented by @Purina. Watch these glammed up pups steal the show TOMORROW at 1pm ET on NBC. #BHDogShow https://t.co/xfR6T6zCuk One of my faves!! https://t.co/njmL1fXKmH 😊😊😊 https://t.co/hAPZIUNCZd 💃🏼 😭 https://t.co/6WXJgPksf1 💋💋💋 https://t.co/BrUYZPoi59 Hahaha https://t.co/Q43StIg7SW Thank you!!! https://t.co/0p82zL10X6 😍😍 https://t.co/CZapKwfINi Get ready to get inside my head. SYMPTOMS 5.3.19 https://t.co/VXSf1gIQRz Amazing! https://t.co/q9owFCgzj9 Cause I’m Feelin’ So Good 😊.........#Symptoms 5.3.19 https://t.co/FSlK0D5HRR YOU GUYS!! I can’t believe my album is gonna be out so soon!! It’s crazy! 😳😳😳 https://t.co/CQGDkGNm3x Such an incredible moment when I got to share the whole album with some of my closest friends for the first time. This album is all about knowing that no matter what you’re going through, you are not alone. I cannot wait till you guys get to hear it May 3rd! 😘❤️ #symptoms https://t.co/5l2SPbSXVl IM BACK!!!!!!!!! (In Candace’s voice of course) https://t.co/Fwz8RvFPjf 😊😊🙌🏼 https://t.co/YyidenPb3Z Thank you!! https://t.co/0xjfhnKXkm @berniiiieee Because that is what I artistically felt was right for this album. More music is still coming after this one! Pre-Save/Pre-Order Symptoms now! Im Feeling So Good! 🖤🖤 https://t.co/3IIKStNGEI https://t.co/kH5iI4O8Tl https://t.co/Ss9CDsRfV3 I legit had dreams of the @Dyson Airwrap... I was like “wow it IS so much easier to blow out my hair”. This is prob because I looked it up yesterday and saw it was sold out 😂😂 Me every morning 🙆🏼‍♀️ https://t.co/adkDdKNT9d Omg @PattyArquette like my tweet about @JoeyKing. I’m gonna take this moment and say I love you, I love your work and everything you stand for! Saturday’s are for watching tv in bed 📺 I’ve been watching you the entire time! So proud of you!! https://t.co/3Az7EZmZua I’ve known @JoeyKing since she was 5 when she guest starred on Suite life. I love watching her on @TheActOnHulu and see her straight up kill it. 🙌🏼 Happy Friday!!! She wasn’t looking for a Knight. She was looking for a sword. -Atticus https://t.co/0mHfrEqYvd I miss Cabo so much that around 330 I could smell the salsa and chips we used to snack on #vacadiet Wow. I can’t believe #Symptoms is one month away 😳 for everyone who suffers from anxiety/depression let’s accept who we are, put on some music and let go! https://t.co/0Bl10PAkJe @_ItsGiorgia Free people! My summer attire... https://t.co/rmU7pLDqs5 Sunday’s are for bikinis https://t.co/oAY4GDkwHH 💕💕💕 https://t.co/vnPzwlJFrD 🙌🏼🙌🏼 https://t.co/CqoxUCuaZD 🙌🏼🙌🏼🙌🏼 https://t.co/E9G1oizIRM We can only save ourselves! https://t.co/2YnebSUVku 💕💕 https://t.co/UzqRePCkra Hahahaha https://t.co/8XkuApbhPV 👑 👑 👑 https://t.co/HOmHgfZFNf 🎉🎉 https://t.co/R4YAQvH0b2 💋💋 https://t.co/kWxCXUGwbM Yay!!!! https://t.co/f3tmQZaT3g 😊😊😊 https://t.co/ulnPJgdm3l SYMPTOMS // 5.3.19 https://t.co/ZOjJ7jg9ko When u wake up for work and it’s still dark outside... after having insomnia for awhile it feels natural. Sunday’s are for deep conditioning and rosé 🍷 https://t.co/keS0fv9oZP @BoettcherAshley Thanks babe!! Let’s have some fun!!! https://t.co/v4zuNcS1xX Thanks babe!! https://t.co/6jFKm7Cfjh So excited to finally share!!! #merryhappywhatever https://t.co/R5kxTj3jms I’ve GOT to see @ArianaGrande concert!! Does anyone know when it comes to LA?!! Announcement coming next week! https://t.co/l46H1LIwmW Water 💦 It does a body good! https://t.co/WyN2S7JNQA SO good!! Love both! https://t.co/mkx3PlRBCk Spring cleaning!! 40% off Limited edition products at https://t.co/KGvFbPy0Z0 \n\nGet it while you can!!! Every time I parallel park and surprise myself at how good I am at it I’m like... that’s because I know how to back that ass up lol 🙌🏼🙌🏼🙌🏼 https://t.co/6i72nRldvL You can check out my tutorial on YouTube! Once u learn it and keep doing it, it gets easier. They are the best lashes!! https://t.co/ozf9hXEQNL Yay!! @IlluminatebyAT https://t.co/O9G7yoLdNe My faves!!! https://t.co/ZsC8wo69Ih Start today with a positive attitude 💪🏼 https://t.co/GCcprsKjCY Tried to find something green for #StPatrickDay. Looked cute might delete later 😂 https://t.co/1V5qUCRbGk Happy Saturday!! Wake up, be present, and have some coffee ☕️ I honestly have no words. I don’t want to tweet anymore about these tragedies. I want something done about it. I want more love in this world and less hate. #NewZealand I don’t know when..... I don’t know how... but I know @instagram is down RIGHT NOW..... https://t.co/roTSul48mT I warned everyone yesterday! https://t.co/PIE8E2epbu I would! But I can insta live OR Facebook live 😳 https://t.co/w4ZCm6olC1 Yea or maybe text them in pager codes! https://t.co/1HPsz7BvU4 HAHAHA https://t.co/udl5IHEj4r It just might get to them before @instagram starts working! https://t.co/JCacqfoxKN But like my hand cramps after two sentences 😂 https://t.co/Awfsfsv1DB If Twitter was down I feel like the world was ending 😬 https://t.co/xIpDgWYWso These are all great suggestions! https://t.co/pgCt3eENji 😂😂😂 https://t.co/9OkccgURC0 You guys we can get through this. Together. https://t.co/rsf1djvWQM This is amazing! https://t.co/deemFRzwUi You guys I feel like I have no idea what’s going on in my friends lives since #instagramisdown should I be old fashioned and just give them a call? Or should I text pics of what I’m doing to help comfort me in this need of time? WHAT AM I GONNA DO?! You guys are the best! https://t.co/Bp8GP4bDIP Mercury retrograde has me on a emotional rollercoaster 😬🤐 anyone else? https://t.co/9t6W8ijRYm Also I am not ready for this @Dumbo movie... the trailer alone makes me cry. Pjs, sushi and Vanderpump rules. My Monday is SO good right now 🍣 💥 My favorite space 🌞 https://t.co/PNsu22Jnqd Happy International Women's Day! 💕 Check out my Spotify playlist with some of the most inspirational women in music right now! #BalanceForBetter #IWD2019 #LeanIn https://t.co/JAymTzh8js &amp; don’t you ever forget it. #InternationalWomensDay (via ig #madebyblaise) https://t.co/ifG81RgZvU I’m over the rain... thank you, next! Take time to rest, realign, and restore. It’s the most important gift we can give ourselves. (📸: @mrmikerosenthal #ModelisteMagazine) https://t.co/SQli8CcqOD My heart! 😭 (via @MyThrpstSays) https://t.co/Pc9t72MRLc How I feel about Monday mornings 🙅🏼‍♀️ https://t.co/x3KtujLdmG beautiful art by @matialonsor 💕 Sky’s the limit ☁️ https://t.co/SplQOx4rQ1 Still learning patience. But it’s SO hard 🙈 Those weekend feels kicking in like... https://t.co/HGPPUiK3hN So thankful for this guy and all of his love and support @iamfrench. You too Maui ❤️ https://t.co/ncFtwF1lVL This morning @iamfrench and I arguing over if the “Momo challenge” is real or a hoax. We are THAT concerned. Typical me 😂 BTS filming for #LoveMeAndLetMeGo music video🖤 https://t.co/u1PKqnHIY2 Love this! 💕 https://t.co/4yYTLelRrc Words to live by ☀️ https://t.co/dIjlVE3hhY I legit freaked out that @ItsRamiMalek won, I can’t imagine how hard it was playing Freddie and he killed it!! “It’s not about winning, it’s about not giving up.” Lady Gaga #Oscars I want it... I got it... I want it... I got it https://t.co/dMFgxkfhow I’m predicting a lot of faces will look like this tonight! 😯 #oscars https://t.co/FZAZ7RoOOT All #IlluminateCosmetics everything!! ✨✨✨ Wearing the #GlowUp Warm Palette on my face and The Cool Palette on my eyes. #TimeToGlowUp\n\nhttps://t.co/yetthmdviU https://t.co/PZeHw9aUN5 Me. Tonight. For sure. https://t.co/WXVr9sytL5 You guys... the news this week has been WILD! https://t.co/Fmnj92atGt If Maui could wear #illuminatecosmetics #glowup...she’d definitely use the warm palette 😆 What’s your favorite shade? https://t.co/bw6K6VE6Gk Performing live can be nerve-wracking but also so rewarding. I am eternally grateful to my team (and you guys!) for all the support, and I can’t wait to do more! 💕 #Symptoms https://t.co/PEV6Q1px6L 🙌🏼🙌🏼🙌🏼 https://t.co/yAWsOiMfPy WILD ⚡️ https://t.co/A45OVQGzK2 @MoonliightPizza She’s too cool for Instagram. She likes to lead a private life 😂 Maui KILLING it in the blogger game https://t.co/Z126TQbuzH Sunday’s best 💁🏼‍♀️ https://t.co/EA3p9mZSfm I’m in my happy place. Vacation... It’s a leopard and #GlowUp type of weekend (wearing #IlluminateCosmetics Glow Up palette in Cool) https://t.co/yetthmdviU https://t.co/IK0hPdBmG6 🖤🖤🖤 #LoveMeAndLetMeGo video out now. https://t.co/kztdogyKbZ https://t.co/0mgfMY2zu9 I miss my messy bun! Need to grow hair out fast 💁🏼‍♀️ any suggestions?? Best card ever. This pretty much sums us up 😂 I love you @iamfrench https://t.co/T3QdyG528s For those stressed out about Valentine’s Day tomorrow, don’t be. Cheers to you and self-love 😘 https://t.co/qhri7egIkr Reminiscing on my pink hair...💕 It was fun, but too much work 😂 7/10 would recommend https://t.co/9KVCafFH7g Love having fun with some clip ins! https://t.co/8Bwa4O7xbZ Saturday night ✌🏻 https://t.co/LM9p5l9WCK Who got paid today? 💰💰 https://t.co/0ygp0WjEqA #LoveMeAndLetMeGo music video is out now. Have you seen?! 🖤 https://t.co/kztdogyKbZ https://t.co/Yf42JRzrRg Just got back from Vegas... can you tell? 😂 https://t.co/9ulwdff7wB @ashleycharts @BigNoise I’m wondering the same thing! 🤔 No time for decaf. #Monday https://t.co/pUQ9gEqAcG The first step to #GlowUp: Rent yourself a skating rink for you and some friends #TimeToGlowUp #illuminatecosmetics 💕✨ https://t.co/nNUnxZfMbv RT @AdoreXtina: @ashleytisdale Athe duo for both warm &amp; cold days 😻 https://t.co/O3XxXMtend What’s your favorite part about your beauty routine? Love it!! 💕 https://t.co/4v5fDE3BPV 💕✨ https://t.co/EGD5fHarFq Who got their #IlluminateCosmetics #GlowUp palette?! https://t.co/40peNE9kOa Getchu a drink that matches your highlight ✨💕 It was all pink everything at the #IlluminateCosmetics #GlowUp party #thepalmrose https://t.co/1BSH64EliX I’ve been chained up to my mind 🤯 https://t.co/IfRvIxw73m TY. So grateful. 🙏🏼😘😘😘 https://t.co/0xpkbJLrLJ #BTS at the #IlluminateCosmetics #GlowUp photoshoot ✨ I’ve been wearing them for months and am so excited they are finally here! Did you get yours?! #TimeToGlowUp https://t.co/6q1sSniLig This is what happens when you stop singing about dudes and start getting real. 😂 https://t.co/mlr38LYsn6 @BurtCarolyn No just online! I got you girls! I’ll do a tutorial on my Instagram this afternoon! Around 4pm PST. 😘😘😘 https://t.co/0ULkzFJES9 @youIovemelikexo Of course!  That’s why I do it 💕 @youIovemelikexo The cool palette! Rachel is wearing that one on the site! The wait is over! My #GlowUp palettes are now available on https://t.co/NFwZSn9eis. \nAvailable in 2 shades: cool &amp; warm to compliment all skin tones ✨💕  #TimeToGlowUp https://t.co/PmaQXTB3mz Meet the Cool and Warm #GlowUp Palettes! Mix, match &amp; blend as you like! 💕 $17 each — or $32 for the duo! https://t.co/NFwZSn9eis https://t.co/vSBU4s9RqM @ReadySetRock75 @IlluminateByAsh Enjoy!! They are so fun. @fallinlovatox @IlluminateByAsh Happy Birthday!! 🎉🎁 @SophieActingOut @IlluminateByAsh ILY! 💕 🙌🏼🙌🏼 #LoveMeAndLetMeGo https://t.co/W41KUdW7rW I’m vibrating higher 💕💕 https://t.co/oVdwZRb7ZP 💕🇧🇷💕🇧🇷💕🇧🇷 https://t.co/7bibFmr4xx You are so sweet I can't. Thank you 🖤 https://t.co/C8vo5XxyWF 💕💕💕 https://t.co/zMjVgWBuaI How cool! Thank youuuu 🖤 https://t.co/zA0YCaBIo2 Yass! 🖤 https://t.co/2ufbu75zal My new music video for #LoveMeAndLetMeGo 🖤 https://t.co/kztdogyKbZ ILY guys! Hahahaha I love you! https://t.co/IhdxnQssR8 Stay strong, you got this 💕 https://t.co/kJgfO8Txm3 Yaaasss #LoveMeAndLetMeGo https://t.co/pCKHEMjEhi Hahaha 🤭🤫 https://t.co/cKnEcVxv6x Thank you ☺️ https://t.co/M3hUy1IHer A MOOD 🖤 https://t.co/2dRjGB0Qnm 💕💕💕 https://t.co/9Pp85HdtLJ Thank you! #LoveMeAndLetMeGo https://t.co/qHNvusEUW1 #LoveMeAndLetMeGo music video out now 🖤 💦💦💦 https://t.co/kztdogyKbZ https://t.co/Nk1hLYW7lP Thanks @Billboard! Go check out the official video for #LoveMeAndLetMeGo right now! 🖤  https://t.co/WzRNBhNugu Tomorrow 🖤 #LoveMeAndLetMeGo https://t.co/5z2wDZy1iM Wearing the @IlluminateByAsh #GlowUp palette in Warm. The perfect bronzer &amp; glow ✨😍 Drops this Thursday 1/31. https://t.co/yrGXKOdegm https://t.co/gWqiyAgimo Couldn’t let the day pass without wishing the Queen a happy birthday! Turn up! 🎉♥️🎂 @Oprah https://t.co/mcKu1kvsUh Yes!! 💕 https://t.co/e2JTLRzlEE These palettes give you a perfect glowy sunkissed sheen that still looks like skin 😍\n I can’t wait for you guys to try it out! 1/31 @IlluminateByAsh #GlowUp #TimeToGlowUp Both are stunning! I even mix shades from both palettes sometimes ✨ https://t.co/fahPHqoykn The #GlowUp palettes come in 2 shades: cool &amp; warm to compliment all skin tones ✨💕 2 highlight shades, and 2 bronze shades! #TimeToGlowUp The #GlowUp Palette in Warm ✨ @IlluminateByAsh #TimeToGlowUp https://t.co/bNEwhvrqYA The #GlowUp Palette in Cool ✨ @IlluminateByAsh #TimeToGlowUp https://t.co/O1B90Lk106 GUYS, this is such a crazy week! Dropping my music video for #LoveMeAndLetMeGo AND my new @illuminatebyash highlight &amp; bronzing palettes! 💕 so exciting TOMORROW 9 AM ET/ 6 AM PT on @billboard 🖤 #LoveMeAndLetMeGo video https://t.co/UbvOVlMaA5 💕💕 https://t.co/T6HxlMh3Sd U ready? #LoveMeAndLetMeGo music video. This Wednesday 1/30 🖤 #Symptoms https://t.co/8Ca015Spi9 Thank you!!! Be the light! Be the light!!! https://t.co/4qokuKDc3o The glow is unreal you guys ✨😍 @IlluminateByAsh When you catch the light!✨ Using my new @IlluminateByAsh Glow Up — Warm Palette. Drops this Thursday 1/31! ✨ https://t.co/jSsUDP0Pvw @FernandoCandiaT @youshipwho @TeaWhatttt That was a joke you guys lol bc it’s a question I get asked all the time. Also someone had tagged me in the Barbie doll pics and I thought they were cute 🤷🏼‍♀️ Sneak Peek: #LoveMeAndLetMeGo music video… coming this week! ♥️ https://t.co/JWz9IX0cvZ You guys I can’t believe the GLOW UP palette is coming out on the 31st 😳 wow there hasn’t been new product from illuminate cosmetics for a minute! And now it’s finally gonna be here!! 🎶 #LoveMeAndLetMeGo \nhttps://t.co/GHxNLgshWv https://t.co/OPbX7o0lH3 The weather is giving me life! It’s making me so excited for spring 😍 It’s a vibe 💕 https://t.co/DK76NHW4bc Truth https://t.co/gvEIOM8i3i @zaynisgayforme Yassssss Happy Saturday! What’s everyone up to today!? 🥰 #LoveMeAndLetMeGo is on @AppleMusic’s Breaking Pop Playlist!! So fun!! ❤️ \nhttps://t.co/uPYBhAGY1L 💕 https://t.co/oUc6JbG9Qn 🖤 https://t.co/Alm76ZaJwB Instagram vs. reality. My new single, #LoveMeAndLetMeGo out now 🖤 https://t.co/GHxNLgshWv https://t.co/so0PwstnWw 💯💯 https://t.co/30R1NreaC2 This is the sweetest https://t.co/Ek5m0zmkgA 💕💕💕 https://t.co/EUXfY1C64S 😍😍 https://t.co/Y6hTK5vE12 Thank you!! https://t.co/OjNdKtrodL Seriously tho! 🤣 https://t.co/HeZ8qG4Gob 🙌🏼🙌🏼 #LoveMeandLetMeGo https://t.co/fQr1BnC96P Just hear to make your day better 😊 https://t.co/ej0ggJmXvw Thanks @Shazam for adding #LoveMeAndLetMeGo to the New Music Friday Playlist! Love it! 🖤\nhttps://t.co/OMtcUsRupE https://t.co/cR2z4wlMXj DOPE https://t.co/9SBoFKgbGI Thank you thank you thank you 💕🖤 https://t.co/LV2JUlv8jz This support you guys…. I can’t right now. #LoveMeAndLetMeGo It’s been fun you guys. I really appreciate all the support 🖤💕 This girl's gotta get some sleep! 😴😴😴😴 ily 👏🏻👏🏻👏🏻👏🏻 https://t.co/ST6m0fQHSO Colombia 🖤👏🏻👏🏻👏🏻 https://t.co/EHSDLrFMud Killing it! 🤘🏻 https://t.co/6orkP0uHG5 💕💕💕💕 https://t.co/maSAHt0sva YES! 💕🖤 https://t.co/57LKTTVSbu 🤘🏻🤘🏻🤘🏻🤘🏻 🖤🖤🖤🖤 https://t.co/7OZSjr8NKM Omg respond with gifs lolol https://t.co/Kpu3aSGwHK @ShelbyGibbs I see you all and I’m so grateful for the support. The sweetest 💕 https://t.co/p58C1rvVz8 @idianawayne 😂 I wanna see you guys jamming out. Tweet me! #LoveMeAndLetMeGo WOW u loyal https://t.co/nr0v48FSBS 😜😜😜 https://t.co/RC6kHUWWTT I love this I love this 🥰 https://t.co/7y0tmJn0AN LOL OMG 🖤 https://t.co/VLvKgDn7eB THIS 💕🖤 https://t.co/XoUOgLMw3b Brazil!!! I ❤️ you guys!! https://t.co/2sLwvtHp2F 😭 Thank you! https://t.co/5cXfP8TIm0 My second single, Love Me &amp; Let Me Go is out now 🖤 #LoveMeAndLetMeGo https://t.co/GHxNLgshWv https://t.co/Y6nQaMAjAb I’m like refreshing my iTunes every 3 seconds lol #LoveMeAndLetMeGo @youIovemelikexo So many emotions. Sooo excited 😜 So proud of you @juliamichaels ❤️ https://t.co/3YE13IXhcp Dropping Love Me &amp; Let Me Go in 1 hour here in the states. I love you guyssss!!! 🖤 @BRTisdale @ashleytbrasil omg even down to the watch. You are hilarious. LOL! https://t.co/nF2tWtcHmp I can’t believe it!! Tonight tonight tonight! 🥰😘🥰 https://t.co/x38ai42iqR I can’t explain to you guys how happy I am to be releasing new music 💕🖤 #LoveMeAndLetMeGo 😂 OMG https://t.co/rOpeYSubWT Aksjdgwjangdjwbsjsbs new music coming! 🖤 LY 💕🖤 https://t.co/PrRjMHK4vG You guys make me so happy 💕💕 #LoveMeAndLetMeGo https://t.co/zCFXewlSZY Thank you thank you thank YOUUU🖤💕 https://t.co/w3g04WNoKs Italy 🖤 thank you ily https://t.co/37XZDp6FOI For those in the states: MIDNIGHT ET/ 9:00PM PT 🖤🖤🖤 #LoveMeAndLetMeGo ILY no luck needed 💕🖤 https://t.co/bIwPJeURmn For anyone who needed this today: You are never alone. You are important. 🖤 #LoveMeAndLetMeGo 🖤 https://t.co/BK8VytPEUP Love!! https://t.co/FN6BjBwkDy 💕💕💕 https://t.co/NQ2oN2EMUb Hours away from Love Me &amp; Let Me Go 🖤 https://t.co/3MbjJnotVC Omg https://t.co/ANrXM7lKUv @ratxhetz ILY 💕 Been there 🤣 https://t.co/M7bK5kSAQS I’m so impatient I wish I could drop my song RN Love Me &amp; Let Me Go will drop at midnight local in each time zone! 🖤 https://t.co/quRALNysWn Love me and let me go...ooo...ooo...oooooooooooooo The Blonde is back in Business 💼 https://t.co/E1HSqE3uPs It’s important to always be kind... even to ourselves. Tell me a positive quality you love about yourself!!! ❤️ Heard it was #NationalPieDay and now I need pie ASAP. The struggle is REAL. 😫🤪 Who’s ready for Love Me &amp; Let Me Go.... ME 🙋🏼‍♀️ https://t.co/2MphwuNKP2 Sending everyone love and positive vibes for a great day tomorrow. GOODNIGHT! 🌙😴✨ @itsCoreyJames Love it! I wish!! https://t.co/wSuZbvRkSu ILY guys 💕 I can’t wait for you guys to hear the whole thing though!!! Sound on: Love Me &amp; Let Me Go. This Friday. https://t.co/o60T6kE2bm You guys ready to hear a teaser of Love Me &amp; Let Me Go?!?! Love Me &amp; Let Me Go\nFRIDAY \nFRIDAY\nFRIDAY \n🎶🖤🎶 https://t.co/zhzHt9JO1u Love this! https://t.co/Y6OXOOZW20 Oh man this is so me… anyone else? 🙋🏼👜 @IlluminateByAsh https://t.co/ZAlf48vhjq When we realize how big the world really is, our problems appear a whole lot smaller 🖤 https://t.co/nKhQVXDYVe I will always lead with love, I will always respect the people who came before me and fought for the life we all lead. Nothing good comes out of hate. Nothing positive. @jacklynn2895 I suggest you look at it yourself. This is by far the most disgusting thing I’ve ever seen. What happened to respect? What happened to humility? I really wasn’t gonna say anything but it truly does bring me down. https://t.co/Txq8J3DRpU The world can feel so dark. Add some color where you can. 🖤🌈 https://t.co/KEg28FST4D Best thing about a 3 day weekend is we can treat today like a Friday! 🥳 To brighten ur day 💕💕 https://t.co/ZFM7SPRs9f @flickershero It feels so good!!  🥰 @rafmoreno_01 On repeat 🎶 When feelings control me, they ain’t gonna hold me back. 🎶\nLove me &amp; let me go 🖤 1.25 It’s gonna be a great week! 🥰 https://t.co/z9ooh9SS38 Trying to remember the only song I ever learned on the guitar... Kashmir by Led Zeppelin 😜 https://t.co/nviKqNoLgM Teaser coming soon 😊 I hope so too 💕 ILYSM https://t.co/2NLSGmtZ5J 💕💕💕 https://t.co/JMiqThpjBt Omg you guys. These gifs are cracking me up. ILYSM It’s one of my favorite songs on the album 💕 https://t.co/iqUxy8gygw You are welcome... https://t.co/GHxNLgshWv Who’s ready for some new music? Love Me &amp; Let Me Go 🖤  7 more days. https://t.co/T3thl1fdUk Bohemian rhapsody just came on at the place I’m at... so it naturally made me happy @actuallyitsbrad @Disney It was def a shape lol Blessing your feeds with this gem today... 🤣 #TBT @Disney #KissTheGirl https://t.co/eiQdXOv7ov I swear California people see rain and act like it’s snow. They don’t leave their house. Me included 🙋🏼‍♀️ Still trying to control my not so in control anxiety 🤯 But first #LoveMeAndLetMeGo https://t.co/nBgTcEm3Tb Sometimes I think too hard on what to write on twitter and then I don’t bc I’m too indecisive 🤷🏼‍♀️ Learn more about my album #Symptoms\n\nhttps://t.co/KMClwWwvl4 https://t.co/BkQcoBquVW Love Me &amp; Let Me Go 1.25.19 https://t.co/0dtNCcJKB1 I can’t wait for you to hear the new song ⚡️⚡️ I can’t wait to see it either!! https://t.co/tRPtkl1IQF Waking up on a Saturday vs. waking up on a Sunday https://t.co/trixsZu6rb Love me &amp; let me go..... EAT some carbs 😝 We finally finished the music video. Can’t wait to show you all 💕 https://t.co/ZjKMnzKDmN Anyone else? #Symptoms https://t.co/DrvRn3YE9G @ShelbyGibbs Love me &amp; let me go! I also posted the year 2018 that morning lol a little exhausted 🙌🏼🙌🏼🙌🏼 https://t.co/q8wqMV3h42 You have held onto light when the night was too long ✨ https://t.co/fHNsZhfb2N A little mid-week pick me up 💕 https://t.co/h5YM14TkY9 Happy Birthday to this legend #DavidBowie 🤟🏻🤘🏻 https://t.co/lrxwL88e7A Love me or let me go. 1.25.19 https://t.co/KTJMXH40vH I’m so happy #BohemianRhapsody and @ItsRamiMalek won tonight, my obsession with Queen is another level and Rami killed it in that movie #GoldenGlobeAwards2019 Cheers to #SelfCareSunday https://t.co/SecsXpaD6m My favorite days look a little something like this. 😌☕️ https://t.co/2MzldqVvbE I relate 🙋🏼‍♀️ https://t.co/N5fgUqaPgn More of this. https://t.co/f8IH9xlz1N My Mood for all of 2019! Let’s go! @TanyaRad @mrbradgoreski Happy New Years everyone!!!! https://t.co/gnCjK9HKPT I hope you all go into this new year with love. Love yourself fully, love everything about you even those imperfections because you’re perfect and you deserve that much love. Stepping out 💋 #NYE https://t.co/HMrbSVkf8f ✌🏼out toxic relationships in 2019 https://t.co/n4bRafNroA Worked out for the first time since being sick and these are my legs https://t.co/e95PvEOE6F @wantyoutilidie Coming in January 😊 Thank god! Was that like a test or something?? https://t.co/MtMaksEakm What just happened to @instagram, why do they keep changing it? I liked the scroll down 😭 🎶 I got these feelings I try to bury down, but they keep screamin’ 🎶 #VoicesInMyHead (art by @mariussperlich x @sarashakeel) https://t.co/Ujxh180GHp Merry Christmas from our family to yours! ❤️ https://t.co/xMMimwIZPS 💕💕 https://t.co/BJWly59sjx Christmas spirit at an all time high rn. https://t.co/fugbA9GHnr Holiday breaking so hard. Bath goals inspired by #therosequartzgoddess https://t.co/mT636h3d5X 🙌🏼🙌🏼🙌🏼 https://t.co/Tw74424JEC Love is in the air 💗☁️ (📸 @Thibuch) https://t.co/DppFNVHOh5 🎶 #Symptoms \nhttps://t.co/gWWwsRjxGP https://t.co/frN5xOUl8E Festive AF ❤️ #TBT https://t.co/4IV3MGsjRv Flower child 🌸🌼🌸 https://t.co/1azRppz8dB And I can’t wait to share it with you! https://t.co/d4oVZJHFZT You got this! 🤗 2019 bring it! https://t.co/YpgmBD0TE6 RIP 💔 #PennyMarshall. I’ll always remember one of my first jobs on TV as a kid in a @nbcsnl Christmas sketch w/ Penny &amp; Whitney Houston. Fast forward to last year, I saved her dog Freckles from being hit by a car. Penny I loved your work, thanks for inspiring me all these years! Still stuck in bed sick but thanks to @TheEllenShow “relatable” I’m literally crying from laughing so hard. Waiting for a pink-hair emoji 🙆🏼‍♀️ https://t.co/y2EPruyOiw Friendly reminder. #MondayMotivation https://t.co/XFU28IFemK Lead with love. #VoicesInMyHead 🍂 #Symptoms \nhttps://t.co/gWWwsRB8yn https://t.co/JB1Up0Cess Actual footage of me tomorrow at my Christmas party 💃🏼🎄 https://t.co/Ys9cnE5MSW Was feeling funky this morning. Sad, tired for no reason. I got outside and hiked, wrote a gratitude list. Feel so much better. Don’t let one funky day bring you down, get out and walk it off! Color me pink... I love this tree! 💕 #TisTheSeason https://t.co/lMXzAIeciM When you have short hair but still try to nail the perfect messy bun 😂 https://t.co/VtAKhYc6IK The Voices In My Head made me do it 😝🦄 https://t.co/QE8Fx7gGl3 It just got a little more pink over here 🎄 https://t.co/f8FuH8tiHZ Love you guys!! https://t.co/pwGkDz55K5 Always time to tweet lol https://t.co/yLg2Rxf598 😘 https://t.co/XbTROIcCmu Thanks! https://t.co/rOrlDWtEyF I just did my own makeup in 20 min for jingleball. My anxiety is through the ROOF 😳 Happy holidays!! Check out https://t.co/40peNEqWcK for a buy one get one 50% off using code HOLIDAY N.Y.C what is it about you... So many things on my mind. But I gotta remember to be present and not let the anxiety take control. Stop the negative thoughts 💭 Hardly slept last night 😞 Thank YoU! https://t.co/cIRov2ySsa An all new #TizzieTuesday!!!  Go BTS of my Symptoms photo shoot and learn more about my upcoming g album! https://t.co/9N5bgzGi12 Got news for ya! #tizzietuesday is BACK BITCHES!!! Starting today, at 10am!! S s s s s s SYMPTOMS 😝 \nhttps://t.co/fb4iidg9LA @aimeecarrero Girl! I’m waiting for u to come home and make some more of that yumminess You can’t put warm bread at the table. I’m a SAVAGE. No self control 🙌🏼🙌🏼🙌🏼 https://t.co/N8UMC8LYuP The first look at the New Illuminate Cosmetics Palette coming In January!!! #glowup https://t.co/w570P8AiIY Yup! $17 https://t.co/S6c0cMbdHi Also me and @iamfrench binged through @MaiselTV so fast, thankfully the next season is coming out lol Ok so @BoRhapMovie was literally one of the best movies. @ItsRamiMalek was so incredible in his performance. You guys 😭 https://t.co/WGSyKrvJgx 😊😊😊 https://t.co/Ippcx9leFo When you know what the next music video is gonna be like... #MOOD https://t.co/yT1dFsWmhI SYMPTOMS https://t.co/hA3Us8Mh0M Once all the palettes are sold out they are gone! Gotta Make room for new product and those palettes were part of my collab with BH cosmetics. https://t.co/A7QiIW095R @aimeecarrero I love you! Just got exciting news for the next music video.. I just don’t even know what to say except 😊🙌🏼🙈😍❤️🔥👍🏼🤩😘😝🥳 @DestructoQueen Thank you!! @breatheeasyy Something even better is coming 😊 😊😊 https://t.co/pfrJhtUdEE 🙌🏼🙌🏼🙌🏼 https://t.co/89KvUg4stZ 😘😘😘 https://t.co/Gv80BB8f3x CYBER MONDAY!! 15% off ALL #illuminatecosmetics products!! 💥 https://t.co/LsLIGcbAkW https://t.co/LFDtQST1rL Pick it 🙌🏼🙌🏼 https://t.co/ycfSvfeYc8 I LOVE THIS!!! https://t.co/ht53bMXT5q Haven’t felt like this for awhile now. Think I’ve finally got this figured out. I can see the light much better now... https://t.co/6N8MRRqu7C I think she stole the performance! https://t.co/UQMlL0IGPe What an unreal experience. It started from pain and here I am on Thanksgiving sharing it all with you! I am so grateful for every single one of you, thank you for always supporting me. This is just the beginning of #HappyThanksgiving @macys https://t.co/8qVoWnvbtT ❤️❤️ https://t.co/YxSrcvH8Fc Thanks!! https://t.co/XKt29xqV84 I love this girl! https://t.co/UQMlL0IGPe You’re so sweet! https://t.co/M73uNgjgD7 Thanks! https://t.co/7Liek4XDI6 😍😍 https://t.co/XUp179D3fG Thank you!! https://t.co/I7GJL24mnE Happy thanksgiving!!!! I’m so thankful for every single one of you. Love you!! RT @Macys: The \"Voices in our Head\" are telling us, you better catch @ashleytisdale's performance tomorrow! She'll be on @kinderus's debut… Monday Mood 💁🏼‍♀️ https://t.co/F4vY9w6Wst Who wants an acoustic version of #voicesinmyhead 🙋🏼‍♀️ https://t.co/Efs2jSANi5 Thank you for sharing 🙌🏼 https://t.co/OucjmJDZ2I WOW. https://t.co/So2CH0NcGZ 😍😍 https://t.co/G0FfhPw7c1 Me 2 😂 https://t.co/qqk219t7bn Thank you!! https://t.co/Vn4zFU3ZT6 ❤️❤️ https://t.co/o7xWPm7N20 Thank you for saying this ❤️ https://t.co/3ulqsQUi7P Hahaha https://t.co/u2VARdymCh Check out my @Spotify playlist that inspired symptoms! https://t.co/lCrNjADGuM Thank u!! https://t.co/5ep0n7PVee ❤️❤️ https://t.co/Xwje96BPz5 Thank you!! https://t.co/PkqA7Ketne ❤️❤️ https://t.co/w2CR02jdRj It’s the only thing I care about 2!! 😍😍😍 https://t.co/jPFmYfDxh2 It’s HERE!! The World Premiere of #Voicesinmyhead Music Video!!!! \nhttps://t.co/QGTWrlM7yj @DerekPlease @enews It’s not for cable tv it was only a online exclusive 😊 https://t.co/7a3PPc0nwX This means a lot! Thank you https://t.co/JqxZyVdslE @itsmeleifan Tomorrow it will be up on my YouTube channel! 😭 thank you! https://t.co/VAN13jmq4r I’m crying with you https://t.co/NegebwInZQ 😘😘😘 https://t.co/jh8lxT9ncx Waiting for the video to upload like... https://t.co/dDEpvT9rDj Whoa.... the world premiere of Voices In My Head music Video is going to be out in less than an hour 😳😊😍😁🤯🙆🏼‍♀️🤩 @RafikJohnWayne @iamcardib I was so shook lol 😘😘😘 https://t.co/3OIhV4BizG I love you!! https://t.co/0MElAhek8p 🙌🏼🙌🏼🙌🏼 https://t.co/r0JL07A8K7 I love you!! https://t.co/zmN9n0cgvf New York minute https://t.co/MRIEJZSoCs Thank you so much!! https://t.co/cNrzYdbI8s 🙌🏼🙌🏼 https://t.co/qFx8XP4mwM Thank you for the support https://t.co/ntkjhINfjC 💋💋 https://t.co/a1LCGbb6FX 🙌🏼🙌🏼 https://t.co/EZbXuLqGkN 😭😭😭 https://t.co/NQ4xIcunp7 Thank you!! https://t.co/kLb9kBX1J7 😍😍 https://t.co/qruC023Syt 💋💋💋 https://t.co/Qvc1nGrZJI ❤️❤️ https://t.co/IyWhgDeibo Thank you!! https://t.co/iuiPVMqtY6 This means so much! https://t.co/UaOUmODEc9 Dream come true ✨✨ https://t.co/WxoeOqnxb9 RT @Refinery29: As wildfires continue to rage in California, these local and national organizations are seeking help with relief efforts. h… Feelin chic AF 💥 @papermagazine https://t.co/MevTqAkIzx Thanks 🙏🏼 https://t.co/3hd2tBdOBF ❤️❤️ https://t.co/eOw02MPGrP Thank you! https://t.co/KxIhKlFl6A So glad it’s mine 2 😊 https://t.co/t90Z00ZITT Guys it’s so cold in NYC and I love it! Finally feels like the holidays ❄️ Thank you for this ❤️ https://t.co/agDk2G0J1V Voices In My Head Official Music Video. 11.14.18 #voicesinmyhead https://t.co/dF9CYizeHR Thank u so much! https://t.co/oMp8NL9Ikc This is so devastating. I’ve already had a friend lose their home to these fires. Please help by donating ANYTHING! https://t.co/UzEAEvwB4A I feel the same way! https://t.co/D0upSM7SoD 🙌🏼🙌🏼🙌🏼 https://t.co/hEyanGnKzt Thanks 😍 https://t.co/6y4mtX3Hid This is epic!!! https://t.co/EFUVA3TWDR So glad u love it! https://t.co/BS8KQX8DZi Thank you!! https://t.co/AQX9S0tQQ9 So glad to be back! https://t.co/7kTKsveEJ5 😊😊 https://t.co/8E0YlAQKO7 🙌🏼🙌🏼🙌🏼 https://t.co/6hnyzoVqXe This means so much https://t.co/A3Tg3WdEz2 Amazing!!! https://t.co/a03KF3sfZa 😘😘😘 https://t.co/mJEo3fd9h6 BTS of making the video COMING SOON #voicesinmyhead https://t.co/imuZs9dJ2p Thanks!! https://t.co/AUdUVGNQRF Yesss 🙌🏼🙌🏼 https://t.co/YInyY2r8Ay I think I did lol https://t.co/s8jZgE03la Thank u!! https://t.co/HdfYxTJnBn 🙆🏼‍♀️🙆🏼‍♀️ https://t.co/yxCwvFSPrk @FernandoCandiaT Typo! But it is coming out next year! @RingRingPotato Thank you!! Next year! https://t.co/gR9qFQwWMz Hell yes! https://t.co/tldAouKxM0 @GarciaMiller128 Yay!!! @radhaaswari Ugh this makes me so happy!! Ha!! Thank you! https://t.co/OKVc9irhUD 😊😊 https://t.co/84v52sRhnv I love this! https://t.co/HNX8FqmuQR Thank you so much! https://t.co/O05drZTRLt Ha! Amazing! https://t.co/mFgWWSKexj Thank you https://t.co/aOKOEwj7Bx Yaaaassss https://t.co/eplXykErt0 Me heart! ❤️ https://t.co/EcuXZi89yS Love this! https://t.co/cmLOP7yjY2 💋💋💋 https://t.co/pkDVSXaWgu Wow. Thank you https://t.co/hXmN2zx2hi Thank you!! https://t.co/WvHTDxKH5l I know, they never stop talkin’, always sabotagin.. https://t.co/OZnkDEfVbd 🤩🤩 https://t.co/26IZPiuILK 😍😍 https://t.co/6A6BOHW8fM I’m back!! https://t.co/fKSwYio8m5 SOON💥 https://t.co/GDh776MT0Q 😝 I can’t wait!! https://t.co/gaZA9BUKVr 😘😘 thank you!! https://t.co/TyzteS88Uu 😍😍 https://t.co/GIkdondt0N ❤️❤️ https://t.co/fyUl0HWUmH I’m so glad. It’s exactly what I wanted! https://t.co/2dkPN2aAOE 😁😁 https://t.co/h0pqvf7mc2 Thanks!! https://t.co/KWzl1qBWnD Thanks for the support! https://t.co/JiKa7oIfli 🙌🏼🙌🏼 https://t.co/OQBtMrLFjo Thank you!! https://t.co/nKqK4psKJR Omg YES!!! https://t.co/kKDWGvVjl1 Wow I’m so overwhelmed with emotion right now. My new single Voices in my Head is out now. I feel like for the first time I can finally breathe.....  https://t.co/gWWwsRB8yn https://t.co/ErmFrNIvql 🙌🏼🙌🏼🙌🏼 https://t.co/jUqOZPnUd7 😘😘😘 https://t.co/g0ns6Uah1x https://t.co/Zc32ziiMF2 @HausOfFiona Acne studios! Thanks!! https://t.co/mybE2VMtKX Street team 😂 #noshame https://t.co/NwcO6fjQ2j I poured my heart into it I’m so glad that translated!! https://t.co/tAGO7zz9v1 😭😭😭 https://t.co/PxeO7HIYPA Yaaass girl!! https://t.co/BBiJXfId9o Thank you!!! https://t.co/nMP74VpwDi @stargirlxo194 Thank you!! 😘😘 https://t.co/dbnhVASpIh 😭😭 https://t.co/dbnhVASpIh So grateful 🙌🏼 https://t.co/1KILg0BaRB 🙌🏼🙌🏼🙌🏼 https://t.co/3pEUONSkH9 Love you!!! https://t.co/RTj1HBooQ5 😘😘😘 https://t.co/7VkaLrOBy4 Hahaha https://t.co/LIZFqHgsNl I’m actually crying. Thank you. This is why I can back to music https://t.co/3LavTXJvp1 😊😊😊 https://t.co/bfsdQbmpw2 This means so much to me! https://t.co/J4jztXnMYU Thank you!! https://t.co/k5dKNAGWNa It’s Out in the World!!! Get #VoicesInMyHead. I’m so overwhelmed with emotion. I hope you guys love it as much as I do. \nhttps://t.co/gWWwsRB8yn 😭😭😭 https://t.co/2g25mqDkqw My most vulnerable lyrics https://t.co/3JLRKeOMcy Hahaha https://t.co/seOtbIKMXI This is crazy https://t.co/78Og6B1oBF Thank you!! https://t.co/k7s5JtvFlq 🙌🏼🙌🏼 https://t.co/z6AzLTdriC Thank you for your support https://t.co/chKfs8HDm6 Thank you!! https://t.co/JtL0fcNYkt WHOA!! I love you!!! https://t.co/VFhrF2EnfZ 😘😘😘 https://t.co/nuuArJpbVA 😊😊😊 https://t.co/lUwgO9CfIy Check it out!!! https://t.co/rQUebuZ2KN It’s HERE!!! My #Voices is out in the world! Aaaaahhh https://t.co/rgKgR1nAIq RT @kellycc_x: relatable af and such a bop 🙌🏼👏🏼 https://t.co/u296mBAV85 RT @luhhpadua: 4:39pm and I can’t stop listening to “voices in my head” from @ashleytisdale\nYOU ARE AWESOME ASHLEY!! I’M IN LOVE WITH THIS… RT @youriceprince: Welcome back girl this song is so amazing and meaningful 💕 @ashleytisdale #VoicesInMyHead https://t.co/Ccq4jxmtVc RT @cristtianojr: Such a powerful song!!!\nThe 9 years wait worth it!\nI’m your fan since The suite Life and see how you grown as an artist f… 😘😘😘 https://t.co/IJhIMcDB7E Hahaha https://t.co/9uNyWQojUK MIDNIGHT TONIGHT! #VoicesInMyHead https://t.co/3hkKtM3uWs 😊😊 https://t.co/HgUWqcyXnN @namseoksidol Music video comes out in a week! @youIovemelikexo Well I’m awake super early so prob a lil nervous lol THANK YOU! https://t.co/synBXJ7G3v Yes. It. Is. Actually it’s dripping TONIGHT AT MIDNIGHT https://t.co/knRQ5t5SGS @ashleytbrasil @iamfrench Thank you for thoughts! It was for a kidney stone 😳 he’s already feeling better!! Want to hear the music that inspired me during my writing process for #VoicesinmyHead? Click link  #Symptoms https://t.co/lcjwnaDnxI THREE days away #VoicesInMyHead  😊😝😁😳😘😆😉🙃😍🤪🤩🤓🤯 https://t.co/hsVNcXbA16 Now that I’ve watched #HauntingofHillHouse my husband now has to look forward to me waking him up in the middle of the night! Your welcome @iamfrench You guys I cant believe it’s only 4 DAYS away from Voices In My Head release 😳 something so personal will be out in the world! Aaaahhh I’m excited and nervous and I’m quietly freaking out lol. 11.8.2018 Voices In My Head. 11.8.18 #lyricvideo #symptoms https://t.co/g81id1s8yA So proud of my husband!! https://t.co/2WUISCKbSx @JohnFeldy Which one? SO excited to announce that I will be a part of the Thanksgiving Day @Macys Parade!! #MACYSPARADE #VoicesInMyHead #Symptoms https://t.co/D2ivl7k2KR 🙌🏼🙌🏼🙌🏼 https://t.co/3eRvDhuu6k Happy halloween!!!! https://t.co/dREpU5QUyJ You’re the best! 😘😘😘 https://t.co/ZX2ho5l9R9 In a world full of darkness, Be your own light💡 https://t.co/CruxaSyHME @RebeccaRSMusic @IlluminateByAsh You better get another one! They are only available for a limited time! Be the first to hear my new single \"Voices in My Head\" when it's released on 11.8 by Pre-Saving now on @Spotify &amp; @AppleMusic! https://t.co/gWWwsRB8yn Voices In My Head. 11.8.18  #symptoms https://t.co/mojNp9Sb4M 💋💋 https://t.co/iSGLihjC0H 😁😁 https://t.co/rAn8OTVOB9 💕💕💕 https://t.co/G5hj7r7qVr 🙌🏼🙌🏼 https://t.co/dz4amSF903 🙌🏼🙌🏼 https://t.co/xIdxfVy0RR ❤️❤️❤️ https://t.co/RGwLRIakkq 😘😘 https://t.co/V983TIp7Lp Thanks!! https://t.co/6AFowuUjli RT @TheButlerWhoFan: @ashleytisdale AAAAAH I can’t wait to finally hear your beautiful voice again 😍 Love this! https://t.co/qH4d4t9Xs6 RT @heyitsris78: @ashleytisdale so pumped for your new music! Thank you!! https://t.co/tvgKHcMsYU Hahaha https://t.co/i1EqKUAYTb 😊😊 https://t.co/998UwdD6Zm It’s coming!!!! #VoicesInMyHead #symptoms https://t.co/ZVzZRSqDPQ @number13_honey @Blushington Tokyo! My girls came out last night to support me at my #illuminatecosmetics @Blushington launch! So amazing to have such incredible women in my life who support me. Also, we are all wearing illuminate matte liquid lipstick! https://t.co/jWkYpvwTWv @AshleyJohnny @Tisdale2UK Self doubt. I got these feelings I try to bury down but they keep screamin’ and I’m just tryin to filter out somehow.... #VoicesInMyHead 11.8.18 https://t.co/n1oI2Uz6bf Making a murderer part 2....enough said lol 😂 https://t.co/LRgnWw9tW3 Life is better when you’re laughing https://t.co/PyxzQshBc9 Illuminate is now available at @Blushington 🙌🏻💕 https://t.co/d2wXMjmsKy Hahaha https://t.co/yV92jon8IQ My happy place 😊 I can’t thank @JohnFeldy enough, his studio has become my safe place. Where I have no cell service and I shut off from the world and just create, it’s the best feeling in the world. #VoicesInMyHead #Nov8  #symptoms https://t.co/kk1Gv88Ohh Sorry guys I gotta go make some dinner and still have work to do. Thank you for all your questions!! Love you guys 😘😘😘 @ChartsAshley Something very different from past music videos @bieberdreamm The video is exactly what the song is about. Can’t tell you now but you’ll know More soon! @derikvs It’s up tempo! @bibleandabeer Haha yes, that is amazing! @chlxegough Thank you! @ashleyismydrug That you can get through anything. Yes there is darkness but you be the light and guide yourself out of it @bibleandabeer I’m really excited, I’ve lived with it and I’m finally ready. It’s not just sharing the album it’s sharing a piece of me. @softbeanbri Probably when I finished I realized what I had done and how Much i poured myself into it, I was wow I created that! @softbeanbri Yes for sure! I missed music @saylortisdale I want to! I love them @DovesLaugh New logo, new colors and a bunch of new products! @emswifts My life. Dealing with anxiety and depression, I just started writing and it helped me through everything @Yayagirl101 In the new year! I’m so excited for everyone to see what I’ve been creating! @taytayyy16 You’re so sweet! Yes @Britinthezone1 All of the above! @saylortisdale 🙌🏼🙌🏼 @adreena0801 Illuminate cosmetics of course! @Britinthezone1 Hmmm I don’t know.... 🤔😊 @tisdalemess Yes!! Live tweeting in an hour! Let me know what questions you guys have. Something illuminating is coming to @blushington! ☺️💕 https://t.co/GyrzW8JyQW They lie to me and they lie to you 🎶 #VoicesInMyHead https://t.co/oskXvc6gvq @novemeblue I love this!! #FBF to my Guilty Pleasure days.. https://t.co/BxIcJk1zlE Hahaha https://t.co/WeFff1qaQR Hahaha https://t.co/bT2kcJqZ9V Never alone. https://t.co/jkUslWAAHW #VoicesInMyHead https://t.co/qF9tn8Vp5v @zaynisgayforme No it’s up tempo! #VoicesInMyHead https://t.co/GdWmVt4XXd Voices In My Head 11.8.2018 #SYMPTOMS https://t.co/tGxU5tiYce RT @JanzforCongress: Good morning! I believe in science, my opponent does not. #CA22 \n\nClimate change is real and we must act now.  https:/… Hahaha https://t.co/SFY69yHVhD RT @ShelbyGibbs: @ashleytisdale I need to hear this single and see the new music video! It’s almost been 10 years girl! So excited! 😂😂 https://t.co/AJgABigxoe 😝😝 https://t.co/Zrh3UI4oCi 😘😘😘 https://t.co/52hVYKdqQF 🙌🏼🙌🏼 https://t.co/zy80FcppCu It’s SO good! https://t.co/vx4Me5puJq @kzamora94 Already in development! Coming out in the new year! 😊😊 https://t.co/DuYYUMYU0u It’s October 🎃, my favorite time for a dark lip💄what is your favorite holiday color? https://t.co/jrTTtnPQIM 😵😵😵😵 https://t.co/GtAzMAb0jM Announcement coming soon....  #SYMPTOMS #AT3 https://t.co/VKqffQxEUV Testing out new products for illuminate! 😉 #illuminatebyashley https://t.co/G6NmQRxmMB Shot #architectural digest today!! 😊 https://t.co/gXyMxVOKuC Dancin’ through Wednesday 😎💃🏼 https://t.co/qitrjxUMyc Monday mood 😘❤️ https://t.co/kCLRuFJzdD A new era is coming.... https://t.co/JSlG23mr2O Guess what? S3 of #SkylandersAcademy is out now on @netflix ! This season is so much fun and I hope you all love it as much as I do! https://t.co/JYT61e3t1j The pain, the memories, the bravery. Thank you for standing up and sharing your story Dr Christine Ford #IBelieveSurvivors #IBelieveDrFord I can see the light much better now #SYMPTOMS https://t.co/yfAtThaPvm BTS today on set! #Symptoms #AT3 https://t.co/SNpinVcIsN 😊😊😊 https://t.co/kgteeJVarR That’s so awesome! Thanks for the support https://t.co/QNqmlwFMVI Thank you! https://t.co/tDYCu7Z9hG 😍 https://t.co/VQyJdSRLTa Thank you! https://t.co/oO1AS6WJz2 ❤️❤️ https://t.co/BcohPzbJXZ This means so much to me 💕 https://t.co/QH2M5FuAPE 😍😍 https://t.co/Tm4kDuzoE8 Thank so much! https://t.co/UvL578HXcm Thank you!! https://t.co/AyrGUWodq6 @youIovemelikexo Soon! Means so much to me https://t.co/Osj28gx3An 😊❤️ https://t.co/bmLYq9lgdi 😘😘😘 https://t.co/BmUNjUZCVG When you’re trying to get the perfect selfie you sometimes have to stand on a bath 😂 https://t.co/IaSKXVVKNn 🤷🏼‍♀️ https://t.co/hgFp8iCTVI Happy and proud to support @LucyHale 's “Do it for the Babes” tee, benefitting @stjude. Get yours today by at https://t.co/LJHahWXJl4 https://t.co/Dl1vc7yuYk All those voices...tell them 🤫 https://t.co/j8FjuLGCwL #SYMPTOMS https://t.co/9iQbT1PfhA Not my favorite side, but I have a lot of things about me that aren’t my favorite. However as I’ve grown I think those sides are just as beautiful. Beautiful isn’t perfection, it’s being you. https://t.co/hDVMrvjmDj We’re back!! https://t.co/u2CzSCPdX1 No one should ever be left behind! Thank you @peta for helping. https://t.co/Ie2B1NCrWT So fun! https://t.co/IIn3k7MNjS RT @justjaredjr: Attention! @ashleytisdale is giving us more details about her upcoming album #Symptoms and we're now even more excited to… This is absolutely horrifying. How and WHY would people do this?? #Denmark https://t.co/J8LnJfcaeO SYMPTOMS https://t.co/AIMQVmlbw7 @papermagazine shoot today! ☺️ https://t.co/fPXXMkHN7T NYC rainy day vibes 😴 https://t.co/n6Er6uvvwL @Menna_Talla2 The single will be! Hell yes!!! https://t.co/oTEkH60MPk 🦋 https://t.co/bfVwwtS5bl Thinking of the lives we lost and the families who have suffered with out their loved ones #neverforget911 https://t.co/6TTYhy5AA1 D E T A I L S ✨ https://t.co/hzNLsfVI8Y 4 years ago... I can’t believe how fast it’s gone by. There are no words that could describe how much this man means to me. https://t.co/WgZ1cfdhyV That Friday feeling ☺️ #fbf https://t.co/d7biGs8qcj You might think you know me, but you have no idea.. #SYMPTOMS\n#writing #inthestudio #at3 https://t.co/95QYZUSW8E Illuminated with the Beach Goddess Palette ✨ \nGet ready, new products coming soon! ☺️. https://t.co/3AfSrQ1CSH https://t.co/2EYtfs5AQ9 #LaborDay vibes 😎 https://t.co/v1g9zgT39a Satur-yay 😝 https://t.co/pTMQiEY1rp ✨✨✨ https://t.co/qS0zRLXG4I @ThePerezHilton 😘😘 Hahahah https://t.co/1BatIqCeNA @DebbyRyan @dimepiecedeb I love you 💕💕 RT @KaliKarker: @ashleytisdale @justjaredjr I love when celebrities speak out about their struggles bc it's a real stigma hanging over peop… Being honest about this stuff is scary. But easier with this support! Thanks @justjaredjr https://t.co/JF4Bd3i6d2 🖤 https://t.co/F4BB3lnBHJ 🤞🏼🤞🏼🤞🏼 https://t.co/ojeiI5KR8U ❤️❤️ https://t.co/PSLSlidZqv 😍😍😍 https://t.co/sUX0axcPn2 😊😊 https://t.co/lnJavFHPaf Thank you!! https://t.co/O3B5K2uwt5 💕💕💕 https://t.co/cVCvkH9boz Thanks girl!! https://t.co/fuOrWYMxDP 🙈🙈 https://t.co/D2E2riWZ3F 😘😘 https://t.co/WOo2l0EABO 🙌🏼🙌🏼🙌🏼 https://t.co/9RcVlMFOAi Last look of the shoot! #At3 https://t.co/z6165wnDNr RT @TheEllenShow: This is the link to join the Brady Campaign and help fight for reasonable gun regulation. I refuse to give up hope. @Brad… Home sweet home. Best thing ever ❤️ #nationaldogday #maui https://t.co/8fC0041Tyk So much fun getting to participate at @createcultivate Thank you so much for having me! #CreateCultivateCHI https://t.co/uh0yV3g8LF Don’t you ever forget it ⚡️ https://t.co/9hafPCmAVJ I’m so ready for Fall weather 🍁 @UfficialeAT No she’s an independent woman His what should I order for dinner? Chinese food? Mediterranean? I’m SO indecisive..... @softbeanbri @CheatCodesMusic @britneysoul Neither! @gomezbotton Beach goddess, but the new palette is gonna be bomb! @_tavareswell It’s happening in the next week! 😬 @marcelowho A lot! So much behind that name, I can’t wait to share with all of you what it means and the journey ive been through! @acttingout Hi! @saylortisdale VERY SOON! I’m so excited! @saylortisdale As of right now no! @fefeszsantos I hope so! I love Brazil! @christafoya Fall! @tisdalemess Something different! Still in the pop world but I would say more pop electro! @tisdalemess I def have plans to tour! Can’t wait to see eveybody! @tisdalemess I can’t say yet!!!! When the squad is all on point 👌🏼 #vmas2018 #arianagrande https://t.co/5KP8vnyWmv Tomorrow come and hang with me #askashley 6pm PST! https://t.co/elQcfcUIs8 When you find that one friend you can truly be yourself around 😂😂 https://t.co/3WnQlIebm0 Rest in Peace Aretha Franklin. Her voice inspired and touched so many and will live on forever. https://t.co/s4kjaDRCig 🍒🍒 https://t.co/4QEefozCfU @magicmikecastle Yaaass What’s your favorite 90’s band? Let me know! https://t.co/d6aPbiwlmp Omg this is amazing!! https://t.co/ndJKmKwZER Yup. This pretty much sums up the life of an actor.  https://t.co/0E1tLoGW6I #bts in the studio today! 🎶 #Symptoms #at3 https://t.co/Lf7uaDXuek Summer essentials ✅ ✅✅ https://t.co/X6vaYgg91T @ShelbyGibbs @iamfrench It’s too early lol thanks for pointing out RT @nytimes: Thirty years ago, we almost saved the planet. This is the story of how we failed. https://t.co/Q5Yyb9lXAr Got music on my mind, what are you  listening 🎧 to? Let me know in the comments below 👇🏻 https://t.co/PDAjJe09ws ☀️ 🌊 ❤️ https://t.co/i96xA9KIb1 Found my happy place 😊 #vacationmode https://t.co/dAVmD6fNa3 Can’t wait to illuminate my way through my vaycay!! 💋💋#illuminateme https://t.co/bpkj7TODBW RT @papermagazine: Crazy that @ashleytisdale invented angst! https://t.co/MmLuzZ0Hkm Celebrated my girl @LeaMichele and Z on their engagement. I couldn’t be happier for this girl, she deserves the best because she is the best. I’m so lucky to have you in my life 💕 https://t.co/uT07WtvH2c RT @ttylgrande: @ashleytisdale i can’t wait for your new music!’ https://t.co/nwC21MTlWt RT @KatarinaNicoleJ: @ashleytisdale Yay!!!! I’ve been waiting so long for this!!! I can’t wait!! ❤️ This is amazing! Haha https://t.co/bdfJjxGrCS RT @CravingToBeWild: I kind of can't wait for @ashleytisdale's new album. I'm so curious. 😊 #AT3 #Symptoms RT @Tariqms11: @ashleytisdale Yesss I’ve been waiting 😍😍🔥🔥🔥 RT @rolenecdreyer: @ashleytisdale Yaaaasss finally!!!!😱😱😭💖 RT @WorldAshleyTisd: @ashleytisdale We need the first single of #Symptoms 🎶❤ SO EXCITED ❤ new album #AT3 💋 https://t.co/o1OrrrglCk RT @yazuxx: omfg new @ashleytisdale music in the fall IM SOO EXCITED https://t.co/Jjc56hTYq2 RT @helenecolin: @ashleytisdale Best news of the day, can’t wait to hear that new album, so excited 🎉 RT @DarkLordCaramon: I’ve been waiting 9 years for this #Symptoms @ashleytisdale RT @DarkLordCaramon: @ashleytisdale just announced new album jfjdjdjdjd the good news of the day #AT3 #Symptoms RT @MuuMuse: Enough with all the he said, she said: the @ashleytisdale comeback is finally upon us. https://t.co/fjkV5w0LX9 It’s official https://t.co/XWNbImd6t3 Animal testing has to be stopped!! Cruelty free is the way! https://t.co/ix3NRWHOFX RT @joangrande: https://t.co/t8VNPF9l73 Thinking of you @ddlovato. Sending you so much love. You guys!!! Not only is my new website for illuminate cosmetics live, but I also have a new #TizzieTuesday of an exclusive look behind the scenes of my first big shoot since taking over Illuminate ✨ https://t.co/wsEGkDID6y https://t.co/NwTe7wiXFt \"I've never met a woman who is not strong. It just doesn't exist.\"\nDiane Von Furstenberg https://t.co/Wag2ri43Hb Change the way you look at things and the things that you look at change https://t.co/xZ3wzxWHqP MOOD 😊💗 https://t.co/Pv73Zssih1 Whatnare some of your favorite shows to binge and repeat? 📺 lemme know! https://t.co/abkKgjCRrF Omg this is amazing haha #GodIsAWoman @ArianaGrande https://t.co/PXjZaaxjsj Thank you guys so much for hanging and all the questions for #AskAshley, every 3rd Tuesday of the month I will be doing this!  ❤️ Too many faves of that show. Can’t pick just one! https://t.co/hU8fRfDw6d It’s such a good song! I love it! https://t.co/HZC0fuO2ts Surrounding myself with positive and supportive people. https://t.co/ywjG3ePdTi Coffee! ☕️ https://t.co/uvj3b0Lh5b Love both, but have a special place in my heart for Louis Vuitton❤️ https://t.co/2DwrsnpGaZ athleisure https://t.co/mA0ey7qEol Summer is my fave! https://t.co/Oqa2u6xKu1 I love them all, but the lashes and beach goddess palette are some of my faves! https://t.co/Ii8o8Nx3dC Never give up https://t.co/qBc3Iz7kBC 😂 https://t.co/AS4FyXv4oa French fries 🍟🤗 https://t.co/lIF2b3cCFv matcha latte! ❤️ https://t.co/tbfhaFaJ2b Got a question!? Ask me today at 5pm PST on Twitter! https://t.co/azbnVypiRm Cause that would be pretty awesome 💗 https://t.co/LpKDfr6ALe Trying to find that work life balance https://t.co/iQ373rK6J6 This heat got me on rinse and repeat 🔥😅 https://t.co/gHRIbts6SF The only B.S. I’m lookin for this weekend 😎 https://t.co/3CUE2aShM7 Last night with @ArianaGrande. Love this girl so much 💕 https://t.co/nqbC8W8z1L And then I follow it up with “Check your DM’s” 🤓😂 I send way too many insta dog videos to my husband...... @iamfrench Real girls aren’t perfect, and real girls can be found in their local 7-11 grabbing snacks! 😜 Embrace your real. https://t.co/1AUfGMBkqI Got my Monday shoes on ✨ https://t.co/pBcfDCLLI2 Laundry day 😉 https://t.co/AZqJFRjqM6 Gearing up for the Saturday night like 💁🏼‍♀️⚡️ https://t.co/oJcJP74w5J It's Friday... time to let out your Night Goddes vibes :) #illuminatebyashley \nShop this look at https://t.co/eSQarcwNK4 https://t.co/vxr0gJbPCm @SabrinaAnnLynn Ha! Amazing #Repost @SabrinaAnnLynn \n😂❤️ https://t.co/OYaP2edBgQ Happy 4th of July!! 🇺🇸 🎉✨ https://t.co/kIJfpqRVAH Trying to keep cool in this LA heat 😎 https://t.co/Ypevgg5HOV ✌🏼out 32! Hello 33.... #HappyBirthdaytoME https://t.co/XenyBQjL10 @chelseatc Thanks babe!! Bday fun today! ❤️ https://t.co/T0R9HIVzFE @jenkellytisdale Hey Big sis it ain’t my birthday yet! U got time lol Fashion speaks louder than words https://t.co/ZRx4k3Qx3N Don't suffer in vain. This beautiful new book by #RabbiSteveLeder taught me how we can actually use our struggles with grief, pain, and loss to come out stronger people, even better than we were before. Pick up #MoreBeautifulThanBefore for yourself and as a gift those you love. https://t.co/c1Ez3w3Q2c That Night Goddess Palette 😍 https://t.co/Gy5JMrD4x1 #illuminatebyashley https://t.co/uFhugWGgAw IM BACK 💁🏼‍♀️ https://t.co/S1JspSjPys New hair, who dis🙋🏼‍♀️ Color: at @dphue by @AnderssonJustin ❤️ #dphuehouse https://t.co/oOUOUZKzUG You know you’re busy when you’re wearing shorts and forgot to shave your legs 🙄 #dontgottime When I realize it’s only one week until my bday!! 💃🏼 https://t.co/79PnT4rVRp #FlashbackFriday....to my bachelorette party!! Download my app for the full video! https://t.co/vdcE8BgcfP https://t.co/D0ctZC9oKN Yaaaass https://t.co/o7xKjtSAYF Turning up the heat 🔥 with  \nM I A M I 💋  #matteliquidlipstick https://t.co/4Ma3BhYhUN https://t.co/K0wK9nI8So https://t.co/M6L5CrasLs https://t.co/bGXaROPWDg Omg this is SO cool!! I’m so proud of you!! 🙌🏼🙌🏼 https://t.co/SH1qCNzEkp @iamfrench Hahahahaha @iamfrench Ha! Because I just am 😜 Thanks guys! Gotta go make some dinner, thanks for all the questions 😘😘 @BiebersButera97 @Gottafindyou Omg I’m binge watching from the beginning! So many episodes are good! @ATArgentina Not yet! @Gottafindyou Rachel from Friends @EXPLICITISDALE We just redid the logo!! I can’t wait to share! @aangelraamirez Yes I do!! So much love @amore1137 MUFFINS! @ju_ferrr You get to be with your best friend everyday @ATArgentina Of course!! @hesaidclara Greece! @rhuancesarr Cauliflower hot wings! @saylorgorgeous I know! So long.... can’t say yet! @petschbutera @sweetenerhannah YES!! @sweetenerhannah I love her! @brunohtreis Working on it! Developing something right now in my company... @iHeartAshley @ATArgentina @rhuancesarr We don’t! The producers of HSM kept it @amore1137 Skinny dipping! @UfficialeAT @iamfrench That’s amazing!! @rhuancesarr Neither! I want an Emmy! @RafikAllalou No tears left to cry @amore1137 @iamfrench Cool, hot, and genuine @BiebersButera97 Handmaids Tale @_tavareswell I might be in the middle of one right now lol @joantisdale98 Never say never! @ashleybrsite Going really good! @saylorgorgeous We spoke about music 😍 @itsbricrista All of them! @saylorgorgeous Not yet... @lincolngravel Kiara! @iHeartAshley Of course I love me tizzies! @RafikAllalou Fave song right now is Dua Lipa IDGAF Shakin’ my way through Tuesday ☺️ https://t.co/jXTX9W7H5v This is so important right now. Please read! https://t.co/qPP8J0kNa0 Join me tomorrow!! #askashley https://t.co/atJNzBfVhg Happy Father’s Day to this one! Not only is he the best dad but we also get to work on construction projects together 🔨 🤗 I Love you so much!! https://t.co/lMk80rSBt3 Saturdays are for Saint Laurent and Sun ☀️ https://t.co/PSNGo5xq2B Me and my girls on Friday! 🔥💃🏻 https://t.co/QtgTTEbMkf #TBT 🎶 https://t.co/fWcCden9HI @ThePerezHilton @mychristian98 You’re the best 😘😘😘 Get your LONDON on this Summer #liquidlipstick #illuminatebyashley  https://t.co/9MC4coEKJm https://t.co/bWnHxt6EPW When your dad says construction will be done before your birthday 🎂 https://t.co/WADOJ3L8Wl Eyes on the prize 💪🏻 #MotivationMonday https://t.co/h84RNdTt41 Saturday vibes all day long 😎 https://t.co/DAEqT80pdp Happy Saturday! Go outside and hug a tree! I promise that you will feel more grounded 🌳 Stop clickbait! https://t.co/gnmOJAyw7d We are all struggling with something, negativity only feeds negativity. What happened to compassion and empathy? Let’s start making an effort on being good to each other, not just in real life but on all social media outlets. @haleycamdennn I’m still doing it but have been pretty busy so I’m hoping to film some soon! Head over to my app for full video! https://t.co/vdcE8BgcfP #WisdomWednesday https://t.co/7f8FAlNl6W RT @MikeLevinCA: My mom’s parents came to the U.S. from Mexico when they were very young.  They didn’t speak English or have much money or… Head over to illuminatecosmetics Instagram story to follow along today for exclusive clips from our shoot! https://t.co/xkTqKeewpK Walking into monday like 😎 https://t.co/C92lN1hHhZ Sundays are for taking a pause, taking a breath and taking time for you https://t.co/pmcOOYkoRR looking back at the Times 📰 https://t.co/7viZyef3mG D🍩nut mind if i do #NationalDonutDay https://t.co/DIMK5uvI2Q 🙌🏼🙌🏼 https://t.co/EKEtDnA7V1 TBT Channeling my inner goddess 🦁 https://t.co/EPeSRnW1oI Good morning beautiful people RT @peta: Yes yes yes 👏 Love that @AshleyTisdale understands the importance of buying #CrueltyFree makeup that wasn’t tested on animals! #S… RT @wwd: .@ashleytisdale on acquiring her makeup line – @IlluminateByAsh – from @bhcosmetics and cruelty-free makeup: https://t.co/hWVxZ3sD… 💄💄💄 https://t.co/a0aFjzw0gp 😘😘😘 https://t.co/C6GMaf6iza 🙌🏼🙌🏼🙌🏼 https://t.co/ifM74T4RDz Thank you!! https://t.co/p06HxbX4rj 💋💋 https://t.co/5p8o4Oi619 ✨✨✨ https://t.co/6SG3LUB7iP Finally able to share with you! Thanks to @bhcosmetics for teaching me the ways and supporting me on this venture https://t.co/f3yNL25VJR Happy Release Day!! #DaphneVelma https://t.co/bm8ssVAPkX RT @BlondieGirlProd: Today you can watch Velma aka @sarahbgilman make slime and TOMORROW you can watch Daphne &amp; Velma on DVD, Digital, and… Can’t wait for you all to see Daphne &amp; Velma get together in @BlondieGirlProd's newest movie #DaphneVelma avail on Digital &amp; Blu-ray™ on 5/22! ttps://amzn.to/2J7W4bo https://t.co/DDK6Jocua6 I got to kick this french fry habit 🙈 Yesssss 🙌🏼🙌🏼🙌🏼 https://t.co/HoHPbu8hsV @carolineborghes New things coming.... RT @justjaredjr: .@ashleytisdale stepped out with hubby Christopher French to support JDRF's Imagine Gala &amp; diabetes research\n\nhttps://t.co… 😘😘😘 https://t.co/W3m5a07uUT #PandasInNewYork 🐼 @CBS https://t.co/2Z9QRJV90Y @MileyCyrus I love them! Saturday stretch 🌤 https://t.co/fXfax6HGGM When it’s almost the weekend... https://t.co/kYaCFZR1gM Worth it ✨✨ https://t.co/pQ3pCPTJON @EXPLICITISDALE Coming.... So glad I love it!! https://t.co/sPVU5vvNik Good morning!! Hope everyone has a kickass Wednesday ⚡️💥 My friend @DrKristiFunk just released a new book that will transform your life! https://t.co/T1EOKafmnS #BreastManual @kylienep New stuff in the works! Those are sold out After being away for 6 days I love the weather in LA #cozy RT @JohnOberg: This video will change your life. Never have I seen footage so powerful. All animals suffer and no animal wants to be killed… There’s that window where you’re really craving ice cream, get all excited to go get it and then..it’s like nah I’ll have my water 🤔 #whoami 💋💋💋 https://t.co/KzUAFVrBn4 Don’t take life so seriously. Learn to laugh sometimes. @ATArgentina Been crazy busy with shooting, it will be back soon! @calmixx That’s amazing! @GraceVanderWaal I mean... I listen to it everyday! @magicmikecastle @laurenlapkus @GraceandFrankie OMG I’m so excited! What season?? So I know how fast I have to binge lol @laurenlapkus @GraceandFrankie @magicmikecastle He’s on it??! I’m in love with the show @GraceandFrankie. I’m also in love that’s there’s 5 seasons already  #bingewatching It’s gonna be fun!!! https://t.co/QLALSwSkG6 Happy Easter lovers 🐰 My husband can still walk into a room and I think he’s the hottest guy there.... how did I get so lucky? 😊😊😊 https://t.co/tRDF9Qu4lE Love everything about this! https://t.co/UHD1jgh2pR Thank you!! https://t.co/kJkQXZSAnt 🐼’s In 🏙 https://t.co/FECY6ItOyN So excited to share!!! https://t.co/IKDLjmfRBl Super proud of this movie we produced..here’s a lil sneak peek! Releasing May 22nd @jenkellytisdale @BlondieGirlProd https://t.co/G8p8yRpnuy Morning tweeters!! It’s Monday, let’s get it 💪🏼 RT @MichaelSkolnik: Emma Gonzalez. \n\nThe entire speech. \n\nWatch. All. Of. It. \n\n#MarchForOurLives \n\nhttps://t.co/AK47lWEkAM I have a love/hate relationship with @waze. I’m like “why you gotta do that to me” followed by “aww thanks for getting me here early” The restaurant im at is blasting Billy Joel and I’m loving it. I can’t stop watching @love. It’s SO good! Look back at it. https://t.co/GfVz3td7pj @iamfrench I’ll do it if you pay me! Happy St Patrick’s day ☘️ 🙌🏼🙌🏼🙌🏼 https://t.co/0xdc40iCNx Also thank you to my husband @iamfrench for taking care of me knowing he could be next 😳 90% feeling better.... almost there! Thank you for all your well wishes 💋💋 @ShelbyGibbs No been super sick 😷 My good friend Erin Cummings battled breast cancer this last year and so have many others.Please donate#imagineacure https://t.co/rkovYpXxol Glad to know everyone is safe at the #glendalegalleria RT @annunoonoo: I'm glad no one got hurt. I'm glad it wasn't a mass shooting at the Glendale Galleria and that, in reality, there was no ac… RT @CBSLA: #BREAKING: Police investigating reports of a robbery at the Glendale Galleria, per @MyGlendale. Report of shots fired, no injuri… RT @estenickleby: The shots fired in #Glendale galleria were from SECURITY OFFICER in response to an attempted robbery. Galleria is on lock… There’s a @aplusk movie marathon on tv..... yaaaassss. These comedies are my favorite. 2nd day no voice... any suggestions to battling laryngitis?? This is one of the reasons why I fell in love with him.... https://t.co/6OzVfvn3Jp I just got back to watching @CW_Riverdale (I’ve missed a lot) but WTF Jughead and Veronica kiss??! AND there goes my voice..... #sick Last night was magical ✨✨ Vanity Fair Oscar after party https://t.co/k9YWwRZpNT Ugh I’ve been sick for the past two days with a cold but I am NOT gonna let it get in the way for Oscar Sunday! Pinterest just makes me want to dress better, look better, and be better! @EddieTheActor For real.... Happy Monday!!! Need a show to watch! Pref on Netflix! Suggestions? Does anyone else make the face of an emoji when trying to find it? Or..is that... just me? 😬 Guys I am hosting my girl @sammydroke bridal shower this wknd w/ @shelleybuckner @kimhidalgo &amp; @kimcrossman and I couldn’t be more stressed Sunday mornings should always look like this ☕️ https://t.co/XGwGI9keLV @Tisdale2UK @AshleyJohnny I haven’t posted Bc I don’t like the new change on Snapchat RT @FreddyInSpace: A gunman killed 35 people in Australia back in 1996. Less than 2 weeks later, Australia enacted sweeping gun-control mea… @juniorsdw This is volume 1! You’ve been asking for it so herenit is!!! Thank you for all your support with Music Sessions. 💕💕 https://t.co/Y09zVDsWLq https://t.co/8RlV3KQvYF SURPRISE!!!!! https://t.co/jQKVVn8Vyl RT @TheEllenShow: I can’t stop thinking about it. We should be working to protect our kids. Our voice is our vote. We can vote people in an… RT @TheEllenShow: No words, no actions, no laws are enough until we end this epidemic of school shootings in our country. My heart is with… RT @iamfrench: If you're curious about why it's so hard for us to get our leaders to make any changes to solve the problem of gun violence… RT @CherylHines: Just so you know,@realDonaldTrump - EVERY CHILD &amp; TEACHER feels unsafe at school. Because they are being killed every week… @laurenlapkus @magicmikecastle Lookin good over there you 2 ❤️ Being afraid to go to school is a real thing now. What is that teaching our younger generation?Something has to be done and it starts w/ us RT @ImTiffanyYu: “It has to be authentic.” @ashleytisdale on working with brands #StartupGrind #startupgrind2018 https://t.co/i8MVqDF5Kc RT @ImTiffanyYu: “There are so many times when you want to give up. But you can’t give up. So much of this industry is rejection.” - advice… My forever valentine @iamfrench 💘💘 https://t.co/Mg2mmBH0ui My forever favorite picture of you 2! https://t.co/q3WGiiEMv8 @MileyCyrus This is amazing 😂 @iamfrench Hahaha Having a Carrie Bradshaw moment 🖤 https://t.co/yYD2KW9WnQ I am fully obsessed with Sex and the City.... wow took long enough 🙈 Why is @amyschumer so funny?! I just watched the trailer for her new movie and now I’m too excited to see it. She kills me. I love her. People are so quick to honk their horns recently. Like is everyone just in a shitty mood? I love!! https://t.co/GhuWxs1bFZ Thank YOU!! https://t.co/RvAVshk7o0 ❤️❤️❤️ https://t.co/wxCtCeIqBD This is amazing! https://t.co/ZIhArPQzjS Head to my YouTube channel for a soft Valentine’s Day makeup tutorial 💕💕 https://t.co/x9OeJUD0i7 I’m just gonna do it today! It’s a good one! 1 hour away from #tizzietuesday 💄💄 RT @ArielleKebbel: 🚨 ALERT 🚨 Updated flyer w/ new contact numbers to call if you know anything about my sister Julia. Pls read, repost prin… Wow even with the flu @Pink kills it!! @LaGiarri It’s tomorrow night??!! RT @iamfrench: Hey anybody in LA looking for the perfect best friend? Brody's waiting for ya. Go save his life, and your own. \n\n https://t.… Guys I have an obsession with alfalfa sprouts right now... @hoeIIo It’s a Gucci AC/DC sweatshirt Literally my Minnie... 😊 https://t.co/e9I40KvOLQ Ive been vegetarian for almost two weeks.... and I’m liking it! 💋💋💋 https://t.co/wrPwUB0P0J I just had to kill a 🕷..... and it was terrifying! This is why I do it!! https://t.co/eah4wrfAqy This is on repeat!!! So proud of my husband https://t.co/fBaNedRMqf Last night.... @KeshaRose so proud to be one of your fans. You killed it, I was overwhelmed with emotion. Been trying to open this for 10 minutes. I think the universe doesn’t want me to have this.... https://t.co/EPUBaBCAf4 RT @iamfrench: Hey you guys, be careful - there's a dangerous new virus going around... \n\nProtect you system. \n\n#ZeroDays https://t.co/QUcn… Last night at the Steven Tyler Grammy Viewing party ✨✨✨ https://t.co/LymT7uN7k5 I was lightning, before the thunder. https://t.co/AQrOY7UzDo Friday let’s do this!! Now how am I supposed to go to sleep??! @iamfrench Please put something funny on! 😢😢 #ThisIsUs Also I feel like I want to stop by Rise Movement just to make sure @MiloVentimiglia is really just acting and he’s perfectly fine 😭 Just watched last nights @NBCThisisUs. Thanks for making me ball my eyes out 😭 Ally my favorite beauty products in one pic! https://t.co/utsLbNDrQz Yaaaasss https://t.co/0qXFCrsbTt You asked the question and I answered! Check out an all new #tizzietuesday https://t.co/akjpUmBvLq https://t.co/GXpQbKLvyj Thanks girl!! https://t.co/ieg4EhryJ0 Less than an hour away for an all new #tizzietuesday 🎉🎉🎉🎉 Going live on my app! If you haven’t downloaded it, get it here: https://t.co/VYxy96XisZ @EXPLICITISDALE Yes! Head to my app tonight and I’ll explain why lol Monday let’s do THIS!! @KarissaMotoyosh @iamfrench He’s pretty handsome! I love her! Thanks for sharing your poem and inspiring so many 🙌🏼 https://t.co/1IP4VOO1Vu Even Maui knows what’s up! https://t.co/47dXwuqYIx Morning!! Friday Let’s do this👊🏼 @ThePerezHilton Try it in the morning before coffee! There are some good apps to help guide your meditation From no sleep I am a certified zombie! Also I’m so sore from my work out yesterday that I look like I’m starring in the walking dead This morning when I couldn’t sleep I had @katyperry song “Wide Awake” playing on repeat in my head 😂 How am I awake right now?!! Wow I slept in till 10am!! That hasn’t happen In like FOREVER 8 million 👀 last night on @MacGyverCBS!! Thanks for watching my episode you guys💋💋💋 https://t.co/ZjMbQfdryR Find out tonight!!! https://t.co/rGgy1vPcUI Points for your Husband!! https://t.co/QM1NwX6eFG Me thinking about pizza after being on this detox diet 🍕🍕 https://t.co/S1irqUr0sk Awwww you think I’m smart 🤓😝 https://t.co/umEicbRkRJ RT @OfficialTCA: The sisters who work together... #DaphneAndVelma is produced by @ashleytisdale and Jennifer Tisdale. Their @BlondieGirlPro… RT @thesurfreport: .@ashleytisdale is a producer on #DaphneandVelma with her sister Jennifer - their companie Blondie Productions has all-f… RT @MacGyverCBS: How will Mac stop an out of control robotic combat vehicle that is headed to destroy The Pentagon? @AshleyTisdale guest st… 1 hour for an all new #tizzietuesday 🎉🎉🎉 @EXPLICITISDALE It’s gonna be open to everyone, tomorrow it will be fixed. No subscription! @mulderscullay Tomorrow that will be fixed! No subscriptions ✖️ @swiftysince89 No restrictions! @UnbrokenFate You know what I don’t like the idea of the subscription so I’m taking that off! Thanks babe https://t.co/7yNSq1XPZQ Yes girl!! https://t.co/1hSO59uivj 💋💋💋 https://t.co/NXbeORn1Bv Work it 👏🏼 #Goldenglobes2018 https://t.co/qYgyt4DMWu Please donate here to the #TIMESUP  legal defense fund. It’s so important! We have to stand up together!! https://t.co/I8yKesdyIt https://t.co/rqkbrCBb02 Shooting some exciting content... can’t wait to share my surprise on Monday!! Glad you love it! https://t.co/9fBDCN0Mw2 Starting a detox diet tomorrow... so I had Thai food for dinner lol I have to say @MargotRobbie was absolutely amazing in @ITonyaMovie. Seeing her do something different from what she’s done was inspiring 🙌🏼 #TIMESUP https://t.co/IAnFjHVqNA U look good!! https://t.co/v20AfMCc47 5 years later @MammothMountain #teamgoodtime https://t.co/DMXsO0BCkF Love!! https://t.co/JRgv47c7PA 💋💋💋 https://t.co/K1UIvluF9B Happy New Year! New year new chance to grow, challenge yourself, reach for your dreams and know that ANYTHING is possible! Love you all 💋 https://t.co/tRSXNdH7kW Uh huh 🍯 https://t.co/tnRN8oqoPE 🙌🏼🙌🏼🙌🏼 https://t.co/nwcq09zp5x Good way to start the new year! Thanks girl! https://t.co/bvNAmKyObi Guys I’m in that grey area with my workouts.... like I COULD go workout today but it’s still vaca SO..... maybe next year? Could she be any cuter??! https://t.co/p9xCVlXfG6 Thanks girl!! https://t.co/UZhg3WlK65 New Year’s Eve ready with this makeup! Head to my channel to check out how to achieve my look 🥂https://t.co/qJv3pyT7BI https://t.co/HN6ry0VGzd I was super excited how it turned out!! https://t.co/3sfsO0H9c3 MERRY CHRISTMAS!!! I hope you have the best day 💋🎁🎅🏽 https://t.co/SUMPK6zc58 Merry Christmas Eve!!! https://t.co/OODgnpTPxN Wearing the new Liquid Lipstick color in Tokyo #illuminatebyashley https://t.co/Zk9m3EV9BM Christmas came early!! Get the new colors Tokyo, Paris, and NYC #illuminatebyashley https://t.co/Pre3ku2jwx https://t.co/pSZROac5wH Love love love https://t.co/GZOUFaC3pl 💋💋💋 https://t.co/v26TgeRca5 It’s so dark and grey in LA... I love it 🌨🌨 IM convinced as well lol https://t.co/mbTOnNH1vJ Brand new #TizzieTuesday is now LIVE on my YouTube channel! I love the Holidays, and with all the Holiday festivities coming up, I thought I’d share one of my favorite Holiday makeup looks with you! Hope you enjoy it &gt;&gt; https://t.co/p93fsysEiD https://t.co/MBKmNmIeBP New #TizzieTuesday up on my YouTube channel in 1 hr!!! Here’s a hint of what to expect on this week’s video: 🎄🎅🏻💄 Just want to give a shoutout to all the Firefighters this Christmas. Thanks for keeping us all safe, we’re all so grateful for you in Cali! The barista at my coffee shop always puts a “little love” in my cup. It really starts your day off with a smile Last night with you was magical✨ https://t.co/kVlzkBq4M2 My @VanessaHudgens birthday is today! I love you so much. V A 4 life https://t.co/ndwZFiJ5eb Someone’s playing games 🧐 H A I R https://t.co/Cclzo5T7cf Yay Alabama!!! https://t.co/TzhrKAGW5Q I literally kicked my own ass at the gym last night! Thanks to my trainer @antaresbrown in Atlanta sending me some awesome workouts in LA 💪🏼 Tonight’s plans look like this 🛀 https://t.co/UPf8MNiwKW https://t.co/qDA5UWsXdv https://t.co/U3WAws032s When you’re like I’m gonna eat healthy.... then you have thai food for dinner 😬 RT @iamfrench: My thoughts are with everyone effected by these fires around Cali - please make sure you take your pets if you have to evacu… I love me some clip ins💕@justinemarjan @TheHairShopInc https://t.co/hLTyikgdSp I'm getting ready to film an #AshleyAnswers for my YouTube Channel! Tweet me your questions with the hashtag #AshleyAnswers 😊😊😊 TONIGHT! Watch me rap battle my teenage crush @NickLachey on #DropTheMic, 10:30PM on TBS! @DropTheMicTBS https://t.co/Rh2MTRXgCw This week’s #TizzieTuesday I’m sharing one of my favorite secrets at @DENmeditation. I love to meditate every morning to help me feel centered, so I wanted to share with you how you can meditate at home with the help from my friend @jamiewozny🙏🏼 https://t.co/tCGknD6hBM https://t.co/vvu92hG134 🙌🏼🙌🏼 https://t.co/1yGBPkTYjX Thank you 💋 https://t.co/lMcJJd9NX0 💕💕💕 https://t.co/59FCfUhnnJ This means so much to me, I totally believe in meditation! Let me know how if it works for you! https://t.co/8SFDFicDES Brand new #TizzieTuesday up on my Youtube channel in 1 hr!!! My favorite show The Great Christmas Light Fight is back on tv!! The holidays have officially started 🎄🎁🎅✨ When you know mercury has gone retrograde😬 https://t.co/DGa5ckSxHj This Christmas....#thoushaltspend https://t.co/W8mDteR3Fk Cool ride🤘🏻 https://t.co/Nhd1XMzwvi This is everything to me 💕💕 https://t.co/14BkFR29iV This makes me so happy!! https://t.co/3FoWWOdBXB Get ready! Had to battle it out with my teenage crush @NickLachey 💔 https://t.co/EtnuJH4Yqy Santa cutie, there’s only one thing I really do need.....#Chanel https://t.co/fBNqpMlXOl 🖤 https://t.co/23eQXG6ueE Such cuties 💕💕💕 https://t.co/xJudromYa8 BOOM 💥 we busy @BlondieGirlProd 😍😍😍 https://t.co/LV6xpp2VcJ Finally worked out after three weeks and it felt..... horrible 😝 I. Can’t. Stop. Eating. Carbs 🙈 I don’t think I could love @bejohnce more. The only person that literally makes me laugh till I cry. #SearchParty Illuminate me ✨✨✨ #illuminatebyashley https://t.co/LsLIGctbcu https://t.co/Hl7rJHGsuQ Happy thanksgiving 🍁 I’m so grateful for so many things this year. Including all of you!! Hope you guys have the best thanksgiving ❤️❤️❤️ Ha! My favorite one 2 😜 https://t.co/z2Uq4K8hJn RT @jenkellytisdale: Please click and call today!!!! Protect our rights to the internet!!! #callcongressnow #NetNeutraility  https://t.co/k… When it’s almost thanksgiving and you get sick with a cold, because apparently the universe wants you to share it with your whole family 😕 It's Tuesday, so you know what that means...ALL NEW #TizzieTuesday going up on my YouTube channel in 1hr!! This week is a #GRWM with a very special guest, can you guess who?!?🤔🤔🤔 Monday’s mood. #MarilynMonroe https://t.co/xyysubMV2P @patrickstarrr I still haven’t made them 🙈 Getting ready for the holidays around here 😊 https://t.co/HsmbUq6RFB SO good!! https://t.co/Tmh04GXiLh Please sign!! https://t.co/ePpTtA0x3M When you are up at 5am because you’re on east coast time... you watch @Bravotv and look at thanksgiving recipes Spread more love. Make someone laugh, make someone smile, be good to each other, help someone out. It feels good❤️ https://t.co/LY6gc3bqrJ Can’t wait to see this lil pup tomorrow💕💕 Miss my Maui https://t.co/mElqNjogNc This is horrible! https://t.co/YLQYnMzahG @sheeelbyb @patrickstarrr SOON!! @alyandajtunes Check out my YouTube tutorials! Girl you’re the best https://t.co/YopFArL7Rz LA I️’m comin for you ☀️☀️ https://t.co/wei8wyCt8n ❤️❤️❤️ https://t.co/uVXHLVNEDj Yesssss https://t.co/ogynXnqc3r True story! https://t.co/Gb7Wy0qr8D Australia knows what’s up! 🙌🏼🙌🏼#MarriageEquality. Where there is love there is life. - Mahatma Gandhi @JessicaRhoades @CBS @Variety @BlondieGirlProd @jenkellytisdale Thanks Jess!! 🙌🏼🙌🏼 https://t.co/2xaI0xZMed I love My @DebbyRyan https://t.co/7K9PspkvbV Yaaas!!! Thanks @CBS for believing in this project as much as we do!! @Variety @BlondieGirlProd https://t.co/jW9dZws84a 🎱🎱🎱 https://t.co/axFW5MbweE Morning tweeters!! It’s a new week, get it 👊🏼 Rainy day in Atlanta and I love it 🌧 Can we just stay in? https://t.co/MPC7A7vo10 Missing these 2..... https://t.co/Btn5YitVIA It’s SO hard to eat healthy in Atlanta. All the food is SO yummy 🍳🍟🥘🥓🍯🍞 His arm is covered in cherry blossoms, stole my heart and I let him keep it. https://t.co/sNJPXVtOZo It’s so cold and rainy in Atlanta, I love it!! @MehreeMakeup It’s #illuminatebyashley liquid lipstick in Miami! Finally get to do my dream role.... C.I.A agent 👊🏼🙌🏼💪🏼 https://t.co/pPsDnDQ1ap Look who joined the party!! Having fun on set with @lucastill and @JustinHires @MacGyverCBS https://t.co/uhm3GneBN2 RT @JoeBiden: A resounding defeat tonight for President Trump. Voters around the country rejected the ugly politics we have seen this past… If only you saw the shower cap I was wearing😂 https://t.co/gaHKDO0VNs Hahaha that’s Me 2!! Gettin lost at the airport trying to find baggage claim 😖 https://t.co/BS7Xo6cB5O @DanPovenmire WHAT is happening??!! I’m so happy to be back in Atlanta, one of my favorite places 😊 with my favorite food! Can’t wait to share what I’m working on! New #TizzieTuesday going up on my YouTube Channel in 1 hour!! This week is a reaction video, but can you guess what I’m reacting to?🤔 My ❤️ hurts for the families, the children.We HAVE to start changing things,we can’t keep letting this happen thinking we can’t do anything Whenever there’s a mass shooting I look at every picture of the lives we lost.It’s my way of honoring them and not just making them a number RT @katyperry: prayer without action is powerless Trying to decide what to wear tonight....🤔🙄 https://t.co/lm8OQJHdcu DYING 😭😭😭 https://t.co/ZW64OCN1nC Good morning!!! Happy Saturday I love playing with makeup💄 Rocking #illuminatecosmetics cluster lashes and liquid lipstick in Miami💋#illuminatebyashley https://t.co/tYE3RlIWhX So wait, Halloween’s over??😭😭 https://t.co/fxireJNfj0 You can thank @iamfrench for that! https://t.co/BoyVQmh5vG Hey guys today there is no #TizzieTuesday! Been pretty busy this week but can’t wait to tell you guys the exciting news!! Who’s ready for Halloween tomorrow? I am!!🙋🏼 https://t.co/05BzwBYraq Last night. My favorite costume so far! https://t.co/IhOi3NxpVL My old closet in my first house. Can’t wait to build my new dream closet...that doesn’t have a huge picture of me😂 https://t.co/LTUuuKBFDY Shine bright like a diamond. https://t.co/14devoiJYg In LA we wear jackets like this. Because it’s too damn hot to put it fully on🙄 https://t.co/Hx0Xrt5VtA Love this!! https://t.co/LEcrWSMuFJ The time is now. Do what you love and love what you do. https://t.co/01yywJTEUE Find your light 💡 https://t.co/Rw8IcKJrHc Watching @ddlovato in Simply Complicated. You’re strength and talent is inspiring. I have always known how beautiful u truly are Haha yea tired &amp; HOT! https://t.co/j4z0E1ZKce “I have nothing to wear” 😂😂 https://t.co/LAvDvUUdeY Had a blast recording #TheSkinnyConfidential Him and Her podcast w/ @laurynevarts and @MichaelBosstick! Listen here: https://t.co/zwz5fO2ZAt https://t.co/li0E8d302X 😁😁 https://t.co/tPgWQQrlgO Ur welcome! https://t.co/MeaRYQdhAi 💪🏼💪🏼 https://t.co/Z0OaRrlK2w All New #TizzieTuesday is LIVE on my YouTube channel! Click here to learn how to get the best workout at home!💪🏻 https://t.co/U0ZTR96hP1 https://t.co/DwHrUSgHPp Almost time for an all new #TizzieTuesday!! 1 hr til it’s up on my YouTube Channel! Here’s a hint on what to expect this week:🏋🏻‍♀️🏃🏻‍♀️💪🏻 YES! Number 1 fan right here! https://t.co/hHTPZXJzdx It’s @TheWalkingDead DAY!!! 💀💀💀 Last night I don’t think we could be more scared 👻 💀 🎃 https://t.co/zDZwvRnhha Success isn’t just about what you accomplish in your life, it’s about what you INSPIRE others to do🙌🏻 https://t.co/rqkwmyhZi8 Never not working. Is it the weekend yet? https://t.co/ONABqJX75m Can someone just teleport me here for the weekend? Thanks. Byyyeeee! https://t.co/XNcASgLwoC @ThePhillLewis @colesprouse @dylansprouse 😂😂😂 Met up with my girl @belindapop 💥come back soon!! https://t.co/9aWLsyEZ8Q Thanks girl! https://t.co/fJ7GAfPJAe You are exactly where you need to be right now. https://t.co/ndubpXlsZ5 Trying to pull a Britney💥#denimondenim https://t.co/Xd9dqsnwVW @BRTisdale When they are ready! 💋💋💋 https://t.co/ykcKWyCJgm @xTwumzie @patrickstarrr He's pretty awesome! 😂😂😂 https://t.co/XAip4Lfz6t Thanks!! https://t.co/Sj1OkhLndK 💋💋💋 https://t.co/y6U74XjtfR Thank you!! https://t.co/MNCnGumUtG Way too much fun!! https://t.co/9Zabe9pBlo New #TizzieTuesday is LIVE! Shout out to @patrickstarrr for making me look FAB for Fall. Check it out! https://t.co/I9Lbc9OiHi https://t.co/EGScTA3vvt 😂😂😂 https://t.co/FFue0BaK8L 😂😂 https://t.co/YwdCJrKBNL Thank you!! https://t.co/TCdf2q3sqM 😊😊😊 https://t.co/m7mE0qs4w2 @TeamTisdaleFR Uploading! All new #TizzieTuesday with a very special guest going up on my YouTube channel in 1 HR!!💥💥💥 I’ll be right back, I gotta catch this ride✌🏻 https://t.co/l4BtSG7884 Can the athleisure trend never go out of style? I love it too much🙏🏻😝 https://t.co/nuHqCgXqAu I want THAT one 👇🏼 https://t.co/Lq3yJxraYG Ok so we are in the middle of October and I still haven't gotten pumpkins yet 🎃🎃🎃 determined to get pumpkins this weekend! 🙌🏼 https://t.co/itgnp3RRt8 Geez @macklemore and @KeshaRose KILL it with that song Good Old Days I’m just gonna pretend it’s Fall weather🍂🍂🍂 https://t.co/MKAyxoJJDi RT @Skylanders: Ready for trick-or-treating?! Everyone's favorite evil genius Kaos is here to share\nsome #Halloween safety tips!  https://t… I want to be around... https://t.co/V1JAgJFJG0 Food. Bed. @CW_Riverdale #happygirl Feeling chic AF with my new little haircut💇🏼 https://t.co/bd1d87gadS Just trying to get it together😝 https://t.co/tlvWK3z6Qw ✌🏻Favorite things. Tag that friend that lives to sleep and eat😝 https://t.co/rqFienq4PU No never met him, only talked on the phone. However I was told to never be alone in a room with him. Glad people are finally speaking out https://t.co/9fFfgHKkup Hey guys sorry No #TizzieTuesday today. Been crazy busy but next week there will be one 👍🏼 Need that coffee fix ☕️☕️☕️ https://t.co/3lB0ctNI2i I’ll just be right here with my coffee👌🏻 https://t.co/GI4ZBjOcgn You're hanging with Stealth Elf tonight, right? #SkylandersAcademy Season 2 premieres on @Netflix today! @Skylanders https://t.co/1hlmeh0xBU I am so ready for the weekend!! 💥💥💥 Love!! https://t.co/ORTY4pHj5O 🙌🏼🙌🏼🙌🏼 https://t.co/TOHDGiTcoN Yay!! https://t.co/YD0RHVhsgp 💋💋 https://t.co/TPFvhc7jmu Good morning La✌🏼 https://t.co/6mWww5Nost Yay!! https://t.co/08EaGDPSiH I had way too much fun with @patrickstarrr today 😝😊😂 💋💋 https://t.co/RXAzw1SvMT 🙌🏼🙌🏼 https://t.co/R9NK28LbYe Too cool for ______. #FinishThisCaption https://t.co/HzidaV4s0p RT @Skylanders: Happy Birthday @SusanSarandon. We hope your day is Golden! #SkylandersAcademy https://t.co/mRDE5hprnO https://t.co/qZbRencO… I know now lol https://t.co/qQplV7NxLU RT @MTV: ✨ @AshleyTisdale puts an acoustic spin on \"Cool Kids\" with the help of @Echosmith's @sydneysierota: https://t.co/Gor0cgvZ4P https:… When you’re half Summer/half Fall. #LA https://t.co/jb7jOOKZcY I love this!! https://t.co/6AvAL3VtM4 😊😊😊 https://t.co/p1eHRuZlW9 New Music Sessions with the lovely @sydneysierota of @echosmith up on my YouTube channel now! Check it out &gt;&gt; https://t.co/BgiHpeOlzC https://t.co/UTvdYPdSHB 🙌🏼🙌🏼 https://t.co/ZS3n8is49O 😊😊😊 https://t.co/Hu2Uck5NSR @EXPLICITISDALE @LouisVuitton 👍🏼👍🏼👍🏼 https://t.co/hrVwxTHuyC Thank you!! https://t.co/HnUqP17wlP 😍😍😍 https://t.co/tNJAgAJTyw Thank you!! https://t.co/8vBnwklH10 💋💋💋 top is @FreePeople https://t.co/qxibRuH9KU 1 hour away from a brand new Music Sessions on my YouTube channel ✨✨✨With a very special guest, who do you think it is?!🤔#TizzieTuesday @x_KARLY_x Yes but that's so lazy. Why not TRY something different, obviously what we're doing now is not working. Also look at Australia and their gun laws. They seem to be doing something right! @x_KARLY_x Do we drive around in military trucks and get into accidents? If so I think people would then blame the car that person was drunk driving in These people are our friends, neighbors, mothers, fathers, sisters, brothers....WAKE UP America #PolicyChangeForAmerica https://t.co/OCaF9UiOqT I don't want to react anymore I want to respond. #guncontrol RT @BenSPLATT: #guncontrol #guncontrol #guncontrol #guncontrol #guncontrol #guncontrol #guncontrol #guncontrol #guncontrol https://t.co/XEV… RT @CityOfLasVegas: How to help and find loved ones. Please share #PrayforLasVegas https://t.co/v0xaV3SAIm RT @LVMPD: If you would like to donate blood for the injured victims of the Strip shooting visit the Labor Health &amp; Welfare Clinic, 7135 W.… Heartbroken. Can't believe we live in a time where going to a concert isn't safe anymore.My thoughts &amp; prayers go out to the victims family Couldn't have said it better myself 🙌🏼👍🏼👊🏼 https://t.co/sL9EQhcfZN I'm so excited for scary movie month 👻🎃🤡 October 1st, here we go.... (I will now take my seat hiding behind @iamfrench) Peek a boo https://t.co/DRmfUuh2py Someone’s ready for Halloween 👻 https://t.co/0t17lGKoy0 RT @rihanna: Dear @realDonaldTrump I know you've probably already seen this, but I just wanted to make sure! \nDon't let your people die lik… Feeling blessed and grateful 🙏🏻🙌🏻💥 https://t.co/EbOU6Djrcn 💋💋💋 https://t.co/RMkmjoLzaX @ItsAshSpicer Had to be the close out page! @dopey1234hc Has to be the close out page! It's because of you guys I get to do what I love to do 💋 so thank you For everyone who shows a proof of purchase of a Matte Liquid Lipstick from Illuminate I will follow you!https://t.co/Pre3ku2jwx 💋💋 Tinker bell haha https://t.co/tKp1ZcLlOP YES!! https://t.co/9daG0btkYn 🙌🏼🙌🏼 https://t.co/nokmZeasXk THEY ARE HERE!! The Illuminate Matte Liquid Lipsticks💄Miami, London, and Milan. $6.99!! Get yours here&gt;&gt; https://t.co/5Tqa4lj6GK https://t.co/gaEJsUSw7R 💋💋💋 https://t.co/zXGSwxgr7z Im LIVE on my Facebook page!!🙌🏻🙌🏻Showing you the new Illuminate matte liquid lipsticks! JOIN ME💄💋💋 https://t.co/7zmhJbFGT1 💋💋💋 https://t.co/VxliSWEFWf 😍😍 https://t.co/Qt6jUVH3Hn That's Milan! https://t.co/AZhzf2A3Kn Sharpay would def want these! https://t.co/d1pJnAJn2i Thank you!! https://t.co/tNrFd3Ziso Woo hoo!! https://t.co/1rrCB95NX2 Pretty much all of them. Milan tho is my favorite nude https://t.co/47vL8rqZLQ Who said these are the only three 😜 https://t.co/57EGBm0HYu Made just for you guys! https://t.co/7nogguRzZ6 Yeeeesss https://t.co/oBQCeqQYmg 😊 https://t.co/egnAb2Y8kb 🙌🏼🙌🏼🙌🏼 https://t.co/ZOmTS7ptXC They have ARRIVED!! My Matte Liquid lipsticks 💄Miami, London, and Milan! $6.99 https://t.co/Pre3ku2jwx https://t.co/v91RowW2Eo Be humble, sit down. https://t.co/eomtssICvl Don’t forget to join for a Q&amp;A and a peek at the new Illuminate liquid lipsticks - TOMORROW, 10AM PST Live on my Facebook💄💄💋 https://t.co/6Km5toOMA6 @emilypizzaswift Same 🙄 it's a blessing and a curse lol @kevinkatovic 10AM PST😊😊🙈 Dreaming of London💫 https://t.co/cmPTm3ybCa Coming Friday!!! 🙌🏼🙌🏼🙌🏼 #IlluminateByAshley https://t.co/y6dXge2WJ8 Girlboss. https://t.co/s0NA2ysRsY I’m going LIVE on my Facebook page this Friday at 10AM to celebrate the new Illuminate matte liquid lipsticks!! Join me!🤗💄💋 Thanks girl! https://t.co/9jNkzi9h1c 🙌🏼🙌🏼🙌🏼 https://t.co/pDVnpmt99x 💥💥💥 https://t.co/gcG2Y4hbcU Yay!!! https://t.co/hfjjkRfVn6 😝😝😝 https://t.co/N7y4YGmlWe Perfect nude! https://t.co/tChffViFEh 🙌🏼🙌🏼🙌🏼 https://t.co/BNWoK6EyAa U might have to get all three! https://t.co/pOnVrnzpu2 😀😀😀 https://t.co/D7AzxeJ2P5 Matte liquid lipsticks comin at ya on Friday💄💄💄(left to right; Miami, Milan, and London) best part? They’re only $6.99!! #illuminateyourself https://t.co/i5porsiXcl @DebbyRyan This tweet makes me miss YOU!! Please donate! https://t.co/iDqNU49OZy Watched the sunrise this morning. There's something about being up early when it's calm and quiet. So grateful for all my blessings 😊 Holy shit! @NBCThisisUs is on tonight!!! Everyone knows I’m a huge workout fan! So I’m sharing my looks that get me motivated to get to the gym. Check it out https://t.co/BzPGL1RNOS https://t.co/rmKNrZkBEs 1 hour away from an all new #TizzieTuesday 💥💥💥https://t.co/eDxcVTXWlB RT @Joanelix: @aimeecarrero please share! https://t.co/Y35TQMo3pY 🌵 https://t.co/bWYNzu3KHm @MathyDreamy Soon to come 😍😍😍 https://t.co/x93hsVPnZB Yup! More to come! https://t.co/C7jg3nCzyL 💥💥💥 https://t.co/TdRQQf6Iq8 😘😘😘 https://t.co/McmRbrEJLX 🙌🏼🙌🏼 https://t.co/WgQGwnymuP 😊😊😊 https://t.co/08EWoRFI6I Exactly me: https://t.co/w7GHlmqgO3 I gotchu! https://t.co/OAijkNezVT This Friday!! https://t.co/WPKzQLud5v 💄💄💄 https://t.co/RgjFZXwqoJ 🙌🏼🙌🏼🙌🏼 https://t.co/YiErXCOWMP Sneak peak! Every1 knows I love to workout! Stay tuned for a new #tizzietuesday lookbook 💪🏼 https://t.co/MnRUP6z06E https://t.co/KOeuLDe2fR Sleepover with my niece last night feels like I partied at the club all night but dont have a hangover. It's just pure exhaustion. 😴 😸 https://t.co/dJuoE959ZK 😎 https://t.co/4qAFzim9pw True story 😂 https://t.co/28KyjgBVnJ About last night...😝😋😇 https://t.co/FJZBbsvksv Spread love in the world 🌎 ❤️ we all need it right now Thank you!! https://t.co/geD1ZkWay2 💁🏻 https://t.co/AliXIlJjyg You're in my thoughts #MexicoCity one of my favorite places when we toured with HSM 💔💔💔 Look up, get some perspective 👍🏼 https://t.co/jM22qwI02V Love everything about this! https://t.co/0p3GHIGv34 🙌🏼🙌🏼🙌🏼 https://t.co/ygwjXdGQ8l Thanks girl!! https://t.co/HJDa9cokd8 💋💋💋 https://t.co/NIoYdzBcSF ❤️❤️❤️ https://t.co/9Ew9OBeC7M Thank you!! https://t.co/arZPcELANk Hey guys!! Check out my no makeup/makeup look on my channel now! https://t.co/H7CEEYpWMR https://t.co/qy4CYTdH9J 🙌🏼🙌🏼 https://t.co/wLJfbYalPu Ok I'm awake. Just felt that #earthquake You can do it! Monday motivation👊🏼 https://t.co/bLzpVdPI7o @cody_landman I know! Why were they cutting everyone off so quickly?? The speeches were on point tonight! So inspiring and excited for Elizabeth Moss, Nicole, Reese and Sterling K Brown 🙌🏼🙌🏼🙌🏼 Sunday I be like.... https://t.co/zZ8dGIH5ko 💛 https://t.co/Ik9wOfUzV0 💀💀💀 https://t.co/xSxjWOJIOx Just saw a llama and a dog in a carriage at Runyon #LA 🤔 @EXPLICITISDALE For the right project I will! @EXPLICITISDALE Growing out my own hair 😊 and of course I'll use clip ins but extensions are so damaging on the hair as well @imHipHopSucka I don't 😂 my hair is so much healthier! And I don't need extensions anymore! 🙌🏼 👅 https://t.co/UYNDm0Ux5I Thursday thoughts; get up, get ready and let's do this! 💥👊🏼 https://t.co/Oq9mw0FTOj Just watched a live taping of my favorite show... that's coming back... @WillAndGrace. One word EPIC!! Your favorite ninja is back!! Stealth Elf and the rest of the #Skylanders crew returns to Netflix on October 6 for Season 2!💥💥💥 https://t.co/0ot1EDxDxM You're the sweetest https://t.co/MhG7sDESRw Yay!! https://t.co/ijuWGrTru7 🙌🏼🙌🏼🙌🏼 https://t.co/b6sTO5Z0bx Pampering my assistant for the day! Check out her mini makeover up on my channel now! https://t.co/yTOfmxscYZ 2 hours away for a all new #TizzieTuesday 👌🏼 https://t.co/JbQu4yUpMf Gotta get that coffee fix ☕️ https://t.co/7iboOvZPA4 Never forget #September11 https://t.co/xpb4AXPCt0 🙌🏼🙌🏼🙌🏼 https://t.co/SJjGf3JiAD RT @BiologistDan: Animal Rescue in Tampa has already had to save 50 dogs tethered to trees before #HurrcaneIrma. Please take your pets with… RT @AutiaI: #HurrcaneIrma \n\nSAVE YOUR PETS\nSAVE YOUR PETS\nSAVE YOUR PETS\nSAVE YOUR PETS\nSAVE YOUR PETS\nSAVE YOUR PETS\nSAVE YOUR PETS\nSAVE Y… PLEASE if you see an animal. Grab them and help them. This is so heartbreaking https://t.co/TKLfIIvojh Until next time...🤘🏼 https://t.co/VZIqvkMAG5 Praying my family and everyone stays safe in Florida. Hey babe, let's take a walk on the bright side ☀️🌊☀️ https://t.co/3wHwbMURSs RT @WilDonnelly: Mexico immediately offered to send aid to Texas after Harvey. Trump hasn't even acknowledged that Mexico's deadly earthqua… Weekend getaway 🌊 https://t.co/hcVZqrODCB @PattiMurin @iamfrench Awww I love that song!! Praying for everyone in Florida. Stay safe #hurricaneirma \"Tell the world that we finally got it all right\" Thank you @iamfrench for choosing me because I would choose you over and over again. https://t.co/NmuyB9prif Moments before... https://t.co/NRJVuFqEEw 3 years ago... https://t.co/G9iiTcCTH0 I'm dying!! @RWitherspoon just tweeted me. Best. Day. Ever. https://t.co/FFwMrRuHnW Yaaaaass girl @RWitherspoon The OG 🔥🔥🔥 https://t.co/ZEc0caREQl When Waze takes you to downtown but you're supposed to be in Santa Monica 🙄 Sshhh... sneak peek. #illuminatebyashley https://t.co/LWlIAnIioJ @lovepaulstefan You can! Love that idea! https://t.co/AQHu3URukJ @ThePerezHilton What about night time? 😊 If you haven't yet check out my all new Music Session up on my channel now! You don't wanna miss it 😜https://t.co/BjkznQh522 https://t.co/Yqd1ISHvUW Thanks guys 💋💋💋 https://t.co/Doka9XSmjy 🙈🙈 https://t.co/DrljPIqUKd ❤️🖤❤️ https://t.co/4tkfBEAsbD Thanks!! https://t.co/1WeVNwBj27 😊😊😊 https://t.co/5tzcxz3Of0 RT @biebertisdale: @alessiacara @Zedd Check out this cover from @ashleytisdale &amp; @iamfrench! Its so beautiful and amazing and perfect!! htt… Thank you!! https://t.co/UcQ1PdbhC6 ❤️❤️❤️ https://t.co/uLvK08qj6H One hour away from an all new #TizzieTuesday 🎶🎶 Oh the feels! This week is my favorite week and I'm sure you guys know why. So tomorrow is a very SPECIAL #tizzietuesday 🎶🎶🎶 Words I live by 🙌🏼 https://t.co/i0CHCvFSnl Saturday's. https://t.co/U7TwIwYs91 😊😊😊 https://t.co/d3fDj5XVnn Yes yes yes yes!! https://t.co/3hsXZnPrER @fancypantsjulia @corbinbleu Gold skinny jeans! Especially because I had to wear them in the summer heat  😂 What’s your go-to: @laurenlapkus What if you hold the phone NEXT to ur face? Guys the weather.. it's scaring me 😵 💋❤️💋 https://t.co/Wyvo9mF5es 👍🏼👍🏼 https://t.co/vPUIRjreW7 💋 https://t.co/TpDHm6k8Xg Can't buy my love. https://t.co/aOEpJakDZ1 🙌🏼🙌🏼🙌🏼 https://t.co/degn63dZVD @fleurxvissers #illuminatebyashley 😉 @spidermans Yea what is that? I was saying that the picture was heartbreaking and if you can donate to https://t.co/bz1lsW642s the animals need our help She took the leap and built her wings on the way down. https://t.co/mPYnXvRZEU 🙌🏼🙌🏼🙌🏼 https://t.co/OKpZPhCvBa Wow! This is amazing! https://t.co/z27UlWqppG RT @KamalaHarris: When times are tough, we stand together and united. Every little bit matters. \nhttps://t.co/pkDjBbMT2b There's a giveaway! Up on my insta! Check it out! 💥💄😝😊💋🙌🏼 Unboxing lots of new goodies from fashion to beauty products today on #TizzieTuesday. Tweet at me to let me know your favorite products! ✨ https://t.co/Wrqh5e3XtF Please donate if you can. Seeing all the images of #HurricaineHarvey is so heartbreaking. https://t.co/KLQM84IYpZ or call 1-800-435-7699 xx RT @gimmemotalk: Thoughts &amp; prayers are with Texas!! 😔🙏🏾 Please share these emergency numbers. https://t.co/WssqKDVOid Ok everyone knows how much I love @Pink, and her doing all my favorite songs topped the night for me!! HOLY SHIT 🙌🏼🙌🏼🙌🏼 @drewseph17 @ddlovato Well it's awesome to see your friends killing it 💥 The fans in the @ddlovato performance are amazing!! Makes me want to be there in that pool! 🌊 I would have loved to see @imjmichaels full performance 😤 Also I f*cking love @MileyCyrus ❤️she killed it! @TwistyTetra Sooo you're saying I cant appreciate a music video? You're also assuming I was talking about Taylor in those tweets. I made clear I wasn't @fategalvezz Like I said. I wasn't talking about ONE particular person I was saying music in general. RT @PattiMurin: Prayers are great, but what Texas needs right now is money and resources. To start, text HARVEY to 90999 to instantly donat… Praying for everyone affected by #HurricanHarvey. Stay safe xx RT @HoustonDSA: We are working on providing aid to those affected by #Harvey.\n \nIf you wish to donate, please go to https://t.co/CMsOmSz78F… You guys @ddlovato KILLED it last night. Such a beautiful person with such a beautiful voice! My heart ❤️❤️❤️#HappyNationalDogDay https://t.co/bB0Y7VSv7t @Starr4ever143 I can promise you that's not what this tweet is about @Blizz_rhymz But when that artist is purely making it about themselves how are we supposed to relate? @Blizz_rhymz About another artist it completely takes me out of that. If I'm goin g through issues I want to feel like that artist understands... @Blizz_rhymz It doesn't have to be. When I listen to music it helps me with whatever I'm going through but if I'm listening to a song that I know is Love this pic!! https://t.co/5fwj9cSTGr 🙌🏼🙌🏼🙌🏼 https://t.co/6yl6i1PFnv So beautiful 💋 https://t.co/aN8zfsrPrt Need to start a new series.. What should I watch? Me getting ready this morning 💥 https://t.co/7yeH4yVr99 Sorry for making you guys cry! Just wanted to give a shout out to whoever made it! It's funny how someone was able to cut up our work and put it together! Give props to whoever created it! https://t.co/Y2N3Zldyhq I need some suggestions for music sessions! What do u guys wanna hear next?? This is so funny 😂😂😂 very creative lol https://t.co/4iAMWZ59Lo 🌹🌹🌹 https://t.co/nvoGTINUvq WHOA!! Nominated for our cover song Ex's and Oh's @VanessaHudgens. That's an awesome surprise 😊😊😊 https://t.co/VTpykeZJBX Recreate the sun kissed makeup look from my music session with @MrGrabeel. Tutorial live on #TizzieTuesday now! ☀️\n\nhttps://t.co/GafAcVllRC 10 am an all new #tizzietuesday 💥 if you haven't subscribed 👉🏼https://t.co/JbQu4yUpMf 🖤🖤🖤 https://t.co/LeuMdYJhCM Me and @iamfrench are ready for the #Eclipse2017 https://t.co/cq7fy2sG0v @nataszijam But there's like a line right? I literally told the chick I was ok three times. I didn't want to come off rude but it was turning me off 😑 @EdKrassen True! Working in Retail was the worst! I love how hollister and Abercrombie taught the employees to straight up ignore the customer tho 😂 Anyone else get annoyed when you're shopping and the sales chick is straight up hovering? I'm like chill I just want to look around myself Maui of course https://t.co/SaqdPiTwPU @emilybnz End of September!!! @amore1137 Order at https://t.co/LsLIGctbcu https://t.co/xohD3YoGgP https://t.co/w4rVPCfZeF Beach goddess and shimmering sand highlighter! https://t.co/AbLBQcoYpr Beach goddess!! Makeup brushes! https://t.co/O2Mzwkfgya I think it's time to order another one!! https://t.co/9yZS8m82nj 😂🙈 https://t.co/kRDkaysMt0 My absolute favorites!! https://t.co/4OzK5OQ7Tt No you def can't! 😍 https://t.co/O1b6STM57y Beach daze 🌊 https://t.co/fD5bI1Go7s @jenkellytisdale Aunt Ashley to the rescue! I'm just gonna play @alyandaj all day. From Rush to now THIS.... congrats ladies 💥 https://t.co/GSaYwCNG0P So glad you love it!! https://t.co/DbI1ItsFMB What’s your summer anthem? #TGIF 💥💥💥 https://t.co/af5Oa2ij9n Get my favorite brushes with this awesome deal!! https://t.co/AO3eirrwpE Since I believe in the power of friendship and because you all seemed to love the awesome #bogo deal we extended today! #OPERATIONBESTIE https://t.co/qObd4aFfHA I guess I'll have to come out with matte palette then 😉 https://t.co/ly2wkhXWzB RT @MarkRuffalo: We don't want a president who stands up in any way for Nazis, KKK &amp; Alt Right like he did today. Bigotry's evil that's it.… @HayBay411 Cinema secrets brush cleaner! If you're having trouble deciding this is always something you should get 2 of! https://t.co/15EZj7dBVz This means so much to me 😊 https://t.co/znDMd0SAHa Yay!! I'm so glad 😁 https://t.co/SzHrYKcnxF Of course!! https://t.co/lnPzlnisxN Only a 24 hour sale! #OPERATIONBESTIE Go Go GO!\nhttps://t.co/KvLmyzT0YE Sharing all my favorite products of summer, now on #TizzieTuesday! ✨\nPS. I hope you enjoy the clip of @thetonyabrewer + me! 😜 💕💕💕 https://t.co/h438C2ybz8 I love it 😍 https://t.co/SB4GBBOJrS I believe in change, I believe people can make a difference. As long as we start taking it seriously and give it the time it deserves. 👍🏼👍🏼👍🏼 https://t.co/3nNMQ0MYrf Check out my current favorites! 💄👓😍https://t.co/OZYJ4QfkFC 30 minutes away from an all new #Tizzietuesday @__DNCE_7meikash End of september! 3 colors.... 🙌🏼🙌🏼🙌🏼 https://t.co/x2dgkAWCqC So excited to share ❤ I teamed up with my beauty besties @bhcosmetics and this is happening....... https://t.co/LwMhMya0Kf How I feel after a sip of coffee ☕️☕️ https://t.co/h5PPm2IhK2 ..I will not let fear, discrimination, racism, or hate be louder. https://t.co/ictUbwdUYt Have a voice. Speak up. Educate yourself. If you're so lucky to have \"followers\"on any platform stand up for what you believe in... RT @iamfrench: My thoughts today are w/Heather Heyer's family, who should not have lost her to a Nazi rally, here in the U.S. in 2017.\n\n#Ch… I'm sorry how many sides are there?There's only ONE side that is full of hate, bigotry, and fear. Horrible speech, who r u trying to protect RT @BarackObama: \"No one is born hating another person because of the color of his skin or his background or his religion...\" https://t.co/… We must all stand up and support each other in this time. Racism and hate are not welcome here.  #charlottsville Obviously we killed it @TheTonyaBrewer 💥 https://t.co/RbSFG4eUnl So excited for @BeautyconTweets today 💄💋💥 #IlluminateByAshley Tomorrow! Come hang with @TheTonyaBrewer and I! She will be doing a tutorial on me at 3pm at the illuminate booth #1455 @BeautyconTweets https://t.co/gYoiTyArl5 Which 90s boy band did you go heart eyes for? Heading into the weekend like... https://t.co/FV9sWYHA0R Exiting things in the works 😊😊😊 @rayneee11 Yes!!! About last night. ✨✨✨ #POYH @Variety https://t.co/dp6P2NEOEo I'm taking over!! https://t.co/OQPtSfjhGT Guess who's going to #BeautyconLA ME 🙋🏻🙋🏻 Come hang out at the #illuminatebyashley  booth with me 😊 https://t.co/rP4RvvxUq7 Answering all your questions and sharing some words of encouragement today on #TizzieTuesday! ❤️ https://t.co/yV2X5dV8HW SO soon!! #illuminatebyashley https://t.co/nGwKE5UqhP 30 minutes away from an all new #tizzietuesday 💥💥💥 You know your Monday is gonna be awesome when you stroll up to a meter and it already has an hour on it 💥 Monday.... I'm lookin at you 😉 https://t.co/NFOVSvQgrG @ThePerezHilton @MrGrabeel @KennyOrtegaBlog Hahahaha The most important thing you could watch for your health is the Netflix documentary \"What the Health\" DO IT!!! About last night✨Congrats @KevinHart4real on the super funny @LOLNetwork https://t.co/MPiYuEizqf Where’s your favorite place to be? Yeessss! Go @MaxMutchnick and #DavidKohan. Congrats to my old neighbor @EricMcCormack, can't wait to watch you every week 😊 https://t.co/tiKUwAJkGo 🍒🍒🍒 https://t.co/4MdkklmMOQ This has to be my favorite interview on a talk show 😂 I love her! @TiffanyHaddish https://t.co/rISkZAX9Mf @laurenlapkus 😂😂😂 My summer lookbook is out now! Can’t wait to hear what your favorite pieces are! 🌞 #TizzieTuesday \n\nhttps://t.co/qoTGmGCIaq 30 minutes..... all new #TizzieTuesday 💥🎉🎉💥 I have a gif problem 🙈 Pucker up it’s #NationalLipstickDay💋💋  #IlluminateByAshley https://t.co/mBPfg4kvFf Which one are you? We are all human. We are all one. Why do we have to continue to target and divide communities, protect each other #TransRightAreHumanRights https://t.co/cMDWNYXypB 💋💋💋 https://t.co/xccMB5l6JW That's me mom!! 👇🏼👇🏼👇🏼 https://t.co/bRVmu2T8S0 🙌🏼🙌🏼🙌🏼 https://t.co/eqx5cVaUwW @LeaMichele I love you more!!! Recored a new music session this week with one of my very best friends @LeaMichele! Enjoy #TizzieTuesday! https://t.co/DGC1HwerUf Do it all for you guys!! https://t.co/LAXmarwzM3 For realz tho... https://t.co/pSFUkTUHwe 🙌🏼🙌🏼🙌🏼 https://t.co/ovCSyUcOtF Hahaha https://t.co/ETAq6YYYWY 😍😍😍 https://t.co/c9ZhJbK1Mp 1 hour..... an all new Music Session with a VERY special guest. Can u guess who it is?? 10am. #TizzieTuesday https://t.co/wUFkCJGgZB If you want it, get it ✨ https://t.co/qsFQdnKI35 Morning tweeters!!! RT @paramore: if you're suffering, say it. Suicide Prevention Hotline, available 24 hrs a day: 1-800-273-8255. we love you. What’s your go-to summer #IlluminateByAshley product? @ThePerezHilton OMG she's SO cute! Sharing a few of my go-to hairstyles for summer. No hot tools or brushes required 😉 Check it out on #TizzieTuesday! https://t.co/9np5D2jb65 30 minutes! #tizzietuesday comin at ya at 10 on my channel. https://t.co/eDxcVTXWlB I had the BEST vegan chocolate chip pancakes this morning! #cheatmeal #happygirl Flea market flip is my new favorite show 📺 Well hello there weekend 😉 https://t.co/rQ6hDlOcLY Thinking about a summer getaway… where should I go? When I shop I always go for the jeans, I wanna like a dress but its always the jeans that win 🙄 Best friend vs sister! Find out who knows me better now on my YouTube channel! 😜 https://t.co/sIu3A7aQlc 10am. An all new #tizzietuesday. One of my favorites! You don't want to miss it! https://t.co/eDxcVTXWlB Fixed upper this morning. Sunday's.... Beach bum. @TheTonyaBrewer https://t.co/MWHcrxuR8p 🌊🌊🌊 https://t.co/utyOMeOc6t The power of a hike is unreal. It literally can turn my day around. If I'm feeling anxious or weird,just getting out in nature is so calming Never let anything get in the way of your passions. https://t.co/Iz8U0ks8S7 Good morning ☀️☀️☀️ I just got into the show \"the killing\" and I can't stop watching. There's so much good stuff on tv!!!! Remember - It’s cool to be kind ✨ It's a party in the USA https://t.co/Rg2gEV5HTW Happy 4th!! Be safe and have fun 🇺🇸🇺🇸🇺🇸🇺🇸 https://t.co/1MOGYhgzRZ Talking to people before morning coffee like... https://t.co/UCiTQXDlot Do it for you, not for them 💕 @chelseatc you are so funny!! Dream on, dreamers 💫 https://t.co/uoB6JCNjUe A change is coming....... Your favorite part of summer? 👍🏼👍🏼👍🏼 https://t.co/GmtiNOKV80 ❤️❤️❤️ https://t.co/5Kk9yR2P5Q Guys I'm late to the game but @CW_Riverdale is SO good. So proud of my lil bro @colesprouse. I can't. stop. watching. 😊😊😊 https://t.co/YkHc5s1UYb Don't miss this week's music session! I'm taking it back to the 90s with one very special guest. Check it out now to find out who! 😘😘 https://t.co/OBpGGbOQTG Can anyone guess who my special guest is on Music Sessions today?? Find out at 10am! https://t.co/eDxcVTXWlB #TizzieTuesday Hey guys!! Send me questions for an all New Ashley answers! #ashleyanswers TFW when you realize tomorrow’s Monday. https://t.co/z2CVI45USP 🌹 #Atticus https://t.co/s86BKy9Kij What do you want to see more of on #TizzieTuesday? @starlightxkiss not yet 😊 Happy Thursday! 💥💕💋 @kellycc_x brandy Melville Today we’re doing #TizzieTuesday travel edition! Check it out to see what my must-have travel items are!😘 https://t.co/UpfDOPjV3G A brand new #tizzietuesday coming at 10am!! https://t.co/eDxcVTXWlB Monday mood 🤷🏼‍♀️ https://t.co/fC5hlomiwt Yay!!! 🙌🏼🙌🏼🙌🏼 https://t.co/SZX9sk01zz Happy Father's Day to all the awesome dads out there! Happy Saturday lovers ❤️❤️❤️ It's so freakin hot dude What do you wish you could bring back from the 90s: Sister date night! #showyourroots Watch Jen color her hair w @ClairolColor Root Touch Up 9A Light Blonde Ash #ad https://t.co/jy2uG8rWGp Summer ready!! https://t.co/rtMrv261fZ Love is a beautiful thing 💞Happy #pride ❤️💛💚💙💜 Bid Bid Bid Bid!!! 💋💋💋 #illuminatebyAshley https://t.co/crTiTaELJo What’s your go-to #IlluminateByAshley illuminating powder tone? Take the time to be kind today! I will miss you everyday Pop Pop Zinc. 💔 https://t.co/ELiFFfg4St I’m sharing all my favorite products and daily skin routine on my YouTube channel! Hope you guys find something that can work for you too! 💕 https://t.co/JmySPHdWfT A new #tizzietuesday comin at ya in 8 minutes! https://t.co/eDxcVTXWlB @HaylieDuff 😊😊😊 My little Maui's birthday is today!! #happybirthdayMaui https://t.co/rn4mnTc8io 🙌🏼🙌🏼🙌🏼 https://t.co/TxmC4VAE7G I am Heath Ledger, what an amazing documentary. Early morning rocking out to @imjmichaels #uhhuh.I find her to be fascinating and magical, how she can write that many hit songs. #realart Own who you are ✨ https://t.co/XfzbdjhclT Guys I'm losing my cool, Ben Mendleson is two tables away from me at dinner..... #bloodline Wow 🙌🏼👍🏼 https://t.co/XzU5BtojME So disappointed https://t.co/hMxWMqw5tD Thank you!! https://t.co/DlhKxP9AOM 💋💋💋 https://t.co/tgsL1HtXew For this week’s video I’m sharing step by step tips on how to apply my new individual false lashes from @IlluminatebyAsh. Enjoy! 💋 https://t.co/nVEnkb9l6r Happy Memorial Day, may we remember and honor the people who lost their lives while fighting for our country 🇺🇸 Attempting housework like… https://t.co/9ZFnxUPNZB How you love yourself is how you teach others to love you 🌹#rupikaur What’s on your bucket-list? It’s Friyay!! ✨ https://t.co/xcubtVt6Ok More love less hate. https://t.co/pCEUDaEVt0 Woo hoo!! https://t.co/GGC6q9mi4V 🎉🎉🎉 https://t.co/Q6gQqcY8vq https://t.co/blxe88noGz 😍😍😍 https://t.co/lwPHKKuv8h So glad you love it! https://t.co/hfsfJXVJuE Love and light. https://t.co/AYz3MRuQEI Hehehe https://t.co/Rmudha0VwF 😊😊😊 https://t.co/OIFk2pnnzW That mean so much! https://t.co/5reXm39Pkh Thank u!! https://t.co/US8urUq8Ar 😍😍😍 https://t.co/UHUdRsa1es https://t.co/K3Uoi3EOZV https://t.co/xLQKPYzm3j I’m so excited about this week’s music session! @MrGrabeel and I did a special song for you guys! Enjoy! 💋💋  #TizzieTuesday New Music Sessions up on my YouTube at 10:30!! Making it perfect just for you guys bc it's so special to me! Anyone know who's the guest? https://t.co/JRXFuAiLWS I am devastated. Sending prayers to everyone in #Manchester #Mondays https://t.co/6ekDEOlsuZ I think I fell in love with @LeaMichele last night night 😝 Getting ready for the @BBMAs 🎉🎉🎉 @selahjewel I hope you didn't ruin your beautiful makeup lol Just peachy 🍑 This Sunday! Ya girl is presenting at the #BBMAs 💥✨ https://t.co/std1zyPp62 RT @iamfrench: In the end, we all become stories. \n\nIt's up to us right now whether or not ours will be good ones. 😍😍😍 https://t.co/ey3siX5auU 😍😍😍 https://t.co/qKmXyI5j7V What shades of #IlluminateByAshley Cream Cheek &amp; Lip Tint do you want to see? Love this haha https://t.co/7SyFNr5Yde 🙌🏼🙌🏼 https://t.co/rQnsXUKx2X This morning in an all new Ashley Answers, I’m taking it back to my days on set with Zac. 😉 #TizzieTuesday\nhttps://t.co/FN9DQKJxNm 1 hour away answering all your questions! #TizzieTuesday I personally think she was a victim from the start....... her parents named her Sharpay! https://t.co/P48WWOkHWM Happy Mothers Day!!! Hope you al have a beautiful and magical day 💘 Favorite song rn: @laurenlapkus @JCrapkus what??! I need a recipe STAT! Guys as an appetizer last night. They had maple glazed bacon and I honestly can't stop thinking about it! 😍😍😍 #therosyoyster #roosevelthotel Why am I always late for meetings but always on time for dinner 🤔 You guys!! I’m so excited to announce that my @IlluminatebyAsh lashes have officially launched! Get yours now on https://t.co/NFwZSn9eis! 💕 https://t.co/64gQ60kN9o #IlluminateByAshley lashes are now availible! Only 5.99!! https://t.co/ZvOmxP6ikN @delenassawyer yup! @fannyafonso they are still in stock! Yay!! https://t.co/Iuo5EO1KKF Woo hoo!! https://t.co/7d6qmgPhNz 🙌🏼🙌🏼 https://t.co/eNzNSO7riM ❤️❤️❤️ https://t.co/R1k5BnAjGZ 🙌🏼🙌🏼🙌🏼 https://t.co/mERSUaGETR I don't think I stopped laughing watching @Snatched_Movie Honestly @amyschumer kills me, her and Goldie Hawn are my favorite duo. #mustsee Doing something new on #TizzieTuesday this morning!! Check out how to create my favorite summer beach wave look!\nhttps://t.co/FhmCls0W74 1 hour! An all new #tizzietuesday 💥🎉💥 I'm pretty excited about this!! What about you? 👸🏼👸🏼👸🏼#Cinderella  #CharmingMovie \n\nhttps://t.co/3qKyPPsDXl 🙌🏼🙌🏼🙌🏼 https://t.co/lq6hGItn9E 😊😊😊😊 https://t.co/HB5xAI4t0G Just being you is enough. Just keep it real. ✌️ Thank you!!! Huge fan of you guys!! https://t.co/cR0Ci2LykT RT @ShaunKing: I need you to know the name #JordanEdwards\n\nThe youngest kid killed by American police this year\n\n15. \n\nAn amazing boy. Unar… What #IlluminateByAshley item is always in your bag for a touch-up? Had so much fun covering Don’t Let Me Down by @TheChainsmokers! Live on my YouTube channel now! ✨ #TizzieTuesday\nhttps://t.co/rSgK1KY1su Thank you!! https://t.co/GQalCUxW1T 😊😊😊 https://t.co/qiNhwXSQJd Haha love this! https://t.co/8HI9MCdyu0 So glad u love it, thanks 😊 https://t.co/d6wtVYUKML 🙌🏼🙌🏼🙌🏼 https://t.co/WOaLK5SHQy So glad u love it!! https://t.co/UuUqvEsYuw Hehe https://t.co/DO9T2G507B Thank you!! https://t.co/jONOrmDLCs 💋💋💋 https://t.co/wOya7PNcIn For the full video go to https://t.co/UMgdasRMAQ ✌🏼#TizzieTuesday https://t.co/0mRRDE6SNq Less than an hour till an all new #TizzieTuesday. Music Sessions!!! ✨✨✨✨ It’s now or never. 🙌🏼 @ThePerezHilton @instagram yes! @TeamTisdaleFR already planning on it! Find joy in the ordinary. Which @Beyonce song should I start my workout with? The wind you guys.... 💨 Keep looking forward. 💫 https://t.co/QD1JSeTPyq GOOD MORNING!!! https://t.co/adoutcE4wK “I never dreamed about success, I worked for it.” - Estée Lauder #WordsOfWisdom I made a vlog of my first trip to Coachella for you guys!!  It’s up now on my YouTube channel! 💕 #TizzieTuesday \n\nhttps://t.co/ix9EtJlGsJ @amore1137 haha right?! I need to get better at vlogging @biebertisdale thank you!! I'm still trying to learn lil Less than a hour away for #tizzietuesday 🔥🔥🔥 Needing a good read! Tweet me your book recs!! 📕 https://t.co/N7h5JYTXJT When my husband said 1800gotjunk was coming this morning to take all the boxes.I think I fell in love with him all over again. #ocd #h8boxes Be fearless, always. 💫 F.R.I.E.N.D.S. girl you relate to most: Reliving my first Coachella... Who wants to go back weekend 2?! https://t.co/Z8wFwAYf0D All day, everyday! 🙌🏼 https://t.co/25DBI7WeoY @zefronistheman @ZacEfron_Swiss guys. It's clothing, my stylist picked it out and I thought it was super cool. Calm down, I didn't even kno Happy Monday! You got this. Happy Easter 🐰🐰🐰 Coming soon!! Tune in Monday 😉 https://t.co/aqkvrfB1uu @emilybnz beauty Guys Monday morning I have a something exciting to share with you! #IlluminateByAshley 💋✨✨ What beauty product can you not live without? Always stay humble and kind. 🌹 Thank YOU for loving it!! https://t.co/OJXGSAXze5 @Ryan_Pinkston more like your planning 😝 So glad u love it!! https://t.co/fgljFRUIw0 @colesprouse badass You Guys I'm getting so excited/nervous for my first Coachella 🙈🙈🙈 😊😊😊 https://t.co/msZBkikmJI 💋💋💋 https://t.co/J89GC1blu7 🙌🏼🙌🏼🙌🏼 https://t.co/0YpVcXEwsB Getting Coachella ready this week on #TizzieTuesday. Check it now! https://t.co/22Hrb3Pkm3 https://t.co/YGAbxhJSlB 1 hour away from a new #tizzietuesday Coachella edition 🌵☀️⚡️💥 Do what you love. Love what you do.💕 https://t.co/o18ItB1eh3 Which @Tillys? https://t.co/Ay4BVqfUkZ Sunday morning couch and movies! 🎉🎉🎉 Make the little things count. ✨ @CharlieeNichols I'm not in turning 32 haha Yay!!! So glad u love it https://t.co/PvxRPEBq0r Find your lighting. 💡 #SusanCain https://t.co/41GDr9J62P I think this is one of my favorite pieces because it's by my favorite person! Get Coachella ready with Kristin Ess https://t.co/QYjnmNHfFx Giving all the deets behind my new @IlluminatebyAsh Goddess palette to just @JustJared:  https://t.co/Q49njvMGJC And don’t let anyone tell you different. 🌎 https://t.co/6L8wBVg8lo Which social media is your go-to? Filming another Q+A tomorrow!! Send me your questions! #askashley To find out how to achieve this look head to my YouTube channel! https://t.co/JbQu4zc1aP https://t.co/FNcBel7cje ✨✨✨ https://t.co/pEkmZUsyFT 1 hour away from #TizzieTuesday 🎉🎉 https://t.co/eDxcVTXWlB So proud of my girl @HaylieDuff and her kids clothing line #littlemoonsociety that launched today! https://t.co/Zaphuj7MWK NEED 4 my niece! Reflecting. https://t.co/lfoBz3D1jk Your potential is endless. ✨ https://t.co/BIwcPsy586 RT @iamfrench: Hey if you're angry about your hard-earned taxes going to pay for @FLOTUS to live wherever she wants, sign &amp; RT! https://t.c… April fools!!! Vaca starts NOW 🌊🌞🌵🌴 Weekend vibes. ✌🏼 https://t.co/0qWiNOjmB5 ✨✨✨ https://t.co/3UbndqqkFv Yay!! https://t.co/EY1RRL2QUD Hahaha 😂😂😂 https://t.co/gIhT74xg6S That's a great bf! https://t.co/KzdkUuo723 💋💋💋 https://t.co/wqKdVlEFB8 ✨✨✨ https://t.co/YW8hk7ps4R ❤❤❤ https://t.co/jy712nrvui Woo hoo! https://t.co/ZdfdH5hBXq 👍🏼👍🏼👍🏼 https://t.co/2aVDNjKOEX 😁😁😁 https://t.co/2k3Goas9tw 🎉🎉🎉 https://t.co/RjbumZPCiH This is amazing lol https://t.co/xmT2iLQZfN You're gonna love it! https://t.co/S9ghhx95lZ 💋💋💋 https://t.co/fMVBzBvbDj ✨✨✨ https://t.co/Uz4rgVtsmV Thanks girl! You're a goddess now https://t.co/gLSEmcKCG1 Yaaaaaass https://t.co/xgc1hh1oPl 👸🏼👸🏼👸🏼 https://t.co/uidXX8GQVb 🙌🏼🙌🏼🙌🏼 https://t.co/It2w0Ntyxq 💋💋💋 https://t.co/WjyxyskKr5 It's HERE!! Goddess palette 12.99 at https://t.co/LsLIGctbcu ✨💋💋 https://t.co/yWuRp8Y8Dh OMG!!!! 30 minutes till the Goddess palette launches ✨✨✨ www. https://t.co/NFwZSn9eis Big Little Lies is so freakin good! Ugh my new favorite show! Sat down with the ladies at @byrdiebeauty and shared my secret to getting the perfect cat eye look: https://t.co/PNgY433VoG Your ideal spring break getaway? Goddess palette. Launches this FRIDAY at 9am! Get ready ✨✨✨ https://t.co/wnVrm6KgCu Had so much chatting with @POPSUGAR for their Pretty Unfiltered series: https://t.co/JWPpfE3L6g Really exciting news on the Goddess palette!!! Head to my snap to find out 👻:ashleymtisdale ✨✨✨✨✨ Find inspiration in all things.  ✨ #AndyWarhol https://t.co/0gayHd2lGb Love what you do, and everyday will feel like vacation! Shop this @ShopSignorelli tee now for only $28.99. https://t.co/xg7H1Tdikf @ShelbyGibbs we didn't change the lyrics 💋💋💋 https://t.co/FVhOEURnAb Love this 😂 https://t.co/ItP2ATwh3r Thank you!! https://t.co/vmfzswWsGF For our latest music session, Chris and I recorded a cover of one of our very favorite songs from @imjmichaels! https://t.co/EmSRDDkv7o https://t.co/orXoDQLJov 10 am!!! New Music Sessions on my channel. #TizzieTuesday https://t.co/ewrsIfPn7r @emilybnz I didn't change it, the packaging quality wasn't perfect so we had to send back. Only want the best for you guys!!! CHELSEA......... Happy birthday 😝 @chelseatc thanks for making life easier @BlondieGirlProd and FUN! Who’s your favorite 90’s supermodel? @MattCookTweeted SO happy for you!!! Beverly Chills, all day everyday! ✌🏼 Shop this new @ShopSignorelli tee online now for only $28.99. https://t.co/Fn1nF2g9pU Major shimmer party happening right now on #TizzieTuesday! Head to my YouTube channel now to see my latest makeup look by my niece Mikayla! https://t.co/GllsY6n2wL It's up!!!! No words, just laughs. 😂😂😂https://t.co/ByfSZyOZVy YouTube fail. It still uploading 😬 #TizzieTuesday will NOT be at 10am, had to do one last minute edit on it! Stay tuned for the new time!! It's all about a good cat eye ✨✨ https://t.co/KNogpCBZuV It's coming SO soon! https://t.co/o8J8JJSjuO I, like, LOVE you. ❤️ https://t.co/FgUEglGKIV 🙌🏼🙌🏼🙌🏼 https://t.co/7K2zXRd9a3 Favorite @shopsignorelli motto: Don’t let anyone tell you different. ✨ #MelissaEtheridge https://t.co/GyVDoSfZGq Love yourself first. #RupiKaur https://t.co/Juxf1Ky8an So excited to announce that @shopsignorelli is now available at @Tillys online and in stores!! You’re going to love the new pieces! 💕 https://t.co/FTLZpXpIHA Check out my latest YouTube video, I just might have answered your question! #TizzieTuesday https://t.co/frWM8C0hMd Get ready #TizzieTuesday coming at ya! 10am. https://t.co/eDxcVTXWlB 🙌🏼🙌🏼🙌🏼 https://t.co/HJdQQJOUea Let’s go anywhere. ✈️💫 https://t.co/sg1RRRQZbI Expect nothing, appreciate everything. ✨ Feeling the love from @aol! 💕 Thank you for such a sweet article!  https://t.co/NLpBMlTy14 Hey guys so I'm shooting another Q&amp;A for YouTube! Tweet me your questions 😊😊😊 Maybe I'll choose yours! Love this @younghollywood article on Chris and I's music sessions.❤️ Give it a read and check out our latest video!\nhttps://t.co/GTGmAeeFOk Key to life. 🔑 https://t.co/WH9DPrWwlT Thanks for the love @people! If you missed it, check out this article for Chris and I's latest music session!  \nhttps://t.co/XidPWtpWxp What's your ideal vacation spot? ☀️ SO cute!!! Congrats girl, so proud of you! https://t.co/T6DMc6L6Z8 Trust in the process. ✨✨ My favorite products!! https://t.co/Fw0STMCEcX Thanks @people ❤❤❤\nhttps://t.co/IzvszNW4Uj Noted 👌🏼 https://t.co/vg8h1UQc4y @largefriespls someone leaked it 😬 Plan on it 👌🏼 https://t.co/Rz38vbHKl5 Chris and I are in the studio again! Check out our cover of Shut Up and Dance on my YouTube channel! https://t.co/5fROvMtUZR Thanks! https://t.co/8ozCS2lkpO RT @iamfrench: Hey there's a new music vid up on @ashleytisdale's channel go check it out &amp; subscribe!! \n\n#ShutUpAndDance 💥 \n\nhttps://t.co/… Just want to thank you all, this video was leaked a couple weeks ago and thank you for patiently waiting to see it!! 😂😂😂 https://t.co/gdoaT0gStK 👍🏼👍🏼 https://t.co/jOOb68F0DK ❤❤❤ https://t.co/yTsg3NdnKE You're so sweet! https://t.co/DsrzHsz7Nx Thank you!! https://t.co/9AXWwIGo87 😘😘😘 https://t.co/rKa9ooZcrS 😊😊😊 https://t.co/ZgcVhfgtgB New Music Sessions! Check it out 😍😍😍\nhttps://t.co/dO94dJ3GPp 1 hour till #tizzietuesday!!! New Music Session on my youtube channel! ✨✨✨ https://t.co/XskHyb0zt2 Always remember: You are capable of amazing things.🌙 Without Tommy Page there would not have been a Headstrong or Guilty pleasure album. I don't understand,  no words #rip love you Tommy @chelseatc CHELSEA...... Ok game over. She is now snapping ME 😂 @deluxetisdale twitter Check out my snap and send me something to ask Chelsea 😂 👻:ashleymtisdale Remember: be your best self. ✨ https://t.co/lNW6ee5yBm @JulioMello @justjaredjr @ddlovato @AvrilLavigne it's actually G.E.M! Demi is in the scene and got confused. 🙈 @TheRobbieJones hahaha I'm dying 😂😂😂 What’s your @shopsignorelli Disco Punk vibe? Recreated my #EJAF look from Sunday night. Check out my YouTube for the NEW Video Link in BIO #tizzietuesday https://t.co/fY1KAmuNH3 RT @hellogiggles: .@ashleytisdale dealt with Twitter body-shamers with intelligence and grace – but she shouldn’t have to https://t.co/5n5m… WHOA! https://t.co/eti0lcIWlv Hey guys #TizzieTuesday is happening today so stay tuned! Almost done editing. 😊😊😊 Do what they think you can’t. 👊🏼 The pressure to being perfect is a struggle.No im not pregnant,I'm just happy and haven't been strict on my diet but thanks for the reminder When you're on your way to the Elton John viewing party but have to stop at Starbucks so you can pee. Never been so dressed up for coffee 😝 Bill Paxton was always my favorite in TiTanic... And every movie he starred in. So sad to hear the news #RIP Today's look Goddess palette. #IlluminateByAshley ✨✨✨ https://t.co/z8OAsICrMg Feels. 💫 https://t.co/lL1ZUGLmGY Talking all things beauty with @goodhealth Find out the one beauty product I don’t leave home without:  https://t.co/4zLF6sR8er Beautiful minds inspire others. 💕 Everyone deserves the right to be who they are. I #standwithgavin and the #LGBTQ community. RT @iamfrench: Disgusting &amp; shameful to me as an American that our new so-called president would back-track on the transgender rights of sc… Sometimes less is more. ;) @ShopSignorelli https://t.co/qFwx2kjZQC How do you shine? #IlluminateByAshley 🙌🏼🙌🏼🙌🏼 https://t.co/OZ2fsx8Ajh Just got done with the most intense workout so now I’ve got to get clean with @OlaySkin DUO to start my day! #ShowerDUOver #sp https://t.co/o3IBapkw4Q Finally watched last nights episode of @SHO_Homeland, it's SO good!! 😍 #IlluminateByAshley https://t.co/IUDF81JiYG Focus on the good. ❤️ https://t.co/8iYliXP45B I have the greatest girlfriends 😊 They're all independent, talented, kick ass women. #girlsnight #inspired #iluvthem #amihashtagging2much 😍😍😍 https://t.co/mXVxH1rCvl Helloooo, weekend. 🙌🏻  Get this @shopsignorelli sweater: https://t.co/Kw4dYfzfUc https://t.co/6bl0T1Ow0h We all have magic inside us. Never forget it. 💫 What’s your go-to outfit? 🖤🖤🖤 https://t.co/aDrhOyMk4j Design a life you love. #ElsiedeWolfe https://t.co/tY4vIaqxPI The wait is almost over you guys! Check out this sneak peek of my new @IlluminatebyAsh Goddess Palette on @Bustle!\n https://t.co/FpMUcW96zk Get date night ready just in time for Valentine’s Day! See my beauty tutorial over on my YouTube! ❤️ #TizzieTuesday https://t.co/IE7BpdYx33 💋💋💋 https://t.co/slvai7CV4T Thank you!! https://t.co/R7KPiwDaM9 1 hour for an all new #TizzieTuesday!! Oh Valentines Day... all the ladies walking around with Victoria Secret bags looking for valentines cards (me included 😝) Thank you 💋💋 https://t.co/tHqCgIZ7Rs ✨✨✨ https://t.co/t3BefsfJEt Twenty one pilots my favorite so of course I'm excited for their win! Well deserved!! #grammys2017 I love this! I love how he did it on his own! https://t.co/XzjrCTmNEd Hell yes @katyperry!! Love this performance #grammys2017 👍🏼👍🏼👍🏼 https://t.co/1aIQqSZryX Baby, you’re one of a kind. 💎 @TeamTisdaleFR @iamfrench thank you! It was An accident, will be coming soon enough! May we know them, may we be them. 💖 https://t.co/U8yk3JNwKk 💋💋 https://t.co/Hs3slnQygL Another reason why my agents are the best! #UTA https://t.co/sTcg7ncRyh Good things take time. Remember that! @TeamTisdaleFR yes! 🙌🏼🙌🏼🙌🏼 https://t.co/RrVHNOm5Zk Need some workout motivation. 💪🏼What’s your go-to? Hey guys!! I won't be able to go live at 10 but I will be going live at 1230 on my instagram! All new #TizzieTuesday is next week! Hey guys! Sorry I was fixing some things on my YouTube channel and pressed live! My bad 😑 Telling it like it is via @shopsignorelli: https://t.co/Kw4dYfQQLK #FashionablyLate https://t.co/Hu7VqOxIyQ So glad u love them! https://t.co/IMpQkGUVIc 💋💋 https://t.co/ZwZloGqvuR Don’t survive, thrive. 💋 Thank you!! https://t.co/ykg6zu2muc Beautiful 💋💋 https://t.co/MmVN5GIhoR My little Maui is number 1!!! ❤️❤️❤️https://t.co/PEn4WFT5yB Never give up. 💪🏼 https://t.co/XbNXdmaf2Q Make sure you watch my girl @VanessaHudgens on her new show tonight on NBC at 8:30!! @nbcpowerless #powerless https://t.co/GqVtnsBrjm 💋💋💋 https://t.co/azeaxxhJ3z Don’t be better than them. Be better than you. https://t.co/DNcPqayJVd 😘😘😘 https://t.co/veOPATKi6E ❤️❤️❤️ https://t.co/WKTrRvmsoe ✨✨✨ https://t.co/vVQBAsKvF5 Got a case of wanderlust. Where do you want to go in 2017? Of course! All my girls are goddess 🙌🏼 https://t.co/H58cqQe4rm ❤️❤️❤️ https://t.co/zRG2ClbQNJ So glad you love it 😘 https://t.co/1L7k9xrpqr It's #TizzieTuesday! 🙌 Head to YouTube to see @iamfrench &amp; me perform a cover of Toxic from one of my favorites, @britneyspears! https://t.co/ewq8M13UPr 10 am! New Music Sessions on my YouTube channel! Hint: it's a classic! https://t.co/9109qxTUmD 😊😊😊 https://t.co/7IkT3DdTeh Just binged @NBCThisisUs and I'm obsessed. Can it be feb 7th yet? I need a NEW episode! #bestshowontv RT @iamfrench: Hey you guys - here's how to help the courageous, smart &amp; powerful people who are fighting this battle. \n\n@ACLU  https://t.c… RT @ACLU: If you hear of any refugees who are being deported, contact the ACLU. \"But if you only have love for your own race. Then you only leave space to discriminate. And to discriminate only generates hate.\" 😊😊😊 https://t.co/GOsqbkpim4 Thanks!! Hehe https://t.co/Tt58hSDst1 🙌🏼🙌🏼🙌🏼 https://t.co/F6yN84V9hQ Love life. Every second of it. ❤️ https://t.co/lSDsD99Xsl You paved the way. #MaryTylerMoore #rip Express yourself. Which @shopsignorelli mantra do you relate to? I picked the color that represents them! https://t.co/L2Fiw05tyo 🙌🏼🙌🏼🙌🏼 https://t.co/LhoJtNys8F Thank you!! https://t.co/1lj9Vs0KoH 😊😊😊 https://t.co/25Of1Qlelv Going live on my YouTube challenge at 930am! Giving you some exclusive deets in my New #IlluminateByAshley Goddess palette https://t.co/BOzaRecOA1 Tomorrow 930 am, going live on my YouTube channel. Gonna give you a little exclusive on the New Goddess palette #illuminatebyashley You are GOOD enough, SMART enough, BEAUTIFUL enough and STRONG enough. Never forget that! 🙌🏼 happy birthday!! https://t.co/hNfbCxSqEH ⚡️ https://t.co/6J4tb6SolV RT @PopmaniaTV: We NEED @AshleyTisdale's new makeup line asap! Mr. and Mrs. Obama, thank you for everything. ❤ When will we realize we are all equal. We are all one. Because there’s so much to love. 😊 #CarrieBradshaw https://t.co/UyAUlGTjIB Blue velvet. 💙 https://t.co/Rlbt9hlmK7 Thanks for the shoutout! I love this look 💋💋 https://t.co/5s0wDRlg3p Dance like no one's watching #lakers https://t.co/EVCoEu18JK A look inside the making of my Winter Lookbook. Head to my YouTube to see the finished product! https://t.co/USp0EDefAL Still can't believe #IlluminateByAshley is at @Target online!! Somebody pinch me. https://t.co/uafkDuFjCI https://t.co/Ye9yJFFO8V Collect moments, not things. ❤️ Thank u https://t.co/kezHUSfcMm This year, I want to spend less time: ✨✨✨ #IlluminateByAshley https://t.co/ehXykUHMCN What I’m wearing and what I’m obsessing over this season! Check out my Winter Lookbook over on my YouTube! #TizzieTuesday https://t.co/figI6vmDTe 🙌🏼 https://t.co/EnyhO9vWbc 😀😀😀 https://t.co/4H4nY1P7fB THANK YOU!! https://t.co/Bc7FzG3g6E 💋💋💋 https://t.co/wDDZ40ACcf Glad u love it https://t.co/skEVhXfxc7 😊😊😊 https://t.co/fuI9XSV1Tf ❤❤ https://t.co/2tKMnIh2WI When you love a song so much you just want to drive in the car and blast it! #issues @imjmichaels 1 hour away from #TizzieTuesday 🎉🎉https://t.co/9109qxTUmD 🙌🏼🙌🏼🙌🏼 https://t.co/J02D44TPMC Sundays are for sleeping in. Shop this @ShopSignorelli sweater: https://t.co/Kw4dYfzfUc https://t.co/eeaO7BjdM7 Want to shop my beauty look? Head over to @UltaBeauty online to get #IlluminateByAshley for yourself! https://t.co/zAetzgaJjU https://t.co/9icmmNWf5Q Creating, creating, creating! #rupikaur https://t.co/YZ7nBYsmum @BRTisdale yes! But I want to play a character that is way different from anything I've done before. @EXPLICITISDALE not cancelled. It was a pilot we were experimenting with. We all couldn't agree on some things at the end of the day She wore army pants and flip flops, so I wore army pants and flip flops. 😂😂 #NameThatMovie #Throwback https://t.co/fWZEEYDHlb ❤❤❤ https://t.co/0bBcfLDBLs Aaaaaaahhhh 1 MILLION subscribers?!!!! I LOVE YOU ALL!! Thank you so much for all the love. https://t.co/eDxcVTXWlB Hiding from the rain like: https://t.co/Rqh3w25CX1 Because #IlluminateByAshley is for the independent woman. 😉 https://t.co/nR0w3hzx7n HUGE NEWS!!! #IlluminateByAshley is now available at @Target online! ❤️✨ Thank you all so much for your support. Couldn’t do it without you! https://t.co/27moTHNQpG No wonder my day has been AMAZING it #internationaltizzieday Hey guys having major difficulties so I'm sticking to insta live! @TeamTisdaleFR this year #tizzie Tuesday is WEEKLY 🎉🎉🎉 Sorry Technical difficulties! Hang in there Going live on my YouTube channel in 10 minutes!!! #tizzietuesday https://t.co/67u5SHXO6Z You are gold, baby. ✨✨✨ https://t.co/DdNfaoTxy2 🙌🏼🙌🏼🙌🏼 https://t.co/xAr6HSx3Ng What's your 2017 resolution? #ashleyasks ❤ https://t.co/WJUAxMpCLy 👀's are my favorite feature. #illuminatebyashley https://t.co/Vdj2fJi2FN 😘😘😘 https://t.co/n26rhUTqKL 🙌🏼🙌🏼🙌🏼 https://t.co/UgG2tAS0I6 10 million views in less than a week. Speechless. ❤❤❤ https://t.co/sC200nG6e7 Thank u!! https://t.co/HaAmGapssA 8.7 MILLION IN 5 DAYS! Wow that's more than some tv show ratings. I LOVE all of your endless support. Thank You!!!! https://t.co/sC200nG6e7 @JeffreeStar @VanessaHudgens THANK YOU 💋💋💋 I can't believe we are at 7 million views!!! Thank you for all the love! @VanessaHudgens and I are so grateful ❤ 🎉🎉🎉 https://t.co/0N0ZxTQyN8 Obsessing over this natural &amp; organic skin care system. #dontworrybehapbee @hapbeecompany 🐝🌻 https://t.co/rniHpB53Co WHOA. Woke up and saw we are at 1.7 million views and we are trending on YouTube. I think you guys liked it 😊 luv u! https://t.co/sC200nG6e7 This is my favorite tweet lol https://t.co/5sWrtTsZgE You asked... We listened!!! Head over to my YouTube for a #TizzieTuesday Music Session with my best friend, @VanessaHudgens!!! https://t.co/1KPy1VIj4C Couldn't do it with out him!! @iamfrench 🙌🏼🙌🏼 https://t.co/9QnaxR4yJh 😊😊😊 https://t.co/x05NHA11zR 🙌🏼🙌🏼🙌🏼 https://t.co/vk49GXFTLA 😘😘😘 https://t.co/IsQWOG7Gz3 Thank u https://t.co/251lXg0Ci1 RT @justjaredjr: Excuse us while we OBSESS over this duet from @VanessaHudgens &amp; @ashleytisdale! Watch them sing an #ExsAndOhs cover! https… 1 hour away from #TizzieTuesday. Music Sessions With a special guest.... 😉 Guys get ready... tomorrow's #tizzietuesday is something you all have been asking for. #specialguest #musicsessions She believed she could, so she did. 💪 Ready to dance my way through 2017 ✨✨✨ https://t.co/o3XADLSXFt This last year was all about growing and learning. Now I can't wait to use all the knowledge I gained and kick 2017's ass! Get ready... Independence is attractive. 🙌🏼 https://t.co/UVruV1bixn Morning. https://t.co/IJ62ljVPyA It's my day off. Get my @ShopSignorelli top at 30% off! Everything is on sale now until December 31 when you use the code: CLINK. &lt;3 https://t.co/DYeBwWrarI The loss in the last two days. 😞 Rest In Peace #DebbieReynolds #CarrieFisher. Feel like binge-watching tonight. 🙈 What are you watching?! And never forget it! https://t.co/e8r9tQkUfs Sweater weather. https://t.co/7KNfTHNxEI Deleting random stuff on your computer just makes you feel overall lighter! The best sales are ones you don't have to get out of bed for. Get 30% off all @ShopSignorelli today until December 31 using the code: CLINK! https://t.co/IsGAMioakc 😊😊😊 https://t.co/aBcQh5QIzg 🙌🏼🙌🏼🙌🏼 https://t.co/uE3MQTOZWp You own and love something I created from nothing. I could never have imagined all this love. Thank you all 😘😘😘😘 Guys seeing all your #IlluminateByAshley you got for Christmas is the best gift you've given me. Your support means everything to me. 🎉🎉 You have a great friend! https://t.co/iemFGNMoM6 🎀🎀🎀 https://t.co/hMA3YMPgJv Woo hoo!! https://t.co/RfwsvRTKkB Yay!!! https://t.co/MZxIWIMXKM 🎉🎉 https://t.co/OL9DivvwMN 🎁🎁 https://t.co/ZcgqeEGfiG Merry Christmas 🎉🎉🎉 Merry Christmas Eve!!! https://t.co/IQZrFz49aa Love seeing everyone's #illuminatebyashley pics! So many exciting new stuff coming 2017! So glad you love them! https://t.co/Zrv0BQiPMG Yay!! https://t.co/FgJHb1bH2t 🙌🏼🙌🏼🙌🏼 https://t.co/JmHPGlfR2e Woo hoo!! https://t.co/hhNVUJTb2l Love!! https://t.co/YaHiQdNOYO @aliyahpotts8 hope it's a good sandwich 👍🏼 @DebbyRyan 😘😘😘 Just so everyone knows @DebbyRyan is my spirit animal. 🐹 RT @Pink: #ChildrenofSyria in #Aleppo &amp; other besieged cities need help. UNICEF can give it. Please do whatever you can: https://t.co/CmWNj… The rain is my fave 🌧 😊😊😊 https://t.co/DmBkU9HMVY Lunch anyone? https://t.co/JB7AMwUZTE @oprah said it best 👆🏼 #wordsofwisdom https://t.co/dPF1gdPxLq @vanessahvdgzns yes! That means so much to me, I love making people laugh 😊 https://t.co/IfNuTKhBYG @annnalynch24 yes! 🙌🏼🙌🏼 https://t.co/hlen7xX1lM 🙌🏼🙌🏼🙌🏼 https://t.co/rytgk7fYHc I hope you feel beautiful today! 😘 😂😂😂 https://t.co/yHNC56hSE3 Thank you!! https://t.co/tPncgEezdq You spoke, I listened! Head over to my YouTube for this month's Q&amp;A to see if your question got answered. ;) #TizzieTuesday https://t.co/yJlwvECUFR 10 minutes to #tizzietuesday !!! Don’t dream your life. Live your dream. https://t.co/jahRKtcwSv Never late. Just \"fashionably late\" 😝 @ShopSignorelli https://t.co/nH80IgTmgR @Jess_Rhoades 😂😂😂 https://t.co/ZJQuWhuhsy Literally just went from my car door slamming on my leg (put ice on it) to a car slamming into my car door (everyone's ok) #imok #notmyday @Arzatii @CraveMyThoughts how do you know I'm not? I am 2!! https://t.co/PY0lrlKqQe 😄😄😄 https://t.co/AkKg51TtyV 🙌🏼🙌🏼🙌🏼 https://t.co/lIwCaVBX4P @MandaCGxo @ThatBombBlonde it's cruelty free! 💋💋💋 https://t.co/rlD5LVOuU2 14 hours left! Get your goddess palette and makeup brushes for only $22!!! https://t.co/WJusbGn4eg https://t.co/v2VBn5x45V Guys you can get the Goddess Palette and Brush Set duo steal for only $22 this weekend! Head over to https://t.co/Ypu0fNK96i! #HolidaySale @dragonatys I do! I'm developing something that super different for me. I want to do more tv and movies that challenge me as an actress They're BACK!!! The #IlluminateByAshley makeup brushes!! Get them before it's too late! https://t.co/VTTIpZuBIq https://t.co/yMkj7Kyck4 https://t.co/2MnOWavsW8 @beachhobo75 tomorrow!! 😍😍😍 https://t.co/2pJlmoa9Gy Girls night is always 🔥 https://t.co/2aXYyANmy4 @amorosasmechi Thursday!!! @TeamTisdaleFR it's coming!! ❤️❤️❤️ https://t.co/oMwXHhtVYP That’s what you are. 💕 https://t.co/8xMTFibR8I It was a magical afternoon. @iamfrench @kimhidalgo @brantdaugherty @UniStudios #WizardingWorldHollywood https://t.co/nfQYYg19yM Geek chic. https://t.co/ZKtYQd4cWq How'd you spend your weekend? Strike a pose 😝 https://t.co/dJcTrQzjHH @09Selenator tomorrow!!! I hope your Sunday morning are even better than your Saturday nights ✨ https://t.co/XMvcgMq8rX MOOD. 😂 https://t.co/cVAqN2Nj8T @emilybnz not till spring! But testing went amazing and I LOVE the formula. Wa ted to create a matte that would dry out the lips WOW!!! https://t.co/nIys2NSiR7 Looking forward to all the holiday parties coming up, but what should I wear? 😂🎉🎄❤️ https://t.co/mnioP5ICh2 @EXPLICITISDALE waiting to get the green light.... been dying to tell you guys! @BRTisdale def things in development! @kyleelaynee YES! I know!! They are coming!! https://t.co/4cNfddX5tR YES!! We have so much more stuff coming in the new year 😊 https://t.co/F5FBBrU8aN VERY SOON! https://t.co/DjvKlzd3AM SOON!!! https://t.co/WJWWNsISOr A is for Ashley 🙋🏼 https://t.co/LlMMJCNWbE Missing NYC already 💙 @shopsignorelli https://t.co/w39vXT3mjj 🙌🏼🙌🏼🙌🏼 https://t.co/uOc2uCw1r9 Don’t be afraid to let your light shine. 💡#kerrywashington https://t.co/rcpVjQAdGN Pilates is kicking my ass! Always grateful for coffee 😝☕️ https://t.co/4i9TugYOgi #IlluminateByAshley makes for good holiday gifts and stocking stuffers… Just saying… 💁🏼 Link in bio! https://t.co/SpBNt89MGS The #IlluminateByAshley Night Goddess palette is perfect for... What do you do after watching the #VSFashionShow with your girlfriends? Make em breakfast! 😝 Head to my YouTube to watch how! #TizzieTuesday https://t.co/oFOLcNuSDS @bieberdream6 waiting on shipping but hopefully in the next two weeks!! 1 hour away from #tizzietuesday!! New video is up on my YouTube channel at 10! Don't miss it! https://t.co/9109qxTUmD @xmcelebsx I was just stating facts 😊 Negan just wants everyone to stick to the status quo 😂😂 https://t.co/5U721GGgcY @xmcelebsx @ShawnMendes thank you! @xmcelebsx @ShawnMendes illuminate by Ashley launched last June so.... 👍🏼👍🏼 https://t.co/cXutYfBdJM Thank u!! https://t.co/iY7LYMDt3F It's the Victoria Secret show so I made sure I got in my Pilates 😊 #workoutlikeanangel Good morning!!!! 🎶🎶🎶 I keep saying I'm gonna cut out carbs and really eat healthy..... but then it's followed with \"next week\" 😂😝 @fannyafonso bc it's so good! Get it before the sale is over!! 🙌🏼 https://t.co/zXEPtGcrc6 &amp; don’t let anyone tell you otherwise! 💗💗💗 https://t.co/LGHnld8RLr RT @sammydroke: HEY EVERYONE! Here is 1 of many videos to come. Yes, that's right! My YouTube channel has… https://t.co/a0imHCViKC Come and get it. 😉 The #IlluminateByAshley Cream Cheek &amp; Lip Tint is now available at @ultabeauty: https://t.co/VjrcyD1GpP https://t.co/rhYULlmm4k Guys!!! #IlluminateByAshley is giving you another Black Friday sale. ✨Get 35-50% off today &amp; tomorrow: https://t.co/LsLIGctbcu https://t.co/qGX7l1N9qM Always believe in the magic of kindness. ✨✨ https://t.co/zWGYGZHski Getting ready for the day like: https://t.co/kMw4dnppsb Some of my faves with #IlluminateByAshley. Get some for yourself or as a gift at @ultabeauty online: https://t.co/BEcIUBXOa4 https://t.co/7TblnRym24 Through the looking glass. https://t.co/1p54IUqYDO Be the type of person you want to meet. ✨ Hey guys you can still get two palette for the price of $20 but only till Thursday!!! #illuminatebyashley https://t.co/NFwZSn9eis @EXPLICITISDALE with the holiday deals we had to push it! Gonna try to do one for Christmas! @TeamTisdaleFR in the new year! Best Christmas gift!! https://t.co/ZPJjP0ustT Holiday @ShopSignorelli mantra? 💋💋💋 https://t.co/8XPmj80p4Y 🙌🏼🙌🏼🙌🏼 https://t.co/pcbMjlSjb9 @ddpieroni beginning of December! @WannaBeLikeJLo I am! A little illuminating never hurt nobody. Get some of my favorite #illuminatebyashley products on @ultabeauty online! https://t.co/BEcIUBXOa4 https://t.co/kXXh0MNEqF SO necessary this season - this @shopsignorelli (faux) leather jacket from the fall collection. Get it here: https://t.co/bdwikONMVU https://t.co/3sZirPzqBR @EmWilliams91 I would order from https://t.co/NFwZSn9eis or https://t.co/WBRnkStSe3 or tillys! #illuminatebyashley is giving you 30% off everything! Just use the code ILLUMINATE at checkout: https://t.co/wRCvpffaKE❤️ #BlackFriday https://t.co/5X59j6HLgE @biebertisdale I know they seek out so fast! @itwaspineapples try refreshing the page! @seastruck hopefully the beginning of December!! 30% off EVERYTHING at  https://t.co/WolhD6QtQv GO GO GO!! #IlluminateByAshley https://t.co/zy9dYXD1VN @emilybnz restock will hopefully be before Christmas!! Happy thanksgiving!!!! Loonnng day of travel but excited to be celebrating thanksgiving with my grandparents tomorrow 😊 ☺️☺️☺️ https://t.co/t2AzKi7wPo 😉 https://t.co/lF16hqXoSe So glad y love it https://t.co/Fr6J2w3Fp4 😍😊😊 https://t.co/ceM4pAcD9L More music is here!! Head over to my YouTube to watch Chris &amp; I sing a cover of It's Alright, It's Ok. Thank you all so much for listening!! https://t.co/iBi0AGPTCM 💋💋💋 https://t.co/gnceoeFUfB So glad u love it https://t.co/RMAoNxrgoX 👍🏼👍🏼 https://t.co/8rybWtzMI4 Thank you!! https://t.co/39WtEYqE44 😘😘😘 https://t.co/6yN6lZUQBu 😍😍😍 https://t.co/9344Bx9O3G 30 minutes away from an all new Music Session up on my YouTube channel!! #TizzieTuesday https://t.co/eDxcVTXWlB Get ready!! Tomorrow is an all new Music Session #TizzieTuesday https://t.co/9109qxTUmD How much pokē is too much pokē? Hey guys! Since @ultabeauty online is Sold out of the Beach Goddess palette, you can also get it here @Tillys https://t.co/cidCm8ACHv #IlluminateByAshley Cream Cheek &amp; Lip Tint available at @UltaBeauty is the perfect stocking stuffer! Get yours here: https://t.co/VjrcyD1GpP https://t.co/MtIVAY20OB Me and @iamfrench are hardcore. We just hiked in the pouring rain. 💪🏼☔️ @Caitlin26x it is on iTunes! Always remember. 💡 https://t.co/7kTLf5qFR6 Keepin' it casual in @ShopSignorelli. https://t.co/r58tz3vXgH https://t.co/zlmz4SYdVq Be confident. Be you. Beyoncé. https://t.co/UNYmopgV3u ⚡️⚡️⚡️ https://t.co/sUt84ypX4B Thank you!! https://t.co/e7SJ4413zD @iamanaurushadze brushes are $15! Palettes are 14.50! 🙌🏼🙌🏼🙌🏼 https://t.co/e1cfj3IXK8 🙌🏼🙌🏼🙌🏼 https://t.co/PSvAdxCeFu 😍😍😍 https://t.co/l0oRNKRRHt I can't. #FavoriteTVCouple https://t.co/8EvXqI6H6h 😊😊😊 https://t.co/HcZpEYcxO5 @FernandoCandiaT it's next week! Tune in for Music Sessions!! Just got such exciting news about #IlluminateByAshley ✨✨✨ can't wait to share! But first, __________. Mondays are better with Maui. 💕 https://t.co/D7hNsTWVdq @Deadline @laurenlapkus aaaahh my favorite people in a movie together!! We're Best friends now! 😊😊😊 https://t.co/ez1ddUGvk3 @TeamTisdaleFR I don't have them! The photographer owns them. @ImanMalek19 @milliebbrown no it's just my phone 🙈 it freezes then tweets When you realize that @milliebbrown is following you, you all of a sudden feel so much cooler #11 #StrangerThings #myfavactres 🙌🏼🙌🏼 https://t.co/dC867MG8ih When I work out I really channel my inner Victoria Secret model and pretend I'm prepping for the runway show 💪🏼 Working @BlondieGirlProd inspired to develop some kick ass shows that feature women in all their glory 🙌🏼  #anofficefullofladies @emilybnz happy birthday!! But not everyone can see it… 👀 https://t.co/5MRaoEGEDt That's an awesome gift! https://t.co/u3yATQs9vn Be a light. Be loving. Be accepting. Live with an open heart and open mind. Stand up for what you think is right but with love not hate. So glad you love it! https://t.co/cMDIr8OwnY RT @PattiMurin: RT and sign if you agree.\n\nPetition: Electoral College Electors: Make Hillary Clinton President on 12/9 https://t.co/iS7DfK… The perfect shades for fall. Get #illuminatebyashley lip glosses and cream cheek + lip tints @ultabeauty online: https://t.co/BEcIUBXOa4 https://t.co/WsdlR2wcr0 Good morning!!!!! It's a brand new day and the sun is shining. ☀️ YES! https://t.co/Wzysc6UCYQ RT @EByard: This is how the future voted. This is what people 18-25 said in casting their votes. We must keep this flame alight and nurture… Downtown. https://t.co/BcKDvoF4Mj RT @sarahchalke: POLLING PLACES CLOSE AT 08:00 PM. IF YOU GET IN LINE BY 07:59 PM, STAY IN LINE. DON'T MOVE.\n\nSHARE. @iMascaraaa no I didn't but thanks for assuming that 😊 @ashfordshelby @MelyssaRenee I was just trying to \"lightly\" talk about who I voted for. I don't care to persuade someone else's choice. @ashfordshelby @MelyssaRenee actually I am educated on who I voted for. It's not just bc she's a woman. I don't need to share why! Yay!! So glad u love it! https://t.co/FfGiNrrqVm #imwithher https://t.co/XVlO4viteu It's #TizzieTuesday! Ask me anything on the video comment section for next months Q&amp;A! https://t.co/bgRHSMfDqf In less than an hour I'm answering all your questions on my YouTube channel! Tune in at 10! https://t.co/eDxcVTXWlB Look back at it. https://t.co/vhXeCP1ey5 Guys I'm already creating new #IlluminateByAshley for 2017 and I can't wait to share!!! New products are coming VERY soon! TOMORROW is the most important day! Don't waste it, get out there and VOTE!!! All the cool kids are doing it 😊 I just have to say @VirginAmerica has to be the best airlines. Sometimes they get you in an hour early to your destination 😊😊😊 #NotAnAD Use it on your lips or on your cheeks! 💕 #IlluminateByAshley Cream Cheek &amp; Lip Tint now available at @UltaBeauty: https://t.co/VjrcyD1GpP https://t.co/XFyvdrfgIf 👍🏼👍🏼👍🏼 https://t.co/9p2jGtOmqJ 💋💋💋 https://t.co/ducTTyMSGI Home stretch. Almost the weekend, guys!! https://t.co/CEXMeQOYfF Just be yourself. #DaveGrohl https://t.co/aCb9OjzGBf I'm not gonna tell you who to vote for, but I am gonna tell you to vote! Your voice matters more than u know, make November 8th count! @Dorenda_Lisa check out illuminate cosmetics on Instagram. I did videos with each brush! Let the adventure begin! Just landed in NYC! Post-Halloween got me like... #CHILL @shopsignorelli https://t.co/ysakRxLkNV Meow 🐱 https://t.co/7myMcocjSX Which artist will you be getting ready to tonight? 🎶 @ThePerezHilton @EXPLICITISDALE yes! I want to see the little ones 😊 @ThePerezHilton @EXPLICITISDALE that explains it 🙈 👍🏼👍🏼👍🏼 https://t.co/qYhe8HUvPB @EXPLICITISDALE @ThePerezHilton now I know why lol I was following his .com twitter page. 💁🏼 blonde moment @EXPLICITISDALE @ThePerezHilton I thought I was already following him! I'm so confused, I never understood why I didn't see his tweets to me 🙌🏼🙌🏼🙌🏼 https://t.co/P9lm0wMaXm 💋💋💋 https://t.co/PWr6uKdtHy Be silly, be honest, be kind. #RalphWaldoEmerson Yay!! https://t.co/kKbBDvCH7U 🙌🏼🙌🏼🙌🏼 https://t.co/WNbCFia7fm YES!! https://t.co/afyQdP0dJB Don't lose your fire. 🔥 https://t.co/p0FKvyyuEB It's here!! #SkylandersAcademy is now out on @Netflix! Watch and listen closely - I'm the voice of Stealth Elf! ;) https://t.co/tLvXnhiWmb Thank u! https://t.co/MTHYXodrsU ❤️❤️❤️ https://t.co/uWq4nbJv3r 👍🏼👍🏼👍🏼 https://t.co/tsi09FsBOS Downtown hangs. https://t.co/RRr5MhZ1Ic Woo hoo!! https://t.co/s8lQeihgnn @EthelRachel yes!! The goddess palette is coming soon! More to come!! https://t.co/wb9kQTJn5L 😊😊😊 https://t.co/I2RB5D7bad That's so crazy!!! https://t.co/vU0uRj12FD Thank u so much https://t.co/ef5n2pESzg Ur so sweet 😊 https://t.co/So9minGmoL Thank u!! https://t.co/xEEeTvNanH ☺️☺️☺️ https://t.co/oR1zDZT7n1 💋💋💋 https://t.co/Hq6VOw0rGq Ur so sweet!! https://t.co/3eco1J3S6m 😍😍😍 https://t.co/fhsUNGvgA5 So glad ur excited!! https://t.co/M8lSec3A98 💋💋💋 https://t.co/QTBjuET1q9 Thank you!' https://t.co/5SDVNpWgWb @Emsftmendler in 4 weeks! But it's a good one! 😊😊 https://t.co/bYmTOPJG4T 💋 https://t.co/s9KHE0g69T Thank you for all the support and love. ❤️ For the 1 million views on YouTube and the overwhelming response, we decided to release the song just for you guys!\nhttps://t.co/aWLCwarUPe Looks so good!! https://t.co/DMe9d6EOHx My niece has drama, film making, and guitar lessons after school. She's only 6 and I'm trying to just fit in her schedule. Yay! https://t.co/ygVaWdGO41 @TeamTisdaleFR I can't believe it's taking this long. I'll let u know as soon as I can! Don't mind me. https://t.co/c0u1UYS9Re Thanks!! https://t.co/66QNAhR0IZ 👍🏼 https://t.co/rA7qjOysKL @jbencantador it's coming!! 😊😊😊 https://t.co/F6GQFhL3kJ Thank u! https://t.co/jxqjcmAsBY 😘😘 https://t.co/WJddieuz0P Thank u!! https://t.co/Xyh0xmf5i0 It's really good! U gotta try it https://t.co/PHKGdlAf5t My Slammin' Salmon recipe is on another level. ;) Head over to my YouTube to see what we cook up in Girls Night In!! #TizzieTuesday https://t.co/6LzLrdTtUt Great pic! https://t.co/cB4PPr1k86 Yay!! https://t.co/ike5FZgqXx 🙌🏼🙌🏼🙌🏼 https://t.co/HnpAVMIK11 Your dream vacation spot &amp; favorite #IlluminateByAshley eyeshadow? @emilybnz beauty blender! So glad u love it https://t.co/7mCUovgW6H"}