{"tweets": "Biden and the Covid relief bill: https://t.co/BJMVLUviP1 Happy Birthday to @jleefilm!! Good producing means surrounding yourself with people from whom you learn something new every day. Go follow acclaimed director  @joncassar, from whom I get a daily education in cinematography, and without whom #TheOrville would be a pale shadow of itself. You’re welcome! Twitter: Sweating the small stuff for 15 fucking years. Happy Birthday to #TheOrville visual FX mastermind, @megamanex! Jimmy Stewart would be proud \nhttps://t.co/c7mr4Jw9RV Happy Birthday to the brilliant @PennyJJerald!!! PSA from the 1970s. Before science became so needlessly politicized, there seems to have been a real effort to educate the public in a way you don’t see as much of today. https://t.co/DOtlc2mowk An ensemble series thrives on its guest actors — Props to the terrific talents @iamandichapman and @NoshirDalal for their outstanding appearances on #TheOrville! Will Hollywood require Covid vaccinations for workers? In an industry where so many people are required to gather in groups, including actors without masks, it would seem (in 280 characters) no different than requiring immunizations to attend school. \nhttps://t.co/NNsiLUCVzZ A very ‘80s but very good episode of television adapted from a terrific short story written by Robert Silverberg in 1963.  Eerily predictive, and a worthwhile perspective on both the issue of racial and economic inequality AND the issue of cancel culture. https://t.co/YHL9itM11G RT @neiltyson: We’re just sayin’.  To abolish mask -wearing laws in some States while the rest of the Nation keeps theirs is like designati… RT @NASAPersevere: I’m on the move! Just took my first test drive on Mars, covering about 16 feet (5 meters). You’re looking at the very be… As vaccine rollouts continue, and vaccine skeptics once again prepare to throw up roadblocks against a speedier return to normalcy, the history of this conflict is worth learning. A perfect time to check out Arthur Allen’s fascinating history of medicine’s greatest lifesaver. https://t.co/0zIGZGXGji Correct. https://t.co/0Mbvkd0zj4 RT @TheOnion: Covid Announces Plan To Move Operations To Texas Full-Time To Escape Burdensome Regulations https://t.co/Wi26rEWANz https://t… Texas fails to grasp the long-term reality that recklessness accelerates all opportunities for the virus to mutate. If we continue to screw around with the virus instead of winning the race and getting rid of it, we’re gonna be at this a long time.  \nhttps://t.co/zH4EY35Wmd RT @peterwsinger: Imagine a world where Trump had leaned into mask wearing vs mocking it and how the right wing ecosystem would have follow… What happens when a global pandemic, a vaccine-resistance movement, and the age of conspiracy collide? A black hole of misinformation that poses a grave threat to public health:\nhttps://t.co/gWALmG5Q7Y RT @patatersWFLA: @SethMacFarlane You, fine sir...have finally made it. You are really going places, man. #FamilyGuy https://t.co/4k8NUIsRX4 Very excited to be working with the legendary @BillNye and of course the incomparable @BrannonBraga! https://t.co/Vvhoh4dbz8 Humans Are Animals. Let’s Get Over It.\nhttps://t.co/wmono2rc7V Sounds like what he’s saying is: We need to find a way to proactively continue to bend the long moral arc toward justice while discouraging certain factions of social media culture and tabloid opportunism from exploiting it for sport. No easy solution. https://t.co/hHqX3Ua630 RT @NicLovesBooks: #TheOrville elevator pitch: Space exploration in a future world where they solved capitalism but everyone's still an alc… How New York City Vaccinated 6 Million People in Less Than a Month — When a single case of smallpox arrived in Manhattan in 1947, a severe outbreak was possible. A decisive civil servant made a bold decision: https://t.co/k1qhej8qOv Vaccine rollout in California https://t.co/Z8R2W2Xopj https://t.co/h9SvQNEZtQ RT @WHCOS: This is what progress looks like. https://t.co/070Av9IkSj The predictive mechanisms of science can warn us of impending crises such as the seriousness of climate change... but sadly, human nature continues to steer us into denial until disaster strikes. Let’s learn for once.\nhttps://t.co/A2UNfTCxIn “If your party is hostile to government and exercising regulatory power because it is beholden to a donor class and right-wing ideologues, you will not be prepared for disasters when they strike.”\nhttps://t.co/08VQ4O0yyt Guys, when the person at your company with the most accountability is Glenn Quagmire, it may be time to examine your values. \nhttps://t.co/EYTkHuZFU8 RT @PaperWash: Twitter is the McDonald's of information A brand new paper from my friend @ericashenoy, who’s a hell of a lot smarter than me. https://t.co/fzWNz2Ez9V Prioritize the vaccination of teachers, regardless of age, TODAY. RT @UCSUSA: UCS thanks @RepYvetteClarke &amp; @SenMarkey for introducing the @FEMA Climate Change Preparedness Act! It would require FEMA to in… The Science of Reasoning With Unreasonable People\nhttps://t.co/p5lzck83im RT @cotteemusic: It's here! The Orville Season 2 soundtrack by myself, @JohnDebney &amp; @joelsephmc\nHear it at https://t.co/g7wbbtRrTY\n@SethMa… Fox News helped create the Big Lie. Now, as ratings slide, it can’t escape it\nhttps://t.co/7FFcgfLwkG Why is corporate America still donating money to climate change deniers? \nhttps://t.co/urefP0yRyp Thanks for the message,Tex. Sad news. Tim Scott was perhaps the most intellectually inspiring and impactful English teacher I ever had, &amp; one of the reasons I decided to write.  Very grateful to have had the opportunity to experience his class. He is most certainly not forgotten. https://t.co/BIZHwzpGRt RT @TomCostantino: In honor of the @TheOrville season 2 soundtrack coming out next week, I thought it was worth digging into the phone for… Most House Republicans Did What the Rioters Wanted:\nhttps://t.co/bYIZaARb4G RT @SashaSagan: This is what happens when we don’t teach critical thinking skills. Georgia, we love you. https://t.co/9b33fKgY2f 100%. https://t.co/gWxakk5kFW Go get it! https://t.co/ZEWkpGA4Kr RT @RichardDawkins: BioNTech/Pfizer &amp; Moderna vaccine both use revolutionary approach applicable to any future vaccines. Sequence a virus &amp;… #TheOrville Season 2 soundtrack is coming — featuring a sparkling 90-piece orchestra, and the compositional talents of Joel McNeely, John Debney, Andrew Cottee, and Bruce Broughton! https://t.co/Hldgzoczfy The one upside of the pandemic: The acceleration of mRNA technology. In the near future, it could be used not only to vaccinate against new and deadlier viruses at a faster production pace, but it could also revolutionize the fight against cancer: https://t.co/gMhyza5Iov Maybe you don’t know anyone with Covid.  But these people do.  Wear a mask.  Be safe.  Do your part. \nhttps://t.co/sezw5vz9xV Superb and informative. https://t.co/mr9QV4VgfV How Do Vaccines Work? https://t.co/7RB6z6vgXv Keeping my day job just to be safe. https://t.co/j5hmtxnz9m RT @TheOrville: And we’re back! Season 3 filming has officially started. #TheOrville 💫 https://t.co/jkMx19WbiE @MessyDeskGames we dig your Leviathan bridge! Thanks for your enthusiasm and your creativity! https://t.co/VpaKp0hg5d To the doctors, nurses, lab techs, hospital janitorial staff, etc. still bravely fighting this pandemic, we feel for you as we watch a nation take your selfless dedication for granted. Your frustration must be endless, but your heroism is appreciated.  https://t.co/fmOYAtet8k Orville season 2 scoring session — hopefully we’ll be doing this again soon. https://t.co/fx6UdBeuVu Does Trump’s Defeat Signal the Start of Populism’s Decline?  For the sake of a brighter future in which human civilization prizes knowledge, intellect, scientific integrity, moral courage, and critical thought, we can only hope.\nhttps://t.co/H5YuUrFuRr During this pandemic, you might be inspired by the heroic efforts of a man who was instrumental in the eradication of an even deadlier one—smallpox. Dr. Larry Brilliant’s work with the WHO effectively helped to wipe this disease off the face of the globe. Great read! https://t.co/1Z3qwkY7aP @EgotasticFT You warm our hearts. https://t.co/URrh7mESAK These guys do fun work: https://t.co/YdD0ya18Ay RT @neiltyson: Dear Science Deniers,\n\n(Anti-vaxers, anti-maskers, climate hoaxers, flat-Earthers, etc)\n\nYou found one another &amp; communicate… Hey all the tunes from me and @LizGillies are now available on Spotify! https://t.co/chqYJEfOd9 Saddened to heat of the passing of Helen Reddy.  A great recording artist and a great person.  Have a listen to one of her best: https://t.co/AcPwhpgDMM Can’t think of a better way to draw attention to this terrific book by Jaron Lanier than with a clean slate. Can we learn to use social media with discipline and selectivity? Or will it inevitably get the better of us? I don’t know. But let’s try this again from the top. https://t.co/Du3fxqE4aG RT @DavidSpade: Does my squash look like stewie? @SethMacFarlane http://t.co/n7H5cvji", "bag_of_tweets": ["Biden and the Covid relief bill: https://t.co/BJMVLUviP1", "Happy Birthday to @jleefilm!!", "Good producing means surrounding yourself with people from whom you learn something new every day. Go follow acclaimed director  @joncassar, from whom I get a daily education in cinematography, and without whom #TheOrville would be a pale shadow of itself. You’re welcome!", "Twitter: Sweating the small stuff for 15 fucking years.", "Happy Birthday to #TheOrville visual FX mastermind, @megamanex!", "Jimmy Stewart would be proud \nhttps://t.co/c7mr4Jw9RV", "Happy Birthday to the brilliant @PennyJJerald!!!", "PSA from the 1970s. Before science became so needlessly politicized, there seems to have been a real effort to educate the public in a way you don’t see as much of today. https://t.co/DOtlc2mowk", "An ensemble series thrives on its guest actors — Props to the terrific talents @iamandichapman and @NoshirDalal for their outstanding appearances on #TheOrville!", "Will Hollywood require Covid vaccinations for workers? In an industry where so many people are required to gather in groups, including actors without masks, it would seem (in 280 characters) no different than requiring immunizations to attend school. \nhttps://t.co/NNsiLUCVzZ", "A very ‘80s but very good episode of television adapted from a terrific short story written by Robert Silverberg in 1963.  Eerily predictive, and a worthwhile perspective on both the issue of racial and economic inequality AND the issue of cancel culture. https://t.co/YHL9itM11G", "RT @neiltyson: We’re just sayin’.  To abolish mask -wearing laws in some States while the rest of the Nation keeps theirs is like designati…", "RT @NASAPersevere: I’m on the move! Just took my first test drive on Mars, covering about 16 feet (5 meters). You’re looking at the very be…", "As vaccine rollouts continue, and vaccine skeptics once again prepare to throw up roadblocks against a speedier return to normalcy, the history of this conflict is worth learning. A perfect time to check out Arthur Allen’s fascinating history of medicine’s greatest lifesaver. https://t.co/0zIGZGXGji", "Correct. https://t.co/0Mbvkd0zj4", "RT @TheOnion: Covid Announces Plan To Move Operations To Texas Full-Time To Escape Burdensome Regulations https://t.co/Wi26rEWANz https://t…", "Texas fails to grasp the long-term reality that recklessness accelerates all opportunities for the virus to mutate. If we continue to screw around with the virus instead of winning the race and getting rid of it, we’re gonna be at this a long time.  \nhttps://t.co/zH4EY35Wmd", "RT @peterwsinger: Imagine a world where Trump had leaned into mask wearing vs mocking it and how the right wing ecosystem would have follow…", "What happens when a global pandemic, a vaccine-resistance movement, and the age of conspiracy collide? A black hole of misinformation that poses a grave threat to public health:\nhttps://t.co/gWALmG5Q7Y", "RT @patatersWFLA: @SethMacFarlane You, fine sir...have finally made it. You are really going places, man. #FamilyGuy https://t.co/4k8NUIsRX4", "Very excited to be working with the legendary @BillNye and of course the incomparable @BrannonBraga! https://t.co/Vvhoh4dbz8", "Humans Are Animals. Let’s Get Over It.\nhttps://t.co/wmono2rc7V", "Sounds like what he’s saying is: We need to find a way to proactively continue to bend the long moral arc toward justice while discouraging certain factions of social media culture and tabloid opportunism from exploiting it for sport. No easy solution. https://t.co/hHqX3Ua630", "RT @NicLovesBooks: #TheOrville elevator pitch: Space exploration in a future world where they solved capitalism but everyone's still an alc…", "How New York City Vaccinated 6 Million People in Less Than a Month — When a single case of smallpox arrived in Manhattan in 1947, a severe outbreak was possible. A decisive civil servant made a bold decision: https://t.co/k1qhej8qOv", "Vaccine rollout in California https://t.co/Z8R2W2Xopj", "https://t.co/h9SvQNEZtQ", "RT @WHCOS: This is what progress looks like. https://t.co/070Av9IkSj", "The predictive mechanisms of science can warn us of impending crises such as the seriousness of climate change... but sadly, human nature continues to steer us into denial until disaster strikes. Let’s learn for once.\nhttps://t.co/A2UNfTCxIn", "“If your party is hostile to government and exercising regulatory power because it is beholden to a donor class and right-wing ideologues, you will not be prepared for disasters when they strike.”\nhttps://t.co/08VQ4O0yyt", "Guys, when the person at your company with the most accountability is Glenn Quagmire, it may be time to examine your values. \nhttps://t.co/EYTkHuZFU8", "RT @PaperWash: Twitter is the McDonald's of information", "A brand new paper from my friend @ericashenoy, who’s a hell of a lot smarter than me. https://t.co/fzWNz2Ez9V", "Prioritize the vaccination of teachers, regardless of age, TODAY.", "RT @UCSUSA: UCS thanks @RepYvetteClarke &amp; @SenMarkey for introducing the @FEMA Climate Change Preparedness Act! It would require FEMA to in…", "The Science of Reasoning With Unreasonable People\nhttps://t.co/p5lzck83im", "RT @cotteemusic: It's here! The Orville Season 2 soundtrack by myself, @JohnDebney &amp; @joelsephmc\nHear it at https://t.co/g7wbbtRrTY\n@SethMa…", "Fox News helped create the Big Lie. Now, as ratings slide, it can’t escape it\nhttps://t.co/7FFcgfLwkG", "Why is corporate America still donating money to climate change deniers? \nhttps://t.co/urefP0yRyp", "Thanks for the message,Tex. Sad news. Tim Scott was perhaps the most intellectually inspiring and impactful English teacher I ever had, &amp; one of the reasons I decided to write.  Very grateful to have had the opportunity to experience his class. He is most certainly not forgotten. https://t.co/BIZHwzpGRt", "RT @TomCostantino: In honor of the @TheOrville season 2 soundtrack coming out next week, I thought it was worth digging into the phone for…", "Most House Republicans Did What the Rioters Wanted:\nhttps://t.co/bYIZaARb4G", "RT @SashaSagan: This is what happens when we don’t teach critical thinking skills.", "Georgia, we love you. https://t.co/9b33fKgY2f", "100%. https://t.co/gWxakk5kFW", "Go get it! https://t.co/ZEWkpGA4Kr", "RT @RichardDawkins: BioNTech/Pfizer &amp; Moderna vaccine both use revolutionary approach applicable to any future vaccines. Sequence a virus &amp;…", "#TheOrville Season 2 soundtrack is coming — featuring a sparkling 90-piece orchestra, and the compositional talents of Joel McNeely, John Debney, Andrew Cottee, and Bruce Broughton! https://t.co/Hldgzoczfy", "The one upside of the pandemic: The acceleration of mRNA technology. In the near future, it could be used not only to vaccinate against new and deadlier viruses at a faster production pace, but it could also revolutionize the fight against cancer: https://t.co/gMhyza5Iov", "Maybe you don’t know anyone with Covid.  But these people do.  Wear a mask.  Be safe.  Do your part. \nhttps://t.co/sezw5vz9xV", "Superb and informative. https://t.co/mr9QV4VgfV", "How Do Vaccines Work? https://t.co/7RB6z6vgXv", "Keeping my day job just to be safe. https://t.co/j5hmtxnz9m", "RT @TheOrville: And we’re back! Season 3 filming has officially started. #TheOrville 💫 https://t.co/jkMx19WbiE", "@MessyDeskGames we dig your Leviathan bridge! Thanks for your enthusiasm and your creativity! https://t.co/VpaKp0hg5d", "To the doctors, nurses, lab techs, hospital janitorial staff, etc. still bravely fighting this pandemic, we feel for you as we watch a nation take your selfless dedication for granted. Your frustration must be endless, but your heroism is appreciated.  https://t.co/fmOYAtet8k", "Orville season 2 scoring session — hopefully we’ll be doing this again soon. https://t.co/fx6UdBeuVu", "Does Trump’s Defeat Signal the Start of Populism’s Decline?  For the sake of a brighter future in which human civilization prizes knowledge, intellect, scientific integrity, moral courage, and critical thought, we can only hope.\nhttps://t.co/H5YuUrFuRr", "During this pandemic, you might be inspired by the heroic efforts of a man who was instrumental in the eradication of an even deadlier one—smallpox. Dr. Larry Brilliant’s work with the WHO effectively helped to wipe this disease off the face of the globe. Great read! https://t.co/1Z3qwkY7aP", "@EgotasticFT You warm our hearts. https://t.co/URrh7mESAK", "These guys do fun work: https://t.co/YdD0ya18Ay", "RT @neiltyson: Dear Science Deniers,\n\n(Anti-vaxers, anti-maskers, climate hoaxers, flat-Earthers, etc)\n\nYou found one another &amp; communicate…", "Hey all the tunes from me and @LizGillies are now available on Spotify! https://t.co/chqYJEfOd9", "Saddened to heat of the passing of Helen Reddy.  A great recording artist and a great person.  Have a listen to one of her best: https://t.co/AcPwhpgDMM", "Can’t think of a better way to draw attention to this terrific book by Jaron Lanier than with a clean slate. Can we learn to use social media with discipline and selectivity? Or will it inevitably get the better of us? I don’t know. But let’s try this again from the top. https://t.co/Du3fxqE4aG", "RT @DavidSpade: Does my squash look like stewie? @SethMacFarlane http://t.co/n7H5cvji"]}