{"tweets": "@KendrickPerkins Aww perkins. That was cute @A_Mora_Music @FrigginFalcon @godlevelklay @TKintheSFC @DrewShiller @loganmmurdock “Awww Kd wouldn’t commit to me” sounds personal...this nba shit ain’t about u champ... RT @boardroom: 2X Super Bowl Champ @JustinTuck on Risk/Reward w/ @ROSGO21 \n\n➖How he went from @NFL to VP @GoldmanSachs\n➖His personal drive… @JumpmanJordan Lock in broski @gmalone There’s No relax champ. No relax when I’m on Twitter. I’m on 10 until the second I close the app. You relax!! RT @boardroom: 🚨 @KDTrey5 has entered the room. 🚨\n\nJoin @ROSGO21 + our crew on Clubhouse! ⬇️ https://t.co/arS1EOjirr @_Semi44 If it’s one thing ima do, ima defend my honor on Twitter and not think less of myself...call me what u want @_Semi44 @woodclutch Stop responding to this stuff, u look sensitive 😭😭 @_Semi44 Here’s your reply. U welcome man, go finish your day now @DrewShiller @loganmmurdock This is hilarious RT @Boi1da: Is Mercury in Gatorade right now ? https://t.co/v4dNrGZTuF FiveM New Hanover Roleplay......link up, we need new members and opps https://t.co/5evJ2kpMK3 We're giving away 3 @NBATopShot All-Star packs on @boardroom 🔥 To enter sign up for our newsletter: https://t.co/kNzXzMDq4c\n\nMake sure you have an active #NBATopShot account in order to be eligible. https://t.co/npaPnleibj @Mali2Slimeyyy @Meelyurate @BankStatementzz @fau_kiu @ItsNoOne_ButRod https://t.co/ro18yYlnea @ItsNoOne_ButRod Let me guess, my “legacy” took another hit? @drdisrespect @ItsNoOne_ButRod I get what you’re saying but I come to Twitter to argue about sports and music Bro..it’s a simple concept for me lol @ItsNoOne_ButRod So what are u saying? @DrGuru_ @ItsNoOne_ButRod Its a little bit of both @ItsNoOne_ButRod I’m convinced y’all don’t watch basketball and you just want a response from me.. Proud to be an EP on this film, congrats on the Oscar nomination @TwoDistantFilm!! https://t.co/wHtBHVxbAA RT @boardroom: With today’s @andbox_official announcement, Kevin Durant joins an ever-growing list of current + former athletes to invest i… Proud to announce our newest investment in @andbox_official @subliners to continue the growth of esports in New York and beyond https://t.co/wwvOrhtJsM RT @boardroom: .@KDTrey5 &amp; @bansky are joined by famed writer/director/producer @RickFamuyiwa on a new ETCs:\n\n➖Rick’s journey as filmmaker,… @bfticketholder Yessir champ. I appreciate you, you been rocking since I was 15...love always @UofLSU Explain the difference then @GlacierBoiii @__johnye__ This 100% fact? @__johnye__ Were u there? RT @boardroom: Does @RickFamuyiwa have competition with fellow black filmmakers like @ava, @BarryJenkins and Ryan Coogler?\n\nOf course a “he… @_MattyMcFly I cooked you...you lucked up and stole the W @thelitoshow The decade 💯 @overtime https://t.co/QorzjVXMXo NEW @boardroom series hosted by @ROSGO21 in partnership with @GoldmanSachs. Thanks for coming on @jj_redick!! https://t.co/Zlj7ytgkEp 🔥🔥🔥 https://t.co/3Hu5cu2jOD https://t.co/Zppm3vxY3D They never gave us a chance, I had to take it\nI need all the payments, for everyday we suffered hatred.\nI want my granny to shoot the hands with Nancy Reagan These days Fame is disconnected from excellence, Half the time I have to ask these niggas What they profession is, ushered A generation in, these where my confessions live! 42 millimeter. Was made in Geneva. I’m moving way too humble\nWeezy handed it off, I still got no fumbles\n#FACT Truth https://t.co/JsVdHC5qwx Now I got it all and being honest I don’t really wanna talk about it.... and if I didn’t have it, wouldn’t wanna sulk about it... But I guess they must have they reasons\n\nThey wanna know how I’m livin my day to day life In the regular season Dog really out here lookin like golden state monta....@lildurk been in that lab https://t.co/EpBKUA2YRq @smokinOPs_ @kashdoll Nah, she really turnt up for no apparent reason dog @kashdoll You did not have to use those initials to get this tweet off...U have to relax with the KD talk, your name is KASHDOLL RT @boardroom: He says he doesn’t do much trash talking on the court, but KD knows a few guys who did.⁣⁣\n⁣⁣\nOn a new ETCs, @KDTrey5 tells @… RT @boardroom: How does company culture contribute to success? Here’s why @Apple’s Eddy @Cue takes building the right culture so seriously.… For those who can help 🙏🏾 @baby2baby: https://t.co/jIUbdBV79F https://t.co/1Ehx4uYtEb RT @boardroom: What is the cost of culture? Here's what @PierceSimpson covers in 1st ep of More Explanation Needed\n\n➖How a team’s culture p… SubZero is a menace. https://t.co/7YdvtoGfgg Bro approached that situation with elite level skill.... https://t.co/lkUUnGRvO5 SubZero looks locked tf in but this one is too tough to decide after the first look... https://t.co/D5ihcTXBHf RT @35Ventures: \"@Therabody is at the forefront of incredible opportunities in the wellness space, and we look forward to seeing what else… RT @35Ventures: We've invested in @GoldinAuctions to help amplify the growing world of collectables and memorabilia. \n\nRead more about the… RT @richkleiman: I'm discussing “ Boardroom: Whats New &amp; Next in Sports Business” with @ROSGO21, @bansky, @PierceSimpson, @ChrisLyons, @fly… 🤲🏿🤲🏿 https://t.co/OiRfL1iQjn We back... my brothers @PierceSimpson  and @Kameron_Hay joined us for this one...y’all already know @bansky was there!! Let’s get It https://t.co/zkQWrd0zi1 🙏🏾🙏🏾 https://t.co/OnbcK0adCS 🐐 https://t.co/Tei5yjWm1Y Aye, I don’t know who the fuck it is, but u gotta lock in mane(boosie voice) Yo @nba,  your fans aren’t dumb!!!! You can’t fool em with your Wack ass PR tactics.. #FREE7 https://t.co/78N1iKFAoc Free me RT @boardroompods: New #OutOfOffice w/ @OmarESPN\n\n-  Omar talks about how he started House of Highlights as a college student &amp; the acquisi… 😁😁😁 https://t.co/HaysfakUWd Congratulations to the @boardroom team on the launch of the new network site https://t.co/gKj3yb4dOj https://t.co/LEEgL8CENw Let’s get it @NickDePaula!!!!! https://t.co/OQBslRAoHU Speak on it @1Snoot https://t.co/B7MVbNJw2H Welcome, my brother. Let’s get it https://t.co/4ZXDH5wGYm RT @boardroom: We're collaborating with @sbjsbd to bring you more of our take on the sports biz every month in their print mag - and more o… Stay tuned to @boardroom tomorrow for news on our new collaboration with @sbjsbd Nah, I run that hit different right back the second she finish that first verse....every time RT @35Ventures: KD x @MasterDynamic\n\nInspired by the @nikebasketball #KD13 🔥🏀🎧 https://t.co/f1vVTLXYtP https://t.co/MweH22KutU RT @richkleiman: Wait till you get a load of this one https://t.co/v7imnzeR3T RT @boardroompods: New #OutOfOffice with Pro Football Hall of Famer Lawrence Taylor \n\n- @LT_56 talks to @richkleiman about winning 2 Super… RT @theaveragevoter: NBA media are tabloid correspondents who are building their own brand to be 1st in the checkout lines. @el_budget https://t.co/f4vrcuuj6J @randyjcruz @Travonne @BillyReinhardt EASILY....only Superman could get bane one on one imo @randyjcruz @BillyReinhardt @Travonne Iron man couldn’t get busy without the suit though. @Travonne @BillyReinhardt @randyjcruz Kill monger had hands but he got washed @BillyReinhardt @randyjcruz @Travonne Him being rich and incorporating tech made him cool to me @Travonne Bane son’d Bruce...until thanos I thought he was the most polarizing. @Travonne U really believe Batman is trash???? I also heard that Godzilla is originally 984 ft tall and they had to make him 300 feet tall to make this an even matchup. https://t.co/rwJMfE2QAC From the trailer, Godzilla was wreaking havoc In the water and on land. This looks like a landslide https://t.co/GVFijkk67b As soon as the god opens his mouth it should be a wrap...pause https://t.co/K6EAralO4e He definitely needs to be load managed. He’s been at it for a century https://t.co/auk4iawolX I can’t see Godzilla losing this matchup.... https://t.co/ylDfNdyMqk RT @35Ventures: Congrats to 35V portfolio company @hellobrigitapp on closing their $35M Series A Led by @lightspeedvp. Doing important work… The @TwoDistantFilm trailer is out now. So proud me and @richkleiman could EP on this incredible short film and can't wait for the world to see it. https://t.co/z7fpDlnUaR RT @boardroom: Introducing Game Plan with @Schultz_Report &amp; first guest @Cavs Head Coach @jbbickerstaff_\n\nHighlights:\n- His experience as a… RT @boardroompods: What's it like being a digital entrepreneur, angel investor, social media personality AND Chief Strategy Officer for @tr… It’s not sweat. It’s your body crying tears of joy. @Degree won’t let you down. #DegreePartner #KeepMoving https://t.co/eigNG4uq0B RT @boardroompods: NEW #OutofOffice: TAO Group co-founder @JasonStrauss joins @richkleiman to discuss his hospitality business w/Noah Teppe… RT @boardroompods: .@SHO_Billions co-creator @briankoppelman joins @richkleiman on a new episode of #OutOfOffice to talk about becoming a c… This is my Why. What’s yours? #TeamNike https://t.co/XmopfAQryF RT @boardroompods: “I’m learning to really evolve as a businessman and having some great vets is the best thing you can have as a young guy… RT @boardroom: 🚨 JERSEY GIVEAWAY 🚨⁣\n⁣\nFollow @broombreakers for all things trading cards and to enter to win an authentic @KDTrey5 game-wor… Had to close out the year with The ETCs and @QuavoStuntin, we're taking a lil break but we'll be back soon with more 👀 https://t.co/GajiLSQHGU https://t.co/rfPMBShhVv RT @boardroompods: .@KDTrey5 talks to Mr. Big Baller Brand himself, @Lavarbigballer, on his 3 sons making it to the NBA, @ZO2_ , @LiAngeloB… RT @boardroom: \"These cards were $2,400 and now $20,000...Card I paid $600 for is now $5,000. These are not little returns.\" - @DanFleyshma… RT @35Ventures: Our friends at @SleeperHQ just launched a brand new way to play fantasy basketball &amp; follow the @NBA season with your frien… @jadande 😂😂😂😂😂 We’re just getting started at @DurantCenter, let’s support future leaders together: https://t.co/2ICdDO3Gnm https://t.co/TpWwRehiuc RT @boardroompods: .@DaveGrutman talks about the importance of being professional, how he identifies workers who have the \"X factor,\" and h… https://t.co/RQpwBZlGy1 https://t.co/zgfPxhgrBw https://t.co/UcNR1xsaXW https://t.co/obHyfyetZt RT @richkleiman: Congrats to my dear friend @jgebbia amazing work! .@Verizon Up members get a chance to join me and @boardroompods for a live taping of an upcoming episode of The ETCs. Claim your ticket in the My Verizon Up app https://t.co/82umMaGGBd #VerizonUp RT @35Ventures: New threads 🔥🎨 \n\nInspired by Brooklyn-born artist Jean-Michel Basquiat\n\n@KDTrey5 @BrooklynNets https://t.co/PdeVqelWmx RT @brkthroughprize: The big reveal! Thousands of students across the planet made brilliant science videos for this year’s Breakthrough Jun… RT @boardroompods: Biggs always knew @kanyewest was a star, from day one.\n\nAnd for that confidence, @1996Biggs &amp; Roc-A-Fella were rewarded… More to come... ICYMI ⬇️ @NBA2K https://t.co/vGv3xJ1yJt Season 3 of @NBA2KMobile is here 🔥\n\nThe first 50 people to hit Redeem in NBA 2K Mobile and enter “KDSEASON3” will get my Sapphire card https://t.co/fNYaxxGJMF RT @boardroompods: Thanks @Spotify for naming #TheETCs w/ @KDTrey5 as one of the best pods of 2020! #SpotifyWrapped \n\nhttps://t.co/5Nf4Ib0E… RT @boardroompods: .@curtismartin talks about what motivates him in business, from earning money in order to give back more to the communit… RT @HYPEBEAST: HYPEBEAST spoke to the two-time NBA champion about his aspirations for the game's development, his favorite player in 2K to… Time to get to work @NBA2K \n\nMore info —&gt; @boardroom https://t.co/vGv3xJ1yJt @dkeys7193 Mj is one of one, God level, unmatched, unparalled, a pure master at this shit. I’m still watching his games to learn. Leave me out of it please RT @boardroompods: New #OutOfOffice episode 🎙\n\n@richkleiman &amp; Gianni discuss their favorite lifestyle brands, rank the top influencers in s… @itsAyane It’s tied 1-1, we gotta lock in for the death match lol. That point guard you played with was INSANE! 🔥🔥 @MasterDynamic https://t.co/jTbEJ7GVsE #2KFest is going down on Twitter, tune in now: https://t.co/vPJu6uwfu3 RT @boardroom: What's @Tonal and how are elite and amateur athletes using it?\n\nFounder @aorady discusses his journey to building Tonal,  ha… RT @boardroompods: How do @USMAN84kg and @KDTrey5 deal with opponents who try to get under their skin? Or a hostile arena and still perform… New pod ep with @USMAN84kg https://t.co/e4Zov4GKYC https://t.co/GAvAUFhX88 RT @boardroompods: \"I learn from the street... I'm not going to go to get an MBA from f****** Harvard\" - @garyvee talks about the advantage… .@MixedByAli dropped gems this week on the ETCs...https://t.co/b5epsV2QZq https://t.co/YeRDyoOQ5Q RT @boardroompods: 🚨 #OutOfOffice Ep 15 w/ @atptour tennis pro @NickKyrgios\n\n- Kyrgios talks about the difference between hoops &amp; tennis cu… RT @boardroom: What does the future of racing look like post-COVID? @NYRR SVP of Partnerships Christine Burke joins us to talk about how th… RT @35Ventures: Court 22 ✔️ #BuildItAndTheyWillBall #KDCF ⁣\n\n📍P.S. 115K - Canarsie, Brooklyn ⁣\n⁣\nSpecial thank you to our partners at @tpl_… RT @35Ventures: The 2020 Supporters’ Shield Champs 🛡🏆⚽️ Congrats @PhilaUnion!! #DOOP https://t.co/iw1JgDYwj0 Nav and wheezy https://t.co/6586LU075z RT @boardroompods: New #OutOfOffice 🚨 Former @NFL Pro Bowl WR @BMarshall joins @RichKleiman to discuss his NFL career, how his House of Ath… Ep 3 is up https://t.co/oNcUAyRSps #TheETCs https://t.co/3zUruyoHDg @FargoPacino4 U know for a fact that I said this? @TyeCrane_ It’s sick 🤲🏿 https://t.co/g4an49vqRT @MrNet718 @LarryGrant95 @DepressedNet U know how these dweebs do it. Anything for engagement @LarryGrant95 @DepressedNet Larry, hop out them feelings my g....it’s a fake quote RT @boardroom: #YoungCEO Experience is going down TODAY 🔥 Who’s coming thru?\n\n@overtime @Degree ➡️ https://t.co/QXRAcdAkWp https://t.co/glw… @_chrisdanger @PapiMally Just shows u how emotional people are @PapiMally Look at u, Emotional @LoudPiff85 Triggered @BrandonRobins1 Triggered RT @BrooklynNets: The @boardroom x @overtime #YoungCEO Experience featuring @KDTrey5 and @SteveNash is tomorrow! Pre-register below ⤵️ @iSpeakComedy Any comedian&gt;&gt;&gt;&gt;&gt;&gt;you The football team &gt;&gt;&gt;&gt;&gt;&gt;&gt; the cow boys RT @boardroom: #YouCantStopOurVoice @Nike gets out the vote. https://t.co/AyB3jLAiqs RT @boardroom: .@Therabody founder Jason Wersland joins @ROSGO21 to talk about the journey that led him to create the prototype for the The… RT @boardroompods: What was it like playing in Atlanta and sharing the center stage in the culture with local hip hop stars, including @Out… RT @boardroom: .@michaelrubin keeps it real when talking about his responsibility as a sports owner. His goals are to win championships for… See you there https://t.co/5RVydE3sNa Never let a screwface heckler spoil a lecture... RT @PhilaUnion: 🚨Philadelphia Union have reached a historic transfer agreement with @redbullsalzburg for Homegrown Midfielder Brenden Aaron… Young CEO coming Oct 27 @boardroom @overtime https://t.co/bB1A0wSkxT https://t.co/B0me609fMp New ep out with @OVO40 #TheETCs https://t.co/Npw2b4S1OF https://t.co/ycfwAl3pGv RT @boardroompods: Ep 2 of #TheEtcs 🎙️ @KDTrey5 &amp; @bansky talk to the man behind @OVOSound &amp; @Drake: @OVO40.\n\n40 talks all things Drake, OV… @ChrrisYoung That time coming RT @boardroompods: .@LarryJackson talks about the early days of @beatsbydre’s iconic headphones and starting Beats Music with the legendary… @TavaresBriggs Damn U bringing back memories with that lol My mama used to sit me down and get her Bible out...\nTwo days straight, teach revelations to me\nFruits of the spirit, love, and patience to me @jeremyjoemills @thecrawsover @JCrossover 🔥🔥🔥 @_JNeel Finally somebody gets it. Rest of these people have no fun @JayRichardson99 Explain what u mean jay? @JayRichardson99 I wanted to put u on live tv since u crave attention so much... @JayRichardson99 These practice squad players talking like starters, I hate it They left earth https://t.co/3QisLQO7rn 💪🏾 Great convo w @ROSGO21 &amp; @talkspace founder on @boardroom x @Degree https://t.co/32nXUaIKeZ RT @espn: Breaking down @JimmyButler's 40-point NBA Finals performance in the latest episode of Detail with @KDTrey5, streaming now on ESPN… RT @boardroom: Aaron Gordon @Double0AG talks about his lifelong love of technology, the growth of cryptocurrency, and how digital collectib… RT @boardroompods: 2x FIFA World Cup Champion, 2x Olympic gold medalist, &amp; soccer icon @CarliLloyd joins @Richkleiman on this week's #OutOf… Yo @jayrock, I kno you’re making music right now. I wanna hear it Part 2 of #TheEtcs with @KyrieIrving is out now.. https://t.co/bethVM5ZH1 https://t.co/Vyqe1OtDNz RT @PhilaUnion: Today, partnering with the Kevin Durant Foundation &amp; @35Ventures, over 300 emergency food boxes were donated through @CityT… 🔒 #TheEtcs @boardroompods @boardroom ⁣\n⁣\nThanks to my brother @KyrieIrving for coming on the pod ⁣https://t.co/tpCI9hkQy5 https://t.co/yzJ1RI8BOs RT @35Ventures: #KDCF completes our 21st #BuildItAndTheyWillBall renovation project at P.S. 152/315 in Brooklyn, NY.⁣\n⁣\nNow more than ever,… Court 21 for the next generation of Brooklyn hoopers #BuildItAndTheyWillBall⁣ https://t.co/F09lfblbsk #TheEtcs first episode dropping Tuesday...@boardroom https://t.co/LF5bWfiQd1 RT @elonmusk: Cybertruck, ATV, Roadster &amp; Semi\nC A R S https://t.co/4Aq1A5cYkH RT @boardroom: This week on #OutOfOffice, @richkleiman talks to @GoldmanSachs CEO David Solomon about his journey to the top, changing comp… First episode of Inspired to Move..showing the ways tech &amp; wellness founders are helping people to #KeepMoving every day. Stay tuned for more @boardroom @Degree https://t.co/H7IbHo6UJw https://t.co/CwBow73ADY Young CEO coming Oct 27 @boardroom @overtime https://t.co/bB1A0wAJ9j https://t.co/Ebj5ZLG1T6 @7elevenst Lock in @Ron_Ruben Bro, focus on your ministry @_rickyfiggg Can u please explain what this new title means? @FleelixTrinidad @Being_wokes U ok? RT @boardroom: Bill Duffy talks about growing up in and around Chinese culture and how that played a role in to being able to build a brand… @bmoe_careful It’s okay to congratulate us on a W The Football Team RT @boardroom: “I’m excited anytime a player, former player gets a job as a coach in the league. I’m excited.” - @KDTrey5 on @SteveNash joi… RT @AntoGriezmann: Thanks @KDTrey5 !!! Un honor vestir el 7 en el Barça! #SomHi #Grie7mann #ViscaBarça Hopped on a bonus ep of Out of Office this week with @jj_redick @richkleiman @talter https://t.co/WxI4m5RaHi https://t.co/M27PVy07VC Which is more important? Getting or letting go? Are you doing this work to facilitate growth or to become famous? New era @whoisjwright @WashingtonNFL https://t.co/VJgdw4Uupj @renzowind @bansky Damn @bansky it is....@renzowind are you sure that everything u said is true? @ludagrizz @bansky @bansky there’s smoke for u RT @TheEliteMedia_: The 2020 NBA Draft Lottery is tonight.\n\nCheck out what @TMCvision did for us back in July. \n\nYour favorite team’s franc… @EllisJBrice @JoelEmbiid https://t.co/N1P69HQNjo @cor_jch This may be a reason and also the obsession over stats and analytics... @_Zeets @JNCO_suave @freedarko Why are u taking the internet so serious right now zeets? He’s just a random lol RT @TheUndefeated: The Washington Football Team's new president Jason Wright says he is the best-qualified person for the job, regardless o… @JoshEberley @russbengtson @C4DUNK @RooshWilliams Lol do as u please josh....who am I to tell u how to be a fan? @JoshEberley @russbengtson @C4DUNK @RooshWilliams Since u have no control, u daydream about differnt scenerios? @thekolsky @_Zeets @freedarko Yea, it’s not REALLY affecting any part of my real life but at some moments i don’t mind indulging in the fuckery 🤷🏾‍♂️...should I be doing it?? I believe so lol @GEN4Glockboy @_Zeets @freedarko I seriously don’t know @_Zeets @freedarko Like how serious do I take it? @freedarko 🤔 @OrunyChoi Lol @TJPhilpot5 @orastaa @envyrgn @RooshWilliams @Prez What’s the difference? @russbengtson @C4DUNK @RooshWilliams What’s the difference? @EJ_Will2 Its why I still have twitter...they want me to act professional on the internet. No, I won’t lol @orastaa @envyrgn @RooshWilliams @Prez Since u replied to me first, what does it make u? @orastaa @envyrgn @RooshWilliams @Prez Are u triggered because I’m tweeting? @russbengtson @C4DUNK @RooshWilliams U think about this everyday since it happened? @RooshWilliams Nah because it’s a pointless excercise that’ll only confuse the mind. Reality is what it is @envyrgn @RooshWilliams “I scroll through my timeline during these wild times and I started to read...” @MrRegTheBest @RooshWilliams U didn’t stop watching so was it really? @RooshWilliams There’s a lot of things in history that would be differnt if you just changed something. @RooshWilliams Still?? @FucckJoeCecot @bansky You https://t.co/gDnRKAQF4r RT @ysldyl: Thug got a fucking pilot license😭😭🐐 https://t.co/GhG7rtgpw8 @FucckJoeCecot @bansky This is a funny tweet @Stopthecap10 @SouthernSincere No lol or nothing? U actually believe this? 🤦🏾‍♂️ @urkle9 We good bro @sighIess @CoachFaulkie He told that man he sold his soul 😂😂😂😂 I’m cryin @sighIess @CoachFaulkie Lmao nah bro really pissed at bansky... @sighIess @CoachFaulkie Which agenda? @CoachFaulkie ? @CoachFaulkie Nah I really don’t get it @CoachFaulkie ? RT @boardroom: Caron Butler @realtuffjuice joins @ROSGO21 to share his thoughts on the success of the #NBAbubble &amp; praise of Adam Silver, t… This Dolph..... https://t.co/c38OgvFhfQ First @boardroom podcast out now 🔥🔥🔥 thanks for coming on @jack https://t.co/mkyr48VofY RT @richkleiman: First podcast for the @boardroom hope you enjoy and thank you to @jack for supporting us always @LosMurillo126 I got Jesus gettin a stop @JimmyAn05128455 Ill never grow up, jimmy @CardoGotWings It’s time @zee_the_creator Lol youre enjoying this experience. You won’t forget about this day...ever!! @zee_the_creator my bad, I accidently pressed follow and liked all her pics, my phone trippin @Stopthecap10 @zee_the_creator All u do is tweet about ball and you’re probably trash. I play but when I tweet about it, ima dork. Make it make sense @KuzPalms @LazyxDaze @arieshoopz @ufeeeelme @FrankNtilikina @_MiddlexChild @YCSNOW23 @zee_the_creator So why are u talking? @ufeeeelme @Aaron99102 @FrankNtilikina @_MiddlexChild @YCSNOW23 @zee_the_creator And u should be focusing on me?? What’s bout your business ventures? @WinItFortheH @aguado_16 😂😂😂 @ufeeeelme @FrankNtilikina @_MiddlexChild @YCSNOW23 @zee_the_creator What’s your point? @arieshoopz @ufeeeelme @FrankNtilikina @_MiddlexChild @YCSNOW23 @zee_the_creator I did it just to piss people like u off @ufeeeelme @FrankNtilikina @_MiddlexChild @YCSNOW23 @zee_the_creator Bro want me to be insecure so bad...ok im insecure about my right eye being a little lazy...your turn @aguado_16 Congrats on graduating. Welcome to the real world @SiloSara I have hurt a lot of people personally with my prediction, for their well being, I take it back..Lakers in 1 😂😂 @EliteFlite @zee_the_creator U sure? @zee_the_creator Somebody’s pissed RT @bansky: So excited for you guys to see what @KDTrey5 and I have been working on with #TheETCs \n\nSeptember. Get ready..@theboardroom @richkleiman pod dropping aug 12, my pod The Etc's coming soon... https://t.co/VtOSV3HUj4 We here... https://t.co/pPyoxFJUyh Thanks for having me on ladies https://t.co/zrWgQBEQIt RT @boardroom: .@WashMystics star @tinacharles31 joins @richkleiman to talk about her experience producing \"Charlie's Records\", her philant… @EricSoHollywood Boys still wanna talk about who got the most swag...okaaay, u guys are cool..congrats @TimAlberta Go do your research Tim. U sound stupid #14 is a different breed.. @ILLest_Isaiah 😂😂😂 Yooo @god we good? https://t.co/j8BRSQ7MfC RT @boardroom: .@WNBA star @angel_35 talks to @rosgo21 about adjusting to life in the #Wubble, the league dedicating their season to social… Basic ass black jacket, but it’s Prada fool\nPeelin hunnids til my mama say “I’m proud of you” @Cole_Killa Preciate u champion..in due time https://t.co/zjWFCcPaOt @aj7157 Too much of one thing can be detrimental, I agree @aj7157 It’s not impossible. @aj7157 Says who? Idle time&gt;&gt;&gt; Normalize coaches in slacks and a polo. Everything come full circle, word to the boss above me Show them how it’s done @JCrossover https://t.co/W9m2WNMXRN RT @MasterDynamic: Introducing #MasterDynamic x #BAPE, a limited-edition collaboration featuring #MW65 Headphones and #MW07 PLUS Earphones.… @KingJames WE BACK!! 😂😂 https://t.co/MoAIBMUqwY https://t.co/1ciAaaRPfN @Jon_Mitchell3 Is this guy making it seem like I said this recently? Some ask me, “Jay, man, why come for so many years, you been exempt?”\nCause familiarity don’t breed gratitude just contempt.\nAnd the price of sanity is too damn high, just like the rent...... Just gettin started @PhilaUnion https://t.co/iMCPUmFvYm RT @espn: Team from @Boardroom, @35Ventures and @RichKleiman building multimedia storytelling &amp; working with ESPN to reimagine how to bring… RT @PhilaUnion: Our players had a message today: #BlackLivesMatter https://t.co/wCVx6DPBro Great convo with Jim before game 1 tomorrow https://t.co/ugyKFx1KJQ We ready @PhilaUnion ✊🏾 https://t.co/GZ4cyg6xGw In the land before time, a land before alter boys, synagogues and shrines...man was in his prime RT @boardroom: “A big thing that you’re gonna see happen is guys get recruited to the wrong level whether it’s too high or too low,” said R… @BLCity5 @edWoodwardceoW @NBArath23 Tell em @edWoodwardceoW @NBArath23 Talk to em @MarkBruty https://t.co/LbzgxiHQrj @BleacherReport 😁.. RT @boardroom: Journalist, podcaster, TV personality, &amp; entrepreneur @jemelehill joins @ROSGO21 to talk about her new @VICE show w/ @CariCh… https://t.co/DW2VWEtOR7 https://t.co/x5ue4Bgz35 RT @boardroom: .@Astros' @TeamCJCorrea &amp; @lmccullers43 give us a look at how they’re breaking into the media business with the making of #T… Join us tonight: https://t.co/SUfc3LoRfL https://t.co/tfbU9tz8Og Proud to partner with @Degree to donate $1M &amp; help more than 100K kids #KeepMoving. Together with @laureus_usa we're supporting #SeatPleasantRec #DancingGrounds @GirlsintheGame @HarlemLacrosse @KidsintheGameNY @LEADAtlanta @MKickersSC @NewHeightsNYC @peaceplayers @rownewyork #ad https://t.co/JuvzW49yWx RT @PhilaUnion: Join us for live Q&amp;A sessions, silent auctions, a prize draw, &amp; a special appearance by @KDtrey5!\n\nYOU can help us bring CO… RT @boardroom: .@SleeperHQ CEO Nan Wang joins @RichKleiman to talk about the future of fantasy sports, the evolution of fantasy leagues as… Let’s go!! https://t.co/jT1Tw5EarL RT @boardroom: FanDuel CEO Matt King joins @RichKleiman to talk about how he got into the sports business, the sports betting legalization… RT @AgentNicoleLynn: Thank you to @KDTrey5\nfor creating a platform where important conversations can happen. Checkout my interview with the… Thanks for the love @PhilaUnion @markmckenzie4_ @AntFontana99 https://t.co/M8xefhXO2H RT @boardroom: .@HoustonRockets GM @dmorey joins @richkleiman to talk about his \"Moneyball\"-style background in sports, working with player… RT @DrGuru23: @KendrickPerkins It’s all good Perk! Real NBA fans know you were one of the most lethal hoppers back in the day  https://t.co… RT @wilsonchandler: Where there’s no vision the people will perish. Proverbs 29:18 RT @wilsonchandler: Ex players turning into suckers right before your eyes on television. It’s official!! Looking forward to working with @PhilaUnion for years to come 💪🏾 https://t.co/Usg0HOdKVY RT @boardroom: .@heydb joins @RealJayWilliams to discuss the amount of prep that goes into 🏀 analysis, her career trajectory, what the @NBA… RT @richkleiman: Impactful conversation from industry trailblazer @AgentNicoleLynn https://t.co/J62Igc2KYn RT @elonmusk: Selling weed literally went from major felony to essential business (open during pandemic) in much of America &amp; yet many are… @KurtisHair @MossMax123 @netsstan You’ll be aight! @KurtisHair @MossMax123 @netsstan U still mad? @KurtisHair @MossMax123 @netsstan 😢 @joel1zellem Everything is low key to you lol @wilocrek @joel1zellem not my type of humor I guess. @wilocrek @joel1zellem Still wasn’t funny @sbragg420 Yessir RT @nikebasketball: The KD13 ‘Home Team’.\n\nInspired by Brooklyn’s distinct team look, @KDTrey5’s latest silhouette sports an all-white uppe… RT @boardroom: .@CAA_basketball co-head of marketing &amp; services @lisjoseph talks about what it takes to build an athlete's brand, from what… RT @35Ventures: .@VicOladipo, @QCook323, @JeramiGrant, &amp; many more of basketball’s elite came thru the program Morgan Wooten created at DeM… Appreciate you jumpin on @RexChapman! https://t.co/rZlfj0TcM5 @HPbasketball @KCJ_Swish @badtweetsonline @PaulMilitello @samialhaw22 @enfuego_22 @SteveCannady @ZTD1989 Yes. @badtweetsonline @HPbasketball @PaulMilitello @samialhaw22 @enfuego_22 @SteveCannady @ZTD1989 Tim Duncan was a fierce leader and competitor. I bet he had some dudes shook in that locker room over his 20 year career lol @HPbasketball @PaulMilitello @samialhaw22 @enfuego_22 @badtweetsonline @SteveCannady @ZTD1989 Held accountable* @RondoBongos @HPbasketball @PaulMilitello @badtweetsonline @SteveCannady @ZTD1989 I think u understand mj more than u think @epark1016 @HPbasketball @badtweetsonline @SteveCannady @ZTD1989 Talk to em Unc @enfuego_22 @HPbasketball @PaulMilitello @badtweetsonline @SteveCannady @ZTD1989 Tell em @Hendo968 @HPbasketball @badtweetsonline @SteveCannady @ZTD1989 Who did he manipulate? @HPbasketball @PaulMilitello @badtweetsonline @SteveCannady @ZTD1989 If you love basketball you would understand Mike. If you just like basketball I can see why u would say he’s mean lol @PaulMilitello @HPbasketball @badtweetsonline @SteveCannady @ZTD1989 PREACH @Hendo968 @HPbasketball @badtweetsonline @SteveCannady @ZTD1989 Sociopath? Define the word please @HPbasketball @badtweetsonline @SteveCannady @ZTD1989 How is that different? @NBATakesForDays @jkirk41 @badtweetsonline @HPbasketball @SteveCannady @ZTD1989 The sport is about beating your opponent. There is usually someone in front of u while you play lol It’s either you or them, it’s sports. @HPbasketball @badtweetsonline @SteveCannady @ZTD1989 You can care about others and enjoy the process but still hate to lose. Being competitive at something doesn’t take away your soul @jkirk41 @badtweetsonline @HPbasketball @SteveCannady @ZTD1989 Unhealthy? What’s unhealthy about going to work and being the best you can be every day? @HPbasketball @badtweetsonline @SteveCannady @ZTD1989 Wow that’s crazy @badtweetsonline @HPbasketball @SteveCannady @ZTD1989 You’re probably the only person on earth who feels that way lol @HPbasketball @SteveCannady @ZTD1989 All I’m saying is it’s not healthy. The game is enough in my opinion @HPbasketball @SteveCannady @ZTD1989 Name those reasons @SteveCannady @ZTD1989 @HPbasketball Why does it matter? They show up to dominate, why are u so tied into their emotions? @Jessicuhhh Very proud. @absolutelypaco @HPbasketball Take that in real quick. U might get inspired https://t.co/hwzwo9poui @ZTD1989 @HPbasketball what does mj regret? @absolutelypaco @HPbasketball Which cryptic tweet had u wondering? @BlackkYoda @HPbasketball 🤲🏿🤲🏿🤲🏿 @BlackkYoda @HPbasketball Glad u still here my g.. @absolutelypaco @HPbasketball What stuff? @absolutelypaco @HPbasketball What made u come to that conclusion? @DSimpso11 @throwpick @willy08lora @HPbasketball “Superstars” care about shit. @throwpick @willy08lora @HPbasketball At this second, Yea, breakfast almost done. Stay tuned though @willy08lora @HPbasketball U should know the answer to that question lol you don’t need me to tell ya @See_Hendo 🤲🏿 @HPbasketball Is it possible to be happy at all times? @AttyCCN @eorvieto @DrewShiller Someone cares about you Carson. Keep ya head up buddy @priddy_nikki81 You won that bet @AttyCCN @eorvieto @DrewShiller Since u know. What do people care about? @AttyCCN @eorvieto @DrewShiller I disagree. @Vincent40001 @DrewShiller He’s infatuated with me but drew was always scared to say anything in person. Just awkward head nods lol @DrewShiller I’m using the app the same way u are @DrewShiller Why do u care? @DrewShiller I can’t respond to someone i follow? @patronusisotter @HPbasketball So what does this make u? @BryanIsTheKing @HPbasketball Cry some more. @BryanIsTheKing @HPbasketball Boo hoo @HPbasketball Sensitive ass @shawathletics @JalenRose I wanna know how many points Jalen thinks he would average today So excited to add original stories to the @boardroom brand hope you enjoy: https://t.co/yprcOQTXjF https://t.co/Tz3GKnfb6T RT @MichelleObama: I know how hard the #Classof2020 has worked to make it to graduation, so @BarackObama and I want to give you the celebra… @wilsonchandler That’s that SoundCloud jay. The elegant celebration sent tremors through every nation, the stars align like cars at grand central station.... New @boardroom with #TheLastDance director. Up now! https://t.co/JSuPIW174B RT @boardroom: Checking in with @cardinals' @aybaybader on staying fit while quarantined after spring training was put on hold &amp; his hopes… RT @boardroom: .@PhilaUnion midfielder @AleBedoya17 talks to @RealJayWilliams about his career, how he became an entrepreneur and activist,… The first #KD13 gamer exclusive with @nikebasketball starts Monday! Unlock the drop by winning a MyPLAYER Nation playoff game on @NBA2K 🔥\n\nU.S. only. Learn more: https://t.co/h3kcevMXs6 https://t.co/aZsibnuWaS @KashMeOut_ U mad? Here we go @richkleiman @AUProSports https://t.co/YBorNvSVxU @ryforry U mad at my list? “Your arms to short to box with the sender of the prophets...aviator shades, the stage is a cockpit.....” “You can’t dance with the chancellor, one glance will have u caught up in the  trance of the tarantula.....” My brother @JCrossover is taking over @boardroom. Ask him anything 👀 https://t.co/FoYaFwEWcH Excited to show the world a story close to my heart. #BasketballCounty: In The Water coming May 15 to @ShoSports https://t.co/JIVwQpPdfo", "bag_of_tweets": ["@KendrickPerkins Aww perkins. That was cute", "@A_Mora_Music @FrigginFalcon @godlevelklay @TKintheSFC @DrewShiller @loganmmurdock “Awww Kd wouldn’t commit to me” sounds personal...this nba shit ain’t about u champ...", "RT @boardroom: 2X Super Bowl Champ @JustinTuck on Risk/Reward w/ @ROSGO21 \n\n➖How he went from @NFL to VP @GoldmanSachs\n➖His personal drive…", "@JumpmanJordan Lock in broski", "@gmalone There’s No relax champ. No relax when I’m on Twitter. I’m on 10 until the second I close the app. You relax!!", "RT @boardroom: 🚨 @KDTrey5 has entered the room. 🚨\n\nJoin @ROSGO21 + our crew on Clubhouse! ⬇️ https://t.co/arS1EOjirr", "@_Semi44 If it’s one thing ima do, ima defend my honor on Twitter and not think less of myself...call me what u want", "@_Semi44 @woodclutch Stop responding to this stuff, u look sensitive 😭😭", "@_Semi44 Here’s your reply. U welcome man, go finish your day now", "@DrewShiller @loganmmurdock This is hilarious", "RT @Boi1da: Is Mercury in Gatorade right now ?", "https://t.co/v4dNrGZTuF", "FiveM New Hanover Roleplay......link up, we need new members and opps https://t.co/5evJ2kpMK3", "We're giving away 3 @NBATopShot All-Star packs on @boardroom 🔥 To enter sign up for our newsletter: https://t.co/kNzXzMDq4c\n\nMake sure you have an active #NBATopShot account in order to be eligible. https://t.co/npaPnleibj", "@Mali2Slimeyyy @Meelyurate @BankStatementzz @fau_kiu @ItsNoOne_ButRod https://t.co/ro18yYlnea", "@ItsNoOne_ButRod Let me guess, my “legacy” took another hit?", "@drdisrespect @ItsNoOne_ButRod I get what you’re saying but I come to Twitter to argue about sports and music Bro..it’s a simple concept for me lol", "@ItsNoOne_ButRod So what are u saying?", "@DrGuru_ @ItsNoOne_ButRod Its a little bit of both", "@ItsNoOne_ButRod I’m convinced y’all don’t watch basketball and you just want a response from me..", "Proud to be an EP on this film, congrats on the Oscar nomination @TwoDistantFilm!! https://t.co/wHtBHVxbAA", "RT @boardroom: With today’s @andbox_official announcement, Kevin Durant joins an ever-growing list of current + former athletes to invest i…", "Proud to announce our newest investment in @andbox_official @subliners to continue the growth of esports in New York and beyond https://t.co/wwvOrhtJsM", "RT @boardroom: .@KDTrey5 &amp; @bansky are joined by famed writer/director/producer @RickFamuyiwa on a new ETCs:\n\n➖Rick’s journey as filmmaker,…", "@bfticketholder Yessir champ. I appreciate you, you been rocking since I was 15...love always", "@UofLSU Explain the difference then", "@GlacierBoiii @__johnye__ This 100% fact?", "@__johnye__ Were u there?", "RT @boardroom: Does @RickFamuyiwa have competition with fellow black filmmakers like @ava, @BarryJenkins and Ryan Coogler?\n\nOf course a “he…", "@_MattyMcFly I cooked you...you lucked up and stole the W", "@thelitoshow The decade", "💯 @overtime https://t.co/QorzjVXMXo", "NEW @boardroom series hosted by @ROSGO21 in partnership with @GoldmanSachs. Thanks for coming on @jj_redick!! https://t.co/Zlj7ytgkEp", "🔥🔥🔥 https://t.co/3Hu5cu2jOD", "https://t.co/Zppm3vxY3D", "They never gave us a chance, I had to take it\nI need all the payments, for everyday we suffered hatred.\nI want my granny to shoot the hands with Nancy Reagan", "These days Fame is disconnected from excellence, Half the time I have to ask these niggas What they profession is, ushered A generation in, these where my confessions live!", "42 millimeter. Was made in Geneva.", "I’m moving way too humble\nWeezy handed it off, I still got no fumbles\n#FACT", "Truth https://t.co/JsVdHC5qwx", "Now I got it all and being honest I don’t really wanna talk about it.... and if I didn’t have it, wouldn’t wanna sulk about it...", "But I guess they must have they reasons\n\nThey wanna know how I’m livin my day to day life In the regular season", "Dog really out here lookin like golden state monta....@lildurk been in that lab https://t.co/EpBKUA2YRq", "@smokinOPs_ @kashdoll Nah, she really turnt up for no apparent reason dog", "@kashdoll You did not have to use those initials to get this tweet off...U have to relax with the KD talk, your name is KASHDOLL", "RT @boardroom: He says he doesn’t do much trash talking on the court, but KD knows a few guys who did.⁣⁣\n⁣⁣\nOn a new ETCs, @KDTrey5 tells @…", "RT @boardroom: How does company culture contribute to success? Here’s why @Apple’s Eddy @Cue takes building the right culture so seriously.…", "For those who can help 🙏🏾 @baby2baby: https://t.co/jIUbdBV79F https://t.co/1Ehx4uYtEb", "RT @boardroom: What is the cost of culture? Here's what @PierceSimpson covers in 1st ep of More Explanation Needed\n\n➖How a team’s culture p…", "SubZero is a menace. https://t.co/7YdvtoGfgg", "Bro approached that situation with elite level skill.... https://t.co/lkUUnGRvO5", "SubZero looks locked tf in but this one is too tough to decide after the first look... https://t.co/D5ihcTXBHf", "RT @35Ventures: \"@Therabody is at the forefront of incredible opportunities in the wellness space, and we look forward to seeing what else…", "RT @35Ventures: We've invested in @GoldinAuctions to help amplify the growing world of collectables and memorabilia. \n\nRead more about the…", "RT @richkleiman: I'm discussing “ Boardroom: Whats New &amp; Next in Sports Business” with @ROSGO21, @bansky, @PierceSimpson, @ChrisLyons, @fly…", "🤲🏿🤲🏿 https://t.co/OiRfL1iQjn", "We back... my brothers @PierceSimpson  and @Kameron_Hay joined us for this one...y’all already know @bansky was there!! Let’s get It https://t.co/zkQWrd0zi1", "🙏🏾🙏🏾 https://t.co/OnbcK0adCS", "🐐 https://t.co/Tei5yjWm1Y", "Aye, I don’t know who the fuck it is, but u gotta lock in mane(boosie voice)", "Yo @nba,  your fans aren’t dumb!!!! You can’t fool em with your Wack ass PR tactics.. #FREE7 https://t.co/78N1iKFAoc", "Free me", "RT @boardroompods: New #OutOfOffice w/ @OmarESPN\n\n-  Omar talks about how he started House of Highlights as a college student &amp; the acquisi…", "😁😁😁 https://t.co/HaysfakUWd", "Congratulations to the @boardroom team on the launch of the new network site https://t.co/gKj3yb4dOj https://t.co/LEEgL8CENw", "Let’s get it @NickDePaula!!!!! https://t.co/OQBslRAoHU", "Speak on it @1Snoot https://t.co/B7MVbNJw2H", "Welcome, my brother. Let’s get it https://t.co/4ZXDH5wGYm", "RT @boardroom: We're collaborating with @sbjsbd to bring you more of our take on the sports biz every month in their print mag - and more o…", "Stay tuned to @boardroom tomorrow for news on our new collaboration with @sbjsbd", "Nah, I run that hit different right back the second she finish that first verse....every time", "RT @35Ventures: KD x @MasterDynamic\n\nInspired by the @nikebasketball #KD13 🔥🏀🎧 https://t.co/f1vVTLXYtP https://t.co/MweH22KutU", "RT @richkleiman: Wait till you get a load of this one https://t.co/v7imnzeR3T", "RT @boardroompods: New #OutOfOffice with Pro Football Hall of Famer Lawrence Taylor \n\n- @LT_56 talks to @richkleiman about winning 2 Super…", "RT @theaveragevoter: NBA media are tabloid correspondents who are building their own brand to be 1st in the checkout lines.", "@el_budget https://t.co/f4vrcuuj6J", "@randyjcruz @Travonne @BillyReinhardt EASILY....only Superman could get bane one on one imo", "@randyjcruz @BillyReinhardt @Travonne Iron man couldn’t get busy without the suit though.", "@Travonne @BillyReinhardt @randyjcruz Kill monger had hands but he got washed", "@BillyReinhardt @randyjcruz @Travonne Him being rich and incorporating tech made him cool to me", "@Travonne Bane son’d Bruce...until thanos I thought he was the most polarizing.", "@Travonne U really believe Batman is trash????", "I also heard that Godzilla is originally 984 ft tall and they had to make him 300 feet tall to make this an even matchup. https://t.co/rwJMfE2QAC", "From the trailer, Godzilla was wreaking havoc In the water and on land. This looks like a landslide https://t.co/GVFijkk67b", "As soon as the god opens his mouth it should be a wrap...pause https://t.co/K6EAralO4e", "He definitely needs to be load managed. He’s been at it for a century https://t.co/auk4iawolX", "I can’t see Godzilla losing this matchup.... https://t.co/ylDfNdyMqk", "RT @35Ventures: Congrats to 35V portfolio company @hellobrigitapp on closing their $35M Series A Led by @lightspeedvp. Doing important work…", "The @TwoDistantFilm trailer is out now. So proud me and @richkleiman could EP on this incredible short film and can't wait for the world to see it. https://t.co/z7fpDlnUaR", "RT @boardroom: Introducing Game Plan with @Schultz_Report &amp; first guest @Cavs Head Coach @jbbickerstaff_\n\nHighlights:\n- His experience as a…", "RT @boardroompods: What's it like being a digital entrepreneur, angel investor, social media personality AND Chief Strategy Officer for @tr…", "It’s not sweat. It’s your body crying tears of joy. @Degree won’t let you down. #DegreePartner #KeepMoving https://t.co/eigNG4uq0B", "RT @boardroompods: NEW #OutofOffice: TAO Group co-founder @JasonStrauss joins @richkleiman to discuss his hospitality business w/Noah Teppe…", "RT @boardroompods: .@SHO_Billions co-creator @briankoppelman joins @richkleiman on a new episode of #OutOfOffice to talk about becoming a c…", "This is my Why. What’s yours? #TeamNike https://t.co/XmopfAQryF", "RT @boardroompods: “I’m learning to really evolve as a businessman and having some great vets is the best thing you can have as a young guy…", "RT @boardroom: 🚨 JERSEY GIVEAWAY 🚨⁣\n⁣\nFollow @broombreakers for all things trading cards and to enter to win an authentic @KDTrey5 game-wor…", "Had to close out the year with The ETCs and @QuavoStuntin, we're taking a lil break but we'll be back soon with more 👀 https://t.co/GajiLSQHGU https://t.co/rfPMBShhVv", "RT @boardroompods: .@KDTrey5 talks to Mr. Big Baller Brand himself, @Lavarbigballer, on his 3 sons making it to the NBA, @ZO2_ , @LiAngeloB…", "RT @boardroom: \"These cards were $2,400 and now $20,000...Card I paid $600 for is now $5,000. These are not little returns.\" - @DanFleyshma…", "RT @35Ventures: Our friends at @SleeperHQ just launched a brand new way to play fantasy basketball &amp; follow the @NBA season with your frien…", "@jadande 😂😂😂😂😂", "We’re just getting started at @DurantCenter, let’s support future leaders together: https://t.co/2ICdDO3Gnm https://t.co/TpWwRehiuc", "RT @boardroompods: .@DaveGrutman talks about the importance of being professional, how he identifies workers who have the \"X factor,\" and h…", "https://t.co/RQpwBZlGy1 https://t.co/zgfPxhgrBw", "https://t.co/UcNR1xsaXW https://t.co/obHyfyetZt", "RT @richkleiman: Congrats to my dear friend @jgebbia amazing work!", ".@Verizon Up members get a chance to join me and @boardroompods for a live taping of an upcoming episode of The ETCs. Claim your ticket in the My Verizon Up app https://t.co/82umMaGGBd #VerizonUp", "RT @35Ventures: New threads 🔥🎨 \n\nInspired by Brooklyn-born artist Jean-Michel Basquiat\n\n@KDTrey5 @BrooklynNets https://t.co/PdeVqelWmx", "RT @brkthroughprize: The big reveal! Thousands of students across the planet made brilliant science videos for this year’s Breakthrough Jun…", "RT @boardroompods: Biggs always knew @kanyewest was a star, from day one.\n\nAnd for that confidence, @1996Biggs &amp; Roc-A-Fella were rewarded…", "More to come... ICYMI ⬇️ @NBA2K https://t.co/vGv3xJ1yJt", "Season 3 of @NBA2KMobile is here 🔥\n\nThe first 50 people to hit Redeem in NBA 2K Mobile and enter “KDSEASON3” will get my Sapphire card https://t.co/fNYaxxGJMF", "RT @boardroompods: Thanks @Spotify for naming #TheETCs w/ @KDTrey5 as one of the best pods of 2020! #SpotifyWrapped \n\nhttps://t.co/5Nf4Ib0E…", "RT @boardroompods: .@curtismartin talks about what motivates him in business, from earning money in order to give back more to the communit…", "RT @HYPEBEAST: HYPEBEAST spoke to the two-time NBA champion about his aspirations for the game's development, his favorite player in 2K to…", "Time to get to work @NBA2K \n\nMore info —&gt; @boardroom https://t.co/vGv3xJ1yJt", "@dkeys7193 Mj is one of one, God level, unmatched, unparalled, a pure master at this shit. I’m still watching his games to learn. Leave me out of it please", "RT @boardroompods: New #OutOfOffice episode 🎙\n\n@richkleiman &amp; Gianni discuss their favorite lifestyle brands, rank the top influencers in s…", "@itsAyane It’s tied 1-1, we gotta lock in for the death match lol. That point guard you played with was INSANE!", "🔥🔥 @MasterDynamic https://t.co/jTbEJ7GVsE", "#2KFest is going down on Twitter, tune in now: https://t.co/vPJu6uwfu3", "RT @boardroom: What's @Tonal and how are elite and amateur athletes using it?\n\nFounder @aorady discusses his journey to building Tonal,  ha…", "RT @boardroompods: How do @USMAN84kg and @KDTrey5 deal with opponents who try to get under their skin? Or a hostile arena and still perform…", "New pod ep with @USMAN84kg https://t.co/e4Zov4GKYC https://t.co/GAvAUFhX88", "RT @boardroompods: \"I learn from the street... I'm not going to go to get an MBA from f****** Harvard\" - @garyvee talks about the advantage…", ".@MixedByAli dropped gems this week on the ETCs...https://t.co/b5epsV2QZq https://t.co/YeRDyoOQ5Q", "RT @boardroompods: 🚨 #OutOfOffice Ep 15 w/ @atptour tennis pro @NickKyrgios\n\n- Kyrgios talks about the difference between hoops &amp; tennis cu…", "RT @boardroom: What does the future of racing look like post-COVID? @NYRR SVP of Partnerships Christine Burke joins us to talk about how th…", "RT @35Ventures: Court 22 ✔️ #BuildItAndTheyWillBall #KDCF ⁣\n\n📍P.S. 115K - Canarsie, Brooklyn ⁣\n⁣\nSpecial thank you to our partners at @tpl_…", "RT @35Ventures: The 2020 Supporters’ Shield Champs 🛡🏆⚽️ Congrats @PhilaUnion!! #DOOP https://t.co/iw1JgDYwj0", "Nav and wheezy https://t.co/6586LU075z", "RT @boardroompods: New #OutOfOffice 🚨 Former @NFL Pro Bowl WR @BMarshall joins @RichKleiman to discuss his NFL career, how his House of Ath…", "Ep 3 is up https://t.co/oNcUAyRSps #TheETCs https://t.co/3zUruyoHDg", "@FargoPacino4 U know for a fact that I said this?", "@TyeCrane_ It’s sick", "🤲🏿 https://t.co/g4an49vqRT", "@MrNet718 @LarryGrant95 @DepressedNet U know how these dweebs do it. Anything for engagement", "@LarryGrant95 @DepressedNet Larry, hop out them feelings my g....it’s a fake quote", "RT @boardroom: #YoungCEO Experience is going down TODAY 🔥 Who’s coming thru?\n\n@overtime @Degree ➡️ https://t.co/QXRAcdAkWp https://t.co/glw…", "@_chrisdanger @PapiMally Just shows u how emotional people are", "@PapiMally Look at u, Emotional", "@LoudPiff85 Triggered", "@BrandonRobins1 Triggered", "RT @BrooklynNets: The @boardroom x @overtime #YoungCEO Experience featuring @KDTrey5 and @SteveNash is tomorrow! Pre-register below ⤵️", "@iSpeakComedy Any comedian&gt;&gt;&gt;&gt;&gt;&gt;you", "The football team &gt;&gt;&gt;&gt;&gt;&gt;&gt; the cow boys", "RT @boardroom: #YouCantStopOurVoice @Nike gets out the vote. https://t.co/AyB3jLAiqs", "RT @boardroom: .@Therabody founder Jason Wersland joins @ROSGO21 to talk about the journey that led him to create the prototype for the The…", "RT @boardroompods: What was it like playing in Atlanta and sharing the center stage in the culture with local hip hop stars, including @Out…", "RT @boardroom: .@michaelrubin keeps it real when talking about his responsibility as a sports owner. His goals are to win championships for…", "See you there https://t.co/5RVydE3sNa", "Never let a screwface heckler spoil a lecture...", "RT @PhilaUnion: 🚨Philadelphia Union have reached a historic transfer agreement with @redbullsalzburg for Homegrown Midfielder Brenden Aaron…", "Young CEO coming Oct 27 @boardroom @overtime https://t.co/bB1A0wSkxT https://t.co/B0me609fMp", "New ep out with @OVO40 #TheETCs https://t.co/Npw2b4S1OF https://t.co/ycfwAl3pGv", "RT @boardroompods: Ep 2 of #TheEtcs 🎙️ @KDTrey5 &amp; @bansky talk to the man behind @OVOSound &amp; @Drake: @OVO40.\n\n40 talks all things Drake, OV…", "@ChrrisYoung That time coming", "RT @boardroompods: .@LarryJackson talks about the early days of @beatsbydre’s iconic headphones and starting Beats Music with the legendary…", "@TavaresBriggs Damn U bringing back memories with that lol", "My mama used to sit me down and get her Bible out...\nTwo days straight, teach revelations to me\nFruits of the spirit, love, and patience to me", "@jeremyjoemills @thecrawsover @JCrossover 🔥🔥🔥", "@_JNeel Finally somebody gets it. Rest of these people have no fun", "@JayRichardson99 Explain what u mean jay?", "@JayRichardson99 I wanted to put u on live tv since u crave attention so much...", "@JayRichardson99 These practice squad players talking like starters, I hate it", "They left earth https://t.co/3QisLQO7rn", "💪🏾 Great convo w @ROSGO21 &amp; @talkspace founder on @boardroom x @Degree https://t.co/32nXUaIKeZ", "RT @espn: Breaking down @JimmyButler's 40-point NBA Finals performance in the latest episode of Detail with @KDTrey5, streaming now on ESPN…", "RT @boardroom: Aaron Gordon @Double0AG talks about his lifelong love of technology, the growth of cryptocurrency, and how digital collectib…", "RT @boardroompods: 2x FIFA World Cup Champion, 2x Olympic gold medalist, &amp; soccer icon @CarliLloyd joins @Richkleiman on this week's #OutOf…", "Yo @jayrock, I kno you’re making music right now. I wanna hear it", "Part 2 of #TheEtcs with @KyrieIrving is out now.. https://t.co/bethVM5ZH1 https://t.co/Vyqe1OtDNz", "RT @PhilaUnion: Today, partnering with the Kevin Durant Foundation &amp; @35Ventures, over 300 emergency food boxes were donated through @CityT…", "🔒 #TheEtcs @boardroompods @boardroom ⁣\n⁣\nThanks to my brother @KyrieIrving for coming on the pod ⁣https://t.co/tpCI9hkQy5 https://t.co/yzJ1RI8BOs", "RT @35Ventures: #KDCF completes our 21st #BuildItAndTheyWillBall renovation project at P.S. 152/315 in Brooklyn, NY.⁣\n⁣\nNow more than ever,…", "Court 21 for the next generation of Brooklyn hoopers #BuildItAndTheyWillBall⁣ https://t.co/F09lfblbsk", "#TheEtcs first episode dropping Tuesday...@boardroom https://t.co/LF5bWfiQd1", "RT @elonmusk: Cybertruck, ATV, Roadster &amp; Semi\nC A R S https://t.co/4Aq1A5cYkH", "RT @boardroom: This week on #OutOfOffice, @richkleiman talks to @GoldmanSachs CEO David Solomon about his journey to the top, changing comp…", "First episode of Inspired to Move..showing the ways tech &amp; wellness founders are helping people to #KeepMoving every day. Stay tuned for more @boardroom @Degree https://t.co/H7IbHo6UJw https://t.co/CwBow73ADY", "Young CEO coming Oct 27 @boardroom @overtime https://t.co/bB1A0wAJ9j https://t.co/Ebj5ZLG1T6", "@7elevenst Lock in", "@Ron_Ruben Bro, focus on your ministry", "@_rickyfiggg Can u please explain what this new title means?", "@FleelixTrinidad @Being_wokes U ok?", "RT @boardroom: Bill Duffy talks about growing up in and around Chinese culture and how that played a role in to being able to build a brand…", "@bmoe_careful It’s okay to congratulate us on a W", "The Football Team", "RT @boardroom: “I’m excited anytime a player, former player gets a job as a coach in the league. I’m excited.” - @KDTrey5 on @SteveNash joi…", "RT @AntoGriezmann: Thanks @KDTrey5 !!! Un honor vestir el 7 en el Barça! #SomHi #Grie7mann #ViscaBarça", "Hopped on a bonus ep of Out of Office this week with @jj_redick @richkleiman @talter https://t.co/WxI4m5RaHi https://t.co/M27PVy07VC", "Which is more important? Getting or letting go?", "Are you doing this work to facilitate growth or to become famous?", "New era @whoisjwright @WashingtonNFL https://t.co/VJgdw4Uupj", "@renzowind @bansky Damn @bansky it is....@renzowind are you sure that everything u said is true?", "@ludagrizz @bansky @bansky there’s smoke for u", "RT @TheEliteMedia_: The 2020 NBA Draft Lottery is tonight.\n\nCheck out what @TMCvision did for us back in July. \n\nYour favorite team’s franc…", "@EllisJBrice @JoelEmbiid https://t.co/N1P69HQNjo", "@cor_jch This may be a reason and also the obsession over stats and analytics...", "@_Zeets @JNCO_suave @freedarko Why are u taking the internet so serious right now zeets? He’s just a random lol", "RT @TheUndefeated: The Washington Football Team's new president Jason Wright says he is the best-qualified person for the job, regardless o…", "@JoshEberley @russbengtson @C4DUNK @RooshWilliams Lol do as u please josh....who am I to tell u how to be a fan?", "@JoshEberley @russbengtson @C4DUNK @RooshWilliams Since u have no control, u daydream about differnt scenerios?", "@thekolsky @_Zeets @freedarko Yea, it’s not REALLY affecting any part of my real life but at some moments i don’t mind indulging in the fuckery 🤷🏾‍♂️...should I be doing it?? I believe so lol", "@GEN4Glockboy @_Zeets @freedarko I seriously don’t know", "@_Zeets @freedarko Like how serious do I take it?", "@freedarko 🤔", "@OrunyChoi Lol", "@TJPhilpot5 @orastaa @envyrgn @RooshWilliams @Prez What’s the difference?", "@russbengtson @C4DUNK @RooshWilliams What’s the difference?", "@EJ_Will2 Its why I still have twitter...they want me to act professional on the internet. No, I won’t lol", "@orastaa @envyrgn @RooshWilliams @Prez Since u replied to me first, what does it make u?", "@orastaa @envyrgn @RooshWilliams @Prez Are u triggered because I’m tweeting?", "@russbengtson @C4DUNK @RooshWilliams U think about this everyday since it happened?", "@RooshWilliams Nah because it’s a pointless excercise that’ll only confuse the mind. Reality is what it is", "@envyrgn @RooshWilliams “I scroll through my timeline during these wild times and I started to read...”", "@MrRegTheBest @RooshWilliams U didn’t stop watching so was it really?", "@RooshWilliams There’s a lot of things in history that would be differnt if you just changed something.", "@RooshWilliams Still??", "@FucckJoeCecot @bansky You https://t.co/gDnRKAQF4r", "RT @ysldyl: Thug got a fucking pilot license😭😭🐐 https://t.co/GhG7rtgpw8", "@FucckJoeCecot @bansky This is a funny tweet", "@Stopthecap10 @SouthernSincere No lol or nothing? U actually believe this? 🤦🏾‍♂️", "@urkle9 We good bro", "@sighIess @CoachFaulkie He told that man he sold his soul 😂😂😂😂 I’m cryin", "@sighIess @CoachFaulkie Lmao nah bro really pissed at bansky...", "@sighIess @CoachFaulkie Which agenda?", "@CoachFaulkie ?", "@CoachFaulkie Nah I really don’t get it", "@CoachFaulkie ?", "RT @boardroom: Caron Butler @realtuffjuice joins @ROSGO21 to share his thoughts on the success of the #NBAbubble &amp; praise of Adam Silver, t…", "This Dolph.....", "https://t.co/c38OgvFhfQ", "First @boardroom podcast out now 🔥🔥🔥 thanks for coming on @jack https://t.co/mkyr48VofY", "RT @richkleiman: First podcast for the @boardroom hope you enjoy and thank you to @jack for supporting us always", "@LosMurillo126 I got Jesus gettin a stop", "@JimmyAn05128455 Ill never grow up, jimmy", "@CardoGotWings It’s time", "@zee_the_creator Lol youre enjoying this experience. You won’t forget about this day...ever!!", "@zee_the_creator my bad, I accidently pressed follow and liked all her pics, my phone trippin", "@Stopthecap10 @zee_the_creator All u do is tweet about ball and you’re probably trash. I play but when I tweet about it, ima dork. Make it make sense", "@KuzPalms @LazyxDaze @arieshoopz @ufeeeelme @FrankNtilikina @_MiddlexChild @YCSNOW23 @zee_the_creator So why are u talking?", "@ufeeeelme @Aaron99102 @FrankNtilikina @_MiddlexChild @YCSNOW23 @zee_the_creator And u should be focusing on me?? What’s bout your business ventures?", "@WinItFortheH @aguado_16 😂😂😂", "@ufeeeelme @FrankNtilikina @_MiddlexChild @YCSNOW23 @zee_the_creator What’s your point?", "@arieshoopz @ufeeeelme @FrankNtilikina @_MiddlexChild @YCSNOW23 @zee_the_creator I did it just to piss people like u off", "@ufeeeelme @FrankNtilikina @_MiddlexChild @YCSNOW23 @zee_the_creator Bro want me to be insecure so bad...ok im insecure about my right eye being a little lazy...your turn", "@aguado_16 Congrats on graduating. Welcome to the real world", "@SiloSara I have hurt a lot of people personally with my prediction, for their well being, I take it back..Lakers in 1 😂😂", "@EliteFlite @zee_the_creator U sure?", "@zee_the_creator Somebody’s pissed", "RT @bansky: So excited for you guys to see what @KDTrey5 and I have been working on with #TheETCs \n\nSeptember.", "Get ready..@theboardroom @richkleiman pod dropping aug 12, my pod The Etc's coming soon... https://t.co/VtOSV3HUj4", "We here... https://t.co/pPyoxFJUyh", "Thanks for having me on ladies https://t.co/zrWgQBEQIt", "RT @boardroom: .@WashMystics star @tinacharles31 joins @richkleiman to talk about her experience producing \"Charlie's Records\", her philant…", "@EricSoHollywood Boys still wanna talk about who got the most swag...okaaay, u guys are cool..congrats", "@TimAlberta Go do your research Tim. U sound stupid", "#14 is a different breed..", "@ILLest_Isaiah 😂😂😂", "Yooo @god we good?", "https://t.co/j8BRSQ7MfC", "RT @boardroom: .@WNBA star @angel_35 talks to @rosgo21 about adjusting to life in the #Wubble, the league dedicating their season to social…", "Basic ass black jacket, but it’s Prada fool\nPeelin hunnids til my mama say “I’m proud of you”", "@Cole_Killa Preciate u champion..in due time", "https://t.co/zjWFCcPaOt", "@aj7157 Too much of one thing can be detrimental, I agree", "@aj7157 It’s not impossible.", "@aj7157 Says who?", "Idle time&gt;&gt;&gt;", "Normalize coaches in slacks and a polo.", "Everything come full circle, word to the boss above me", "Show them how it’s done @JCrossover https://t.co/W9m2WNMXRN", "RT @MasterDynamic: Introducing #MasterDynamic x #BAPE, a limited-edition collaboration featuring #MW65 Headphones and #MW07 PLUS Earphones.…", "@KingJames WE BACK!! 😂😂", "https://t.co/MoAIBMUqwY https://t.co/1ciAaaRPfN", "@Jon_Mitchell3 Is this guy making it seem like I said this recently?", "Some ask me, “Jay, man, why come for so many years, you been exempt?”\nCause familiarity don’t breed gratitude just contempt.\nAnd the price of sanity is too damn high, just like the rent......", "Just gettin started @PhilaUnion https://t.co/iMCPUmFvYm", "RT @espn: Team from @Boardroom, @35Ventures and @RichKleiman building multimedia storytelling &amp; working with ESPN to reimagine how to bring…", "RT @PhilaUnion: Our players had a message today: #BlackLivesMatter https://t.co/wCVx6DPBro", "Great convo with Jim before game 1 tomorrow https://t.co/ugyKFx1KJQ", "We ready @PhilaUnion ✊🏾 https://t.co/GZ4cyg6xGw", "In the land before time, a land before alter boys, synagogues and shrines...man was in his prime", "RT @boardroom: “A big thing that you’re gonna see happen is guys get recruited to the wrong level whether it’s too high or too low,” said R…", "@BLCity5 @edWoodwardceoW @NBArath23 Tell em", "@edWoodwardceoW @NBArath23 Talk to em", "@MarkBruty https://t.co/LbzgxiHQrj", "@BleacherReport 😁..", "RT @boardroom: Journalist, podcaster, TV personality, &amp; entrepreneur @jemelehill joins @ROSGO21 to talk about her new @VICE show w/ @CariCh…", "https://t.co/DW2VWEtOR7 https://t.co/x5ue4Bgz35", "RT @boardroom: .@Astros' @TeamCJCorrea &amp; @lmccullers43 give us a look at how they’re breaking into the media business with the making of #T…", "Join us tonight: https://t.co/SUfc3LoRfL https://t.co/tfbU9tz8Og", "Proud to partner with @Degree to donate $1M &amp; help more than 100K kids #KeepMoving. Together with @laureus_usa we're supporting #SeatPleasantRec #DancingGrounds @GirlsintheGame @HarlemLacrosse @KidsintheGameNY @LEADAtlanta @MKickersSC @NewHeightsNYC @peaceplayers @rownewyork #ad https://t.co/JuvzW49yWx", "RT @PhilaUnion: Join us for live Q&amp;A sessions, silent auctions, a prize draw, &amp; a special appearance by @KDtrey5!\n\nYOU can help us bring CO…", "RT @boardroom: .@SleeperHQ CEO Nan Wang joins @RichKleiman to talk about the future of fantasy sports, the evolution of fantasy leagues as…", "Let’s go!! https://t.co/jT1Tw5EarL", "RT @boardroom: FanDuel CEO Matt King joins @RichKleiman to talk about how he got into the sports business, the sports betting legalization…", "RT @AgentNicoleLynn: Thank you to @KDTrey5\nfor creating a platform where important conversations can happen. Checkout my interview with the…", "Thanks for the love @PhilaUnion @markmckenzie4_ @AntFontana99 https://t.co/M8xefhXO2H", "RT @boardroom: .@HoustonRockets GM @dmorey joins @richkleiman to talk about his \"Moneyball\"-style background in sports, working with player…", "RT @DrGuru23: @KendrickPerkins It’s all good Perk! Real NBA fans know you were one of the most lethal hoppers back in the day  https://t.co…", "RT @wilsonchandler: Where there’s no vision the people will perish. Proverbs 29:18", "RT @wilsonchandler: Ex players turning into suckers right before your eyes on television.", "It’s official!! Looking forward to working with @PhilaUnion for years to come 💪🏾 https://t.co/Usg0HOdKVY", "RT @boardroom: .@heydb joins @RealJayWilliams to discuss the amount of prep that goes into 🏀 analysis, her career trajectory, what the @NBA…", "RT @richkleiman: Impactful conversation from industry trailblazer @AgentNicoleLynn https://t.co/J62Igc2KYn", "RT @elonmusk: Selling weed literally went from major felony to essential business (open during pandemic) in much of America &amp; yet many are…", "@KurtisHair @MossMax123 @netsstan You’ll be aight!", "@KurtisHair @MossMax123 @netsstan U still mad?", "@KurtisHair @MossMax123 @netsstan 😢", "@joel1zellem Everything is low key to you lol", "@wilocrek @joel1zellem not my type of humor I guess.", "@wilocrek @joel1zellem Still wasn’t funny", "@sbragg420 Yessir", "RT @nikebasketball: The KD13 ‘Home Team’.\n\nInspired by Brooklyn’s distinct team look, @KDTrey5’s latest silhouette sports an all-white uppe…", "RT @boardroom: .@CAA_basketball co-head of marketing &amp; services @lisjoseph talks about what it takes to build an athlete's brand, from what…", "RT @35Ventures: .@VicOladipo, @QCook323, @JeramiGrant, &amp; many more of basketball’s elite came thru the program Morgan Wooten created at DeM…", "Appreciate you jumpin on @RexChapman! https://t.co/rZlfj0TcM5", "@HPbasketball @KCJ_Swish @badtweetsonline @PaulMilitello @samialhaw22 @enfuego_22 @SteveCannady @ZTD1989 Yes.", "@badtweetsonline @HPbasketball @PaulMilitello @samialhaw22 @enfuego_22 @SteveCannady @ZTD1989 Tim Duncan was a fierce leader and competitor. I bet he had some dudes shook in that locker room over his 20 year career lol", "@HPbasketball @PaulMilitello @samialhaw22 @enfuego_22 @badtweetsonline @SteveCannady @ZTD1989 Held accountable*", "@RondoBongos @HPbasketball @PaulMilitello @badtweetsonline @SteveCannady @ZTD1989 I think u understand mj more than u think", "@epark1016 @HPbasketball @badtweetsonline @SteveCannady @ZTD1989 Talk to em Unc", "@enfuego_22 @HPbasketball @PaulMilitello @badtweetsonline @SteveCannady @ZTD1989 Tell em", "@Hendo968 @HPbasketball @badtweetsonline @SteveCannady @ZTD1989 Who did he manipulate?", "@HPbasketball @PaulMilitello @badtweetsonline @SteveCannady @ZTD1989 If you love basketball you would understand Mike. If you just like basketball I can see why u would say he’s mean lol", "@PaulMilitello @HPbasketball @badtweetsonline @SteveCannady @ZTD1989 PREACH", "@Hendo968 @HPbasketball @badtweetsonline @SteveCannady @ZTD1989 Sociopath? Define the word please", "@HPbasketball @badtweetsonline @SteveCannady @ZTD1989 How is that different?", "@NBATakesForDays @jkirk41 @badtweetsonline @HPbasketball @SteveCannady @ZTD1989 The sport is about beating your opponent. There is usually someone in front of u while you play lol It’s either you or them, it’s sports.", "@HPbasketball @badtweetsonline @SteveCannady @ZTD1989 You can care about others and enjoy the process but still hate to lose. Being competitive at something doesn’t take away your soul", "@jkirk41 @badtweetsonline @HPbasketball @SteveCannady @ZTD1989 Unhealthy? What’s unhealthy about going to work and being the best you can be every day?", "@HPbasketball @badtweetsonline @SteveCannady @ZTD1989 Wow that’s crazy", "@badtweetsonline @HPbasketball @SteveCannady @ZTD1989 You’re probably the only person on earth who feels that way lol", "@HPbasketball @SteveCannady @ZTD1989 All I’m saying is it’s not healthy. The game is enough in my opinion", "@HPbasketball @SteveCannady @ZTD1989 Name those reasons", "@SteveCannady @ZTD1989 @HPbasketball Why does it matter? They show up to dominate, why are u so tied into their emotions?", "@Jessicuhhh Very proud.", "@absolutelypaco @HPbasketball Take that in real quick. U might get inspired https://t.co/hwzwo9poui", "@ZTD1989 @HPbasketball what does mj regret?", "@absolutelypaco @HPbasketball Which cryptic tweet had u wondering?", "@BlackkYoda @HPbasketball 🤲🏿🤲🏿🤲🏿", "@BlackkYoda @HPbasketball Glad u still here my g..", "@absolutelypaco @HPbasketball What stuff?", "@absolutelypaco @HPbasketball What made u come to that conclusion?", "@DSimpso11 @throwpick @willy08lora @HPbasketball “Superstars” care about shit.", "@throwpick @willy08lora @HPbasketball At this second, Yea, breakfast almost done. Stay tuned though", "@willy08lora @HPbasketball U should know the answer to that question lol you don’t need me to tell ya", "@See_Hendo 🤲🏿", "@HPbasketball Is it possible to be happy at all times?", "@AttyCCN @eorvieto @DrewShiller Someone cares about you Carson. Keep ya head up buddy", "@priddy_nikki81 You won that bet", "@AttyCCN @eorvieto @DrewShiller Since u know. What do people care about?", "@AttyCCN @eorvieto @DrewShiller I disagree.", "@Vincent40001 @DrewShiller He’s infatuated with me but drew was always scared to say anything in person. Just awkward head nods lol", "@DrewShiller I’m using the app the same way u are", "@DrewShiller Why do u care?", "@DrewShiller I can’t respond to someone i follow?", "@patronusisotter @HPbasketball So what does this make u?", "@BryanIsTheKing @HPbasketball Cry some more.", "@BryanIsTheKing @HPbasketball Boo hoo", "@HPbasketball Sensitive ass", "@shawathletics @JalenRose I wanna know how many points Jalen thinks he would average today", "So excited to add original stories to the @boardroom brand hope you enjoy: https://t.co/yprcOQTXjF https://t.co/Tz3GKnfb6T", "RT @MichelleObama: I know how hard the #Classof2020 has worked to make it to graduation, so @BarackObama and I want to give you the celebra…", "@wilsonchandler That’s that SoundCloud jay.", "The elegant celebration sent tremors through every nation, the stars align like cars at grand central station....", "New @boardroom with #TheLastDance director. Up now! https://t.co/JSuPIW174B", "RT @boardroom: Checking in with @cardinals' @aybaybader on staying fit while quarantined after spring training was put on hold &amp; his hopes…", "RT @boardroom: .@PhilaUnion midfielder @AleBedoya17 talks to @RealJayWilliams about his career, how he became an entrepreneur and activist,…", "The first #KD13 gamer exclusive with @nikebasketball starts Monday! Unlock the drop by winning a MyPLAYER Nation playoff game on @NBA2K 🔥\n\nU.S. only. Learn more: https://t.co/h3kcevMXs6 https://t.co/aZsibnuWaS", "@KashMeOut_ U mad?", "Here we go @richkleiman @AUProSports https://t.co/YBorNvSVxU", "@ryforry U mad at my list?", "“Your arms to short to box with the sender of the prophets...aviator shades, the stage is a cockpit.....”", "“You can’t dance with the chancellor, one glance will have u caught up in the  trance of the tarantula.....”", "My brother @JCrossover is taking over @boardroom. Ask him anything 👀 https://t.co/FoYaFwEWcH", "Excited to show the world a story close to my heart. #BasketballCounty: In The Water coming May 15 to @ShoSports https://t.co/JIVwQpPdfo"]}