{"tweets": "On the set of “Only Murders in the Building” today with the great ⁦@janemarielynch⁩. Yes, we’re in look-alike clothes. https://t.co/TaLLWkBzwU Today’s cartoon from @Blisscartoons and me: https://t.co/0PuvfbmfJw Well I can’t even not even. https://t.co/gt7Cfw2i9P RT @Blisscartoons: I like this one. With ⁦@SteveMartinToGo⁩ https://t.co/uOch3uot2h Perhaps I was too oblique, 🐝: https://t.co/U9lNnomest And let’s not forget, 🐝: https://t.co/1tMrvwuLCf https://t.co/08S2yZv8qc Yes, I’ll be there. And we can discuss The Trouble With Harry. https://t.co/VRPTEWZ8Nl My clammy hand should not meet another’s clammy hand. https://t.co/9sDHSiW6lh “Feckless goon” is now a category. https://t.co/zKuRVFDaoJ You’re not alone. https://t.co/mT2ISXzmJv For there ain’t no one for to give you no pain. https://t.co/6lq9whiGyI Today’s cartoon from @Blisscartoons and me. https://t.co/Sz3QhyfXSJ RT @OnlyMurdersHulu: Things will never be the same… 👀🩸🏢 #OnlyMurdersOnHulu https://t.co/gvYz8UKhrJ I wear the same clothes and haircut that I had in high school. Pants and a shirt, and the “Ivy League.” https://t.co/9tLdxTClza Amazing, and yet, no indoor dining. https://t.co/cQBE6ok4Ht Huh? Comedians self-plagiarize every show. https://t.co/JzQlcyVJoj RT @Blisscartoons: A cartoon from @SteveMartinToGo and me... https://t.co/37JItBhEVF This is an important book. https://t.co/IYF0223m7q It’s got to be in the nickels. https://t.co/lXlgJNIudl It’s a great book. https://t.co/GR2VeR2s7L If I live as long as Sister Andre, Selena Gomez, whom I am currently working with, would be 70. https://t.co/fbPTS914a9 On the contrary. I’m intrigued. https://t.co/w9bd9qQQJV @tingtime @danjlevy Oh, Deb, you’re the greatest. My dreams have convinced me: I wrote Penny Lane. The Ceremony of the Coin Toss always makes me a bit weepy. I just can’t help myself: I seem to have taken another award winning photograph. (People waiting to see the rare snowy owl in Central Park.) https://t.co/mk4KeT6yg9 If it means anything to anyone, I got an F in my college essay class. An A was given to the student whose essay was titled, “What I Did Last Summer.” https://t.co/4ivVOGr5sj I am such a sucker for Morandi and his solace. https://t.co/XpujU1gQ0q A special day on the set of “Only Murders in the Building.” (Our masks are down because we’re 30 seconds before shooting.) For detailists, Sting is hold the Financial Times cryptic crossword which he zinged through to embarrass us all. https://t.co/trN8iftA3l Salute to Cloris Leachman, who brought comedy’s mysteries to the big and small screen. Oh 🐝, why is Egyptology capitalized? I’m proud to say that Dolly Parton and Vince Gill sang a song of mine!  https://t.co/ZuvqOydw2R I was trying to trick Betty. https://t.co/738iDWhQkH Oops. 24. Way too big an age difference. https://t.co/4M76aIJKhl Hi Betty, I loved working with you in Bringing Down the House. And I love that you and Allen Ludden came to see me at the Troubadour a hundred years ago. I never forgot it. By the way, you’re only 14 years older than me. https://t.co/9GmYMyLU3m Right now, I’m having no fide resects. https://t.co/SUYyvOexeW I signed up ON line through an NYC dot gov website (sorry I don’t have the exact site), and waited IN line at the Javits Center. https://t.co/Ohp3frxy6i Good news/Bad news. Good news: I just got vaccinated! Bad news: I got it because I’m 75. Ha! The operation in NYC was smooth as silk (sorry about the cliché @BCDreyer!) and hosted to perfection by the US Army and National Guard. Thank you all, and thank you science. My research tells me that Oxford wasn’t established until WAY after Planes, Trains (,) and Automobiles. Like, years. https://t.co/mmp60zfjGO Significant Canadian paintings have to pass a board before export, which means paintings considered national masterpieces are inevitably restricted. Most Canadian paintings can be exported. https://t.co/9uQwJ52cJn Melancholic tonight, remembering for some reason, my friend Michael Johnson, who walked into our local club in 1967 and stunned us with his beautiful voice and smooth guitar.  https://t.co/RgpbyuEY9F Yes, our cartoon for today. https://t.co/FrYnAmUydx Fabulous. https://t.co/urEqRLF2lB I plead guilty. https://t.co/WJWMvpW702 Then my work is done here. https://t.co/XTgZJYYTZj This is a must retweet. https://t.co/WlWlWNI9ql Of course! https://t.co/weMn0adKq4 Yes, Ma’am! https://t.co/yXkK78QKMf I’m hoping to never be in an “actual police interrogation” video. Okay, here’s Tony Rice.  https://t.co/u0DSPaVRR7 Aw, Tony Rice. A name I’ve known my whole life. A great musician. https://t.co/33lBEgZiPU I just made up a cryptic crossword clue: “They are descended from raptors.” Merry Christmas! https://t.co/EppygpMK0C I’ve never gotten Queen Bee because of forces that lie against me. https://t.co/LZ9ocDON58 Dude. https://t.co/dImshLhVGF Wept tonight watching the boss, Cary Grant, in “Penny Serenade.” I get to be a pretty big blowhard on this segment. What fun to do. https://t.co/WKeRTOY6FU This is truly the strangest Christmas Yet. Steve Martin and the Steep Canyon Rangers - \"Strangest Christmas Yet\" (O... https://t.co/01KDrou8TW via @YouTube And Al Franken was there! https://t.co/HJorqGWBSy Today’s cartoon from ⁦@Blisscartoons⁩ and me. https://t.co/rNA9qAEnIE I don’t know of sheet music for it. But the song is “Friend of Mine.” It’s on an Edie Brickell/Steve Martin album. https://t.co/fXfpWiQdjC Double C. https://t.co/CgHxkxRIZ7 I had a request to repost this (from the early days of the pandemic). Obliged. https://t.co/YsalvEtRpu RT @ScottSanders20: @SteveMartinToGo I miss your banjo calm video. I loved it at the beginning of the pandemic and I’d go back to it from t… Today’s cartoon from ⁦@Blisscartoons⁩ and me. https://t.co/Zx87KrCwQC Hey! Thank you, Alan. https://t.co/EGLzHhnHu2 @SarahKSilverman I’ll watch in an Elf outfit! .What the worser people are giving... https://t.co/EZO3rakHVh https://t.co/VPWjm6jNW2 We are having a great time shooting this show! https://t.co/D4toYSCiV5 Number one is good, but is there more? https://t.co/DDQ5sgKCW6 Today’s cartoon from ⁦@Blisscartoons⁩ and me. https://t.co/8Z70Nclupe Proud to I be a part of Giving Tuesday Charity Banjos – Deering® Banjo Company https://t.co/Qv8KjuDwlC Working on it! https://t.co/QULdRSHzlt Thank God for the instructions! https://t.co/5Uo4BFDXqS This is very weird. https://t.co/b2zE2YUGcn One of my personal faves. https://t.co/HsK4xUu3kO Today is the first day of filming our new TV show, “Only Murders in the Building,” in Manhattan. Starring the incredible Selena Gomez and the just okay Martin Short. https://t.co/oLKhfDWUYj Here’s another: https://t.co/J717juTAVN https://t.co/igwCSOGSWF Can’t you I spot a trap when you see one? Hey, Dane! https://t.co/tm4HKIiVyi I have no problem with this. https://t.co/mg5doTNvUC Okay, audio book sleep timer. What happened to twenty minutes? Lovely, spacious, drawing. https://t.co/qU3aOZssMo Well, you win. https://t.co/igiPu4Neqd Can my pardon include several films? Especially while capturing criminals. https://t.co/zQYIY46SRd Passengers often wear headset in helicopters. To protect their hearing, and so they can hear one another. https://t.co/pcLd36d25A When I was good. https://t.co/IL2PUu9NvJ I’ll be sipping a droll white wine. https://t.co/vPaOKjyYQq How decent. Thank you. https://t.co/2TwOpvzGdU And Marty Short and I are hoping to come back to London to do our Covid-cancelled shows at Royal Albert Hall. https://t.co/0NRsL8LDMU A Wealth of Pigeons #5 at Wash. Post. Why number 5 is better than number 1: \n\n1: Too braggadocio. \n2. Not number one. \n3. Kinda nowheresville. \n4. Probably bought by publishing house. \n5. Perfectly confident and authoritative. Upwardly mobile. \n6. Notorious pigs’ sty. https://t.co/0BKiIvmrYs I just found my misplaced monolith. https://t.co/2XdkBu1rng Wholy Cow! Congrats. https://t.co/BwUc31ncjw Interesting take on PTA for Thanksgiving. New Documentary Explores \"Planes, Trains and Automobiles\" - InsideHook.  https://t.co/itCnrDYs7f I am honored to have had Dolly Parton and Vince Gill sing one of my tunes. https://t.co/BZVvLVsyWn Maybe they were mail-in likes. https://t.co/H2mKteNTla I imagine Dolly Parton sitting in a quiet room, manipulating RNA while writing a hit song. Thank you, Kirkus! “Pigeons” thanks you, too. https://t.co/yMqJHoRD8J It was the posing that was difficult. https://t.co/6BExcVOL75 Yesterday it wasn’t, but today it is: It’s publication day! I truly hope this lightens your hearts. A Wealth of Pigeons by Harry Bliss &amp; Steve Martin | https://t.co/oWACh0ubWX Thank you, Rachel. Great interview, even though I’m afraid to listen to it! https://t.co/bgvsTOC2V2 Great, Rita! https://t.co/9ly45y62rG So I guess pigeons are actually wealthy: “Racing pigeon sells for record $1.9 million after frantic bidding war.” Not going to retweet this....oops, finger slipped. https://t.co/7481n5y6LF Steve Martin's New Cartoon Book Is the Respite We All Need https://t.co/461A1J6ROl @CeladonBooks @Blisscartoons @Powells Powell’s! RT @CeladonBooks: A WEALTH OF PIGEONS by @Blisscartoons and @SteveMartinToGo is a @Powells Pick of the Season! \"The two comedians outdo the… Great new tune from buddy and banjo mentor, Tony Trischka. https://t.co/SlR5i2VQEe Thank you, ⁦@hwinkler4real⁩ for joining our event. The photos should have been in order of descending gray, though. https://t.co/GyWxXsM9Ab Honored to say I was a writer on that show. Humbled to say I was not a very good one. https://t.co/DsyloZEyUn I’m so excited! Also, about this! https://t.co/o6G0LG7KfR Whaaaa? Hey Henry, thanks so much for participating. https://t.co/SIUdcVJChH I’m looking forward to discussing Martin Amis’ new book with its author, Martin Amis. https://t.co/u53xb6srLR I was told there’s a paywall...sorry. Thanks to Alexandra Alter for a great article! They Are Also 2 Wild and Crazy Guys - The New York Times https://t.co/hsm5ozSb7e RT @MichaelRinke2: I love the new @SteveMartinToGo cartoons!  @cabanam @DavidGBundy @whatdrfeinsaid @BGoilav @bethtarini https://t.co/2Jzks… RT @Blisscartoons: From our @SteveMartinToGo cartoon book out next week ‘A Wealth of Pigeons’ - sneak peek. Hunting season has started here… @mfaboston Thomas Sully! Yikes. We’re number 1 on Amazon. But I knew I had to take the picture FAST. https://t.co/dIy4PAUTKy Grammar is back! @CBSSunday What fun we had with this interview! Join me and Harry Bliss online for an evening of cartoons and who knows what. Two nights only. Click for tickets https://t.co/Y2DzHLBGCC https://t.co/kfwYskgAo5 I guess you have nothing else to do. https://t.co/vF4Ikbdi1W The strings must be counted first. https://t.co/Ld7PQq7X5I @sarahcpr Why not banjo? Calming song for today. Steve Martin and the Steep Canyon Rangers - \"Always Will\" (Official Video) - YouTube https://t.co/21i1lif9eJ I’ll be there. https://t.co/6VLqkcckQA You were chaste those first three years, right? https://t.co/mcqQihj5lY @davidgura I saw the hoop move two feet forward. Did you see that? Not a lot of people know that. I call your mask and raise you. https://t.co/vMDW3CuOEG https://t.co/oF5Nprdv4a ! https://t.co/jq9TsZo90D @DaxTwit Thank you, but that was actually George Carlinton. @rblandford Jerry Lee Lewis kicked back his stool, but it was Jerry Lewis who threw it back. @Desert_Fox42 That was Andy Kaufman. Steve Allen did that bit. https://t.co/C8bmcoZ2YJ I’ve made it! I’m in the New York Times book section! via @NYTimes https://t.co/umZVse0Wu8 I can’t wait! https://t.co/ungERMPkSb The new phone book’s here! The new phone book’s here! Just got my hands on a copy of our new book of cartoons and more. \n\nhttps://t.co/oWACh0ubWX https://t.co/YRSIs5Qfw8 I never thought my music would be part of a yoga flow class. Okay, actually, I did. https://t.co/MLodrmgQF0 I’m an active 75 year old, yet I’m thinking of letting go of stretch pants. RT @strandbookstore: 📣 We need your help. This is the post we hoped to never write, but today marks a huge turning point in The Strand's hi… Yup. https://t.co/aAqjndMeFx Good will, Jeff. https://t.co/EOp1W7YwkH Hey, I’m just working here at home. https://t.co/4m3TcfhORo Just FYI:  Scientists have measured the shortest unit of time ever: the time it takes a light particle to cross a hydrogen molecule. \nThat time is 247 zeptoseconds. A zeptosecond is a trillionth of a billionth of a second, or a decimal point followed by 21 zeroes and a 1. Here’s my collaboration withThe Philadelphia Orchestra | Rare Bird Alert - YouTube What fun it was.  https://t.co/2NQxYoZ1bp My Halloween costume arrived! https://t.co/psobRQ4eqO RT @FolkAlley: TONIGHT! 8pm ET.\n\nSee performances from the Steve Martin Banjo Prize Winners (with an intro from @SteveMartinToGo), @domflem… Tomorrow, Wednesday, you can watch the revamped(!) Steve Martin Banjo Prize festivities, with videos from the winners. 8pm CENTRAL. https://t.co/1p94g4PhVg Uh oh. Reversible belts. I have just discovered Etsy. Goodbye. RT @HamiltonCollege: Jake Blount '17 is awarded Steve Martin Banjo Prize, which goes to the most talented practitioners, especially those s… RT @FreshGrassFest: Announcing the five 2020 Steve Martin Banjo Prize winners!\n\nThe Steve Martin Banjo Prize is proudly presented in partne… I get tired of myself, but I never, ever, get tired of Fred Astaire. I know it’s sad, but I’ve asked my child to follow me around the house with this.  https://t.co/OLrbxt1PLh Maybe because every once in a while they clean out fake accounts. https://t.co/LM2ZNj3jYi One of my favorite cartoons from our new book. From the cartoon collection A WEALTH OF PIGEONS, on sale 11/17. https://t.co/wRjJfhBH66 #AWealthofPigeons https://t.co/ixRyr1Mgij RT @vjbooks: Here's a fun title we're carrying that is a bit outside our usual wheelhouse: @SteveMartinToGo's new cartoon collection A WEAL… I’m so proud to have been in this dance number with Tommy Rall and Bob Fitch. Rall is mostly on the left. https://t.co/9R60E1LRo4 Goodbye to Tommy Rall, Dancer in 'Kiss Me Kate' and 'Seven Brides for Seven Brothers,' (And Pennies from Heaven) Dies at 90 | Hollywood Reporter https://t.co/yrQp32cAZr I suppose I have to hire a full-time glasses cleaner. My favorite boy band - whom I also work with - has their best music ever, with a huge donation to the people of the Asheville area! https://t.co/9jPTOENl4A RT @SteepCanyon: Our new album 'Arm in Arm’ is out 10/16! @wickedweedbeer is donating $10 per album pre-ordered to Downtown Welcome Table,… I just had a brilliant idea: Someone should write a history of these times. RT @DudesInterview: This Wednesday we release our last episode of Season 6 interview with the one and only @SteveMartinToGo for our subscri… Okay. Funny. https://t.co/0tjfn4VaXK From the cartoon collection A WEALTH OF PIGEONS by Harry Bliss and me, on sale 11/17. https://t.co/wRjJfhBH66 #AWealthofPigeons https://t.co/v5twnRcHYU A diversion, but what a diversion! https://t.co/ya0NvUHJlx Playing with the Philly Orchestra is always a thrill for this me-guy. https://t.co/dQ72Leqib6 RT @philorch: Join us TONIGHT on the Digital Stage for our first performance with Yannick @nezetseguin since March, filmed @MannCenter. Ton… Leo, I need you every day, every minute. This is not romantic. https://t.co/Q8y0l4C68D Okay, here’s the video about Father of the Bride 3-ish. https://t.co/K46mKJNVSA Our video is a hit. And the fundraising is spectacular. https://t.co/9aqLNi8bEw  Thank you so much. Here’s the link to Father of the Bride Part 3 (ish). An actual mini-movie with the original cast with BIG SURPRISES. We’re live when the clock strikes the hour. And, if you’re able, at the end donate to World Central Kitchen.  https://t.co/tuhCGtj0jX Going live in three hours. Father of the Bride Part 3 (ish) Free to watch; donate to World Central Kitchen at the end if you’re able. We had great fun making this.  https://t.co/tuhCGtj0jX For clarity, Father of the Bride 3-ish will be on Netflix YouTube, not Netflix itself. So it’s open to all! Release is later today. I’ll post a link when available. Here’s a better link to the trailer for Father of the Bride 3. It’s an actual mini-movie, with the original cast and MAJOR surprises. No rehash! Premier’s tomorrow! To benefit World Central Kitchen. https://t.co/I090x1eBrc RT @netflix: something is coming 👀 https://t.co/LxN1NWfPXk RT @CalibaBooks: New Steve Martin / Harry Bliss Holiday Gift Book https://t.co/4QfOaFcZgX https://t.co/fYA8a1H4n3 RT @discoverPHL: Just when you thought @PhilOrch's already star-studded Opening Night Celebration Concert couldn't get any better... @Steve… I always wear a mask when I go outside. But something about it was leaving me anxious and unsettled. I thought about the problem, addressed it, and here is the solution. https://t.co/aUW4jHI3dX Enigmatic, isn’t it? https://t.co/GqGGiloEjM @DudesInterview Give me a minute. Great interview with my buddy Martin Short! https://t.co/74YTpIyBQt @_Holmes92_ It already is one. Providing the calendar isn’t re-written, the perfect comedy holiday book is now available for pre-order: A Wealth of Pigeons by Harry Bliss &amp; Steve Martin (How’s my ad copy?) https://t.co/oWACh0cAyn RT @RollingStone: Steve Martin will be bringing back his annual Banjo Prize this fall with a new mission statement and two new partners htt… Not yet. https://t.co/2Guxi6Yqhy @Blisscartoons “It irritates me when you sit like a person.” @Blisscartoons “You complete me.” @RayStevensMusic Hey Ray, so nice to hear from you! \"I like ya!\" Remember that? @tonytrischka Thank you Tony and Sean! You play it better I ever did! @extremeimprov “Sorry, I don’t do improv.” Well, a huge thank you to these wonderful artists for taking time for this, especially since I consider my career to be “patchy.” However, I’m hoping this will be a daily column.  https://t.co/UsH9S1zuhd @nytimesbooks The result of not wearing a mask? Thinking of dressing up for dinner and wondering what to wear. https://t.co/WkNq4v4pVY @DEADLINE @selenagomez @hulu Welcome aboard Selena Gomez! Marty and I are tremendously excited about working with you! “Only Murders in the Building.” @caltagm Third finger moving in synch. @douglasnoble That I wasn’t in? @NickyFiddle Thanks, Nicky! Jubilation Day! https://t.co/shn78FzFCC @JoyceCarolOates How kind you are, Joyce. So there. My list won’t include “ingrate.” It’s you who are the treasure. @HlywdStacy It is from a TV special called “Steve Martin’s Greatest Show Ever.” But it was essentially an SNL special. @philipmould Looks good just the way it is in the photo. Today’s literary cartoon from ⁦@Blisscartoons⁩ and me. https://t.co/4jnTNWn34T I’m wishing Aishwarya Rai Bachchan and her daughter a speedy recovery. She was such an elegant and delightful acting partner in Pink Panther. Today’s cartoon from @Blisscartoons and me! https://t.co/hzeWZoqDKM I’m retweeting this tune because I found a better version....Night Owl Banjo. https://t.co/DhcGreuuo5 Another cartoon from @Blisscartoons and me! https://t.co/MBFAJxgZYh Thank you, Benjamin. I’m honored. https://t.co/64CpKLMS8y Carl Reiner, Perfect https://t.co/GHKU0WmCKy I don’t mind self-retweeting when so many great artists are involved. https://t.co/c15nWVhr3z Bassoon and banjo. Who knew? https://t.co/CLrvC6FCk1 Hey Judd, I am complimented by your retweetion. https://t.co/4fSbRif0s5 Tell me something I didn’t already know. https://t.co/qlT7gSVr5V Steve Martin Plays With Philly Orchestra in Remote But Rousing Video – Variety https://t.co/9wLYMEbFpz I was honored to play with members of the Philadelphia Orchestra for their yearly fundraiser.  What a cast! Enjoy.   https://t.co/6teTBxVvZo @philorch Yes, it’s true. And I’m honored to be playing with members of the Philadelphia Orchestra.  That Yo-Yo Ma guy is there, too, also Wynton Marsalis, Nicola Benedetti, Lang Lang, and Renée Fleming. An evening out while staying in. Formal wear, please. OMG. I’m watching a 1937 Leslie Howard movie called “It’s Love I’m After,” and they stole the bird calling scene from ‘’3 Amigos!” I go biking to get away from it all. Then, this.... https://t.co/ILpicapLv5 Today’s cartoon from ⁦@Blisscartoons⁩ and me. https://t.co/LhJN1fz9fh My new mop arrived! My new mop arrived! Our cartoon for the day, from ⁦@Blisscartoons⁩ and me. https://t.co/FSlv749ZVv @Blisscartoons Today’s cartoon from Harry and me. RT @sierrahull: Tune in tomorrow to #TheRoundup with @RounderRecords! I play songs from my new album and a surprise cover. Special guest ap… @SquidyUK Yes, George Gipe wrote with Carl Reiner and me. He was a talented but very quiet person. Once we had lunch at a restaurant, and Carl and I drove away thinking George was in the car. We circled around the block, and George was still standing in the parking spot. Banjo finale/The Great Remember https://t.co/am424ScrPa Today’s cartoon from ⁦@Blisscartoons⁩ and me. https://t.co/GJaAyfLXkW Here’s what we’ve seen so far in our driveway in California: the Fed-Ex guy, the UPS guy, a bobcat, and the air conditioning mechanic. The odds that a person is standing in the exact spot you want to go to in the kitchen is now 80%. @belafleckbanjo Thank you, Bela! Banjo sky https://t.co/Na52pFi8Jk Today’s cartoon from ⁦@Blisscartoons⁩ and me. https://t.co/CDjuPVO89D It’s the little things. https://t.co/XSUqvmadTM @TerryTeachout1 @hekasia So sorry to hear. @ThePublicSA @ebnewbohemians @TRWMusicals @TheActorsFund @ActorsEquity @SethRudetsky @TheEllenShow @lianamariehunt @broadwaycom @BroadwayWorld @theatermania Great job! Stay safe and strong. Ireland and Scotland do melancholy very well.  https://t.co/9nDXEXuPIV Banjo calm. https://t.co/kAhRbMyfUp Banjo balm. https://t.co/eQ6jUkHSHm Through the years, I’ve loved bluegrass and folk music, and I’ve collected some of my favorites here: https://t.co/HwSLxLZ2Jo RT @SteepCanyon: #Steepcanyonrangers https://t.co/Vg9pQksldM A tiny light for today.... https://t.co/4uKo2lBFdM You mean, continue on? https://t.co/VFmYgDXyNd Glorious. https://t.co/RT8aKUk2G8 Good for the sole, as in self-isolators. https://t.co/0Mas9bUsWb This is on the Royal Albert Hall website: We are sorry to announce that the Steve Martin and Martin Short shows on 14 and 15 March 2020 will no longer take place due to the developing coronavirus situation.\n\nWe are calling it a postponement. This is the right thing. More later. Dear Belfast ticket-holders, in light of the ever-evolving global situation, Marty and I have decided to postpone our Belfast show until happier times. Last night’s thrilling Dublin show turns out to be our sad farewell – for a while – to our beautiful Ireland and Scotland tour. Announcement shortly about tonight’s Belfast show....stay tuned. We’ll be there, all dressed up! https://t.co/9EqMJYClj9 We are excited to get started in Glasgow! https://t.co/EX9uxo8rJR We are on! We start mostly on time, and there is no opening act. WE BEGIN! https://t.co/6xAat6cDep Isn’t that immoral? https://t.co/HTYnaeZFdO This is so obvious. https://t.co/2iVRbRxLqP Name tags are pointless unless worn on the forehead. Is that good? https://t.co/Rn4h00PmqJ This is how I find out? You tell me?  https://t.co/mlAdiVrIPu RT @NorthwellJBT: JUST ANNOUNCED: @SteveMartinToGo &amp; Martin Short: The Funniest Show in Town at The Moment live from the Beach on Friday, J… RT @Sunny102_3: Just Announced! @SteveMartinToGo and Martin Short will be coming to @cmacevents on August 29th! Tickets go on-sale on Frida… RT @cmacevents: JUST ANNOUNCED: @SteveMartinToGo &amp; Martin Short: The Funniest Show in Town at The Moment live from CMAC on Saturday, August… This cartoon by @Blisscartoons and me is up for auction for the benefit of the Cartoon Art Museum! Yay us! https://t.co/a4iOuJkISu I just had an incredible idea: Buy low, sell high. I didn’t spot a thing! I thought I was making a joke. https://t.co/kwewYq94aJ I love grammar and usage, but feel I’ve gotten worse at it as time grows on. https://t.co/V2lNBUsX86 I was drunk. https://t.co/O8dEnFysv6 Just asking: When did the word “mocks” replace “kids about” or “satirizes?” Since clickbait? Make that Erivo! Go team! https://t.co/RnJgBHORwD Yep. I blew it. https://t.co/jehFyFIv6J Love these rare birds I saw today at MOMA: Lee Bontecou, Kaspar Malevich, and John Covert https://t.co/8zTKVdYeEf A cartoon from Harry Bliss and me. https://t.co/DevMu3LlhT So, daily Spelling Bee, “Clickbait” is not a word? You’ve got to get out more. https://t.co/xH15rCpWqk Here we are on Colbert last night: https://t.co/8NmK6FLP0Z Had a great time on The Late Show last night, doing the banjo thang with @SteepCanyon! https://t.co/pOmfF1B04q This is not in error. https://t.co/9GGZsD08OL Preparing for our appearance tonight on Colbert; great shot of me frowning. https://t.co/HUeLhEUTJA @TinaLynn64 @Blisscartoons It was a perfect retweet. Tonight on Colbert @SteepCanyon and myself playing our new hit single, California! .. https://t.co/Q4Ud4WWGTQ via @YouTube (“hit” is, of course, relative). Yes, tomorrow night (That’s Wednesday night. https://t.co/aUvuBCzmh9 Yesterday’s cartoon from ⁦@Blisscartoons⁩ and me. https://t.co/g08EgHFJck Yes, our new single will have its TV premier on Colbert on Wednesday. No exclamation point needed, as the news is exciting enough.  Steve Martin and the Steep Canyon Rangers - California (Official Lyric V... https://t.co/Q4Ud4WWGTQ via @YouTube Mr. Fancy Pants. https://t.co/PMCdASg8Zu A great weekend in Florida with master musicians! Next stop, the UK with @steepcanyon https://t.co/qd43aVcKp9 Going out on a limb here, but doorbells and phone rings should be banned in TV commercials. I was hoping someone would catgut us! https://t.co/roCLTESPRe Great show last night with the First Ladies of Bluegrass! And the guy on the right. https://t.co/V4MIEwYVNm Weird phenomenon: Everytime I tweet this link, the view of my new song/video increase. Correlation? https://t.co/Q4Ud4WWGTQ via @YouTube I deleted the last tweet because our performance on Colbert is on JANUARY 29TH, not February. @SteepCanyon OMG (Oh my God), so funny. Salute to Terry Jones. https://t.co/1SK3dRwspf See you soon, Becky! https://t.co/EjUoF1C3K4 Very nice! https://t.co/MtluEKhmJQ So great to have written and recorded a song that fits into no known genre! https://t.co/Q4Ud4WWGTQ I’m starting to look like my caricature. https://t.co/rJGSifbj3N This is actually quite true. https://t.co/DqRnckFvma First post was too blurry. Trying again. ⁦@Blisscartoons⁩ https://t.co/BBoMHRWYtP “Catchy + infections!” https://t.co/YZ28naap9z New song/video “California” flirting with number 1 in the arctic charts! @SteepCanyon https://t.co/Q4Ud4WWGTQ via @YouTube Here’s our new song on the Rounder site with no ads! @SteepCanyon https://t.co/rmcWyP0quZ We must be a hit! Our YouTube video now has ads. https://t.co/Q4Ud4WWGTQ Our new single continues to climb the charts that are in my head! Go “California!” @SteepCanyon Produced by the master Peter Asher. https://t.co/Q4Ud4WWGTQ Final tweet of the day regarding our new single and video, “California.”  It’s turning into a monster hit! (Remember, this is Twitter)https://t.co/Q4Ud4WWGTQ @SteepCanyon #PeterAsher Thank you Rolling Stone. I will continue to send you compromising information about my friends.  https://t.co/RQu61P9eZP Think Robert Preston in the Music Man. Wait, you’re too young. https://t.co/O2U0rluQVi My whole new idea of using Twitter for promotion is catching on. I see others copying.... https://t.co/SGpn6WjQTe So California is stirring, thus, here is my new single with @SteepCanyon, produced by Peter Asher, “California.”  https://t.co/Q4Ud4WWGTQ via @YouTube And I love We Banjo 3! Missed you at Merlefest one year and I’ve rued it ever since. https://t.co/JDXejth8j1 Just had a revelation! I can tweet the video now for those awake, and tweet it later for California! Here’s our new song/video from me and @SteepCanyon, produced by the produced by the historic and gifted Peter Asher https://t.co/Q4Ud4WWGTQ via @YouTube I’ll link to our new song today, but since its title is “California,” I’ll wait till California is awake to do it. Produced by the great Peter Asher and starring @SteepCanyon. Unfortunately, I’m singing. Even though it’s “single release day,” here’s a new cartoon from @Blisscartoons and me. https://t.co/1j1mdqurrC Here’s a momentous teaser for our new single, “California,” coming out tomorrow. ⁦@SteepCanyon⁩  https://t.co/KgUVcs1LDj Vlog and flow both failed, and yet, genius. https://t.co/FCht9s5c9g I’m just learning that Twitter can be used for promotion! https://t.co/JQkid8fAlx Yes, tomorrow is release day for our new hit single. @SteepCanyon. Take heed as this is probably the only promotion you’ll see for it #VanityProject https://t.co/xa2rCRS4Rq @mortgerberg Yeah, man. Love it. Today’s cartoon. https://t.co/F9cgY6j6Qg My new single with @SteepCanyon drops on January 10, just in time for the holidays! https://t.co/MtvUh4Y55u Today’s cartoon from @Blisscartoons and Steve (Martin). https://t.co/64z1Ukmfc2 Oops on the second semicolon. https://t.co/4KFO6BQMcu @BanjoMuseum The Mark Twain award made this remarkable Gibson banjo for me; yes, that’s the Kennedy Center inlaid on the neck. Too beautiful to play; it will do more good on display at the American Banjo Museum. The light on the stone thingy has pros reeling. https://t.co/zDchSrmxbk News for my bluegrass followers. @SteepCanyon and I will have a new single on January 10th, “California.” Less details to follow! A little piece of my teen years. Thanks, Daveland!  https://t.co/0XS8z3rTJI Indeed! https://t.co/YuJxQ00hiN This is absolutely true. People in California should book their flights early. Probably best through Toronto, drive to New Brunswick, take a boat to Greenland, they fly to Glasgow. https://t.co/UQTG2bqqkN A laughing dumpling is problematic for me. https://t.co/kUFrBDDGqz It’s called anarchy. https://t.co/SbViBDJz6G OMG. https://t.co/a1fAXx6pWv When I describe our family’s traditional Christmas Day dinner, I always hear an envious *sigh.* https://t.co/oivNkegOd5 This is actually the case. https://t.co/CsySEjAJsw A holiday cartoon from @Blisscartoons and me. https://t.co/cRuMHh09pY Yup. https://t.co/m6IynGGg5S Question. “Which” or “that?” https://t.co/ugox4Kls48 When I took my driver’s license photo this morning, the clerk said, “Do you want to go into the restroom and fix your hair?” I said, no. Then I went to the magic shop. So sorry now. https://t.co/sca9TYlFnt @deborahsolo @museodelprado An important essay by Deborah Solomon about my newest favorite painting, which, to me, rivals the Mona Lisa. Uh oh. I’m in trouble. Free tickets! Wait, hold on there.... https://t.co/MbmPxl593V I love that the Grammy Award winning group I’ve worked with for ten years is making huge waves, again, on the charts. https://t.co/c2w3SnrOzt It’s true. From the 70s. https://t.co/0Aqei1XG6g I so get it. https://t.co/L59sMJ3C2D And this is me when I was young. https://t.co/Kkn3MhDxjh Listen and learn! https://t.co/aEycRcCJMo My favorite boy band has a new record! https://t.co/lXiegdx8KX I so wish I could send John candy this review. https://t.co/Q1t6cg9aKL The radius is so obvious. But, nevermind, I’m just a comedian. https://t.co/8iIsjp9AB1 OMG. Donald Trump, Fred Armisen and a guy. https://t.co/Ex6Xopoqhr I’m featured! https://t.co/6c2UxTWV4n I’m pretty sure I said that tomorrow. https://t.co/lB7cp5xKuU RT @TWiT: No joke. @SteveMartinToGo now knows what USB-C is and how to pick the right cable because he Ask(ed) The Tech Guy. You don't have… Hey, hang on there, wait just a second.... https://t.co/U7I4juWFk3 Now tweeting from an unknown location. https://t.co/UHWJSM1qBi Today’s cartoon! https://t.co/Fp0J0uJPA3 Masterpiece. https://t.co/inMobVUqlR So interesting to have become a major photographer with only one photo. https://t.co/mq4xT4QG1c We LOVED our whole tour of Australia! Audiences great, food great, art great, weather great. And our sold-out show last night in Sydney was the wonderful finish. Thanks so much. https://t.co/xbTgsJxuMM It is fabulous. Thanks so much. https://t.co/y9grLgnEKX 'Bright Star' shines with bluegrass and a little magic | Arts and Entertainment | Your Observer https://t.co/RtIi49toAn Yep, our cartoon for the day. https://t.co/6oZ3u5nFtY now tweeting from a secret location. https://t.co/9FF4H6H5Xl I loved my visit to this beautiful and very active museum. I learned a lot that I didn’t know...wait, that’s redundant. https://t.co/lCsy9zsC6x Uh, we were in Perth four days ago. https://t.co/ap5SfrBH3o A new bit keeps performers alive. https://t.co/iAU4oqb21t I could have drawn it in a snap. https://t.co/amqMt5Helz I never tweet laudatory reviews.Oops. Finger slip. Steve Martin and Martin Short in Adelaide review: A masterclass in comedy | Adelaide Now https://t.co/Ufiu6SZEfl Already evil things are happening. https://t.co/cPketV11tx The hat is the star on the California flag. FYI. https://t.co/zHzA4frmcy Can you read this in a hotel shower without glasses? Is it body lotion, or is it poison? https://t.co/TuW1IN0YVb A few empty seats tonight at our show in Brisbane. Okay, maybe it was U2. https://t.co/CJYfK0KJp6 Australian audiences are very affectionate! https://t.co/WzBjZ5dYdx Guess what country I’m in. https://t.co/ZiGQunbGax This photo is what comedy is all about. https://t.co/mzxeAA2SDL Marty and I are loving our Australian tour! https://t.co/vkRVgqWOhP If you like paywalls, you’ll love this interview!  We’re in Perth TONIGHT. https://t.co/unUt7WCcxF Congrats on what is evidently a wonderful production: BWW Review: Hatty Ryan King's Star Shines Brightly in Lipscomb's BRIGHT STAR https://t.co/XLG5DVlyPX Our latest.... https://t.co/WAIUg3OrBq Our latest.... https://t.co/Jsop9vD1Ux The latest cartoon from us two guys. https://t.co/BaYcyBWx1x Go to a nail salon and ask for acrylic nails. You only need one or two depending on your playing style. The nail will usually last a month. Plus, your finger will look beautiful! https://t.co/nZVkUUwUbb We all love Tim! https://t.co/FOQzUGCfJA “I retweet, I retweet, I retweet,”is the new “location, location, location.” https://t.co/Lb0JJ45muL I love the work of Allegheny. https://t.co/Bw3osWGxYP I confess I have rhymed “sauna” with “marijuana.” And also, “amigos” with “Speedos.” https://t.co/LC9n9NzZ90 I never retweet good reviews. OOPS. https://t.co/ncGkeYEyzQ Clearly they are actors. https://t.co/pGsdB4yAy6 Just found this photo of Emmylou Harris and me. Great memories. Of being thin. https://t.co/W56ZGAe9ew Tonight, in Atlantic City! https://t.co/O80zIVjo38 That’s a great compliment considering I was saddled with Marty Short. https://t.co/28WNPonbcH I’m sure I was with @SteepCanyon. Have a great show with those dang banjos. https://t.co/9QsBo5wxW9 RT @BBCSounds: Actor and comedian Steve Martin searches the extraordinary collection of the @MuseumModernArt and finds two works that speak… Very enjoyable for me to do! https://t.co/x6rSGKGgUY Today’s cartoon from ⁦@Blisscartoons⁩ and me.  https://t.co/SCr9MW4ExP This is accurate. I love accuracy. https://t.co/LmV2URTBao RT @deborahsolo: I wrote about the new MoMA, and what to do when the Modern is no longer modern, for the ⁦@NYTmag⁩.  https://t.co/zQ9B2PAVOW Congrats! https://t.co/63sRDknVLl I’m enjoying my collaboration with ⁦@Blisscartoons⁩! https://t.co/dCLSKj1ud2 Hopper may be the master of isolation, but he’s also the master of windows. https://t.co/kehNvbFxyP Today’s cartoon! https://t.co/wwdTREI0H4 Isn’t the multipack, though, for cowards? https://t.co/pilWOCO5vx FYI, this was in my Amazon recommendations. https://t.co/xMq9tGoZKB We are simply a catalyst. https://t.co/Af2Ij6DcBT I knew about them last year but who the hell is going to listen to me? https://t.co/75eB1K3qk7 How dare you insult us in this way. Wait, let me re-read. https://t.co/AFVeHw9ChB And what about this vase, given to me over 40 years ago? https://t.co/ojyWfUixm2 https://t.co/vS3zRlR1nM Here’s the cartoon that started it all between ⁦@Blisscartoons⁩ and me. https://t.co/BtkO9A8N3L I guess I’m doing better than I thought: “Steve Martin and Lauren Yee are among America's most popular playwrights — and there's a San Diego connection - The San Diego Union-Tribune” https://t.co/cWmojU80CD Here’s Marty Short’s and my official dates for Australia! We think of it as going “up over.” https://t.co/YreAihbiAT Preorder now! Though I have nothing for sale, it’s always good to preorder. Another cartoon from @Blisscartoons and me. https://t.co/DRRcsEOcvC Today’s cartoon! @Blisscartoons https://t.co/KfX65uqACg ... After the shows, he said “Please call me.” About a month later, I did. He didn’t recognize my voice, and he said, “What’s my dog’s name?” I said, “Charlie.” He said, “Hi, Steve!” The brilliant Ken Burns’ documentary, “Country Music,” reminds me, among other things, of the charm and artistry of Roger Miller, whom I opened for in Sparks, Nevada in the early seventies. [Next Tweet!] RT @MyTicketUK: ICYMI: Last week, comedy legends @SteveMartinToGo and #MartinShort announced “The Funniest Show in Town at the Moment” tour… Here’s yet another cartoon from ⁦@Blisscartoons⁩ and me. https://t.co/6XOUBbBud0 @AlexWesaw We loved the Four Winds! And the audience seemed to enjoy me and sometimes Marty. @PBBTC Unfortunately, I won’t get there in time, but if the video speaks for the talent, I’M IMPRESSED!  Have a great run. We loved our show at the Colosseum last night. The part with the lions was especially entertaining. https://t.co/KZ9juNRozb Here’s a tune from a few years ago from Edie Brickell and me.  https://t.co/biZWfdR6op Marty (I think of him as Martyr because of his whining) and I are coming to the UK in March! https://t.co/XrPxLDjPHS Today’s cartoon! https://t.co/qp6eKcP2rj It’s an online pledge. https://t.co/MhbbLYGKVJ Yup! https://t.co/bQdfIzvHlr See you tonight at the show! https://t.co/CiCOj9ru2F It’s a masterpiece, but not very funny. https://t.co/wwjjdovdo8 Ha! https://t.co/VS7jsVP43G Nice review of Marty and me! Interestingly, the reviewer is absolutely correct. https://t.co/OxqNOyT1Cc Cartoon time! From ⁦@Blisscartoons⁩ and me. https://t.co/HI84coG948 Yes, we’re all headed for Australia in November.  Exciting to think of the Steep Canyon Rangers doing a solo show there while we (Marty Short and I) and the Rangers are on tour. https://t.co/DnXcMEfwkS Another cartoon from ⁦@Blisscartoons⁩ and me. https://t.co/BGTVtKofs8 Today’s cartoon! From ⁦@Blisscartoons⁩ and yours truly. https://t.co/uiTvk1iyfq We loved our show in Bangor tonight! https://t.co/dg544F9Ors Congrats to Victor Furtado on winning the Banjo Prize! https://t.co/IX0SxgAgvU Never too late to sign this charity autograph request from 2013. https://t.co/fVMXHTYh98 This weekend, Springfield, Saratoga Springs, Bangor! Marty will have his head on my shoulder the entire show! https://t.co/dXU7Xdmt3f RT @cl_tampabay: The trick to enjoying Theatre of the Absurd is that you should never, ever think too much, because the point is there is n… Our cartoon for today from ⁦@Blisscartoons⁩ and me. https://t.co/kmsHHGpXpJ This beautiful “carpet” by Xu Bing at LACMA is made entirely of cigarettes. https://t.co/lbVFHGEMi8 Great cast; great production! https://t.co/NlzwsOkXyX Today’s cartoon from ⁦@Blisscartoons⁩ and Steve https://t.co/3v6n0aZabu Comedian, banjoist second. https://t.co/SVSase74Yv You should not, currently, be laughing at this. https://t.co/0veLey19J6 Please, no more “comedy” answers. Straight answers only. I’m so angry right now. I’m sure you’ll comply. https://t.co/rV7O06wCQC I knew something like this would happen. https://t.co/gPAIWsDIPn Can any of you experts tell me where this rug is from? And don’t say Carpet City. https://t.co/a7fCPrS9oF Today’s cartoon from Harry and Steve. ⁦@Blisscartoons⁩ https://t.co/qNIMkRTo4I Here is Marty’s and my touring schedule for the next two months. Dallas; Carmel, IN;Windsor, ON; New Buffalo, MI; Vegas!; Bethlehem, PA. See you there. https://t.co/SRjpUynudo Today’s cartoon! From ⁦@Blisscartoons⁩ and my little self. https://t.co/5VwRGkw5Up Today’s cartoon! From ⁦@Blisscartoons⁩ and me. https://t.co/DAaxnQgztn Gagosian's 'Desert Painters of Australia' bursts with beauty - Los Angeles Times https://t.co/wBnzLPA9gQ RT @AusintheUS: You know @SteveMartinToGo as a comedian, actor &amp; musician, but #DYK he's also an 🇦🇺#IndigenousArt collector? You can see a… RT @Blisscartoons: And the rest is lame pizza history... https://t.co/MIGdhZCqvp Thanks, guys. Our collaboration has been extraordinary for me. https://t.co/B5x60YVsr0 Yep, and thanks for all your help and advice through the years. https://t.co/Tte9zPEKQW @bdgrabinski I modestly retweet. Latest cartoon from @Blisscartoons and me. https://t.co/vLwLiXnwpT We’re getting closer to “A Night to Rememeber” in Dallas. If we remember. https://t.co/GKWegEqdaJ Just bought it. Can’t wait to hear the wonderful things you say about me. https://t.co/9KSW3DXEQX Today’s cartoon from ⁦@Blisscartoons⁩ and me. https://t.co/kKUvrBpi3X Today’s cartoon! https://t.co/5oXkpiGjrz Here is a great discussion of Western Desert painting by three luminaries in the field: https://t.co/87nkyOGJOd My nightmare last night. https://t.co/Z8THG2DKQJ Wonderful to be back at the Old Globe -as a writer-and to play the beautiful circle in the round oval shaped theatre. https://t.co/WerqnXLoot Today’s cartoon from ⁦@Blisscartoons⁩ and me. https://t.co/j7W9cXf8Og This is a very bad situation to be in. https://t.co/RaLaI94uPT Another view of the Australian Western Desert painters at Gagosian in L. A. Opens Friday evening. https://t.co/WFgT8ihdEy A beautiful show of modern Australian Western Desert painters is opening tomorrow at Gagosian L.A. 6-8. Many of the paintings featured are from my wife’s and my collection. So honored. https://t.co/56Ie1cFS2Y We had a ball with this interview. https://t.co/ZVLSbdAuQd Reno tomorrow, Eugene Saturday. Airway Heights-? Sunday. https://t.co/hN69nsOnNl And another cartoon from ⁦@Blisscartoons⁩ and me. https://t.co/NRAcxjFWm0 I’m so excited for this show. https://t.co/yUFN5QQlfO Curious about your reaction to this section of our new single. ⁦@SteepCanyon⁩ https://t.co/QNL8Gl7tdu Yes, Harry and I keep on keepin’ on. https://t.co/bbDu7ENewC I’m recording a new single today with @SteepCanyon. First single since King Tut! Very different though. Tonight in Colorado Springs (that’s in Colorado). https://t.co/K4Gfnto59A I know, bleak. ⁦@Blisscartoons⁩ and me. https://t.co/kGUcqSfl1b Every minute of every day. https://t.co/gTxQlTSUH6 Colorado, see you this weekend. Loveland, Colorado Springs, Vail. We can’t wait. https://t.co/PIa31AleA3 Thursday’s cartoon! From ⁦@Blisscartoons⁩ and me. https://t.co/Lpj6HbzopJ It’s cartoon time! ⁦@Blisscartoons⁩ https://t.co/LmSw5hwPn7 And yet another cartoon from me and ⁦@Blisscartoons⁩ https://t.co/PLeDVwlAP0 I’m definitely going! https://t.co/5ilMj45GFI Today’s cartoon from ⁦@Blisscartoons⁩ and me.... https://t.co/bOSeca34yP RT @BookOfBENAIAH: 🌟 ...a few stills from Bright Star. The experience was priceless, but SEEING what the audience saw brings tears to my ey… Hey Jeff, have a great time. So glad you’re doing it. https://t.co/hPsGTewgZR Today’s fun from ⁦@Blisscartoons⁩ and me. https://t.co/mrn5cU6Qer Marty and I are excited about our Colorado tour, beginning in about ten days.... https://t.co/xxxMvtltIC Today’s cartoon! https://t.co/aeFGm9nhZf Barry Flanagan. https://t.co/67th3UvT9m Nice toilet. Privacy was an issue. https://t.co/LgnU5YfQME Today’s cartoon from ⁦@Blisscartoons⁩ and me. https://t.co/FsM5xVNBVz @Variety No magazine has ever fact-checked the false statement that I am a member of Mensa. Never have been, never applied. And if my life depended on it, if I was asked “Who is Henry Clark?,” I would have died. https://t.co/maVtO3VTm4 Took me a minute. https://t.co/maVtO3VTm4 You got it, (may I call you) dude! https://t.co/hcJudJxzfg Today’s cartoon from Steve and ⁦@Blisscartoons⁩ https://t.co/7ySQcw07fJ Surprises at my eye exam. https://t.co/3uuRspoY6L A dog cartoon today from @Blisscartoons and me. https://t.co/sPcnCRV700 Have a great run! https://t.co/NQjer4Pw1I Today’s cartoon! ⁦@Blisscartoons⁩ https://t.co/sWRgJx2UeG Yup. https://t.co/UGjooJNi5p FYI, the star on my hat is the from the California flag. https://t.co/837bb4vdyq Now tweeting from an undisclosed location. https://t.co/f6gjMyDfsn Just when you think you know it all, here’s a photo from Venus.  https://t.co/j4baEHTbez Somehow, these are not the most exhilarating photos. https://t.co/P07QXsKecP Full house tonight, except when I was playing and people went to get beers. https://t.co/0pgUPQXhv4 Unbelievable. We played Moorhead tonight and did not make one Moorhead joke. It’s cartoon time! From ⁦@Blisscartoons⁩ and me. https://t.co/ZQ4ebGUZjm Only problem with visiting the American Banjo Museum in Oklahoma City: not enough banjos. Har. https://t.co/RvLFtgVOYZ A cartoon from Harry Bliss and me...⁦@Blisscartoons⁩ https://t.co/c3DfdJRgZk Moorhead, Sioux Falls, and Davenport, IA coming up next weekend. https://t.co/GlIYq3riwr All I can see is my button. https://t.co/DotycjEdY9 This is actually the theatre we played tonight in San Antonio. The blue sky is an illusion. We are indoors. https://t.co/G1B5HPecAR Sorry, earlier tweet turns out not to be the Alamo. Here is correct photo of the Alamo. https://t.co/VBRhoc2oSf In San Antonio, just saw the Alamo. So fantastic! https://t.co/0wkQpVrNoC Today’s retro cartoon from Harry and me. @Blisscartoons https://t.co/rqhYT7dkfZ A perfect correction. https://t.co/EYpDDmAhys El Paso rocked. And I even think I know what that means. San Antonio today, then Oklahoma City Sunday. https://t.co/33b3t7ulwv One of the great banjo photos ever. https://t.co/PbET0Wn6LS Congrats to The Firehouse Theatre!  https://t.co/nPUwnIpS9L We are there! https://t.co/rFJ7Cwhmff Today’s cartoon from Steve and Harry. ⁦@Blisscartoons⁩ https://t.co/ZQXTu1A9mA See you in El Paso. This Friday. https://t.co/cTztG37IQW Marty and I are in El Paso on Friday! Saturday, San Antonio!. https://t.co/CPgJwRcaaN @HistoryToLearn This man, Vermeer, paints better than I do. At this point. But why would you put your hands down? https://t.co/0LUWXDnexH Yup. Loved coming to the town of Jack Benny, a comedian I admire, steal from, but, alas, never met. https://t.co/wodrgRgVVO This can’t be true. And yet it is. https://t.co/0LUWXDnexH Yes, it’s true. https://t.co/lV7nUZdLqb Marty and I were expecting more people for our show in Rochester tonight. https://t.co/5AQUoBmdnQ See you in Rochester, MN in a few hours! https://t.co/eLarpE8REQ See you tomorrow in Rochester, MN, then on to Waukegan an Hammond. Marty and I haven’t seen each other in TWO WEEKS. So it will be a love-fest. https://t.co/74GczSath8 Today’s cartoon from Steve and Harry ⁦@Blisscartoons⁩ https://t.co/2TJSScGcHQ This, either, is not something I expected in my life. https://t.co/BjCCc5ZHkI This is not something I expected in my life. https://t.co/mTFWrKBw4e A laugh a minute from @Blisscartoons and me https://t.co/NrV2E6963c Here we come, Rochester MN, Waukegan, and Hammond! https://t.co/UHpW7XUqSx Another George  Tjungurrayi work. https://t.co/79tzBrtkjZ Love this image of a George  Tjungurrayi painting. Accompanied by a great article by Sebastian Smee https://t.co/mC0i8u6XsB I already knew that. https://t.co/7fiYPhrSq9 I deeply enjoyed this well thought out piece by Jason Farago about Indigenous Australian art...\n\nhttps://t.co/sJ3OKzJuby via @NYTimes Today’s cartoon post, from ⁦@Blisscartoons⁩ and me. https://t.co/fXRratHPRz I can’t wait to see myself! In Rochester, among other places. https://t.co/OLkRYFLlOJ Agreed. And I got my name mentioned! https://t.co/rbXWpMckWj Today’s cartoon. ⁦@Blisscartoons⁩ https://t.co/Pe2MJdvwmB I don’t know if this is behind a paywall, but I’m posting it anyway.  https://t.co/BZjFmLo60U It’s cartoon time from me and ⁦@Blisscartoons⁩. https://t.co/23U78ZCDGr Love this side-by-side of these two remarkable works. https://t.co/SFVSOjhpb9 We loved doing this interview in advance of our AUSTRALIAN TOUR in November. Thanks, Andrew Denton’s! https://t.co/NKaZ2UNqpG Today’s cartoon from Harry and me. @Blisscartoons https://t.co/Df17r8jxih RT @marshall_steven: The spectacular artwork from leading Indigenous Australian desert painters are on display at the @Gagosian in New York… RT @johncarty77: Tjumpo Tjapanangka was an epic artist. His navigation of art, abstraction and the Dreaming was sublime and grounded in dee… A cartoon for the day from Harry Bliss and me. ⁦@Blisscartoons⁩ https://t.co/6XadWfKb0A Thanks, Wichita (if a city can be thankable), for a great evening and riotous, rockin’ audience. Tonight Kansas City! https://t.co/r9QuRyk2NW Marty and I - in better days - doing Stan and Ollie. Wichita tonight! Kansas City tomorrow! https://t.co/dB0yNa9vok Now, this has five retweets. https://t.co/OaZZJ55HSU I save it for the latter part of the show. Excitement builds for the audience. https://t.co/TA16BfKFls You are correct. I’m going to Kansas City on Thursday. Sorry to excite a town prematurely. https://t.co/aCW7ITY4kk Oops. Kansas City. https://t.co/dDvuMi3lH1 Marty and I are coming to Wichita on Wednesday, Oklahoma City on Thursday. Yes, I will be doing the pointing gesture as seen in this photo. https://t.co/kJUkHifyni Today’s cartoon from Harry and Steve. @Blisscartoons https://t.co/INpNnQuSRp Actor Steve Martin Amassed a Stellar Collection of Australian Aboriginal Art at Warp Speed—and Now You Can See It at Gagosian | artnet News https://t.co/MHkJ1qFC2k Another cartoon from Harry and me. @Blisscartoons https://t.co/TctEOY6uPE You can see our collection of Indigenous Australian desert artists opening today at Gagosian Bookstore Gallery. https://t.co/YB90q4W0dT https://t.co/T8JUF5a6WU Here is today’s cartoon from Harry Bliss and me. @Blisscartoons https://t.co/xECebBBZ7x Look out, Wichita and Kansas City. 8 &amp; 9th. https://t.co/MWU9uZQAql Our Australian tour is now announced! Starts in November in Perth. Look how cute we are. https://t.co/kfE7601Yf4 Marty and I are now preparing for Wichita and Kansas City.  Concerned over packing for unknown temperature. Could be sweater weather or shirt-sleeves. Still, temperature in hotel room is a variable.  There’s only so much room in 12 suitcases. https://t.co/sPT88jSWZG We are so excited! Which means we have to be excited for five months. https://t.co/WLECH1d1E4 Another cartoon from Harry Bliss and me. ⁦@Blisscartoons⁩ https://t.co/giOGq9VtDM “T” Just finishing the “far.” https://t.co/OmIWmKprHy Ugh. Not complaining, just finishing the “tho.” Working on it! https://t.co/vdr2ZHyFDB Busy night for Steve even though I’m just sitting here. https://t.co/ZfBKHW85Pe I’m moving to Australia just so I can watch it! https://t.co/D2SG1BEy1R Today’s cartoon from Harry Bliss and me. ⁦@Blisscartoons⁩ https://t.co/NqlPqUHQA5 I have realized that on this tour, Marty and I are only playing cities that are fun to say. Rochester is certainly fun to say, so is Waukegan. Kansas City, perhaps, is not AS fun to say, still, one would have to be very jaded to say it’s not fun at all. https://t.co/BJ8MYaye3o Retweet, lose comma after first Wichita. https://t.co/OTHOzB9RQL Coming to Wichita, and Kansas City soon. “Wichita” very fun to say; “Kansas City” less fun to say, but very self-explanatory. https://t.co/jwOSSdZiad You might enjoy this painting by the American 19th Century painter Frederic Church. 5.6 by 9.5 feet. Argh. So hard to correct a typo on Twitter. https://t.co/iAXHgROBCw Be sure to see Marty and me in Wichita on May 8th! https://t.co/xXHC9WAAEP Next stop, Wichita! May 8, Kansas City, May 9th. https://t.co/fTuBWR14t0 Any of you solvers get this? ⁦@Blisscartoons⁩ https://t.co/axhc1l4Ytp Achieved by overcharging! https://t.co/42OTXuuxxq Thank you, Peoria, for a great night! And thanks, too, for having such a fun name to say! Unfortunately, that’s the show. Thanks for coming! https://t.co/Upatjx7vak By the way, I’ve become an exclamation point person! Marty and I are happy to be playing the gorgeous Peoria Civic Center theater tonight! The nation has beautiful theaters both new and renovated wonders. Tonight, Peoria! Sensational audience last night in Milwaukee gave me confidence to have an egg-white frittata for breakfast this AM. https://t.co/Cws4JB55oS I‘m stymied by  the paywall, but the headlines are fantastic. Tonight, Milwaukee, tomorrow, Peoria! https://t.co/xxD0s2juRD Today’s cartoon from Harry Bliss and me. ⁦@Blisscartoons⁩ https://t.co/E57mhp7GF8 Tonight, Milwaukee! https://t.co/Wr17EAKXcL Despite its extra vowels, Marty and I are playing Milwaukee today, Friday. https://t.co/xPxR5AsvEl RT @Blisscartoons: Cartoonist Harry Bliss Collaborates With Comedian Steve Martin https://t.co/ngYzifXbuz We are in Omaha tonight! https://t.co/7tpOyRs5eq RT @NewsHour: Comedians @SteveMartinToGo and Martin Short give us their #BriefButSpectacular take on, as they put it, \"our fabulously popul… Another collaborative cartoon from me and Harry Bliss. ⁦@Blisscartoons⁩ https://t.co/lshb9LNvEl I’m one. https://t.co/YA94i7YkzQ See you this weekend, Omaha, Milwaukee, and Peoria! We’re already pressing our shirts! https://t.co/kpBM412GmY Marty and I really enjoyed this interview. https://t.co/BRa7M1S9W1 The great cartoonist Harry Bliss and I are working on a series of cartoons for a book at some point in the future. Great fun. ⁦@Blisscartoons⁩ https://t.co/AqRqG8bEPy Omaha, Milwaukee, Peoria! We’re on our way. https://t.co/DaaJQ5NJh2 When the audience stays the whole show, we know we’ve killed. https://t.co/cnXbTwdCUg Great audience last night makes us even more inspired for tonight! https://t.co/ye7fJQGTlJ Yep. We’ll be starting shortly. https://t.co/OZLGLabpob Congratulations to Kristin Scott Benson on being awarded the SM Prize for Excellence in Banjo and Bluegrass. https://t.co/ulsV7Js8lL", "bag_of_tweets": ["On the set of “Only Murders in the Building” today with the great ⁦@janemarielynch⁩. Yes, we’re in look-alike clothes. https://t.co/TaLLWkBzwU", "Today’s cartoon from @Blisscartoons and me: https://t.co/0PuvfbmfJw", "Well I can’t even not even. https://t.co/gt7Cfw2i9P", "RT @Blisscartoons: I like this one. With ⁦@SteveMartinToGo⁩ https://t.co/uOch3uot2h", "Perhaps I was too oblique, 🐝: https://t.co/U9lNnomest", "And let’s not forget, 🐝: https://t.co/1tMrvwuLCf https://t.co/08S2yZv8qc", "Yes, I’ll be there. And we can discuss The Trouble With Harry. https://t.co/VRPTEWZ8Nl", "My clammy hand should not meet another’s clammy hand. https://t.co/9sDHSiW6lh", "“Feckless goon” is now a category. https://t.co/zKuRVFDaoJ", "You’re not alone. https://t.co/mT2ISXzmJv", "For there ain’t no one for to give you no pain. https://t.co/6lq9whiGyI", "Today’s cartoon from @Blisscartoons and me. https://t.co/Sz3QhyfXSJ", "RT @OnlyMurdersHulu: Things will never be the same… 👀🩸🏢 #OnlyMurdersOnHulu https://t.co/gvYz8UKhrJ", "I wear the same clothes and haircut that I had in high school. Pants and a shirt, and the “Ivy League.” https://t.co/9tLdxTClza", "Amazing, and yet, no indoor dining. https://t.co/cQBE6ok4Ht", "Huh? Comedians self-plagiarize every show. https://t.co/JzQlcyVJoj", "RT @Blisscartoons: A cartoon from @SteveMartinToGo and me... https://t.co/37JItBhEVF", "This is an important book. https://t.co/IYF0223m7q", "It’s got to be in the nickels. https://t.co/lXlgJNIudl", "It’s a great book. https://t.co/GR2VeR2s7L", "If I live as long as Sister Andre, Selena Gomez, whom I am currently working with, would be 70. https://t.co/fbPTS914a9", "On the contrary. I’m intrigued. https://t.co/w9bd9qQQJV", "@tingtime @danjlevy Oh, Deb, you’re the greatest.", "My dreams have convinced me: I wrote Penny Lane.", "The Ceremony of the Coin Toss always makes me a bit weepy.", "I just can’t help myself: I seem to have taken another award winning photograph. (People waiting to see the rare snowy owl in Central Park.) https://t.co/mk4KeT6yg9", "If it means anything to anyone, I got an F in my college essay class. An A was given to the student whose essay was titled, “What I Did Last Summer.” https://t.co/4ivVOGr5sj", "I am such a sucker for Morandi and his solace. https://t.co/XpujU1gQ0q", "A special day on the set of “Only Murders in the Building.” (Our masks are down because we’re 30 seconds before shooting.) For detailists, Sting is hold the Financial Times cryptic crossword which he zinged through to embarrass us all. https://t.co/trN8iftA3l", "Salute to Cloris Leachman, who brought comedy’s mysteries to the big and small screen.", "Oh 🐝, why is Egyptology capitalized?", "I’m proud to say that Dolly Parton and Vince Gill sang a song of mine!  https://t.co/ZuvqOydw2R", "I was trying to trick Betty. https://t.co/738iDWhQkH", "Oops. 24. Way too big an age difference. https://t.co/4M76aIJKhl", "Hi Betty, I loved working with you in Bringing Down the House. And I love that you and Allen Ludden came to see me at the Troubadour a hundred years ago. I never forgot it. By the way, you’re only 14 years older than me. https://t.co/9GmYMyLU3m", "Right now, I’m having no fide resects. https://t.co/SUYyvOexeW", "I signed up ON line through an NYC dot gov website (sorry I don’t have the exact site), and waited IN line at the Javits Center. https://t.co/Ohp3frxy6i", "Good news/Bad news. Good news: I just got vaccinated! Bad news: I got it because I’m 75. Ha! The operation in NYC was smooth as silk (sorry about the cliché @BCDreyer!) and hosted to perfection by the US Army and National Guard. Thank you all, and thank you science.", "My research tells me that Oxford wasn’t established until WAY after Planes, Trains (,) and Automobiles. Like, years. https://t.co/mmp60zfjGO", "Significant Canadian paintings have to pass a board before export, which means paintings considered national masterpieces are inevitably restricted. Most Canadian paintings can be exported. https://t.co/9uQwJ52cJn", "Melancholic tonight, remembering for some reason, my friend Michael Johnson, who walked into our local club in 1967 and stunned us with his beautiful voice and smooth guitar.  https://t.co/RgpbyuEY9F", "Yes, our cartoon for today. https://t.co/FrYnAmUydx", "Fabulous. https://t.co/urEqRLF2lB", "I plead guilty. https://t.co/WJWMvpW702", "Then my work is done here. https://t.co/XTgZJYYTZj", "This is a must retweet. https://t.co/WlWlWNI9ql", "Of course! https://t.co/weMn0adKq4", "Yes, Ma’am! https://t.co/yXkK78QKMf", "I’m hoping to never be in an “actual police interrogation” video.", "Okay, here’s Tony Rice.  https://t.co/u0DSPaVRR7", "Aw, Tony Rice. A name I’ve known my whole life. A great musician. https://t.co/33lBEgZiPU", "I just made up a cryptic crossword clue: “They are descended from raptors.”", "Merry Christmas! https://t.co/EppygpMK0C", "I’ve never gotten Queen Bee because of forces that lie against me. https://t.co/LZ9ocDON58", "Dude. https://t.co/dImshLhVGF", "Wept tonight watching the boss, Cary Grant, in “Penny Serenade.”", "I get to be a pretty big blowhard on this segment. What fun to do. https://t.co/WKeRTOY6FU", "This is truly the strangest Christmas Yet. Steve Martin and the Steep Canyon Rangers - \"Strangest Christmas Yet\" (O... https://t.co/01KDrou8TW via @YouTube", "And Al Franken was there! https://t.co/HJorqGWBSy", "Today’s cartoon from ⁦@Blisscartoons⁩ and me. https://t.co/rNA9qAEnIE", "I don’t know of sheet music for it. But the song is “Friend of Mine.” It’s on an Edie Brickell/Steve Martin album. https://t.co/fXfpWiQdjC", "Double C. https://t.co/CgHxkxRIZ7", "I had a request to repost this (from the early days of the pandemic). Obliged. https://t.co/YsalvEtRpu", "RT @ScottSanders20: @SteveMartinToGo I miss your banjo calm video. I loved it at the beginning of the pandemic and I’d go back to it from t…", "Today’s cartoon from ⁦@Blisscartoons⁩ and me. https://t.co/Zx87KrCwQC", "Hey! Thank you, Alan. https://t.co/EGLzHhnHu2", "@SarahKSilverman I’ll watch in an Elf outfit!", ".What the worser people are giving... https://t.co/EZO3rakHVh https://t.co/VPWjm6jNW2", "We are having a great time shooting this show! https://t.co/D4toYSCiV5", "Number one is good, but is there more? https://t.co/DDQ5sgKCW6", "Today’s cartoon from ⁦@Blisscartoons⁩ and me. https://t.co/8Z70Nclupe", "Proud to I be a part of Giving Tuesday Charity Banjos – Deering® Banjo Company https://t.co/Qv8KjuDwlC", "Working on it! https://t.co/QULdRSHzlt", "Thank God for the instructions! https://t.co/5Uo4BFDXqS", "This is very weird. https://t.co/b2zE2YUGcn", "One of my personal faves. https://t.co/HsK4xUu3kO", "Today is the first day of filming our new TV show, “Only Murders in the Building,” in Manhattan. Starring the incredible Selena Gomez and the just okay Martin Short. https://t.co/oLKhfDWUYj", "Here’s another: https://t.co/J717juTAVN https://t.co/igwCSOGSWF", "Can’t you I spot a trap when you see one? Hey, Dane! https://t.co/tm4HKIiVyi", "I have no problem with this. https://t.co/mg5doTNvUC", "Okay, audio book sleep timer. What happened to twenty minutes?", "Lovely, spacious, drawing. https://t.co/qU3aOZssMo", "Well, you win. https://t.co/igiPu4Neqd", "Can my pardon include several films?", "Especially while capturing criminals. https://t.co/zQYIY46SRd", "Passengers often wear headset in helicopters. To protect their hearing, and so they can hear one another. https://t.co/pcLd36d25A", "When I was good. https://t.co/IL2PUu9NvJ", "I’ll be sipping a droll white wine. https://t.co/vPaOKjyYQq", "How decent. Thank you. https://t.co/2TwOpvzGdU", "And Marty Short and I are hoping to come back to London to do our Covid-cancelled shows at Royal Albert Hall. https://t.co/0NRsL8LDMU", "A Wealth of Pigeons #5 at Wash. Post. Why number 5 is better than number 1: \n\n1: Too braggadocio. \n2. Not number one. \n3. Kinda nowheresville. \n4. Probably bought by publishing house. \n5. Perfectly confident and authoritative. Upwardly mobile. \n6. Notorious pigs’ sty. https://t.co/0BKiIvmrYs", "I just found my misplaced monolith. https://t.co/2XdkBu1rng", "Wholy Cow! Congrats. https://t.co/BwUc31ncjw", "Interesting take on PTA for Thanksgiving. New Documentary Explores \"Planes, Trains and Automobiles\" - InsideHook.  https://t.co/itCnrDYs7f", "I am honored to have had Dolly Parton and Vince Gill sing one of my tunes. https://t.co/BZVvLVsyWn", "Maybe they were mail-in likes. https://t.co/H2mKteNTla", "I imagine Dolly Parton sitting in a quiet room, manipulating RNA while writing a hit song.", "Thank you, Kirkus! “Pigeons” thanks you, too. https://t.co/yMqJHoRD8J", "It was the posing that was difficult. https://t.co/6BExcVOL75", "Yesterday it wasn’t, but today it is: It’s publication day! I truly hope this lightens your hearts. A Wealth of Pigeons by Harry Bliss &amp; Steve Martin | https://t.co/oWACh0ubWX", "Thank you, Rachel. Great interview, even though I’m afraid to listen to it! https://t.co/bgvsTOC2V2", "Great, Rita! https://t.co/9ly45y62rG", "So I guess pigeons are actually wealthy: “Racing pigeon sells for record $1.9 million after frantic bidding war.”", "Not going to retweet this....oops, finger slipped. https://t.co/7481n5y6LF", "Steve Martin's New Cartoon Book Is the Respite We All Need https://t.co/461A1J6ROl", "@CeladonBooks @Blisscartoons @Powells Powell’s!", "RT @CeladonBooks: A WEALTH OF PIGEONS by @Blisscartoons and @SteveMartinToGo is a @Powells Pick of the Season! \"The two comedians outdo the…", "Great new tune from buddy and banjo mentor, Tony Trischka. https://t.co/SlR5i2VQEe", "Thank you, ⁦@hwinkler4real⁩ for joining our event. The photos should have been in order of descending gray, though. https://t.co/GyWxXsM9Ab", "Honored to say I was a writer on that show. Humbled to say I was not a very good one. https://t.co/DsyloZEyUn", "I’m so excited! Also, about this! https://t.co/o6G0LG7KfR", "Whaaaa? Hey Henry, thanks so much for participating. https://t.co/SIUdcVJChH", "I’m looking forward to discussing Martin Amis’ new book with its author, Martin Amis. https://t.co/u53xb6srLR", "I was told there’s a paywall...sorry.", "Thanks to Alexandra Alter for a great article! They Are Also 2 Wild and Crazy Guys - The New York Times https://t.co/hsm5ozSb7e", "RT @MichaelRinke2: I love the new @SteveMartinToGo cartoons!  @cabanam @DavidGBundy @whatdrfeinsaid @BGoilav @bethtarini https://t.co/2Jzks…", "RT @Blisscartoons: From our @SteveMartinToGo cartoon book out next week ‘A Wealth of Pigeons’ - sneak peek. Hunting season has started here…", "@mfaboston Thomas Sully!", "Yikes. We’re number 1 on Amazon. But I knew I had to take the picture FAST. https://t.co/dIy4PAUTKy", "Grammar is back!", "@CBSSunday What fun we had with this interview!", "Join me and Harry Bliss online for an evening of cartoons and who knows what. Two nights only. Click for tickets https://t.co/Y2DzHLBGCC https://t.co/kfwYskgAo5", "I guess you have nothing else to do. https://t.co/vF4Ikbdi1W", "The strings must be counted first. https://t.co/Ld7PQq7X5I", "@sarahcpr Why not banjo?", "Calming song for today. Steve Martin and the Steep Canyon Rangers - \"Always Will\" (Official Video) - YouTube https://t.co/21i1lif9eJ", "I’ll be there. https://t.co/6VLqkcckQA", "You were chaste those first three years, right? https://t.co/mcqQihj5lY", "@davidgura I saw the hoop move two feet forward. Did you see that? Not a lot of people know that.", "I call your mask and raise you. https://t.co/vMDW3CuOEG https://t.co/oF5Nprdv4a", "! https://t.co/jq9TsZo90D", "@DaxTwit Thank you, but that was actually George Carlinton.", "@rblandford Jerry Lee Lewis kicked back his stool, but it was Jerry Lewis who threw it back.", "@Desert_Fox42 That was Andy Kaufman.", "Steve Allen did that bit. https://t.co/C8bmcoZ2YJ", "I’ve made it! I’m in the New York Times book section! via @NYTimes https://t.co/umZVse0Wu8", "I can’t wait! https://t.co/ungERMPkSb", "The new phone book’s here! The new phone book’s here! Just got my hands on a copy of our new book of cartoons and more. \n\nhttps://t.co/oWACh0ubWX https://t.co/YRSIs5Qfw8", "I never thought my music would be part of a yoga flow class. Okay, actually, I did. https://t.co/MLodrmgQF0", "I’m an active 75 year old, yet I’m thinking of letting go of stretch pants.", "RT @strandbookstore: 📣 We need your help. This is the post we hoped to never write, but today marks a huge turning point in The Strand's hi…", "Yup. https://t.co/aAqjndMeFx", "Good will, Jeff. https://t.co/EOp1W7YwkH", "Hey, I’m just working here at home. https://t.co/4m3TcfhORo", "Just FYI:  Scientists have measured the shortest unit of time ever: the time it takes a light particle to cross a hydrogen molecule. \nThat time is 247 zeptoseconds. A zeptosecond is a trillionth of a billionth of a second, or a decimal point followed by 21 zeroes and a 1.", "Here’s my collaboration withThe Philadelphia Orchestra | Rare Bird Alert - YouTube What fun it was.  https://t.co/2NQxYoZ1bp", "My Halloween costume arrived! https://t.co/psobRQ4eqO", "RT @FolkAlley: TONIGHT! 8pm ET.\n\nSee performances from the Steve Martin Banjo Prize Winners (with an intro from @SteveMartinToGo), @domflem…", "Tomorrow, Wednesday, you can watch the revamped(!) Steve Martin Banjo Prize festivities, with videos from the winners. 8pm CENTRAL. https://t.co/1p94g4PhVg", "Uh oh. Reversible belts.", "I have just discovered Etsy. Goodbye.", "RT @HamiltonCollege: Jake Blount '17 is awarded Steve Martin Banjo Prize, which goes to the most talented practitioners, especially those s…", "RT @FreshGrassFest: Announcing the five 2020 Steve Martin Banjo Prize winners!\n\nThe Steve Martin Banjo Prize is proudly presented in partne…", "I get tired of myself, but I never, ever, get tired of Fred Astaire.", "I know it’s sad, but I’ve asked my child to follow me around the house with this.  https://t.co/OLrbxt1PLh", "Maybe because every once in a while they clean out fake accounts. https://t.co/LM2ZNj3jYi", "One of my favorite cartoons from our new book. From the cartoon collection A WEALTH OF PIGEONS, on sale 11/17. https://t.co/wRjJfhBH66 #AWealthofPigeons https://t.co/ixRyr1Mgij", "RT @vjbooks: Here's a fun title we're carrying that is a bit outside our usual wheelhouse: @SteveMartinToGo's new cartoon collection A WEAL…", "I’m so proud to have been in this dance number with Tommy Rall and Bob Fitch. Rall is mostly on the left. https://t.co/9R60E1LRo4", "Goodbye to Tommy Rall, Dancer in 'Kiss Me Kate' and 'Seven Brides for Seven Brothers,' (And Pennies from Heaven) Dies at 90 | Hollywood Reporter https://t.co/yrQp32cAZr", "I suppose I have to hire a full-time glasses cleaner.", "My favorite boy band - whom I also work with - has their best music ever, with a huge donation to the people of the Asheville area! https://t.co/9jPTOENl4A", "RT @SteepCanyon: Our new album 'Arm in Arm’ is out 10/16! @wickedweedbeer is donating $10 per album pre-ordered to Downtown Welcome Table,…", "I just had a brilliant idea: Someone should write a history of these times.", "RT @DudesInterview: This Wednesday we release our last episode of Season 6 interview with the one and only @SteveMartinToGo for our subscri…", "Okay. Funny. https://t.co/0tjfn4VaXK", "From the cartoon collection A WEALTH OF PIGEONS by Harry Bliss and me, on sale 11/17. https://t.co/wRjJfhBH66 #AWealthofPigeons https://t.co/v5twnRcHYU", "A diversion, but what a diversion! https://t.co/ya0NvUHJlx", "Playing with the Philly Orchestra is always a thrill for this me-guy. https://t.co/dQ72Leqib6", "RT @philorch: Join us TONIGHT on the Digital Stage for our first performance with Yannick @nezetseguin since March, filmed @MannCenter. Ton…", "Leo, I need you every day, every minute. This is not romantic. https://t.co/Q8y0l4C68D", "Okay, here’s the video about Father of the Bride 3-ish. https://t.co/K46mKJNVSA", "Our video is a hit. And the fundraising is spectacular. https://t.co/9aqLNi8bEw  Thank you so much.", "Here’s the link to Father of the Bride Part 3 (ish). An actual mini-movie with the original cast with BIG SURPRISES. We’re live when the clock strikes the hour. And, if you’re able, at the end donate to World Central Kitchen.  https://t.co/tuhCGtj0jX", "Going live in three hours. Father of the Bride Part 3 (ish) Free to watch; donate to World Central Kitchen at the end if you’re able. We had great fun making this.  https://t.co/tuhCGtj0jX", "For clarity, Father of the Bride 3-ish will be on Netflix YouTube, not Netflix itself. So it’s open to all! Release is later today. I’ll post a link when available.", "Here’s a better link to the trailer for Father of the Bride 3. It’s an actual mini-movie, with the original cast and MAJOR surprises. No rehash! Premier’s tomorrow! To benefit World Central Kitchen. https://t.co/I090x1eBrc", "RT @netflix: something is coming 👀 https://t.co/LxN1NWfPXk", "RT @CalibaBooks: New Steve Martin / Harry Bliss Holiday Gift Book https://t.co/4QfOaFcZgX https://t.co/fYA8a1H4n3", "RT @discoverPHL: Just when you thought @PhilOrch's already star-studded Opening Night Celebration Concert couldn't get any better... @Steve…", "I always wear a mask when I go outside. But something about it was leaving me anxious and unsettled. I thought about the problem, addressed it, and here is the solution. https://t.co/aUW4jHI3dX", "Enigmatic, isn’t it? https://t.co/GqGGiloEjM", "@DudesInterview Give me a minute.", "Great interview with my buddy Martin Short! https://t.co/74YTpIyBQt", "@_Holmes92_ It already is one.", "Providing the calendar isn’t re-written, the perfect comedy holiday book is now available for pre-order: A Wealth of Pigeons by Harry Bliss &amp; Steve Martin (How’s my ad copy?) https://t.co/oWACh0cAyn", "RT @RollingStone: Steve Martin will be bringing back his annual Banjo Prize this fall with a new mission statement and two new partners htt…", "Not yet. https://t.co/2Guxi6Yqhy", "@Blisscartoons “It irritates me when you sit like a person.”", "@Blisscartoons “You complete me.”", "@RayStevensMusic Hey Ray, so nice to hear from you! \"I like ya!\" Remember that?", "@tonytrischka Thank you Tony and Sean! You play it better I ever did!", "@extremeimprov “Sorry, I don’t do improv.”", "Well, a huge thank you to these wonderful artists for taking time for this, especially since I consider my career to be “patchy.” However, I’m hoping this will be a daily column.  https://t.co/UsH9S1zuhd", "@nytimesbooks The result of not wearing a mask?", "Thinking of dressing up for dinner and wondering what to wear. https://t.co/WkNq4v4pVY", "@DEADLINE @selenagomez @hulu Welcome aboard Selena Gomez! Marty and I are tremendously excited about working with you! “Only Murders in the Building.”", "@caltagm Third finger moving in synch.", "@douglasnoble That I wasn’t in?", "@NickyFiddle Thanks, Nicky!", "Jubilation Day! https://t.co/shn78FzFCC", "@JoyceCarolOates How kind you are, Joyce. So there. My list won’t include “ingrate.” It’s you who are the treasure.", "@HlywdStacy It is from a TV special called “Steve Martin’s Greatest Show Ever.” But it was essentially an SNL special.", "@philipmould Looks good just the way it is in the photo.", "Today’s literary cartoon from ⁦@Blisscartoons⁩ and me. https://t.co/4jnTNWn34T", "I’m wishing Aishwarya Rai Bachchan and her daughter a speedy recovery. She was such an elegant and delightful acting partner in Pink Panther.", "Today’s cartoon from @Blisscartoons and me! https://t.co/hzeWZoqDKM", "I’m retweeting this tune because I found a better version....Night Owl Banjo. https://t.co/DhcGreuuo5", "Another cartoon from @Blisscartoons and me! https://t.co/MBFAJxgZYh", "Thank you, Benjamin. I’m honored. https://t.co/64CpKLMS8y", "Carl Reiner, Perfect https://t.co/GHKU0WmCKy", "I don’t mind self-retweeting when so many great artists are involved. https://t.co/c15nWVhr3z", "Bassoon and banjo. Who knew? https://t.co/CLrvC6FCk1", "Hey Judd, I am complimented by your retweetion. https://t.co/4fSbRif0s5", "Tell me something I didn’t already know. https://t.co/qlT7gSVr5V", "Steve Martin Plays With Philly Orchestra in Remote But Rousing Video – Variety https://t.co/9wLYMEbFpz", "I was honored to play with members of the Philadelphia Orchestra for their yearly fundraiser.  What a cast! Enjoy.   https://t.co/6teTBxVvZo", "@philorch Yes, it’s true. And I’m honored to be playing with members of the Philadelphia Orchestra.  That Yo-Yo Ma guy is there, too, also Wynton Marsalis, Nicola Benedetti, Lang Lang, and Renée Fleming. An evening out while staying in. Formal wear, please.", "OMG. I’m watching a 1937 Leslie Howard movie called “It’s Love I’m After,” and they stole the bird calling scene from ‘’3 Amigos!”", "I go biking to get away from it all. Then, this.... https://t.co/ILpicapLv5", "Today’s cartoon from ⁦@Blisscartoons⁩ and me. https://t.co/LhJN1fz9fh", "My new mop arrived! My new mop arrived!", "Our cartoon for the day, from ⁦@Blisscartoons⁩ and me. https://t.co/FSlv749ZVv", "@Blisscartoons Today’s cartoon from Harry and me.", "RT @sierrahull: Tune in tomorrow to #TheRoundup with @RounderRecords! I play songs from my new album and a surprise cover. Special guest ap…", "@SquidyUK Yes, George Gipe wrote with Carl Reiner and me. He was a talented but very quiet person. Once we had lunch at a restaurant, and Carl and I drove away thinking George was in the car. We circled around the block, and George was still standing in the parking spot.", "Banjo finale/The Great Remember https://t.co/am424ScrPa", "Today’s cartoon from ⁦@Blisscartoons⁩ and me. https://t.co/GJaAyfLXkW", "Here’s what we’ve seen so far in our driveway in California: the Fed-Ex guy, the UPS guy, a bobcat, and the air conditioning mechanic.", "The odds that a person is standing in the exact spot you want to go to in the kitchen is now 80%.", "@belafleckbanjo Thank you, Bela!", "Banjo sky https://t.co/Na52pFi8Jk", "Today’s cartoon from ⁦@Blisscartoons⁩ and me. https://t.co/CDjuPVO89D", "It’s the little things. https://t.co/XSUqvmadTM", "@TerryTeachout1 @hekasia So sorry to hear.", "@ThePublicSA @ebnewbohemians @TRWMusicals @TheActorsFund @ActorsEquity @SethRudetsky @TheEllenShow @lianamariehunt @broadwaycom @BroadwayWorld @theatermania Great job! Stay safe and strong.", "Ireland and Scotland do melancholy very well.  https://t.co/9nDXEXuPIV", "Banjo calm. https://t.co/kAhRbMyfUp", "Banjo balm. https://t.co/eQ6jUkHSHm", "Through the years, I’ve loved bluegrass and folk music, and I’ve collected some of my favorites here: https://t.co/HwSLxLZ2Jo", "RT @SteepCanyon: #Steepcanyonrangers https://t.co/Vg9pQksldM", "A tiny light for today.... https://t.co/4uKo2lBFdM", "You mean, continue on? https://t.co/VFmYgDXyNd", "Glorious. https://t.co/RT8aKUk2G8", "Good for the sole, as in self-isolators. https://t.co/0Mas9bUsWb", "This is on the Royal Albert Hall website: We are sorry to announce that the Steve Martin and Martin Short shows on 14 and 15 March 2020 will no longer take place due to the developing coronavirus situation.\n\nWe are calling it a postponement. This is the right thing. More later.", "Dear Belfast ticket-holders, in light of the ever-evolving global situation, Marty and I have decided to postpone our Belfast show until happier times. Last night’s thrilling Dublin show turns out to be our sad farewell – for a while – to our beautiful Ireland and Scotland tour.", "Announcement shortly about tonight’s Belfast show....stay tuned.", "We’ll be there, all dressed up! https://t.co/9EqMJYClj9", "We are excited to get started in Glasgow! https://t.co/EX9uxo8rJR", "We are on! We start mostly on time, and there is no opening act. WE BEGIN! https://t.co/6xAat6cDep", "Isn’t that immoral? https://t.co/HTYnaeZFdO", "This is so obvious. https://t.co/2iVRbRxLqP", "Name tags are pointless unless worn on the forehead.", "Is that good? https://t.co/Rn4h00PmqJ", "This is how I find out? You tell me?  https://t.co/mlAdiVrIPu", "RT @NorthwellJBT: JUST ANNOUNCED: @SteveMartinToGo &amp; Martin Short: The Funniest Show in Town at The Moment live from the Beach on Friday, J…", "RT @Sunny102_3: Just Announced! @SteveMartinToGo and Martin Short will be coming to @cmacevents on August 29th! Tickets go on-sale on Frida…", "RT @cmacevents: JUST ANNOUNCED: @SteveMartinToGo &amp; Martin Short: The Funniest Show in Town at The Moment live from CMAC on Saturday, August…", "This cartoon by @Blisscartoons and me is up for auction for the benefit of the Cartoon Art Museum! Yay us! https://t.co/a4iOuJkISu", "I just had an incredible idea: Buy low, sell high.", "I didn’t spot a thing! I thought I was making a joke. https://t.co/kwewYq94aJ", "I love grammar and usage, but feel I’ve gotten worse at it as time grows on. https://t.co/V2lNBUsX86", "I was drunk. https://t.co/O8dEnFysv6", "Just asking: When did the word “mocks” replace “kids about” or “satirizes?” Since clickbait?", "Make that Erivo!", "Go team! https://t.co/RnJgBHORwD", "Yep. I blew it. https://t.co/jehFyFIv6J", "Love these rare birds I saw today at MOMA: Lee Bontecou, Kaspar Malevich, and John Covert https://t.co/8zTKVdYeEf", "A cartoon from Harry Bliss and me. https://t.co/DevMu3LlhT", "So, daily Spelling Bee, “Clickbait” is not a word? You’ve got to get out more. https://t.co/xH15rCpWqk", "Here we are on Colbert last night: https://t.co/8NmK6FLP0Z", "Had a great time on The Late Show last night, doing the banjo thang with @SteepCanyon! https://t.co/pOmfF1B04q", "This is not in error. https://t.co/9GGZsD08OL", "Preparing for our appearance tonight on Colbert; great shot of me frowning. https://t.co/HUeLhEUTJA", "@TinaLynn64 @Blisscartoons It was a perfect retweet.", "Tonight on Colbert @SteepCanyon and myself playing our new hit single, California! .. https://t.co/Q4Ud4WWGTQ via @YouTube (“hit” is, of course, relative).", "Yes, tomorrow night (That’s Wednesday night. https://t.co/aUvuBCzmh9", "Yesterday’s cartoon from ⁦@Blisscartoons⁩ and me. https://t.co/g08EgHFJck", "Yes, our new single will have its TV premier on Colbert on Wednesday. No exclamation point needed, as the news is exciting enough.  Steve Martin and the Steep Canyon Rangers - California (Official Lyric V... https://t.co/Q4Ud4WWGTQ via @YouTube", "Mr. Fancy Pants. https://t.co/PMCdASg8Zu", "A great weekend in Florida with master musicians! Next stop, the UK with @steepcanyon https://t.co/qd43aVcKp9", "Going out on a limb here, but doorbells and phone rings should be banned in TV commercials.", "I was hoping someone would catgut us! https://t.co/roCLTESPRe", "Great show last night with the First Ladies of Bluegrass! And the guy on the right. https://t.co/V4MIEwYVNm", "Weird phenomenon: Everytime I tweet this link, the view of my new song/video increase. Correlation? https://t.co/Q4Ud4WWGTQ via @YouTube", "I deleted the last tweet because our performance on Colbert is on JANUARY 29TH, not February. @SteepCanyon", "OMG (Oh my God), so funny. Salute to Terry Jones. https://t.co/1SK3dRwspf", "See you soon, Becky! https://t.co/EjUoF1C3K4", "Very nice! https://t.co/MtluEKhmJQ", "So great to have written and recorded a song that fits into no known genre! https://t.co/Q4Ud4WWGTQ", "I’m starting to look like my caricature. https://t.co/rJGSifbj3N", "This is actually quite true. https://t.co/DqRnckFvma", "First post was too blurry. Trying again. ⁦@Blisscartoons⁩ https://t.co/BBoMHRWYtP", "“Catchy + infections!” https://t.co/YZ28naap9z", "New song/video “California” flirting with number 1 in the arctic charts! @SteepCanyon https://t.co/Q4Ud4WWGTQ via @YouTube", "Here’s our new song on the Rounder site with no ads! @SteepCanyon https://t.co/rmcWyP0quZ", "We must be a hit! Our YouTube video now has ads. https://t.co/Q4Ud4WWGTQ", "Our new single continues to climb the charts that are in my head! Go “California!” @SteepCanyon Produced by the master Peter Asher. https://t.co/Q4Ud4WWGTQ", "Final tweet of the day regarding our new single and video, “California.”  It’s turning into a monster hit! (Remember, this is Twitter)https://t.co/Q4Ud4WWGTQ @SteepCanyon #PeterAsher", "Thank you Rolling Stone. I will continue to send you compromising information about my friends.  https://t.co/RQu61P9eZP", "Think Robert Preston in the Music Man. Wait, you’re too young. https://t.co/O2U0rluQVi", "My whole new idea of using Twitter for promotion is catching on. I see others copying.... https://t.co/SGpn6WjQTe", "So California is stirring, thus, here is my new single with @SteepCanyon, produced by Peter Asher, “California.”  https://t.co/Q4Ud4WWGTQ via @YouTube", "And I love We Banjo 3! Missed you at Merlefest one year and I’ve rued it ever since. https://t.co/JDXejth8j1", "Just had a revelation! I can tweet the video now for those awake, and tweet it later for California! Here’s our new song/video from me and @SteepCanyon, produced by the produced by the historic and gifted Peter Asher https://t.co/Q4Ud4WWGTQ via @YouTube", "I’ll link to our new song today, but since its title is “California,” I’ll wait till California is awake to do it. Produced by the great Peter Asher and starring @SteepCanyon. Unfortunately, I’m singing.", "Even though it’s “single release day,” here’s a new cartoon from @Blisscartoons and me. https://t.co/1j1mdqurrC", "Here’s a momentous teaser for our new single, “California,” coming out tomorrow. ⁦@SteepCanyon⁩  https://t.co/KgUVcs1LDj", "Vlog and flow both failed, and yet, genius. https://t.co/FCht9s5c9g", "I’m just learning that Twitter can be used for promotion! https://t.co/JQkid8fAlx", "Yes, tomorrow is release day for our new hit single. @SteepCanyon. Take heed as this is probably the only promotion you’ll see for it #VanityProject https://t.co/xa2rCRS4Rq", "@mortgerberg Yeah, man. Love it.", "Today’s cartoon. https://t.co/F9cgY6j6Qg", "My new single with @SteepCanyon drops on January 10, just in time for the holidays! https://t.co/MtvUh4Y55u", "Today’s cartoon from @Blisscartoons and Steve (Martin). https://t.co/64z1Ukmfc2", "Oops on the second semicolon. https://t.co/4KFO6BQMcu", "@BanjoMuseum The Mark Twain award made this remarkable Gibson banjo for me; yes, that’s the Kennedy Center inlaid on the neck. Too beautiful to play; it will do more good on display at the American Banjo Museum.", "The light on the stone thingy has pros reeling. https://t.co/zDchSrmxbk", "News for my bluegrass followers. @SteepCanyon and I will have a new single on January 10th, “California.” Less details to follow!", "A little piece of my teen years. Thanks, Daveland!  https://t.co/0XS8z3rTJI", "Indeed! https://t.co/YuJxQ00hiN", "This is absolutely true. People in California should book their flights early. Probably best through Toronto, drive to New Brunswick, take a boat to Greenland, they fly to Glasgow. https://t.co/UQTG2bqqkN", "A laughing dumpling is problematic for me. https://t.co/kUFrBDDGqz", "It’s called anarchy. https://t.co/SbViBDJz6G", "OMG. https://t.co/a1fAXx6pWv", "When I describe our family’s traditional Christmas Day dinner, I always hear an envious *sigh.* https://t.co/oivNkegOd5", "This is actually the case. https://t.co/CsySEjAJsw", "A holiday cartoon from @Blisscartoons and me. https://t.co/cRuMHh09pY", "Yup. https://t.co/m6IynGGg5S", "Question. “Which” or “that?” https://t.co/ugox4Kls48", "When I took my driver’s license photo this morning, the clerk said, “Do you want to go into the restroom and fix your hair?” I said, no. Then I went to the magic shop. So sorry now. https://t.co/sca9TYlFnt", "@deborahsolo @museodelprado An important essay by Deborah Solomon about my newest favorite painting, which, to me, rivals the Mona Lisa. Uh oh. I’m in trouble.", "Free tickets! Wait, hold on there.... https://t.co/MbmPxl593V", "I love that the Grammy Award winning group I’ve worked with for ten years is making huge waves, again, on the charts. https://t.co/c2w3SnrOzt", "It’s true. From the 70s. https://t.co/0Aqei1XG6g", "I so get it. https://t.co/L59sMJ3C2D", "And this is me when I was young. https://t.co/Kkn3MhDxjh", "Listen and learn! https://t.co/aEycRcCJMo", "My favorite boy band has a new record! https://t.co/lXiegdx8KX", "I so wish I could send John candy this review. https://t.co/Q1t6cg9aKL", "The radius is so obvious. But, nevermind, I’m just a comedian. https://t.co/8iIsjp9AB1", "OMG. Donald Trump, Fred Armisen and a guy. https://t.co/Ex6Xopoqhr", "I’m featured! https://t.co/6c2UxTWV4n", "I’m pretty sure I said that tomorrow. https://t.co/lB7cp5xKuU", "RT @TWiT: No joke. @SteveMartinToGo now knows what USB-C is and how to pick the right cable because he Ask(ed) The Tech Guy. You don't have…", "Hey, hang on there, wait just a second.... https://t.co/U7I4juWFk3", "Now tweeting from an unknown location. https://t.co/UHWJSM1qBi", "Today’s cartoon! https://t.co/Fp0J0uJPA3", "Masterpiece. https://t.co/inMobVUqlR", "So interesting to have become a major photographer with only one photo. https://t.co/mq4xT4QG1c", "We LOVED our whole tour of Australia! Audiences great, food great, art great, weather great. And our sold-out show last night in Sydney was the wonderful finish. Thanks so much. https://t.co/xbTgsJxuMM", "It is fabulous. Thanks so much. https://t.co/y9grLgnEKX", "'Bright Star' shines with bluegrass and a little magic | Arts and Entertainment | Your Observer https://t.co/RtIi49toAn", "Yep, our cartoon for the day. https://t.co/6oZ3u5nFtY", "now tweeting from a secret location. https://t.co/9FF4H6H5Xl", "I loved my visit to this beautiful and very active museum. I learned a lot that I didn’t know...wait, that’s redundant. https://t.co/lCsy9zsC6x", "Uh, we were in Perth four days ago. https://t.co/ap5SfrBH3o", "A new bit keeps performers alive. https://t.co/iAU4oqb21t", "I could have drawn it in a snap. https://t.co/amqMt5Helz", "I never tweet laudatory reviews.Oops. Finger slip. Steve Martin and Martin Short in Adelaide review: A masterclass in comedy | Adelaide Now https://t.co/Ufiu6SZEfl", "Already evil things are happening. https://t.co/cPketV11tx", "The hat is the star on the California flag. FYI. https://t.co/zHzA4frmcy", "Can you read this in a hotel shower without glasses? Is it body lotion, or is it poison? https://t.co/TuW1IN0YVb", "A few empty seats tonight at our show in Brisbane. Okay, maybe it was U2. https://t.co/CJYfK0KJp6", "Australian audiences are very affectionate! https://t.co/WzBjZ5dYdx", "Guess what country I’m in. https://t.co/ZiGQunbGax", "This photo is what comedy is all about. https://t.co/mzxeAA2SDL", "Marty and I are loving our Australian tour! https://t.co/vkRVgqWOhP", "If you like paywalls, you’ll love this interview!  We’re in Perth TONIGHT. https://t.co/unUt7WCcxF", "Congrats on what is evidently a wonderful production: BWW Review: Hatty Ryan King's Star Shines Brightly in Lipscomb's BRIGHT STAR https://t.co/XLG5DVlyPX", "Our latest.... https://t.co/WAIUg3OrBq", "Our latest.... https://t.co/Jsop9vD1Ux", "The latest cartoon from us two guys. https://t.co/BaYcyBWx1x", "Go to a nail salon and ask for acrylic nails. You only need one or two depending on your playing style. The nail will usually last a month. Plus, your finger will look beautiful! https://t.co/nZVkUUwUbb", "We all love Tim! https://t.co/FOQzUGCfJA", "“I retweet, I retweet, I retweet,”is the new “location, location, location.” https://t.co/Lb0JJ45muL", "I love the work of Allegheny. https://t.co/Bw3osWGxYP", "I confess I have rhymed “sauna” with “marijuana.” And also, “amigos” with “Speedos.” https://t.co/LC9n9NzZ90", "I never retweet good reviews. OOPS. https://t.co/ncGkeYEyzQ", "Clearly they are actors. https://t.co/pGsdB4yAy6", "Just found this photo of Emmylou Harris and me. Great memories. Of being thin. https://t.co/W56ZGAe9ew", "Tonight, in Atlantic City! https://t.co/O80zIVjo38", "That’s a great compliment considering I was saddled with Marty Short. https://t.co/28WNPonbcH", "I’m sure I was with @SteepCanyon. Have a great show with those dang banjos. https://t.co/9QsBo5wxW9", "RT @BBCSounds: Actor and comedian Steve Martin searches the extraordinary collection of the @MuseumModernArt and finds two works that speak…", "Very enjoyable for me to do! https://t.co/x6rSGKGgUY", "Today’s cartoon from ⁦@Blisscartoons⁩ and me.  https://t.co/SCr9MW4ExP", "This is accurate. I love accuracy. https://t.co/LmV2URTBao", "RT @deborahsolo: I wrote about the new MoMA, and what to do when the Modern is no longer modern, for the ⁦@NYTmag⁩.  https://t.co/zQ9B2PAVOW", "Congrats! https://t.co/63sRDknVLl", "I’m enjoying my collaboration with ⁦@Blisscartoons⁩! https://t.co/dCLSKj1ud2", "Hopper may be the master of isolation, but he’s also the master of windows. https://t.co/kehNvbFxyP", "Today’s cartoon! https://t.co/wwdTREI0H4", "Isn’t the multipack, though, for cowards? https://t.co/pilWOCO5vx", "FYI, this was in my Amazon recommendations. https://t.co/xMq9tGoZKB", "We are simply a catalyst. https://t.co/Af2Ij6DcBT", "I knew about them last year but who the hell is going to listen to me? https://t.co/75eB1K3qk7", "How dare you insult us in this way. Wait, let me re-read. https://t.co/AFVeHw9ChB", "And what about this vase, given to me over 40 years ago? https://t.co/ojyWfUixm2 https://t.co/vS3zRlR1nM", "Here’s the cartoon that started it all between ⁦@Blisscartoons⁩ and me. https://t.co/BtkO9A8N3L", "I guess I’m doing better than I thought: “Steve Martin and Lauren Yee are among America's most popular playwrights — and there's a San Diego connection - The San Diego Union-Tribune” https://t.co/cWmojU80CD", "Here’s Marty Short’s and my official dates for Australia! We think of it as going “up over.” https://t.co/YreAihbiAT", "Preorder now! Though I have nothing for sale, it’s always good to preorder.", "Another cartoon from @Blisscartoons and me. https://t.co/DRRcsEOcvC", "Today’s cartoon! @Blisscartoons https://t.co/KfX65uqACg", "... After the shows, he said “Please call me.” About a month later, I did. He didn’t recognize my voice, and he said, “What’s my dog’s name?” I said, “Charlie.” He said, “Hi, Steve!”", "The brilliant Ken Burns’ documentary, “Country Music,” reminds me, among other things, of the charm and artistry of Roger Miller, whom I opened for in Sparks, Nevada in the early seventies. [Next Tweet!]", "RT @MyTicketUK: ICYMI: Last week, comedy legends @SteveMartinToGo and #MartinShort announced “The Funniest Show in Town at the Moment” tour…", "Here’s yet another cartoon from ⁦@Blisscartoons⁩ and me. https://t.co/6XOUBbBud0", "@AlexWesaw We loved the Four Winds! And the audience seemed to enjoy me and sometimes Marty.", "@PBBTC Unfortunately, I won’t get there in time, but if the video speaks for the talent, I’M IMPRESSED!  Have a great run.", "We loved our show at the Colosseum last night. The part with the lions was especially entertaining. https://t.co/KZ9juNRozb", "Here’s a tune from a few years ago from Edie Brickell and me.  https://t.co/biZWfdR6op", "Marty (I think of him as Martyr because of his whining) and I are coming to the UK in March! https://t.co/XrPxLDjPHS", "Today’s cartoon! https://t.co/qp6eKcP2rj", "It’s an online pledge. https://t.co/MhbbLYGKVJ", "Yup! https://t.co/bQdfIzvHlr", "See you tonight at the show! https://t.co/CiCOj9ru2F", "It’s a masterpiece, but not very funny. https://t.co/wwjjdovdo8", "Ha! https://t.co/VS7jsVP43G", "Nice review of Marty and me! Interestingly, the reviewer is absolutely correct. https://t.co/OxqNOyT1Cc", "Cartoon time! From ⁦@Blisscartoons⁩ and me. https://t.co/HI84coG948", "Yes, we’re all headed for Australia in November.  Exciting to think of the Steep Canyon Rangers doing a solo show there while we (Marty Short and I) and the Rangers are on tour. https://t.co/DnXcMEfwkS", "Another cartoon from ⁦@Blisscartoons⁩ and me. https://t.co/BGTVtKofs8", "Today’s cartoon! From ⁦@Blisscartoons⁩ and yours truly. https://t.co/uiTvk1iyfq", "We loved our show in Bangor tonight! https://t.co/dg544F9Ors", "Congrats to Victor Furtado on winning the Banjo Prize! https://t.co/IX0SxgAgvU", "Never too late to sign this charity autograph request from 2013. https://t.co/fVMXHTYh98", "This weekend, Springfield, Saratoga Springs, Bangor! Marty will have his head on my shoulder the entire show! https://t.co/dXU7Xdmt3f", "RT @cl_tampabay: The trick to enjoying Theatre of the Absurd is that you should never, ever think too much, because the point is there is n…", "Our cartoon for today from ⁦@Blisscartoons⁩ and me. https://t.co/kmsHHGpXpJ", "This beautiful “carpet” by Xu Bing at LACMA is made entirely of cigarettes. https://t.co/lbVFHGEMi8", "Great cast; great production! https://t.co/NlzwsOkXyX", "Today’s cartoon from ⁦@Blisscartoons⁩ and Steve https://t.co/3v6n0aZabu", "Comedian, banjoist second. https://t.co/SVSase74Yv", "You should not, currently, be laughing at this. https://t.co/0veLey19J6", "Please, no more “comedy” answers. Straight answers only. I’m so angry right now. I’m sure you’ll comply. https://t.co/rV7O06wCQC", "I knew something like this would happen. https://t.co/gPAIWsDIPn", "Can any of you experts tell me where this rug is from? And don’t say Carpet City. https://t.co/a7fCPrS9oF", "Today’s cartoon from Harry and Steve. ⁦@Blisscartoons⁩ https://t.co/qNIMkRTo4I", "Here is Marty’s and my touring schedule for the next two months. Dallas; Carmel, IN;Windsor, ON; New Buffalo, MI; Vegas!; Bethlehem, PA. See you there. https://t.co/SRjpUynudo", "Today’s cartoon! From ⁦@Blisscartoons⁩ and my little self. https://t.co/5VwRGkw5Up", "Today’s cartoon! From ⁦@Blisscartoons⁩ and me. https://t.co/DAaxnQgztn", "Gagosian's 'Desert Painters of Australia' bursts with beauty - Los Angeles Times https://t.co/wBnzLPA9gQ", "RT @AusintheUS: You know @SteveMartinToGo as a comedian, actor &amp; musician, but #DYK he's also an 🇦🇺#IndigenousArt collector? You can see a…", "RT @Blisscartoons: And the rest is lame pizza history... https://t.co/MIGdhZCqvp", "Thanks, guys. Our collaboration has been extraordinary for me. https://t.co/B5x60YVsr0", "Yep, and thanks for all your help and advice through the years. https://t.co/Tte9zPEKQW", "@bdgrabinski I modestly retweet.", "Latest cartoon from @Blisscartoons and me. https://t.co/vLwLiXnwpT", "We’re getting closer to “A Night to Rememeber” in Dallas. If we remember. https://t.co/GKWegEqdaJ", "Just bought it. Can’t wait to hear the wonderful things you say about me. https://t.co/9KSW3DXEQX", "Today’s cartoon from ⁦@Blisscartoons⁩ and me. https://t.co/kKUvrBpi3X", "Today’s cartoon! https://t.co/5oXkpiGjrz", "Here is a great discussion of Western Desert painting by three luminaries in the field: https://t.co/87nkyOGJOd", "My nightmare last night. https://t.co/Z8THG2DKQJ", "Wonderful to be back at the Old Globe -as a writer-and to play the beautiful circle in the round oval shaped theatre. https://t.co/WerqnXLoot", "Today’s cartoon from ⁦@Blisscartoons⁩ and me. https://t.co/j7W9cXf8Og", "This is a very bad situation to be in. https://t.co/RaLaI94uPT", "Another view of the Australian Western Desert painters at Gagosian in L. A. Opens Friday evening. https://t.co/WFgT8ihdEy", "A beautiful show of modern Australian Western Desert painters is opening tomorrow at Gagosian L.A. 6-8. Many of the paintings featured are from my wife’s and my collection. So honored. https://t.co/56Ie1cFS2Y", "We had a ball with this interview. https://t.co/ZVLSbdAuQd", "Reno tomorrow, Eugene Saturday. Airway Heights-? Sunday. https://t.co/hN69nsOnNl", "And another cartoon from ⁦@Blisscartoons⁩ and me. https://t.co/NRAcxjFWm0", "I’m so excited for this show. https://t.co/yUFN5QQlfO", "Curious about your reaction to this section of our new single. ⁦@SteepCanyon⁩ https://t.co/QNL8Gl7tdu", "Yes, Harry and I keep on keepin’ on. https://t.co/bbDu7ENewC", "I’m recording a new single today with @SteepCanyon. First single since King Tut! Very different though.", "Tonight in Colorado Springs (that’s in Colorado). https://t.co/K4Gfnto59A", "I know, bleak. ⁦@Blisscartoons⁩ and me. https://t.co/kGUcqSfl1b", "Every minute of every day. https://t.co/gTxQlTSUH6", "Colorado, see you this weekend. Loveland, Colorado Springs, Vail. We can’t wait. https://t.co/PIa31AleA3", "Thursday’s cartoon! From ⁦@Blisscartoons⁩ and me. https://t.co/Lpj6HbzopJ", "It’s cartoon time! ⁦@Blisscartoons⁩ https://t.co/LmSw5hwPn7", "And yet another cartoon from me and ⁦@Blisscartoons⁩ https://t.co/PLeDVwlAP0", "I’m definitely going! https://t.co/5ilMj45GFI", "Today’s cartoon from ⁦@Blisscartoons⁩ and me.... https://t.co/bOSeca34yP", "RT @BookOfBENAIAH: 🌟 ...a few stills from Bright Star. The experience was priceless, but SEEING what the audience saw brings tears to my ey…", "Hey Jeff, have a great time. So glad you’re doing it. https://t.co/hPsGTewgZR", "Today’s fun from ⁦@Blisscartoons⁩ and me. https://t.co/mrn5cU6Qer", "Marty and I are excited about our Colorado tour, beginning in about ten days.... https://t.co/xxxMvtltIC", "Today’s cartoon! https://t.co/aeFGm9nhZf", "Barry Flanagan. https://t.co/67th3UvT9m", "Nice toilet. Privacy was an issue. https://t.co/LgnU5YfQME", "Today’s cartoon from ⁦@Blisscartoons⁩ and me. https://t.co/FsM5xVNBVz", "@Variety No magazine has ever fact-checked the false statement that I am a member of Mensa. Never have been, never applied.", "And if my life depended on it, if I was asked “Who is Henry Clark?,” I would have died. https://t.co/maVtO3VTm4", "Took me a minute. https://t.co/maVtO3VTm4", "You got it, (may I call you) dude! https://t.co/hcJudJxzfg", "Today’s cartoon from Steve and ⁦@Blisscartoons⁩ https://t.co/7ySQcw07fJ", "Surprises at my eye exam. https://t.co/3uuRspoY6L", "A dog cartoon today from @Blisscartoons and me. https://t.co/sPcnCRV700", "Have a great run! https://t.co/NQjer4Pw1I", "Today’s cartoon! ⁦@Blisscartoons⁩ https://t.co/sWRgJx2UeG", "Yup. https://t.co/UGjooJNi5p", "FYI, the star on my hat is the from the California flag. https://t.co/837bb4vdyq", "Now tweeting from an undisclosed location. https://t.co/f6gjMyDfsn", "Just when you think you know it all, here’s a photo from Venus.  https://t.co/j4baEHTbez", "Somehow, these are not the most exhilarating photos. https://t.co/P07QXsKecP", "Full house tonight, except when I was playing and people went to get beers. https://t.co/0pgUPQXhv4", "Unbelievable. We played Moorhead tonight and did not make one Moorhead joke.", "It’s cartoon time! From ⁦@Blisscartoons⁩ and me. https://t.co/ZQ4ebGUZjm", "Only problem with visiting the American Banjo Museum in Oklahoma City: not enough banjos. Har. https://t.co/RvLFtgVOYZ", "A cartoon from Harry Bliss and me...⁦@Blisscartoons⁩ https://t.co/c3DfdJRgZk", "Moorhead, Sioux Falls, and Davenport, IA coming up next weekend. https://t.co/GlIYq3riwr", "All I can see is my button. https://t.co/DotycjEdY9", "This is actually the theatre we played tonight in San Antonio. The blue sky is an illusion. We are indoors. https://t.co/G1B5HPecAR", "Sorry, earlier tweet turns out not to be the Alamo. Here is correct photo of the Alamo. https://t.co/VBRhoc2oSf", "In San Antonio, just saw the Alamo. So fantastic! https://t.co/0wkQpVrNoC", "Today’s retro cartoon from Harry and me. @Blisscartoons https://t.co/rqhYT7dkfZ", "A perfect correction. https://t.co/EYpDDmAhys", "El Paso rocked. And I even think I know what that means. San Antonio today, then Oklahoma City Sunday. https://t.co/33b3t7ulwv", "One of the great banjo photos ever. https://t.co/PbET0Wn6LS", "Congrats to The Firehouse Theatre!  https://t.co/nPUwnIpS9L", "We are there! https://t.co/rFJ7Cwhmff", "Today’s cartoon from Steve and Harry. ⁦@Blisscartoons⁩ https://t.co/ZQXTu1A9mA", "See you in El Paso. This Friday. https://t.co/cTztG37IQW", "Marty and I are in El Paso on Friday! Saturday, San Antonio!. https://t.co/CPgJwRcaaN", "@HistoryToLearn This man, Vermeer, paints better than I do. At this point.", "But why would you put your hands down? https://t.co/0LUWXDnexH", "Yup. Loved coming to the town of Jack Benny, a comedian I admire, steal from, but, alas, never met. https://t.co/wodrgRgVVO", "This can’t be true. And yet it is. https://t.co/0LUWXDnexH", "Yes, it’s true. https://t.co/lV7nUZdLqb", "Marty and I were expecting more people for our show in Rochester tonight. https://t.co/5AQUoBmdnQ", "See you in Rochester, MN in a few hours! https://t.co/eLarpE8REQ", "See you tomorrow in Rochester, MN, then on to Waukegan an Hammond. Marty and I haven’t seen each other in TWO WEEKS. So it will be a love-fest. https://t.co/74GczSath8", "Today’s cartoon from Steve and Harry ⁦@Blisscartoons⁩ https://t.co/2TJSScGcHQ", "This, either, is not something I expected in my life. https://t.co/BjCCc5ZHkI", "This is not something I expected in my life. https://t.co/mTFWrKBw4e", "A laugh a minute from @Blisscartoons and me https://t.co/NrV2E6963c", "Here we come, Rochester MN, Waukegan, and Hammond! https://t.co/UHpW7XUqSx", "Another George  Tjungurrayi work. https://t.co/79tzBrtkjZ", "Love this image of a George  Tjungurrayi painting. Accompanied by a great article by Sebastian Smee https://t.co/mC0i8u6XsB", "I already knew that. https://t.co/7fiYPhrSq9", "I deeply enjoyed this well thought out piece by Jason Farago about Indigenous Australian art...\n\nhttps://t.co/sJ3OKzJuby via @NYTimes", "Today’s cartoon post, from ⁦@Blisscartoons⁩ and me. https://t.co/fXRratHPRz", "I can’t wait to see myself! In Rochester, among other places. https://t.co/OLkRYFLlOJ", "Agreed. And I got my name mentioned! https://t.co/rbXWpMckWj", "Today’s cartoon. ⁦@Blisscartoons⁩ https://t.co/Pe2MJdvwmB", "I don’t know if this is behind a paywall, but I’m posting it anyway.  https://t.co/BZjFmLo60U", "It’s cartoon time from me and ⁦@Blisscartoons⁩. https://t.co/23U78ZCDGr", "Love this side-by-side of these two remarkable works. https://t.co/SFVSOjhpb9", "We loved doing this interview in advance of our AUSTRALIAN TOUR in November. Thanks, Andrew Denton’s! https://t.co/NKaZ2UNqpG", "Today’s cartoon from Harry and me. @Blisscartoons https://t.co/Df17r8jxih", "RT @marshall_steven: The spectacular artwork from leading Indigenous Australian desert painters are on display at the @Gagosian in New York…", "RT @johncarty77: Tjumpo Tjapanangka was an epic artist. His navigation of art, abstraction and the Dreaming was sublime and grounded in dee…", "A cartoon for the day from Harry Bliss and me. ⁦@Blisscartoons⁩ https://t.co/6XadWfKb0A", "Thanks, Wichita (if a city can be thankable), for a great evening and riotous, rockin’ audience. Tonight Kansas City! https://t.co/r9QuRyk2NW", "Marty and I - in better days - doing Stan and Ollie. Wichita tonight! Kansas City tomorrow! https://t.co/dB0yNa9vok", "Now, this has five retweets. https://t.co/OaZZJ55HSU", "I save it for the latter part of the show. Excitement builds for the audience. https://t.co/TA16BfKFls", "You are correct. I’m going to Kansas City on Thursday. Sorry to excite a town prematurely. https://t.co/aCW7ITY4kk", "Oops. Kansas City. https://t.co/dDvuMi3lH1", "Marty and I are coming to Wichita on Wednesday, Oklahoma City on Thursday. Yes, I will be doing the pointing gesture as seen in this photo. https://t.co/kJUkHifyni", "Today’s cartoon from Harry and Steve. @Blisscartoons https://t.co/INpNnQuSRp", "Actor Steve Martin Amassed a Stellar Collection of Australian Aboriginal Art at Warp Speed—and Now You Can See It at Gagosian | artnet News https://t.co/MHkJ1qFC2k", "Another cartoon from Harry and me. @Blisscartoons https://t.co/TctEOY6uPE", "You can see our collection of Indigenous Australian desert artists opening today at Gagosian Bookstore Gallery. https://t.co/YB90q4W0dT https://t.co/T8JUF5a6WU", "Here is today’s cartoon from Harry Bliss and me. @Blisscartoons https://t.co/xECebBBZ7x", "Look out, Wichita and Kansas City. 8 &amp; 9th. https://t.co/MWU9uZQAql", "Our Australian tour is now announced! Starts in November in Perth. Look how cute we are. https://t.co/kfE7601Yf4", "Marty and I are now preparing for Wichita and Kansas City.  Concerned over packing for unknown temperature. Could be sweater weather or shirt-sleeves. Still, temperature in hotel room is a variable.  There’s only so much room in 12 suitcases. https://t.co/sPT88jSWZG", "We are so excited! Which means we have to be excited for five months. https://t.co/WLECH1d1E4", "Another cartoon from Harry Bliss and me. ⁦@Blisscartoons⁩ https://t.co/giOGq9VtDM", "“T” Just finishing the “far.” https://t.co/OmIWmKprHy", "Ugh. Not complaining, just finishing the “tho.” Working on it! https://t.co/vdr2ZHyFDB", "Busy night for Steve even though I’m just sitting here. https://t.co/ZfBKHW85Pe", "I’m moving to Australia just so I can watch it! https://t.co/D2SG1BEy1R", "Today’s cartoon from Harry Bliss and me. ⁦@Blisscartoons⁩ https://t.co/NqlPqUHQA5", "I have realized that on this tour, Marty and I are only playing cities that are fun to say. Rochester is certainly fun to say, so is Waukegan. Kansas City, perhaps, is not AS fun to say, still, one would have to be very jaded to say it’s not fun at all. https://t.co/BJ8MYaye3o", "Retweet, lose comma after first Wichita. https://t.co/OTHOzB9RQL", "Coming to Wichita, and Kansas City soon. “Wichita” very fun to say; “Kansas City” less fun to say, but very self-explanatory. https://t.co/jwOSSdZiad", "You might enjoy this painting by the American 19th Century painter Frederic Church. 5.6 by 9.5 feet. Argh. So hard to correct a typo on Twitter. https://t.co/iAXHgROBCw", "Be sure to see Marty and me in Wichita on May 8th! https://t.co/xXHC9WAAEP", "Next stop, Wichita! May 8, Kansas City, May 9th. https://t.co/fTuBWR14t0", "Any of you solvers get this? ⁦@Blisscartoons⁩ https://t.co/axhc1l4Ytp", "Achieved by overcharging! https://t.co/42OTXuuxxq", "Thank you, Peoria, for a great night! And thanks, too, for having such a fun name to say!", "Unfortunately, that’s the show. Thanks for coming! https://t.co/Upatjx7vak", "By the way, I’ve become an exclamation point person!", "Marty and I are happy to be playing the gorgeous Peoria Civic Center theater tonight! The nation has beautiful theaters both new and renovated wonders.", "Tonight, Peoria! Sensational audience last night in Milwaukee gave me confidence to have an egg-white frittata for breakfast this AM. https://t.co/Cws4JB55oS", "I‘m stymied by  the paywall, but the headlines are fantastic. Tonight, Milwaukee, tomorrow, Peoria! https://t.co/xxD0s2juRD", "Today’s cartoon from Harry Bliss and me. ⁦@Blisscartoons⁩ https://t.co/E57mhp7GF8", "Tonight, Milwaukee! https://t.co/Wr17EAKXcL", "Despite its extra vowels, Marty and I are playing Milwaukee today, Friday. https://t.co/xPxR5AsvEl", "RT @Blisscartoons: Cartoonist Harry Bliss Collaborates With Comedian Steve Martin https://t.co/ngYzifXbuz", "We are in Omaha tonight! https://t.co/7tpOyRs5eq", "RT @NewsHour: Comedians @SteveMartinToGo and Martin Short give us their #BriefButSpectacular take on, as they put it, \"our fabulously popul…", "Another collaborative cartoon from me and Harry Bliss. ⁦@Blisscartoons⁩ https://t.co/lshb9LNvEl", "I’m one. https://t.co/YA94i7YkzQ", "See you this weekend, Omaha, Milwaukee, and Peoria! We’re already pressing our shirts! https://t.co/kpBM412GmY", "Marty and I really enjoyed this interview. https://t.co/BRa7M1S9W1", "The great cartoonist Harry Bliss and I are working on a series of cartoons for a book at some point in the future. Great fun. ⁦@Blisscartoons⁩ https://t.co/AqRqG8bEPy", "Omaha, Milwaukee, Peoria! We’re on our way. https://t.co/DaaJQ5NJh2", "When the audience stays the whole show, we know we’ve killed. https://t.co/cnXbTwdCUg", "Great audience last night makes us even more inspired for tonight! https://t.co/ye7fJQGTlJ", "Yep. We’ll be starting shortly. https://t.co/OZLGLabpob", "Congratulations to Kristin Scott Benson on being awarded the SM Prize for Excellence in Banjo and Bluegrass. https://t.co/ulsV7Js8lL"]}