{"tweets": "@WeatherDog3 @meowitsjoey You're definitely bandy. RT @debsjim69: @rickygervais just look at how happy he is showing off his certificate 🤣 #AfterLife #tubbylittleginger https://t.co/DxPMtYzD… @meowitsjoey Both. Then I can chose the one that's least awful. RT @AfterLife_Fans: The first two seasons of #AfterLife have notched up 72 million views. Most watched British Comedy in the world 2 years… \"While exploring the depressing and fatalistic theme of death and loss, After Life (Season 2) ends up being an uplifting, optimistic and delightful drama that just helps you get by.\"\n#AfterLife Review: Ricky Gervais At His Wisest https://t.co/LLNfuvFqHH @rosie54542781 🙏 RT @ScarlettBeagle: Thank you @IanByrneMP for signing Parliament #EDM250, for a Govt. mandated science hearing to stop the false claims abo… Another nomination for #AfterLife 🍻 Best On Demand Show Vote here https://t.co/oXtY3zvhJX RT @beerhunteruk: Shop our 'bit retro and a bit Game of Thronesy' glasses now! - @rickygervais words  🙌🏼 For every glass purchased - £1 wil… RT @flamingfeline: Sooooo many categories to vote in so  don’t forget The Willoughbys 🐾🐾🤗❤️🥂@rickygervais @meowitsjoey @WeatherDog3 @jim731… RT @TheCreativeC: Join us for the The #TelevisionHumanitarianAwards: Use The Voice You Were Given on Thursday, September 17, 2020! More inf… @Daiparish 👍 RT @meowitsjoey: Ok everyone, get voting for @rickygervais #AfterLife if you haven’t already (if you have, do it again) 😇 And don’t forget… RT @mikewarburton: I don’t miss doing things with Lisa.\nI miss doing nothing with Lisa. \n\nAFTER LIFE (2020)\n\n@rickygervais yet again writin… @Kalirae12 Not sure. \"Dog from Afterlife\", maybe? @EBlardeblar That was her character name yes. Great Idea. Everyone nominate the dog in #AfterLife. \nGood Girl! https://t.co/fwwvDnean5 https://t.co/TZhs6evt1h @LaurenceChubb They'll be postponed. RT @GazetteLin: Why do I keep watching After Life when I cry every episode? Ridiculously good characters from  @rickygervais but Tony’s dog… RT @lestroy: This is  by far my favourite positive thing of 2020  so far ! All the money goes to  helping dogs 🐾Absolutely genius  idea ❤️🐾… RT @olliecomicstrip: @rickygervais That’s a bit rude... https://t.co/kP6mvEOpH0 RT @meowitsjoey: Oh this is just fantastic! @rickygervais your ‘shite’ broadcasts are doing a whole lot of good for the less fortunate anim… RT @WeatherDog3: @rickygervais I voted ..I retweeted ...I went for a piddle and then I did it all again ..then I had a snooze and did it ag… RT @ScarlettBeagle: \"Oh woof everyone! This is great on catch up, I'm late to the Sunday Sermon party but better late than never! Thank you… About 1 in a thousand of you RT after watching this shite. It's almost as if you're ashamed of it. Scum. https://t.co/7KfExlJu8B @marcusfurlongus It will be postponed I'm afraid. @WeatherDog3 Good boy. @beerhunteruk @pupaid @Paws2RescueUK @CeliaHammond @olliecomicstrip @BleakholtUK 🙏 RT @beerhunteruk: EXCITING TIMES!\n\n@rickygervais gave us an ace shoutout, so we've made donations to 4 animal charities.🙌🏼 We've donated a… Vote for #AfterLife if you like https://t.co/E3NelHbWl1 @MWatts3376 Unhappy Mondays. @lougalczynski Quite sad really. @LoulsGreenhalgh Definitely not. @KateRobbins 😂 RT @meowitsjoey: Happy Monday! Today I am... David Brent 🎶 \n\n#MondaySingalong #OohLaLa #DavidBrent https://t.co/xuDWykUfK6 Tonight's broadcast was one of the best ever. And still shite. https://t.co/7KfExlJu8B Best fans in the world 🙏 https://t.co/n8jn4907lt RT @DavidBrentMovie: A fan-made video for Electricity by David Brent. Download or stream the album now on Apple Music, Spotify and Google P… @SophGreenee Almost certainly ☹️ @purbrooktony @WeatherDog3 👍 @meowitsjoey 5' 8\" and slowly shrinking. @Sherlock_is_me_ It's a book about Turner in front of a book of photos of New York. @JamieRossiter78 Filming Derek I think. @SusieHope7 Happy Birthday Fur Mum! @IiiStonewall Oh I missed your tweet. https://t.co/8Je79h8WNN @Kathbum 1. His wife earned a lot more than him. \n2. It's not Hampstead in the work of fiction 😇 RT @closetfolkie: @rickygervais my local brewery in Hendersonville, NC has this delightfully named brew on tap, named after everyone’s favo… @petethenord It will be postponed I'm afraid. RT @DavidBrentMovie: Football is back - it’s match day! I bloody love football, don’t I? https://t.co/LigiuSHOxm Just popping to the shops. https://t.co/drHOzOT03D I do these broadcasts for free because they’re shite, but they help save homeless dogs so RT anyway. https://t.co/4aHtR9X5C1 RT @ladbible: .@rickygervais took us on a behind-the-scenes look at After Life 2, and he's got some news that fans of the show will love 🙌… This will be the front cover, obviously. https://t.co/7s3gSquU2T Might write a serious novel just to use this photo on the inside back cover. https://t.co/oAphPpCq8p @meowitsjoey I'm sure I'll be able to manage that 👍 @purbrooktony @JaneFallon Yep. RT @Melanie10120: Dear @rickygervais I want you to know that #AfterLife and your video for @dignityindying have helped my family and me eno… RT @IAR_updates: PLEASE TAKE ACTION TO END THIS SUFFERING.\n\nNew videos of slow lorises being kept as pets have emerged on social media plat… @IAmPapaMeat @DavidEarltweets Early 50s I think but he hasn't looked after himself. @DavidEarltweets You'd have to work really hard like he did. @DavidEarltweets @NameIsJamie I was talking to Jamie mate. @Consul001 @DavidEarltweets 👍 @Dave_SonOf_Dave @DavidEarltweets Boom! @NameIsJamie @DavidEarltweets You heard him. He can't be arsed. This is why we're in the mess we're in. @DavidEarltweets Grow up mate. RT @TVChoice: CONGRATS TO OUR WINNERS!\nIf you missed it, you can still watch all of your 2020 #tvchoiceawards winners revealed over on our… RT @mikewarburton: “You’re not the only one”\n\nAFTER LIFE \n\n@rickygervais and @MandiDhillon are just exquisite in this beautiful little scen… RT @DavidBrentMovie: ‘Lady Gypsy’ by David Brent. Download or stream it now on Apple Music. https://t.co/E1ZuK6DQ93 @lynzr33 @bisping D'oh! @bisping I'll fight you for it. @purbrooktony You know me. I'll do anything for dogs. @Tuconzie @WeatherDog3 Just humans. @purbrooktony @BrewDog Yes. Judging by all your lovely tweets, @BrewDog sent out the 50,000 cans of #StreetDog today. We're drinking for stray dogs now, which is totally allowed 🙏 https://t.co/G2WHJnVODQ @meowitsjoey Excellent! @EmmLouSeal @LondonPalladium It will be postponed I'm afraid. @mikekea1 Very unlikely I’m afraid. https://t.co/csMlORzHb6 RT @purbrooktony: 🗣️ Hey siri, show me the funniest tv outtake ever... https://t.co/Nhzk5qZN4L @Darren94775262 I am. @tonypaulway Thanks mate. Bad angle. Also, the lighting is terrible. No makeup either. https://t.co/DzMsRHUHmk @AnthonyOgogo 🙏 RT @coleandersonJ: And I for one believe her @rickygervais #theoffice https://t.co/NYcDGZ1awP @pixxguru Yeah. Even that will probably be postponed again 😫 For everyone asking, all #SuperNature dates this year will be postponed. Because they’re all sold out to capacity, we can’t do socially distanced shows. Waiting for new dates. Annoying, I know. https://t.co/PitEna22GB @dannycannon23 @MartinaQuinn1 Everything this year will be postponed for sure. @MartinaQuinn1 It will be postponed I’m afraid. You should have been notified. @tvr_82 I reckon even Randers would've had to admit he liked it. @PETAUK Pointless cruelty. RT @AfterLife_Fans: Still so many new amazing tweets about people just seeing #AfterLife for the first time! 🙌 https://t.co/Rf4z3PkUrv @LeawoodCattery @LondonPalladium It will be postponed. RT @themayhew: There's still time to purchase live-stream tickets to our event, An Evening with Jane Fallon! 💜\n\nJoin us for an evening with… @dougleddin @Graham__Coull @UnitedAgents @tonypaulway Thanks so much 🙏 @Clark1995Clark 👍 @crazyhorse65 @Thedukeistheman @marylizowen @Essio13 @Clark1995Clark Thanks. It's ironic that you enjoy my comedy more than my analytical thought as I have no qualifications in humour but I have a university degree in Philosophy 😇. Nice talking to you though 🙏 @WeatherDog3 https://t.co/lqbg1L7tyM @ErinPritchard15 @kalbo_adam I’m afraid satirising stupid views is only possible because those stupid views actually exist in the real world. It’s regrettable that they do but they do. There are stupid people around. It’s sad but true. Have a great day. @ErinPritchard15 @kalbo_adam The line is said by a hedonistic, abusive narcissistic with a warped moral code. I hope most people realise his views are to be treated with contempt. @RichardDawkins This is why they went with porridge in \"Goldilocks and the 3 bears\". A quarter of a million views and only 300 retweets. \nYou people are scum. See you Wednesday 😂 https://t.co/qgKIN92SXt @crazyhorse65 @Thedukeistheman @marylizowen @Essio13 @Clark1995Clark OK, make up your own definitions if you want. It makes no difference to me. Have a great day. @crazyhorse65 @Thedukeistheman @marylizowen @Essio13 @Clark1995Clark Do you think these guys get the gist of it? https://t.co/r5ouqtjMPR @crazyhorse65 @Thedukeistheman @marylizowen @Essio13 @Clark1995Clark I wrote this to help explain my position. https://t.co/n4NsHNmLmv @crazyhorse65 @Thedukeistheman @marylizowen @Essio13 @Clark1995Clark Not believing in something existing is not the same as believing that something does not exist. I don't believe you have a cucumber up your arse. But it would be odd to proclaim that you don't have one up there as I have no proof. So I simply don't believe you do. @TIMOTHYJOHNART @deemadigan Yes, Tony can be forgiven this throwaway sexist trope as he's struggling to be kind and positive and sees nothing but perfection in his lost love. @crazyhorse65 @Thedukeistheman @marylizowen @Essio13 @Clark1995Clark Everyone is entitled to talk rubbish. As you've just proven 👍 @Marajax It doesn't unfortunately ☹️ https://t.co/EO3w6g5Vqo RT @billbarretta: It's UP!! Hope you enjoy it as much as we did!!\nEp #17 Ricky Gervais and Matt Vogel. September 6. The Barretta Brothers:.… @WeatherDog3 I'm enjoying it Rupe. RT @Lawrence: @rickygervais Yes, one more would be nice. And maybe another after that. And then maybe another until you get it right. @Lawrence 😇 RT @theversion: Icymi Review:  Ricky Gervais's After Life 2 is perfect ★★★★★ https://t.co/t8TxhjokXo via @theversion @rickygervais RT @CineroomTweets: #AfterLife2 is a show that holds the viewers for two series straight with its authentic writing and beautifully poignan… RT @AwardsDailyTV: \"He just doesn't want to live without her. It's a love story. That's what it is.\"\n\n@rickygervais writes, directs, and st… @danieljoachim You've assumed that I agree with you that what I said was unreasonable. It's Saturday night Daniel. Enjoy yourself with friends. @danieljoachim Exactly. Life is fun. Enjoy it 👍 @danieljoachim I doubt they’d be critiquing a comedian on a chat show plugging their latest Netflix special, Danners. @danieljoachim Hmmm...interesting. https://t.co/uLdUbdqXmw @danieljoachim This may be entry level stuff to people like you and I, who have studied both science &amp; philosophy to quite an advanced level, but I always try to speak simply for those who have never pondered such things. Hope you don’t mind people enjoying it. Watch this and let me know if you want me to do another one tomorrow that's just as shite. https://t.co/3JprGHbul6 RT @coleandersonJ: “Brent mused” @rickygervais #theoffice https://t.co/gMzCIEwu1t @tonypaulway \"Lunatic Woman\" 😂\nI love how they didn't beat around the bush in those days. Hello https://t.co/61yhoYDloV @dougleddin @Graham__Coull @DingleWhiskey @Fay_Coull @portercentral @phbrew @talkdram @cyrilbriscoe @beardydave81 Thanks Doug. Looks amazing. I'm with @UnitedAgents @Justineryan @LondonPalladium Very unlikely I’m afraid. I do these broadcasts for free because they're shite, but watch anyway because they help homeless dogs. See you Sunday! https://t.co/3JprGHbul6 RT @sean_m_maguire: #AfterLife2 is so good it’s hard to put into words. The humor &amp; the sadness reflect humanity so honestly and beautifull… @sean_m_maguire 🙏 @davidwilliman1 Almost certainly not I'm afraid. @ScottMoffett01 No, he’s also getting fatter 🙏 @at_cate @LondonPalladium Pretty sure they’ll be next year 😫 @Rossmiddleton7 Unlikely I'm afraid. @tonypaulway 134, actually. This calls for a little celebration. https://t.co/UIZXC1avZw Thanks for all your wonderful tweets about #AfterLife still flooding in after all this time, and thanks even more for always supporting the animal welfare stuff I bother you with 🙏 https://t.co/N2Wd68Vk9h Please help the beautiful moon bears by simply buying a t shirt https://t.co/cOxDDzibtO https://t.co/MidXLKl2iS RT @SusieHope7: @rickygervais @rickygervais ..When you ask Alexa \" Is Ricky Gervais a genius?!\" 😉😊...( we all know you are !!!🤗 ) God like… @TheSimonEvans You look like someone I'd have to do a little favour for in prison to get a job in the library. RT @rickygervais: Thanks for making #AfterLife the most watched British Comedy in the world again, and thanks to the millions who just disc… RT @rickygervais: https://t.co/kSmLxBz4yj RT @WeatherDog3: Sponsor my Uncle please @netflix @sainsburys @AldiUK @Greenies @BrewDog #sponsership Come on he gets loads of views, he’s… @ShaunProulx @netflix 👍 Who should I get to sponsor this shite? https://t.co/3JprGHbul6 RT @DavidBrentMovie: “Nothing Happened” #DavidBrent https://t.co/OZdyMB6DEN RT @AfterLife_Fans: “What’s your name?”\n“You’ll laugh”\n#AfterLife https://t.co/xqlDqp6niH @TerrySparrow4 yes @71smartie71 I make fun of things so they're not scary anymore. RT @makhzoom13: @rickygervais 🤣🤣🤣\n\nThanks for answering my question 🤣❤ https://t.co/UgQr0g4ETA @JulieBoBooly @Apple @Twitter 👍 https://t.co/kSmLxBz4yj @sabshussain @Art71Rachael Yeah, to be honest, my tweet was more about the subjective nature of stand up routines and TV sitcoms. Not torture, mass murder or genocide. Hope that's clearer now :) @TinekeHonore Should know soon. @markjudic @LondonPalladium Should know soon. RT @DavidBrentMovie: #BackToSchool\nEvery parent in Britain: https://t.co/BduYU9Ybgq @DDD03498840 @CelticNotorious I don’t understand the sentence you just tweeted I’m afraid. RT @KenKrantzComic: Hands down the coolest opener to a comedy show I've ever seen was in NYC when David Bowie opened for @rickygervais @FacileTalk To be fair, I did actually invade Poland too. We'll all be dead soon. Forever. So have a great day😎 https://t.co/VOcSW0SJy1 RT @AfterLife_Fans: I think this is my favourite #AfterLife2 outtake! 😂😂😂 https://t.co/jmaSjeXuAx @itsmaybay Still no news I'm afraid. Here's a useful GIF https://t.co/PlmAG0EqzX Stop fat shaming me! It's not my fault that eating and drinking too much makes me put on weight. It's science. https://t.co/lcEFZpaYgi Laugh at whatever you find funny. Don't laugh at things that you don't find funny. It's really simple. There is no argument. RT @kamchatka_es: Ricky Gervais: \"Prefiero que no haya corridas de toros, pero si alguien decide torturar a un animal hasta la muerte por d… @tereseforstholm @TicketmasterDK Doubt it ☹️ @DMMosullivan 🙏 @toddbarry Hope you didn’t have to follow him. #Industryhumour Thanks for making #AfterLife the most watched British Comedy in the world again, and thanks to the millions who just discovered #Derek because of it. The beauty of Netflix. \nDog Bless you. 🙏 https://t.co/RH96VaLa3b RT @DavidBrentMovie: #Slough by David Brent, available now to download and stream on Apple Music! https://t.co/ESRef62z3p RT @AfterLife_Fans: Tony always says it how it is 😂 Watch #AfterLife series 1 and 2 on @netflix now! https://t.co/fYXbxBOzjX RT @DavidBrentMovie: That time when David Brent wrote a song about the plight of the Native Americans. A subject very close to his heart. h… RT @AfterLife_Fans: What’s worse than ants in your pants? #AfterLife2 https://t.co/YokzbH4KKF RT @DavidBrentMovie: Life on the Road by #DavidBrent, available now to download and stream:\nApple Music: https://t.co/gL0i4kXdW5\nGoogle Pla… RT @AfterLife_Fans: I identify as an 8-year-old girl. #AfterLife2 https://t.co/bU27oGK4Xb Got one of those pumpy up things that’s meant to be good for your neck, but I’m worried it makes me look fat. https://t.co/JWdndgNM51 I do these broadcasts for free because they're shite, but RT anyway as they help stray dogs 🙏 https://t.co/fMrhNcS6Ov Great idea. Or even just photo montage. All the songs are on YouTube. Go for it! https://t.co/uozOPYax91 RT @DerekTVShow: What's the first thing you think when you see this picture? #Derek https://t.co/vAf7KQYLL7 @janseventyfour @GraemeHampton @piersmorgan I think Graeme's point was that for the first part of the film Hawking was walking. @rhettmc Thank you 🙏 https://t.co/Q2YrriY2IN @milmoop Still not sure. Annoying, I know. @WeatherDog3 I know a chubby bearded space hopper with no balls, if that's any help. @Art71Rachael How would I lift him onto it? RT @JasonLeePatrick: Are you on the fence about tuning in to @rickygervais Sunday Sermon at 6pm?\nHere are some highlights from 1 episode (t… Best fans in the world 🙏 https://t.co/tWethjfESS RT @AfterLife_Fans: “We’re both having the fish fingers and beans please...” #AfterLife https://t.co/P81MlNsI9r @JoetteAlt I'd have to keep that for myself. @Fred_Delicious Homon Boong (Homo Sopoons) @Fred_Delicious ont ootor @SpedSpedding That's xmas sorted too 👍 @boydhilton Haha. You will be the belle of the ball at the emirates stadium. @cherylduncan Ah yeah. I think you’re right. @MissJoHartley Haha 😂 @ElectricAgora Yep I usually have to spend a lot more than 26 quid on Jane’s birthday present, so I couldn’t believe my luck when I saw this. Sorted. https://t.co/odsZm9ttEC RT @rickygervais: #Humanity is now streaming on Netflix. #dogs https://t.co/k0jcWEfVqz RT @DerekTVShow: “Hand pump after hand pump\" - More #Derek outtakes! https://t.co/xR5BqhEaKv @trishforde123 Thanks. What about people who have God but just not your God? RT @ladbible: I swear to God I will never get tired of watching this. \n\n‘Billy The C*nt’ is the best one btw.\n\n@rickygervais \nhttps://t.co/… RT @NOWTV: Well that's settled, @rickygervais is definitely the new #DavidAttenborough 😉 https://t.co/UxTWSwIt3V RT @BrewDogDundee: We did a cool thing!\nThanks to @rickygervais we launched Street Dog: Limited edition Punk cans. We are putting adoption… I do these broadcasts for free because they're shite, but RT anyway as they help homeless dogs. See you Sunday. 🙏 https://t.co/DQtzE0zvFR @callumkingg Not sure Best fans in the world 🙏 https://t.co/n8jn4907lt RT @AfterLife_Fans: 3 months after the release of the #AfterLife outtakes, who’s still laughing at this? 😂😂 https://t.co/jmaSjeXuAx @BigStep29111951 👍 The bad news is, the world is absolutely fucked. The good news is, if you're reading this, things aren't that bad for you yet. Have a great day 👍 https://t.co/Wqhef7Qz7A @archied009 @Clark1995Clark The Short Fat Duck @DrumStig @DavidBrentMovie Led Zepp, Eagles, Stones, The Who. RT @Clark1995Clark: If you haven’t bought and listened to Life on the Road by David Brent yet, you’re an idiot. Fact. \n\niTunes: https://t.c… RT @Clark1995Clark: Currently watching ‘The Invention of Lying’ on Netflix. Bloody love this film. \n\nhttps://t.co/iSlFUzbZpz RT @DerekTVShow: The greatest ever song penned by @rickygervais? https://t.co/MxlaeDJyA4 @StuartEdwards4 👍 RT @TitaniaMcGrath: BRAVO @stonewalluk!!! 👏👏✊\n\nThe idea that there are biological differences between trans women and cis women is a transp… @WeatherDog3 I'd have to shave you first. @jackMPmiddleton 1. Yes. 2. No. @Clark1995Clark Yep. And people looked round. @Clark1995Clark How would you improv the movie? One woman put her hand upon and said \"I'd cast Jim Carrey in the lead role.\" RT @rickygervais: I do these broadcasts for free because they're shite, but RT anyway as they help homeless dogs 🙏 @RialbTrebor It depends. I noticed people focused a lot more on the grief than I thought they would so it made me think about going deeper into that. RT @BrewDogJames: Our US brewery @BrewDogUSA has now also collaborated with @rickygervais on StreetDog.\n\nWe have put adoption ads to help p… Love this little review of #AfterLife 🙏https://t.co/TBKIHmHlqq RT @DavidBrentMovie: “Native American” by David Brent. Factually accurate music now available on Apple Music to download or stream. https:/… @djstanners Still not sure yet. RT @DerekTVShow: \"I'm not a failure because I didn't succeed, I'm a failure because I didn't try.\" \n#Derek is streaming now on @netflix htt… I do these broadcasts for free because they're shite, but RT anyway as they help homeless dogs 🙏 https://t.co/DQtzE0zvFR RT @DavidBrentMovie: “You’ve gotta do the voice” Download/stream all the David Brent tracks on Apple Music now! https://t.co/aWXTRLuazN @DreyfusJames 🙏 Good one tonight. And by 'good', I mean 'least awful so far'. https://t.co/DQtzE0zvFR @IndiaWilloughby Cheers 😂 https://t.co/ULDX9GkE37 RT @CrueltyFreeIntl: Did you know that each year over 59,000 dogs are used in experiments in the US? This #NationalDogDay we need your help… @FreyaBird11 @KerryAGodliman Amazing 🙏 Happy #InternationalDogDay https://t.co/plg4zGlhcj RT @DavidBrentMovie: Throwback to David Brent performing #LifeOnTheRoad for Children in Need. Download and stream the album now on Apple Mu… RT @DerekTVShow: That time when #Derek and Kev got autographs from @EmmaBunton and @radioleary. https://t.co/J351FreOto @olliecomicstrip No. As I remember, some newspaper spotted us shooting the pilot and thought one of the extras was Connery. RT @Backstage: “If you're excited about something and you haven't seen it before and you do it your way and it turns out like you wanted it… https://t.co/TBKIHmHlqq @tonypaulway @JustMissEmma Yeah me too 😂 @petercrouch Love how he stays there for so long, hatching a plan 😂 @JustMissEmma I can’t stop watching it 😂 Thanks for all your amazing tweets about #AfterLife still flooding in after all this time. It was a joy to make and your wonderful comments make me even happier. This is me trying to direct 2 idiots eating a cake. https://t.co/Xe6O690KFY RT @sportsandra: If you haven't watched the two seasons of #afterlife...you're missing out. It's actually a PERFECT distraction from this p… RT @BrewDogUSA: We collaborated with @rickygervais on Street Dog and Street Dog AF: two limited edition Punk IPA and Punk AFs.\n\nWe’re putti… I do these for free because they're shite. But they also help homeless dogs, so please RT 🙏 #StreetDog https://t.co/IjevMZ0CLh @meowitsjoey @WeatherDog3 Not fed up with anyone😇 @WeatherDog3 Ask 2. One sensible &amp; one stupid. I’ll pick my favourite 😊 RT @DavidBrentMovie: #MondayMotivation Try and laugh several times a day #DavidBrent https://t.co/Up3Nhiz324 RT @DerekTVShow: Good morning #Derek fans! https://t.co/141iSiEX9B @seahunter2009 Yes. Cheers 👍 https://t.co/c2OZFkZdhC RT @teddy4593: Just got Netflix and watching afterlife to see what all the fuss was about.  @rickygervais  is one funny cunt @ChefPollard1 @JaneFallon A big rescued street dog @CathyGarside 🙏 @purbrooktony That's so difficult. Bowie for sure. Nirvana. Probably The Stones. Impossible. RT @KirkWilson512: I've always been a fan of Buddha quotes, but this one from #AfterLife is deffo in the top 5. @rickygervais https://t.co/… RT @Clark1995Clark: Possibly the best @rickygervais MEME of all time. \n\nhttps://t.co/GsSUwFFkrx Best fans in the world 🙏 https://t.co/tWethjfESS @ConanOBrien Is this one of your prison euphemisms again? @jim73194352 @meowitsjoey @WeatherDog3 @ScarlettBeagle @PocketsWarhol I didn't see it. RT @DavidBrentMovie: If You Don't Know Me by Now - David Brent\nCourtesy Juxtaposition Records https://t.co/l5RmiynB76 RT @DavidBrentMovie: “If you don’t know me by now” - the outtakes. https://t.co/xLz1BF9H3X RT @DerekTVShow: Good morning #Derek fans! https://t.co/aTxejgIOQI @Raymundoswing @CFCGARYG I'm Ricky's Butler and I assure you it's not automatic. I'm at it it all day. @Clark1995Clark You'll get to see Micky The Gypsy. @JustMissEmma @Anonymouse_mmx Amazing. RT @DerekTVShow: RT if you loves having pudding. https://t.co/MxlaeE19rC RT @DavidBrentMovie: Recent photograph. https://t.co/bK9Sb9oxiJ RT @AfterLife_Fans: RT if you agree with Brandy 😂 #AfterLife https://t.co/NR3uDQc0nj RT @DerekTVShow: “Joan used to say...” #Derek https://t.co/H4DfLLmj0z @WeatherDog3 Yeah but I think we'd get one with legs. RT @Clark1995Clark: Probably @rickygervais’ greatest joke and most relevant to the world today. \n\nhttps://t.co/z8fycdD47X RT @MattLawson76: Don't worry .. you'll have a whistle 👍🛩 @rickygervais #TikTok #lipsync #rickygervais https://t.co/UXYmBOr0FC @slash015nl I think it's a fake 😂 RT @DerekTVShow: First rule: Always Get Up #Derek https://t.co/eSUqTxPIom @JasonWilkins91 I think my favourite is Ooh La La and my least favourite is Spaceman. RT @BrewDogJames: We collaborated with @rickygervais on Street Dog &amp; we put adoption ads on the cans to help pups find new homes.\n\nWe suppo… RT @Clark1995Clark: Eight of the greatest minutes in the history of Live television. \n\nGod bless @rickygervais. \n\nhttps://t.co/i1XkQ44bZz @MartyntheMuso Don't watch #Humanity on Netflix. @WeatherDog3 mental @reid_nacho @meowitsjoey @WeatherDog3 Happy Birthday. @Clark1995Clark It was award-winning. Really beautifully crafted philosophical questions will equally profound answers. 5 stars. @Clark1995Clark Happy Birthday Kathleen 🥳 Watch and RT. Or just RT. Better for both of us. https://t.co/VupneCoO48 @danijade85 AfterLife 😇 https://t.co/LBNEcsIAPz @BJA_VISUALS What did she say? @HopkinsBRFC Hope the filthy piece of shit was seriously hurt. RT @ScarlettBeagle: On #WorldPhotographyDay rescued ex-laboratory @ScarlettBeagle shares her favourite photo with her kindest human @rickyg… @WeatherDog3 Like a snowman with ears. @SudakshinaKina I don’t know. It’s nothing to do with me. Just a fan I assume. RT @JaneFallon: God, she loved that brush 💔 https://t.co/jEqGFjJyKK @IAmPapaMeat It's free because it's shite. @purbrooktony Call him and tell him I'll see him next week. RT @DavidBrentMovie: #WorldHumanitarianDay https://t.co/CHkzdIcKWg RT @DerekTVShow: “Weird question... Why aren't you writing on crabs mate? That's a better question. #Derek https://t.co/zbfxDgtK3a RT @DavidBrentMovie: #WorldPhotographyDay https://t.co/MERp5sG0sA RT @DavidBrentMovie: Some #WednesdayWisdom from David Brent. https://t.co/SemIcRbgAx RT @Clark1995Clark: Just harmless fun. https://t.co/IQKZ4AWsV2 RT @DerekTVShow: “I fucking love Wednesdays” #Derek https://t.co/wi55t4xiJE RT @AfterLife_Fans: “Any bad things that have happened to you, you must have welcomed them in” #AfterLife https://t.co/mVyBqKabPA RT @meowitsjoey: Just incase you’re losing track of the days I must remind you that today is WEDNESDAY which means you must tune in to @ric… RT @WeatherDog3: GUESS WHAT TODAY IS... YEP.. Uncle ChubbaDoobies @rickygervais Talking B*llocks Show ..Where else can you get free enterta… RT @mikewarburton: Happiness is amazing.\nIt’s so amazing it doesn’t matter if it’s yours or not.\nThere’s that lovely thing -\n‘A society gro… @NicolaWilsonBi1 👍 RT @DerekTVShow: The Twine Family. #Derek https://t.co/cT6nHe5tby RT @olliecomicstrip: The people have spoken, @rickygervais. \nPlease consider doing one last season of #Derek. “It’s never too late - until… RT @jazuletaj: #AfterLife masterpiece by @rickygervais https://t.co/ftIfOHfG0i RT @BanditKingUK: Re-watching #AfterLife with @rickygervais and the stuff regarding his father hits really close to home. Masterpiece of me… RT @stueekennedy: Anyone surprised by the brilliant comedy and heart wrenching mix in #AfterLife needs to check out #Derek - an absolute ma… RT @DerekTVShow: Kev shits himself - the outtakes! #Derek https://t.co/gzmEmvhKqG @SeanMcLoughlin She has more faith in your ability than I do then. RT @DavidBrentMovie: #TuesdayThoughts “Why buy a book when you can join a library?\" #DavidBrent #libraries https://t.co/pWEqSBA5Ln RT @dotslondon: You can still grab your @BrewDog and @rickygervais collaboration “Street Dog Punk IPA” 100% of sales will be donated to DOT… RT @AfterLife_Fans: Who won the argument? \nRT for Tony\nLike for Kath \n#AfterLife https://t.co/gsXOPwfmQz @MissJoHartley A Bronx Tale. RT @piersmorgan: Finally, shamefully late, got round to watching #AfterLife2. Oh ⁦@rickygervais⁩, you’re a comedy genius. That is all. http… RT @swillmedia: @piersmorgan @rickygervais I just finished #AfterLife2 as well. Beautifully done. Simultaneously brutally heartbreaking and… @purbrooktony @JaneFallon @PeterEgan6 Yep. Fat little cunt. @piersmorgan 🙏 RT @Shaun_ONeill5: @rickygervais could you recommend a therapist to help me understand why I don't do well on Tinder? #AfterLife https://t.… RT @BrewDogJames: We collaborated with @rickygervais on Street Dog: a limited edition Punk IPA.\n\nWe’re putting adoption ads from  @AllDogsM… I do these for free because they are shite. RT though. See you Wednesday. https://t.co/7MTjQoO6Ha @WeatherDog3 One question per household. We have a winner! https://t.co/TmBPyACtEy @LouisaCorr 🙏 @LouisaCorr 👍 @FrederickFried8 👍 @FreyaBird11 Hi Freya, I either use people who I've worked with before because I know they have what it takes or I audition and try to find the stars of tomorrow 👍 https://t.co/Y4cK6G6p0z RT @Stateastic: The show will make you laugh and cry at the same time. It will show you that no matter what happens, you need to carry on.… RT @dignityindying: “If you know that you’re not getting better and every day is painful agony with no hope, it should be your human right… RT @LDoran89: Finally, watching #AfterLife with my dog @rickygervais haven’t laughed and cried so much in one morning... wonderfully heartf… @newmanstings haha @meowitsjoey good question @DinoKaijiu I don't think it's worth it as the original version is already shown around the world. @andrewjbarron Final Draft, but I know nothing about that sort of thing. RT @robboref85: Just finished #AfterLife for the second time, all 12 episodes in 4 evenings with a friend who had not seen it. Side-splitti… RT @coleandersonJ: My reaction to @rickygervais Afterlife nicknames Polls 👀 #theoffice #afterlife https://t.co/CVHgWPBLYb @Art71Rachael @DerekTVShow I think I fell onto a little gym mat. OK. Here it is. The Big One. \nNicknames for The Nonce: The Final @loulabelle46 Not sure yet. @KenPlume Is that a young Schindler making his first ever list? @jeffyjamj Thank you 🙏 @DardilhacGuy Thank you 🙏 RT @DerekTVShow: Baby Monkey! https://t.co/aTxejgIOQI RT @stueekennedy: #Derek saying goodbye to Ivor is the most heartbreaking piece of TV ever @rickygervais - please don’t hurt Brandy in seas… @rol_l_y Kill it! @bethanylansing Very different. @Admac111 🙏 @mrsbalexander11 @AfterLife_Fans Yes RT @DerekTVShow: “What if the worm’s having a lie in?” https://t.co/4B7OyAhRd5 The Invention of Lying is now on @NetflixUK https://t.co/7ia4vS07G0 @AussiePhinatic Pretty sure it has subtitles around the world on Netflix. RT @DavidBrentMovie: The David Brent album is available to download/stream on Apple Music, including the brilliant song, Electricity! https… @TomFred85 Only 3 actually. I just went mental. @mick_matheson Couple of hours. @jamesdowdeswell Thanks, Count 👍 RT @_SonOfBen_: Watched David Brent's life on the road today. Never seen it before. The Berk tattoo bit really got me 😂😂😂\nWell done @rickyg… The World Cup of Nicknames for The Nonce. #AfterLife \nSemi Finals The World Cup of Nicknames for The Nonce. #AfterLife\nSemi Finals Best fans in the world 🙏 https://t.co/ILyFBPLSmu RT @dollydimple01: Just binged watched #AfterLife2 hilarious and emotional. @rickygervais you never disappoint 👍 RT @rickygervais: Please watch and RT. \nIt's free because it's bollocks. See you Sunday. https://t.co/i02agbjjgX RT @roobzperez: David Brent’s little face when his band mates have a pint with him on Life on the Road. 😭😭😭 @rickygervais I love you. 😆 “hh… RT @ClaireCollins31: Never gets unfunny! “From the horses mouth” Ricky you are a legend 💖 @rickygervais #lifeontheroad https://t.co/eUVJNEj… @FlamingoLove71 @DavidBrentMovie I want everyone in the world to buy the first one first 😂 @TVKev @Grey4Simply @talkRADIO You're trying to have a reasonable discussion with someone who actually has \"BLM (Black Looting Men)\" in their Bio. @pifapaul 😂 I want 10% of the profits. @Craig67M Michael Parkinbum got knocked out by Clitoris Allsorts. Gutted. RT @signofthetwines: Derek's opening credits, but with Friends' theme.\n\n@rickygervais @DerekTVShow @MrDerekNoakes https://t.co/cSAH5CobrL RT @DavidBrentMovie: That’s backfired https://t.co/qMdYW1rWad RT @DerekTVShow: “Now what’s going on over here” #Derek https://t.co/JLjz2HnkkH RT @talkRADIO: Ricky Gervais raises money for homeless dogs with charity beer: \"100% of the profits are going to dog charities. I love beer… @olliecomicstrip Nice idea. Although I think all the idiots who ask questions already give to charity 😂 @liamgallagher You should cover this song. C'mon you know. As you were RGx https://t.co/gTgdfkT2yg RT @BrewDog: Our secret talks with @rickygervais resulted in the launch of Street Dog: limited edition Punk IPA.\n\nWe teamed up with @dotslo… Please watch and RT. \nIt's free because it's bollocks. See you Sunday. https://t.co/i02agbjjgX RT @Clark1995Clark: The greatest @rickygervais outtake of all time. 😂 #AfterLife2\n\nhttps://t.co/w1NyeHGWCv The World Cup of Nicknames for The Nonce. #AfterLife \nRound 1 Group A The World Cup of Nicknames for The Nonce. #AfterLife \nRound 2 Group B The World Cup of Nicknames for The Nonce. #AfterLife \nRound 2 Group C The World Cup of Nicknames for The Nonce. #AfterLife \nRound 2 Group D @jim73194352 @TheRossOwenShow @WeatherDog3 @AsheyThe 😂 @v4vile 🙏 RT @Fordys_twits: ‘I remember what it’s like to be normal @rickygervais so i try to do an impression of that...’ knew #AfterLife was genius… RT @ReallyDHealy: @rickygervais  just watched After Life.  It was the closest thing to perfection in story telling I've ever seen. And you… RT @baggymandan: Last night we binge watched After Life on @NetflixUK Flawlessly brilliant @rickygervais RT @RoryJakeman: Well, #AfterLife is a life afirming, beautifully crafted series that has me from howling to blinking back tears. So, so wo… RT @kerryfowler_: The dialogue is genius here. But the facial expressions &amp; pickled onions are comedy acting gold.\n\n#Derek #Netflix  \n@rick… RT @alexjgriffin23: Just catching up with the second series of @rickygervais’ After Life. It’s rare to watch a show where every scene has y… @TDL_Coop That can certainly be true yes. RT @dotslondon: Morning 🌞 You can still pre-order the LIMITED EDITION  “Street Dog” Punk IPA from @BrewDog here: https://t.co/PxM8YiWybQ… RT @ABritInCanada: @rickygervais, Last night I watched one of the most beautiful episodes of TV I think I've ever seen - Season 1, Episode… @bennidaytime Yeah I didn't realise Clitoris Allsorts would be so popular. @TheEnglandMan Yeah but 2 go through from each group. @c_r_5 I agree. AIDS is disappointing too. The World Cup of Nicknames for The Nonce. #AfterLife \nRound 1 Group A The World Cup of Nicknames for The Nonce. #AfterLife \nRound 1 Group B The World Cup of Nicknames for The Nonce. #AfterLife\nRound 1 Group C The World Cup of Nicknames for The Nonce. #AfterLife \nRound 1 Group D @MrRyanJDalton @JaneFallon 👍 @greasycanyon Then you should be happy that you're not 👍 https://t.co/g6AxYml5tj Please watch and RT. It's free because it's bollocks. https://t.co/i02agb1HSn RT @coleandersonJ: Women... are... dirty @rickygervais #theoffice https://t.co/Mk5BMfq8FD @WeatherDog3 Udder Thanks for making #AfterLife the most watched British Comedy in the world again, and thanks to the millions who just discovered #Derek because of it. The beauty of Netflix. \nDog Bless you. 🙏 https://t.co/LOAFG7nE4B RT @purbrooktony: How were you allowed to film this in a public place @rickygervais? 🤣 https://t.co/Kb3Y0PImzS RT @AllDogsMatter: Huge thanks again to our fab patrons @rickygervais + @PeterEgan6 for the inspiration behind our #streetdog partnership w… RT @thepressAU: I am laughing so hard at #AfterLife my stomach hurts. Thanks @rickygervais ! RT @matth0gan: Why have I just started watching derek @rickygervais - it’s hilarious 😂 @iampagu Don't think anyone has done that. RT @dotslondon: We have teamed up with @AllDogsMatter and @BrewDog  with the help of @rickygervais to present to you the limited edition St… @meowitsjoey Whatever you want Joey 👍 @Clark1995Clark We both know the answer to that. @WeatherDog3 😂 A little fat sausage could never really annoy me. @purbrooktony And I literally lived around the corner at the time. RT @BrewDogJames: Thanks to @rickygervais we’re launching Street Dog: limited edition Punk IPA.\n\nWe’re putting dog adoption ads from @AllDo… RT @AllDogsMatter: We're thrilled to let you know that @BrewDog has launched Street Dog: limited edition Punk IPA. These special cans help… RT @dotslondon: Just want to express how amazing this is for us here at DOTS thank you @BrewDog and @rickygervais ! Everyone get your can w… RT @BrewDog: Thanks to @rickygervais we’re launching Street Dog: limited edition Punk IPA.\n\nWe’re putting dog adoption ads from @AllDogsMat… @SandraKing16 👍 https://t.co/jQ48wrV7xN RT @fpitetta1: @rickygervais Hey Ricky, we are watching a clip from After life in a class of ethics in a university of URUGUAY, that´s how… @CHENIER2626 Looks like it. @IndiaWilloughby 👍 @RobertJMorgan65 Me @WeatherDog3 👍 https://t.co/a5bpiDrOQ9 Happy #WorldElephantDay! Peanut and Coconut are celebrating in a river at #WildlifeSOS. Help rescue abused elephants in captivity by joining Wildlife SOS' #ElephantFreedomTeam. https://t.co/r4JIF6xSt0 https://t.co/eSRscWtUSW See you tomorrow 😇 https://t.co/FelUJAbxUj @MarcRidge 👍 @depechebo Very unlikely I'm afraid. RT @rickygervais: I do these broadcasts for free. I would never charge for them because they're shite. But please have a watch and RT. http… RT @rickygervais: Thanks for all your lovely tweets about #AfterLife still flooding in, particularly all of your own stories of grief and l… Best fans in the world 🙏 https://t.co/tWethjfESS @dal_fab @PinkNews Perfect RT @MammothVolume: Just saw the second season of 'After Life' with @rickygervais (for the second time), incredibly moving, beautiful, sad b… RT @CiaraNK36: I love how my dog ruins the atmosphere in Afterlife @rickygervais thanks for a brilliant series. We’re looking forward to se… RT @GervaisTrivia: Ricky’s monologue at this year's Golden Globes has been viewed an estimated 300 million times around the world on TV and… 🍻 https://t.co/wTyKoHih8c RT @JaneFallon: This Thursday!!! Watch from the comfort of your own home. Ticket price includes a copy of the book and signed bookplate. ht… @MooskelTomTom Those ears! @LouisaCorr 👍 RT @lindathesinner: @rickygervais Just finished #AfterLife and I am reduced to a snot-curdling cunt! #epic 🙏 https://t.co/i4v3S3mxfZ 👍 https://t.co/NXqvJZVRMM RT @coleandersonJ: Good news and bad news... @rickygervais #theoffice https://t.co/fPy9sdBqRE @1980_tori I did indeed write that and all the David Brent songs 👍 @DreyfusJames @TheRosebud14 🙏 @Art71Rachael Always channelled David Brent. @alexand59506953 Ooh La La @meowitsjoey I think it's Ooh La La What's your favourite track? https://t.co/rvXEVHENfD #iTunes I do these broadcasts for free. I would never charge for them because they're shite. But please have a watch and RT. https://t.co/5iu81LQBXp RT @RoastParsnip: Just watched all 12 episodes of @RickyGervais's #AfterLife back to back. Fuck me, I'm absolutely shattered.\n\nI've been th… @FionaWolstenho1 🙏 Thanks for all your lovely tweets about #AfterLife still flooding in, particularly all of your own stories of grief and loss and how you identified with the themes of the show. Stay strong 🙏 https://t.co/RKyLALWrmB RT @TheDoncastrian: @rickygervais took me this long to get the opportunity, but I just binged after life season 2.\n\nThat’s 3 hours of tears… RT @olliecomicstrip: Thank you for an absolutely amazing sermon tonight, @rickygervais - although I don’t know what’s most alarming:\nThat m… RT @DrColeFletch: As a trainee #socialworker, mum of a little boy who was #premature and daughter who lost her mum to #cancer, am I meant t… RT @Tom_Bergeron: If you're not watching @rickygervais's Sunday &amp; Wednesday @Twitter broadcasts, you're missing some prime, improvised &amp; hi… RT @TriciaKicksSaaS: Darth’s favourite part of the day is watching @rickygervais’ live broadcasts 😂😭\nHe pushes me out of the way to watch 😂… https://t.co/eYEWNEbMCd RT @NickRhcp95: I dont think ive ever seen a show to impact me as much as After Life by @rickygervais has! So many instances where i could… RT @_katefm: Nobody looks happier than Ricky Gervais saying hello to all the dogs on Hampstead Heath. He beamingly introduces himself to ev… RT @Clark1995Clark: Happy Sunday Everyone! \n\n@tonypaulway @rickygervais \n\n https://t.co/CiNYXQcUkQ @EstherThePig 😂 @WeatherDog3 You'd better have a back up question in case I start imposing a quality control. @WeatherDog3 Yes. What is it? RT @kerryfowler_: ”Would you feed my slug?.”\n\n#RickyGervais #Derek #Kev https://t.co/2MNsR5Dw3G RT @mikemc1979: @rickygervais Watching #AfterLife with my pugs Daffodil (featured) and Bugs. Today would've been my wife, Jennifer McDowell… \"Season 2 Of ‘After Life’ By Ricky Gervais Is Painfully Good\" via @forbes https://t.co/S9mIxX9xLG @VictoriaS 🙏 @DanGWestern I'm looking great too. @HolliDee One of the most impossible scenes ever. 3 quarters of a million idiots watched my Wednesday broadcast. Let's see if we can get a million tomorrow. See you at 6. Dogs and cats welcome. https://t.co/5PBA5ScJCu Best fans in the world 🙏 https://t.co/tWethjfESS RT @rickygervais: What's your favourite nickname for The Nonce? https://t.co/APncI0BM58 #MichaelParkinbum is trending 😂 @RussMcKenzie84 @ladbible https://t.co/5GvXUfxQmS @westernquestion Mr Toad RT @coleandersonJ: Five Knuckle Shuffle... @DavidEarltweets @rickygervais #Derek https://t.co/yf1pIw5sOO @GSpellchecker I was hoping it was a piece from a dictator themed chess set. RT @RadioTimes: In this week's #TheBigRTInterview, Ricky Gervais talks about creating \"human connections\" with his Netflix viewers\n\nhttps:/… Happy #InternationalCatDay \nThis is the last photo I took of little Ollie. She wasn’t feeling her best but she was beautiful to the end 💔 https://t.co/jUYij5Oj96 What's your favourite nickname for The Nonce? https://t.co/APncI0BM58 RT @rickygervais: Can't believe over half a million people tune into this shite. \nBest fans in the world. See you Sunday 🙏 RT @rickygervais: Thanks for making #AfterLife the most watched British Comedy in the world again, and thanks to the millions who just disc… @ScottFeinberg Indeed. Just played tennis again. Mental. https://t.co/FlvQBVib3u RT @MetroUK: ‘Everyone’s allowed to call you an a******e, everyone’s allowed to stop watching your stuff, everyone’s allowed to burn your D… Thanks for making #AfterLife the most watched British Comedy in the world again, and thanks to the millions who just discovered #Derek because of it. The beauty of Netflix. \nDog Bless you.🙏🙏🙏 https://t.co/oKcC2OsSgo RT @AnimalsAsia: .@rickygervais Thank you for your absolutely fantastic support for our #TheOnlyCureIsKindness campaign. Now is the time to… @ladbible Hole in Juan. RT @Metro_Ents: Ricky Gervais calls out celebrity cancel culture \n\nhttps://t.co/TBMUoEaJK6 RT @AnimalsAsia: This crisis has been a wake-up call for change, and our work in Vietnam shows change is entirely possible. We can put an e… @AshHarrison78 It's out of Harold Shitmum, Long Dong Silver and Michael Parkinbum. Always have water and shade available for your dog today, watch out for hot pavements, and if you leave them in a car you are a stupid cunt. Enjoy the sunshine 🍻 https://t.co/DHBkvSTQ45 RT @JustMissEmma: Current mood: https://t.co/7QmgeZfMsJ @purbrooktony Amazing RT @davemoquy: Wow. @rickygervais in “Derek” on Netflix. Beautiful. \n“Just be good. I’m good. Not because I think I’ll go to heaven, but be… @ben_wheeler18 AfterLife and Real Life 👍 @elliot_gonzalez 🙏 @omid9 🙏 Can't believe over half a million people tune into this shite. \nBest fans in the world. See you Sunday 🙏 https://t.co/5PBA5ScJCu https://t.co/u9MNMCMgCg RT @jonpauljames: Who is wroooooooooong and who is right? \n\n@rickygervais @Carra23 https://t.co/dPeIJm3Pgs @JosephLucas256 😂\nPeople who still watch normal telly actually do really say things like that though. Some are relatives. RT @rickygervais: https://t.co/fxDxS0xBrY RT @coleandersonJ: Oh for f... @rickygervais #theoffice https://t.co/qm9iihtz8M RT @DavidBrentMovie: Music from David Brent is available to stream/download on Apple Music, so... https://t.co/ul2axbaOzY Have a great day! https://t.co/eegkMnPfPl @RobRobbEdwards @razooshka96 filth @Lynzschofield Please report it. RT @DavidBrentMovie: David Brent: Life on the Road the album is available to stream and download on Apple Music. Fact. Here’s David highlig… RT @Margare89734686: Just bought the David Brent album as a thank you to @rickygervais for his free sermons on here.. (He begged us to buy… @Suej1959 Weird isn't it. https://t.co/fxDxS0xBrY RT @AfterLife_Fans: “Why do you want your baby to look like Adolf Hitler?” #AfterLife Series 1 and 2 are streaming on Netflix! https://t.co… RT @ManVersusFilm: So glad I checked which mug I was using and adopted the relevant side before my first MS Teams call this morning @rickyg… I hate themed weddings too. https://t.co/jGyskKfMx4 RT @Clark1995Clark: How the hell does this happen? https://t.co/iA9U1fstCf RT @DavidBrentMovie: I think there's been a... https://t.co/bRdnxrvGbj New bath pic. Still got it. https://t.co/1q0DR8edEt @CPDwing Not sure I’m afraid RT @MrNickKnowles: I am both honoured and deeply disturbed at the same time 😂😂 https://t.co/MwTfUSXF5w RT @DavidBrentMovie: She's not dead https://t.co/yX1PVHpSZJ RT @coleandersonJ: Freight Train @rickygervais @MrNickKnowles  #Derek #Kev https://t.co/FyGBQEbsEI @peta @UPS Disgusting @coleandersonJ @MrNickKnowles haha RT @purbrooktony: “You should see my minge...it’s like a butchers bin” 😂 https://t.co/EzXHgjvXhO RT @JLOW_14: Spent a lovely day in Hampstead for the wife's birthday then made her pose for this... \"Shouldn't you be wanking someone off o… That moment in the movie when you first realise he’s a vampire. https://t.co/SuVCCuvzi7 @bam_vik Thank you &amp; sorry for your loss. RT @wolfetone98: Needed this today!\n\n\"Good people do things for other people.\"\n\nThis will forever be my favourite scene in @rickygervais's… RT @rickygervais: https://t.co/BwkKK8cGnR RT @Clark1995Clark: Nominated for ‘Outstanding Live Variety Special’ @TelevisionAcad. 👊🏻\n\n#Emmys2020 @rickygervais \n\nhttps://t.co/i1XkQ44bZz @FacileTalk I think someone does post them already. https://t.co/BwkKK8cGnR RT @KoroushGhazi: Love this quote from Ricky Gervais as David Brent. I agree: in the end, all we can do is keep trying to accomplish what w… @olliecomicstrip @WeatherDog3 @meowitsjoey Spot on! RT @PeterEgan6: Thank you @rickygervais #DameJudiDench #SirRanulphFiennes &amp; #SundayMirror :  Song for Cecil calls for ban on import of hunt… @Rahul_Mohan 👍 Have a beautiful day! https://t.co/RNtcIfrHpd @WendyS1892 Simon is welcome. @Lloyd_Cole 🙏 Thanks for all your lovely tweets about #AfterLife still flooding in, particularly all of your own stories of grief and loss and how you identified with the themes of the show. Stay strong 🙏 https://t.co/13MC820BA3 RT @MirandaNolan01: Finale of #AfterLife s2 😭 @rickygervais just heartbreaking and brilliant (as is the Dog!) 🙌🏼 RT @matt_bingham13: #AfterLife is so good. Like @rickygervais would be creeped out by how many times I've sat down and watched this lmao. RT @ClairenLiff_Eff: @rickygervais finally just got Netflix today so could watch #afterlife and was well worth the wait- absolutely brillia… RT @TheRossOwenShow: https://t.co/6kew6xNkMk\n\nNOW YOU CAN RECORD YOUR VERSION OF A DAVID BRENT SONG USING THE KARAOKE VERSIONS BELOW. \n\nDav… @Lloyd_Cole You have to do a cover version now. @goldchannel 👍 @Lloyd_Cole Oh my word. Thanks man. I was listening to 'Like Lovers Do' today! This just made my day 🙏 https://t.co/w1cbNrIWVR #LadyGypsy by #DavidBrent \nhttps://t.co/KnMzBm47rC What's your favourite track on the David Brent Album? \nhttps://t.co/rvXEVHnbR3 RT @DavidBrentMovie: It’s FA CUP FINAL day! https://t.co/LigiuSZpoU @purbrooktony I still feel hot from yesterday. Have a great day! https://t.co/0OidzhF9RH @robertpopper \"Shopping Lift\" really made me laugh. @bselcoe Beautiful. @FiGilg Me Just played tennis. I’ve genuinely never felt this hot. Mental. https://t.co/7OZDYiBQLn RT @askptk: @AfterLife_Fans @rickygervais This is by far my favourite scene from season 2. I personally know what this truly means and feel… RT @reddevil_andy: Watching @rickygervais #Humanity for the 100th time, remember #TheyAreJustJokes RT @coleandersonJ: GBH of the ears... @meggiefoster @rickygervais #theoffice https://t.co/Q4rYwb7ft2 RT @DavidBrent: “How can I hate individuals with a cervix? My mum’s one.” #WokeBrent RT @DaveDigger871: @rickygervais  A true fan watching 😂 🐕 #AfterLife https://t.co/UAO66CeRRB @KBoniface01 David Brent &amp; Foregone Conclusion @bipoldenise Whatever gets you through :) @buck040858 @afterlife More scribbling than fixed time in a room for sure :) @capdoffer I think so. 19 years ago today, the 'Training Day' episode of The Office aired on BBC 2 and David Brent treated us to a bit of Free Love on The Free Love Freeway. Now it's 99p https://t.co/zRAMQtleDZ @Clark1995Clark If he can still turn water in to wine I’d kneel by my pond, yeah. @ChrisDEarl Happy birthday Irene #DogsWatchingAfterLife https://t.co/veOUsTAYvY RT @LoriAlan1: If you haven’t seen #AfterLife  seasons one and two, written and directed by the amazing @rickygervais  You are missing out.… @CathyGarside 😂 @drjedijen Well in the sense that you’re slightly different from your parents, yes. https://t.co/g7mCWsgejX @mgetzski Yes @PeterEgan6 Pure filth. @meowitsjoey .@themayhew is always a good one :) @WeatherDog3 I'm answering questions but I doubt a dog would ask one. RT @LindaLauren: @rickygervais Be quiet and stay on your side of the pond. No one absolutely no one likes you or wants you here.#Despicable… RT @daniq000: @rickygervais Rivited 🐶🐶❤️ #DogsWatchingAfterlife https://t.co/YfxwY1eojt @JOOBSSTONE Not sure yet. Thanks for all the love for #AfterLife 💕 Best fans in the world. And that’s what really counts 🙏 https://t.co/f2AJGIVmZo #AfterLife didn't get nominated for an Emmy this year.\nBut this did. \"Outstanding Live Variety Special: The 77th Annual Golden Globe Awards\" That's some conciliation, I guess. So, Thanks, Hollywood. Oh, and stop fucking kids. Cheers 🙏 https://t.co/NuqoVfByt4 @CathyGarside 👍 RT @ScarlettBeagle: Thank you @FinancialTimes for this vital piece by Prof. @LisaKramer, on the human medical failure of #AnimalExperiments… RT @rquinn2784: After Life, written and starring @rickygervais, is absolutely phenomenal. My first instinct after watching it was to hold m… RT @beer_trade: @rickygervais Beautiful, heart-warming, heart-breaking, and all in-between thank you and your co stars for #Afterlife brill… RT @smclaughlin93: Just binged both seasons of After Life on @netflix - haven’t properly belly laughed to a show in a long time, but also t… #DogsWatchingAfterLife https://t.co/veOUsTSznw RT @HSIUKorg: FUR HORROR: Caged raccoon dog impaled through eye and head as horror Finnish fur farms exposed by @oikeuttaelaimil in today’s… It also works if you close your eyes and just think of the one you want to hear. https://t.co/qqVSgr6KBd Dirty fucking savages. https://t.co/iIGEcSApKn @K4ndyB Yes. It will be next year. @meowitsjoey OK RT @SophiieGardner: Rewatching @rickygervais ‘After Life’ because it is just so perfect ❤️ I highly recommend anyone who hasn’t seen this t… @WeatherDog3 @dreffdesigns Someone is going into my agent's office this week to collect the mail 👍 @dreffdesigns Amazing @Spoonhead8 @Saffiya_Khan1 I wasn’t talking about either specifically. I was concerned with the principle. Acknowledging the right of someone to say something you don’t agree with. That’s all 👍 @Spoonhead8 @Saffiya_Khan1 You'd have to ask them 🤔 @Saffiya_Khan1 Luckily, it's not for individuals to define it. It's defined by law 👍 @gta395 Not sure yet. @purbrooktony 👍 RT @nickjhwilson: @rickygervais Just binged watched Both series of After Life and I have held my wife’s hand for most of it. She’s been in… @RedeMarta @Corpodormente @Twitter Oh really? Thanks @LORRAINENERO Braquo @JoetteAlt Yeah the kid at the window sent a chill down my spine. @scarffyy Braquo RT @chloe62692120: @rickygervais @rickygervais  really great Sunday sermon Ricky, I've found your broadcasts over the last few months weird… @WeatherDog3 Not sure, Rupe. @WeatherDog3 I wasn't laughing because I though it was wrong. I was laughing because I thought it was right. #CatsWatchingAfterLife https://t.co/MWgfsJ4PFW RT @meowitsjoey: Haha another great broadcast @rickygervais... thanks for answering mine, @WeatherDog3 and @jim73194352’s questions, we ask… RT @lynzr33: Please watch &amp; retweet also please watch any @rickygervais stuff on Netflix, #AfterLife is stunning &amp; genuis, #Derek is amazin… https://t.co/qSVzinE75t RT @Nikki_JTaylor: Due to #AfterLife I've found #Derek. Absolute art!! The observations are infinite. Although @rickygervais laugh is like… @everettehatcher I haven't no. @Joe_Davi5 Partridge is one of my favourite comedy characters :) @therealsfmurray Not that Milman Road but the one in Reading :) Thanks for making #AfterLife the most watched British Comedy in the world again, and thanks to the millions who just discovered #Derek because of it. The beauty of Netflix. \nDog Bless you. https://t.co/cIs0HnZmt1 @IanRWebb1 Stan. @WeatherDog3 You look like a fat sperm. There’s good news and bad news. The bad news is there’s a global pandemic. The good news is I look great in a mask. So, every cloud. You’re still thinking of the bad news, aren’t you? https://t.co/mPfjnVjawX @TVamp1 👍 @Clark1995Clark Haha, amazing. @TheRossOwenShow How the fuck does it make Brian Gittins uglier? Gutted. @tonypaulway Not a bad idea. @TheRossOwenShow It's like a nightmare. RT @coleandersonJ: Here’s to #Afterlife3 🙌🏽 @rickygervais https://t.co/Dbpo0pQB3o @davidschneider @Baddiel @matthaig1 They hate grammar nazis. RT @ladbible: @rickygervais and Brandy the dog's journey continues. 🙌\nhttps://t.co/12okFM0bRV Just wrote a joke for Brian Gittins to tell in #AfterLife3. It’s so good I’m counting it as a day’s work. https://t.co/UhR0mclmDf @JordanDrump Brian’s stand up. @tonypaulway Yeah, first draft though. @purbrooktony @tonypaulway 😂 @Lipperlipper Sorry for your loss. @purbrooktony Just ep 1. The rest are getting there though. #DogsWatchingAfterLife https://t.co/U8gt95HKu3 Cheers 🥂 https://t.co/PHfzXHsO0E https://t.co/64suRQmSYm @GSpellchecker I loves how he gives them a few things to be getting on with. @Ianrwebbicloud1 Always loved Roy Kinnear @melaniebirch haha no What's your favourite bit? https://t.co/t0juFmAZk5 @utilities4biz @GaryLineker @Ashgate_Hospice So sorry for your loss. @WeatherDog3 Why Don't you just sit and chew a bone like a normal dog? @jlh532 Yes. RT @UfitDrinks: Thanks again to @rickygervais for the shout out and showing his love of the UFIT Crunchers! As a thank you we have donated… RT @DogsTrust: @UfitDrinks @rickygervais @StokenchurchDR Thanks so much! RT @coleandersonJ: Milligan, Cleese, Everett... @rickygervais @DavidBrentMovie #theoffice https://t.co/RmR9j0dSWL #DogsWatchingAfterlife https://t.co/t9o14YD9Tw RT @TheVersion: For those of you who live on another planet and haven't seen it yet...\n\nReview:  @RickyGervais's After Life 2 is perfect ★★… Thanks to all your 10 Star reviews, #Afterlife is now the highest rated Netflix original comedy. Best fans in the world 🙏\nhttps://t.co/yn8icnPjYy @LouLou2109 😂 @youngman_neil I think someone made one for Spotify. #DogsWatchingAfterlife ❤️ https://t.co/gUrfRQzwjL RT @TheVersion: Congratulations to @rickygervais.\n\nReaders of https://t.co/Osc71VkWAC have voted #afterlife the Best TV show (on a streamin… @DanGWestern Forget the money, just look how great my hair looks! RT @AfterLife_Fans: “A man who is tired of the anus is tired of life” - Brian Gittins, #AfterLife\nhttps://t.co/GPnersvklJ @AndyHoment I just think its the richest world I've created so I can explore it more :) @EthanDLawrence @tonypaulway https://t.co/nRyng9ODUR @EthanDLawrence @tonypaulway This is like some weird fetish chatroom. @Baronbigbucks Cheers @EthanDLawrence @tonypaulway I wonder if you ate more cake than Tony ate rice puddings in #AfterLife. I promise. https://t.co/lc4AnifLS1 RT @dan_strzempka: Friends: Hey, did you see that English dude on the Golden Globes last night? He was a savage, that was hilarious!\n\nMe: Y… RT @katgsalex: @rickygervais Nala is a fan #AfterLife https://t.co/aYRzEaDO4h RT @Clark1995Clark: 15 years ago today, #Extras first aired. An absolute masterpiece. \n\nhttps://t.co/mjJ1T1dXDF @MontyGina 🙏 @SteveSpeirs4 https://t.co/LjlyMh54S8 Happy Birthday, Extras! 15 years old today. \nhttps://t.co/YRB4XgruJQ RT @rickygervais: Thanks for all your lovely tweets about #AfterLife still flooding in, particularly all of your own stories of grief and l… RT @rickygervais: Thanks for making #AfterLife the most watched British Comedy in the world again, and thanks to the millions who just disc… RT @UfitDrinks: Thank you so much for bringing this video to our attention. We are thrilled @rickygervais is a UFIT Crunchers fan and local… @rickshade Sounds great. RT @mijingue: @rickygervais thank you for this, we all enjoyed #AfterLife including my 2 #Germanshepherd  dogs https://t.co/nwRbrwg4kg RT @tv_libby: oooooooooooh\nIf Daddy drops my leash Brandy is getting kisses.  #AfterLife @rickygervais https://t.co/VihBYayxIt RT @RadishBrain: @rickygervais poor Charlie the Cockapoo getting all emotional about the final scenes, don't do it!!! #afterlife https://t.… @flicked46 We ARE animals. Great Apes, to be precise 🐵 RT @tv_libby: .@rickygervais is not the star of #AfterLife. https://t.co/Na1pF2xOiS RT @AustinMorrison_: Glad to have a dog that will sit and watch afterlife with me @rickygervais https://t.co/jyX7SlW3x8 RT @Nanske001: Whisper is watching Afterlife to see Brandy, as you can see his girlfriend Dita, in the background, looks a bit Jealous 😁 @r… RT @jimrobb: @rickygervais #AfterLife circa 1905 https://t.co/hkPLc7M3mE RT @AnneMartens: @rickygervais My \"Hunni\" (Doggy in danish) is in love (see the end)🐶 https://t.co/RQhf2YBh43 Dog watching #AfterLife? Instant Retweet. https://t.co/t9o14YD9Tw @htrob @JimNorton @jimandsamshow Certainly not surprised. @ylla999 🙏 @abetit Sorry for your loss. @petergardner50 Sponge I just mopped my bathroom floor. https://t.co/myuVG3lnrT @purbrooktony Half way through first drafts. Thanks for all your lovely tweets about #AfterLife still flooding in, particularly all of your own stories of grief and loss and how you identified with the themes of the show. Stay strong 🙏 https://t.co/htdjwW4Yd2 @jim73194352 @WeatherDog3 @meowitsjoey @themayhew I still love you Gunner! Thanks for making #AfterLife the most watched British Comedy in the world again, and thanks to the millions who just discovered #Derek because of it. The beauty of Netflix. \nDog Bless you. https://t.co/o6khNaPnso @eg_emmie Exactly. @aritaurius Nope. Evolution is a fact. It happened. It's still happening. The \"theory\" refers to the mechanism of how it happens i.e. natural selection :) https://t.co/njezBC4Rpg RT @RyanFarmer12: @rickygervais Evelution can be argued @BioHJM @KristiansBrain I was being sarcastic. @michaelianblack You look great, Michael. In MY opinion. @sabrina_marengo Doubtful. Not sure yet though. Life's amazing and then you die. Have a great day! https://t.co/UE4H528eDP @rickshade Where should I explore the evidence of creation? If you want to deny something, don't choose stuff like The Holocaust, Evolution, the shape of planets or Biology. All the evidence will make you look stupid. Lots of people giving 'their' definition of free speech. Doesn't anyone 'google' any more? @KristiansBrain Good point. When we've all decided on exactly what constitutes hate speech we should ban it. @Jelle_Dijkstra Libel, slander, false advertising, fraud, food ingredients, incitement, etc, are taken care of under law. Many other caveats too for free speech :) @iainlee Did they type that with their feet? It's common now to mistake defending someone's right to say things, with agreeing with those things. If you don't support free speech for people who you disagree with, then you don't support free speech. And remember, it's your right not to listen and even say things back 👍 RT @BlondeMzungu: I don’t care who dies in #Afterlife series 3 but don’t even think about killing off the dog @rickygervais otherwise there… @FiGilg @NetflixIsAJoke https://t.co/8fE9vkAQWe @NetflixIsAJoke Eddie Murphy @Shmooshie I don’t know but I think it will be after Xmas now. They usually leave it to near the actual date to postpone. @DawnSpraggActor @ThisisRiverside Beautiful. RT @MyWildLove666: Started watching After Life last year when my husband was sick from liver disease, loved it but had to stop as it was hi… RT @firedonk: @rickygervais Dear Sir my wife and I have been binge watching Afterlife. To be very honest I think it is the best tv program… RT @Marathonswift: Well finally finished both seasons &amp; despite it being about grief and depression how refreshing to watch a show where ev… RT @ChrisJStratford: You are a cruel, heartless, vindictive b*stard @rickygervais for writing such a wonderfully witty, insightful, beautif… RT @MrJkDavid: Just getting round to watching After Life on Netflix. @rickygervais have never failed to make me laugh, but cry while laughi… RT @highelegance: @rickygervais 2 handkerchiefs needed during Among the Living #Afterlife.  You are a GENIUS Ricky!  The writing, the actin… RT @PonderinginLee: Ffs @rickygervais I should have known better than to watch the second half of #Afterlife S2 when I'm feeling a bit emot… RT @derdrache: “I drink in times of trouble. It’s not my fault the world’s full of trouble.” - Tony Johnson, After Life @rickygervais RT @bhushanrsalve: Just watched Afterlife\n@rickygervais you fat twat😍♥️\n\n-I’d rather live missing him than for him to live missing me🥺 @Michael_Buffer Depressing RT @JamesGillComedy: To encourage my two young girls to eat their food, I enthusiastically go: \"Yumma yumma yumma yumma!\" They must never k… @IMDb Angels with dirty faces. RT @Jaynesharp: Last night I finally plucked up the courage to watch After Life S2.\nCried so much that I woke up today with a face like a p… RT @Knowlesitall: @rickygervais #AfterLife is a masterpiece. That's it. That's the tweet. @SarahMillican75 By themselves immediately after I've left them. RT @shaminabegum10: Anyone want any fags bringing back? RT @TitaniaMcGrath: Cancel culture is a myth invented by fascists.\n\nIf you see anyone disagreeing with this statement, please send me their… @BethanyPorkPie Same, but it would be Prosecco. @woahrafferty Of course. @SarahMillican75 I leave them. But then I eat them. @Knowlesitall Thank you. RT @GoldDerby: Ricky Gervais (‘After Life’) on his ‘one big worry’ writing the Netflix comedy [Complete Interview Transcript] https://t.co/… RT @coleandersonJ: Go and get the guitar... @rickygervais #theoffice https://t.co/fnAvFz85Gr I love it when you argue. @Dorling83 I have no woe. I think this tweet aged pretty well 😇 https://t.co/lmeqiAMexf Last 24 hours to vote for #AfterLife! https://t.co/7WzriXHJxo RT @colbertlateshow: “It would be me running around playing with dogs...like a Disney movie.” - @rickygervais on what his heaven would look… RT @SFSketchfest: Now available! In this @SFSketchfest Tribute, @RickyGervais sat down with friend and fellow comedy icon Christopher Guest… @ventriloquist29 Can't you just cut and paste all my tweets? @Pauline_Walsh @McAllisterDen I'm more likely to call out for dog :) @McAllisterDen @VonHamburger Whatever your reason is for loving and respecting people is fine by me. Have a great day. @McAllisterDen Let's agree to disagree then :) @McAllisterDen @VonHamburger Yes we are human. I don't believe in any god but I don't think people who do are lesser people. We're all different and should be judged on our actions not our beliefs. @McAllisterDen So you're saying it's more reasonable to believe in something without proof than to not believe in something without proof? I think you're using the word \"reasonable\" to mean \"common\". @VonHamburger @McAllisterDen That's true of all the gods then. @McAllisterDen You can't disprove theism. It's a faith. And you can't disprove the non existence of something however improbable. Gods, fairies, Santa...they might all exist. All you can say is, that until their existence is proved, you don't believe in them :) @MaggieKBW @J_Larkin21 Go for it 👍 RT @JosephConners: I'm late to the party but I've just finished 'After Life' season 1, written by @rickygervais\n\nThankyou for continually,… @IainMacaulay15 Very doubtful I'm afraid. Vote for #AfterLife if you like 🙏 https://t.co/7WzriXHJxo RT @coleandersonJ: First dates after lockdown @rickygervais #theoffice #dating https://t.co/UB2v1zWBMO @DMaxiCoupland @MirrorCeleb Thank you. Yes it's a shame clickbait always has to be so negative. @guy_boster Thanks. Let me know what they say. @Mikeyboi9 👍 @phillassman1 @BrewDog @AllDogsMatter 🥳 happy birthday 🥳 @Clark1995Clark I have absolutely no chance. Just having fun 😇 Dear Hollywood, It's the last day of Emmy voting. Please vote for me. Also, stop being overprivileged perverts. Thanks. https://t.co/SWezHjT7xC @ventriloquist29 @LondonPalladium No idea yet. RT @PenFarthing: Cheers @BrewDog and thank you @rickygervais I could murder a pint!! Sadly though no post to get any to Kabul 😫 Truly thoug… RT @theactorgenie: Who better than @RickyGervais to show us #death with a sense of #comedy in #Afterlife on @Netflix. Get this man another… RT @BrewDogJames: Standard celeb endorsements tend to feel like disingenuous money grabs.\n \nBut @rickygervais may just have came up with a… RT @AllDogsMatter: What a wonderful surprise this Monday. Thanks so much @BrewDog! ♥️ And thanks to our fab ambassador @rickygervais ✨ http… @noseypeg Can't remember but probably Teddington area. RT @Nowzad: @BrewDog @AllDogsMatter @AnimalsAsia @Paws2RescueUK @rickygervais Thank you for this wonderful gesture! \nIt will make a big dif… RT @BrewDog: We didn’t have to pay for this publicity so we donated money to these charities instead \n@Nowzad @AllDogsMatter @AnimalsAsia @… @MissJoHartley @NetflixUK Isn’t it amazing! RT @Paws2RescueUK: Cheers @rickygervais hope you enjoyed your @BrewDog  and thank you for your support of our work in Romania. https://t.co… RT @BrewDogDave: Thanks @rickygervais!! We will be making a donation to all of the charities listed to say thanks for the support and shout… Amazing. Thank You. https://t.co/i3nB3YcGxF RT @BrewDogJames: Thanks for the brilliant feedback @rickygervais 🙂\n\nMy co-founder Martin &amp; I are massive fans &amp; we saw you live in Glasgow… RT @olliecomicstrip: Dear @BrewDog. You can’t buy publicity like this but you can donate the money to a charity - like @Nowzad, @AllDogsMat… https://t.co/WAudBuDhl8 RT @coleandersonJ: Mr. Toad, I can’t... @rickygervais #theoffice https://t.co/wigjxLCqQD @WeatherDog3 @JaneFallon amazing RT @Clark1995Clark: @rickygervais “We’re great apes.” #SundayThoughts https://t.co/Pbjqdka6Gg @WeatherDog3 Idiot @GrantSEASONS No but it looks doubtful. Really not sure. Have a great day, my fellow apes. https://t.co/eFMjsEbLDu @raiofsunshine21 🤦‍♂️ @purbrooktony Only deface that statue if the crab was a racist. RT @VonBze: @rickygervais I hated everything you did until Afterlife RT @timesradio: \"It was about all the things people fear to talk about now in case they say the wrong thing and are cancelled.\"\n\nOn the 19t… RT @coleandersonJ: Richard Blackwood @rickygervais #theoffice #19years https://t.co/UavSFF0ORU @MissJoHartley \"If you choose a job you love, you'll never have to work a day in your life\" And yet I just had to cut my own hair with a pair of nail scissors. https://t.co/myuVG3lnrT RT @Clark1995Clark: For your consideration: @rickygervais for Outstanding Lead Actor in a Comedy Series. #AfterLife2\n\n#EmmyCampaign #EmmyFo… RT @rickygervais: Happy Birthday to my little Ollie who would have been 17 today 💔 https://t.co/AwGoKyEmoX 19 years today since David Brent hit our screens. So glad you remembered to thank him. And remember, Live Fast, Die Old. https://t.co/aG7795rr2j @boydhilton 🙏 https://t.co/NPAZKOyYtj @18ocram Yep. Ollie was 100% inside. RT @AfterLife_Fans: I’m not crying, you are! #AfterLife2 https://t.co/gT4LRWnnvg RT @DavidBrentMovie: And of course, The Office introduced us to the art of @rickygervais outtakes. Scroll down this thread to watch 👇 #Bren… RT @DavidBrentMovie: David Brent gave us an iconic song and 19 years later we still know all the words and still know exactly when to say “… RT @DavidBrentMovie: Give him credit, Neil was the first to clap. RT @DavidBrentMovie: 19 years ago today we all met David Brent. Here’s the opening scene to #TheOffice Series 1, Episode 1. #Brent19 https:… RT @kerryfowler_: We met David Brent 19 years ago today. What a journey it's been. \n\n@rickygervais #DavidBrent https://t.co/JPo4BaVd7H RT @Clark1995Clark: 19 years ago today, the greatest TV show began and comedy changed forever. \n\n#TheOffice #Brent19 @rickygervais https://… RT @coleandersonJ: Des’ree, the Philosopher.. @rickygervais @DavidBrent #theoffice https://t.co/IXKzd2KYem RT @ladbible: Cheers for one of the greatest sitcoms of all time @rickygervais. \n\nNot why you did it but thanks. https://t.co/fMRdcT6sh1 RT @DavidBrentMovie: And, as is now an annual tradition, here is the first review of #TheOffice: “A summer stinker: A bore in homeopathic d… Happy Birthday to my little Ollie who would have been 17 today 💔 https://t.co/AwGoKyEmoX RT @BBCArchive: #OTD 2001: The first episode of 'The Office' was screened on BBC Two. https://t.co/dc2WTKnHP0 RT @NetflixUK: 19 years ago today, @rickygervais https://t.co/zEPBYJvxh8 RT @rickygervais: This was 4 years ago when people thought I was just being rude 😆 https://t.co/af7g3Z6Aol RT @TVChoice: Which of these hilarious shows gets your vote for BEST COMEDY in the 2020 #tvchoiceawards shortlist?\nCLICK HERE TO VOTE NOW!… Sophie's Choice: The Single Years. https://t.co/xahDRPbS0K @tobyfoster Did you keep the costume? @applenessuk I nearly did one because I miss them too 😇 This was 4 years ago when people thought I was just being rude 😆 https://t.co/af7g3Z6Aol https://t.co/tSOZ27z1Mi RT @meowitsjoey: I just voted for @rickygervais #AfterLife in the @TVChoice awards! I’m a clever boy... get voting everyone, it’s easy! \n\n1… RT @coleandersonJ: Proving you’re not a racist in 2020 @rickygervais #extras https://t.co/NkBn8LtieT RT @AfterLife_Fans: Tag anyone you know called Simon 😂 #AfterLife2 https://t.co/Bv3Qim5chz RT @GoldDerby: 2020 Emmy Awards nominations ballot: See the 111 Best Comedy Series hopefuls from A (‘After Life’) to Z (‘Zoey’s Extraordina… RT @Clark1995Clark: Go vote @rickygervais’ #AfterLife2 for Best Comedy in this year’s @TVChoice Awards: \n\nhttps://t.co/S4fY0awI6r\n\n https:/… RT @DailyMirror: . @rickygervais backs #FurFreeBritain campaign and slams UK's fur trade 'hypocrisy' as foxes 'beaten or electrocuted' - wi… RT @ConwayShow: https://t.co/3eA8Ov4W71 @rickygervais @MarkTLive @KFIAM640 @netflix @iHeartRadio https://t.co/FehYHqkmtC RT @TVChoice: Shortlist voting for the 2020 #tvchoiceawards is NOW OPEN! \nEach day we’ll be revealing who’s made the cut in each category.… RT @pitt_roche: HMU ⁦@rickygervais⁩ I wanna talk Afterlife, Golden Globes and doggiessssss 🐶✨ https://t.co/1shD7HmBuj It’s Emmy Voting week! So if you’re an Emmy Member, and you’re not a pedo, please vote for me for Best Actor in a Comedy. Thanks. https://t.co/XoMwNcfEyr @WeatherDog3 I do believe some people are kind and others are not, so in that sense I believe there are good 'souls' in the world. But not literally. @WeatherDog3 I don't believe in anything supernatural, so a soul existing independently of our mortal existence is not something I think is likely, no. RT @AfterLife_Fans: Knock knock.... #AfterLife2 https://t.co/1Iz383EBHz RT @AfterLife_Fans: For your consideration: #AfterLife2 #EmmyAwards https://t.co/q8AeXh02q0 RT @msanonymousme: Emmy voting has begun and @rickygervais is quite literally the most stunning and brilliant actor, writer and director co… @MooskelTomTom @TheEmmys Beautiful. @skcomedy @REDROMINA Italian-American ex serviceman is sucked into taking over his father's olive oil importing business. @Unnamedinsider @tonypaulway I used to eat truffle and Parmesan mash. @tonypaulway Mash, obviously. @WeatherDog3 Go to bed. @Knowlesy25 Which one? @makhzoom13 Hahaha @BiffenGerry I used to have faith. So I think I get the gist of it :) https://t.co/JAje1L5WsP If Earth were a smaller planet, I wouldn’t weigh so much. So it’s not really my fault. https://t.co/iltohNyPnJ The UK last night. https://t.co/ndpF3DmQmO Have a great day. https://t.co/tLNokukkTv RT @rickygervais: Please stop saying \"You can't joke about anything anymore\". You can. You can joke about whatever the fuck you like. And s… RT @THR: Comedian @rickygervais says it's an occupational hazard that some people won't get his humor: \"That someone might take you at face… @mmatthewswriter Then there would be. RT @rickygervais: #Humanity now streaming on Netflix https://t.co/xcbxenxy7G RT @creativeppl_pod: \"It's better to create something that others criticize than to create nothing and criticize others.\" - Ricky Gervais #… I wish all theological discussions could be this nice. https://t.co/Cruk9q1Ztj RT @ScarlettBeagle: @rickygervais \"Thank you for celebrating the lives of us dogs @rickygervais. You are the kindest best dog-person, thank… RT @Protect_Wldlife: \"How can anyone abandon a beautiful loyal dog? It's not an accessory. It's your best friend\" @RickyGervais.\n\nWhen you… RT @marcthevet: Massive thanks again @rickygervais for supporting this important campaign to ban sick puppies imported into the UK from ove… RT @WeatherDog3: Whoever is in charge @TheEmmys #Emmys2020 then you better make sure you give my Uncle @rickygervais an award for the best… RT @usagihoes: There is something unique about this show that crushes your soul from crying but you are also laughing because reality hits… RT @kellieconforth: @rickygervais @rickygervais deserves to win the #Emmy for his performance in #AfterLife...and for writing...and directi… RT @verissimoallan: For Your Consideration: Ricky Gervais as Tony in \"After Life\" for Outstanding Lead Actor In A Comedy Series at the 2020… RT @Paul_Berney: Why is there an Emmy campaign for Ricky Gervais and After Life? Surely there's many wins in the bag? I don't like most new… RT @britishtarts: Afterlife for an Emmy. I don’t think @rickygervais realizes the masterpiece he created. You saved me from severe grief .… RT @THESickoNicko: For your #Emmy consideration! Vote for @rickygervais' #AfterLife https://t.co/fWNWIOey16 RT @Clark1995Clark: The most relevant joke in the world today. \n\n@rickygervais \n\nhttps://t.co/z8fycdD47X RT @AfterLife_Fans: C U Next Tuesday! #AfterLife2 https://t.co/mVyBqKabPA https://t.co/0I2qPMB4JR Everyone involved in this is a cunt. https://t.co/G1wYJSGypY RT @DeadlineNY: The Film That Lit My Fuse: Ricky Gervais https://t.co/5xwVj2SGcn @coleandersonJ Haha. @meowitsjoey Any shows are being postponed as opposed to cancelled. RT @TonyBellew: The best comedian this country has ever produced! Finds laughter in every situation! Even in this series through loss there… RT @Jake_Kanter: Something for the weekend: our The Film That Lit My Fuse series. Screen stars on the movies that made them.\n\nHere, @rickyg… RT @Clark1995Clark: Emmy voting starts today.... \n\n#EmmyForAfterLife @rickygervais \n\nhttps://t.co/w1NyeHGWCv Why isn’t this in Braille? https://t.co/LrNavkpEEZ RT @meowitsjoey: If you’re an Emmy voter, vote for @rickygervais in #AfterLife because this Hampstead c*nt deserves to win! #Emmys2020 \n\n*R… RT @David_Hicks: Good luck @rickygervais #afterlife should win everything. Emmys. Grammys. Oscars. Brits. Olympics. Wimbledon. FA Cup. Boat… RT @FiGilg: @rickygervais #Emmys2020 https://t.co/k6iObackzS https://t.co/tX34DdPJMD RT @elliot_gonzalez: Looking for a show to binge over the weekend? Here are my 10 favourite TV shows since lockdown began, including #After… @lordfarmer @Independent They've been coming for me for 20 years mate. It's just that the 'they' has changed. @AndrewDuncanJo2 Only on email. @TonyBellew Thanks, man. https://t.co/EOwyCV3TIm RT @sagaftraFOUND: \"I don't have a process, I let thoughts come into my head. I try and make time for thoughts that I have no control over.… RT @heydudemeg: #AfterLife on @netflix is one of the best depictions of depression on TV. I talked to @rickygervais about writing, directin… RT @DEADLINE: .@rickygervais talks with us about his creative ambitions, formative influences and inspirations on this week's #TheFilmThatL… RT @GoldDerby: Ricky Gervais (‘After Life’): ‘It’s the most overtly grown-up and vulnerable I’ve been’ [EXCLUSIVE VIDEO INTERVIEW] https://… @WeatherDog3 Idiot @WeatherDog3 Yeah, maybe. @MrsG1674 yes RT @mikewarburton: “You’re not the only one”\n\nAFTER LIFE \n\nThis is what you call writing, and acting.\n\n@rickygervais and @MandiDhillon are… RT @olliecomicstrip: For your consideration @TheEmmys: \nOutstanding Corpsing in a Comedy Series - @rickygervais in #AfterLife2 ! https://t.… RT @dalbone1978: This is without a doubt the funniest 130 seconds on the internet to date ⁦@rickygervais⁩ #AfterLife2 https://t.co/BT1zwkBj… RT @THR: “What really annoys me is that people think that a joke is the window to the comedian's true soul. And it's just not true,” @Ricky… RT @THR: “That's the best time. When everyone's on edge and sensitive, that's the best time to be insensitive,” says @RickyGervais RT @netflix: In less than 60 seconds, After Life perfectly summarizes why it's so difficult to move on after losing a loved one https://t.c… Emmy Voting starts today. \nI don’t know who the fuck gets to vote, but vote for me you twats. #EmmyCampaign https://t.co/oofCOAryEa RT @kerryfowler_: It's just as easy to thank someone as it is to criticise them.\n\nI love Lisa's messages to Tony. But this is probably my f… RT @TelevisionAcad: Checking In With @rickygervais from #AfterLife (@Netflix) who discusses what makes him fall in love with a television s… https://t.co/EOwyCV3TIm RT @THR: Five of the funniest men on television spoke candidly about the politics of a punchline, relevance, and the role of comedy in this… @WeatherDog3 Happy Birthday Mrs Rupert! RT @rickygervais: Watch #AfterLife now streaming on Netflix around the world 🙏 https://t.co/8VeZmy178R RT @rickygervais: https://t.co/tSOZ27z1Mi RT @AfterLife_Fans: “I’ve seen fuck all. I may as well have been a tree” #AfterLife2 https://t.co/LpLVcMXMNH @WeatherDog3 Have a wee. https://t.co/D7nw2x8x5R @martingreaves1 Completely different. Only the title was the same. @PeterEgan6 @CBTHunting 🙏 RT @CBTHunting: The brilliant @rickygervais rightly says #trophyhunting is “Humanity at its worst”. It’s time to #GetTheBanDone . Retweet i… Life’s amazing &amp; then you die. https://t.co/sQ416PMm6E @MissJoHartley 😂 @ethnadun What’s even harder to understand is why you would follow someone who constantly uses a word that you find offensive. Watch #AfterLife now streaming on Netflix around the world 🙏 https://t.co/8VeZmy178R https://t.co/tSOZ27z1Mi I want to ban leaf blowers. Just fucking rake the leaves up, you lazy, noisy Cunt. Black &amp; White makes everything sexier. https://t.co/p5UvhgbEaa @TheRossOwenShow One of my favourite scenes Yes! We'll do our own Emmy Campaign 🙏 https://t.co/sdxtGR0xOx Thanks for all your lovely tweets about #AfterLife still flooding in, particularly all of your own stories of grief and loss and how you identified with the themes of the show. Stay strong 🙏 https://t.co/Me6JdXp1E6 I have no Emmy campaign for #AfterLife. No press ads, no billboards, nothing. I didn't have any of those things for the launch either, but fans of the show came through for me as usual and made it the most watched British comedy in the world. And that's better than any award. https://t.co/ajE55oPlcX RT @Independent: Ricky Gervais among stars urging Boris Johnson to help end exotic pet trade https://t.co/XyoO3RROVc @meowitsjoey Don't think so, as I've got to do all the ones that were postponed before I film Afterlife 3. RT @ScarlettBeagle: Thank you @EmmaLewellBuck MP for signing Parliamentary #EDM250, for a Govt. mandated hearing to stop false claims about… RT @marcthevet: NEW PETITION: 'Ban the exploitative import of young puppies for sale in UK' In light of the recent high profile case of 'Mr… RT @wolfetone98: @rickygervais 👇👇👇👇👇🤣#AfterLife #AfterLife2 https://t.co/jwtACFsOHj @TerrysTradeTips Love to @leeleeColegate I'd like it cancelled🤓 @ianwillis_86 25% there Thanks for all the 10 Star reviews for #Afterlife 🙏\nhttps://t.co/rFsdCzV90q https://t.co/sSuUKWxuWl @lisav44 @metalXmanga @DerekTVShow 👍 @PaterHumor You should certainly try. @mrscmway Yes https://t.co/xHuzMZLtiv @Coldwar_Steve Amazing RT @AfterLife_Fans: “I can’t understand a word you’re saying but I love watching you eat.”\n\nWatch #AfterLife Series 1 and 2 now on Netflix!… This was our last ever armpit snooze https://t.co/jVRTX2lppQ https://t.co/PyhmiIJhpK @shmolly_holly yes Just found this on my doorstep. I’m going to raise him as my own. https://t.co/5q8lH0jYHm RT @AfterLife_Fans: Retweet if you think #Afterlife should be up for an Emmy Award. Help us raise awareness! https://t.co/q1c2gUG7st RT @kerryfowler_: Imagine someone that you've only just met caring this much about your happiness. \n\nSandy fast became one of my favourite… RT @ladbible: .@rickygervais has never done a third series of any of his sitcoms before, so he's explained why he decided to do series thre… RT @elliot_gonzalez: With no new telly to recommend this week, I thought I’d do something different instead...\n\nSo here are my 10 best TV s… @Jackbythehedge1 @AfterLife_Fans 👍 RT @wolfetone98: \"Good people do things for other people.\"\n\nThis will forever be my favourite scene in @rickygervais's #AfterLife It's not… @wolfetone98 @TheEmmys @TelevisionAcad Brilliant. RT @wolfetone98: @rickygervais Here it is! Your #Emmys2020 campaign poster. @TheEmmys @TelevisionAcad #AfterLife #AfterLife2 #Emmys #EmmyAw… RT @mikewarburton: Cannot tell you how much I loved this scene from Season 2 of AFTER LIFE.\n\nAnnette Crosbie smashed it right out of the pa… @GrumpyOldRick @netflix 🙏 Balls waxed. https://t.co/MAq5yt6AAv @BerryHollyb303 yes Watch #Afterlife. Now streaming on @netflix around the world. It’s funny, sad, and it’s not very long. Just like life. https://t.co/lvDHTvTs83 @dennisschumach3 Easy. Number 3 👍 Art 😂 https://t.co/3K8eR5zHEX RT @purbrooktony: Let's get #BillyTheCunt trending! 🤣 https://t.co/lUx7nVZho4 @WeatherDog3 What was the question? You have to change your name by deed poll  to one of these. Which one? \n#BillyTheCunt #LongDongSilver #QuimmySavile #MichaelParkinBum #HaroldShitMum #TheNonce #JamieRedknapp https://t.co/juZCEJtjDc https://t.co/dMB74dIq5M RT @coleandersonJ: We’re gunna leave that there... @rickygervais @DavidBrentMovie #theoffice https://t.co/iEViXvHHwP @HolliDee 🙏 @PocketsWarhol Thanks, monkey friend 👍 RT @AnimalsAsia: Happy birthday to an absolute animal champion @rickygervais . Sending much love and big bear hugs from your moon bear fami… RT @DerekTVShow: A very happy birthday to @rickygervais! https://t.co/lFaLCDe99k RT @DavidBrentMovie: Happy birthday @rickygervais! Hope Jane made you a nice flan! https://t.co/cN07ML71ga RT @peta: Even while he’s making you laugh or cry, he’s always speaking up for what’s right.\n\nHappy birthday to the compassionate and hilar… @GSpellchecker 🙏 RT @HSIUKorg: Wishing a very happy birthday to our friend and HSI Cecil Award recipient @rickygervais 🦁 Thank you for always championing ki… RT @ScarlettBeagle: \"For my kindest human on this earth: Happy Birthday @rickygervais 🎉🍾🎂May your day be filled with dog happiness and joy!… RT @pupaid: Happy birthday to one of our favourite supporters, Mr @rickygervais! Thanks Ricky for all your incredible support of #LucysLaw… @officialroycey 🙏 RT @IAR_updates: Happy birthday @rickygervais on behalf of us all at @IAR_updates and the countless suffering animals you help us rescue an… RT @dotslondon: We’d like to wish @rickygervais a happy birthday! Thanks for all you do for dogs and other animals 🧡 https://t.co/FNOmdbyyGc RT @RSPCA_official: Happy bee-day to the one and only Ricky G! We and the animals are furever grateful for everything you do for us, and ho… @MandiDhillon 🙏 @purbrooktony I'm melting. @WeatherDog3 Haha. Thank's Haggis. RT @AllDogsMatter: Happy Birthday to the amazing ⁦@rickygervais⁩ from all of us here at ADM and enjoy whatever you do to celebrate 🥳🌈🐶 http… RT @Battersea_: We'd like to wish a very happy birthday to @rickygervais! 🎂🎉 Thank you for being a champion for animals in need, and for be… @boydhilton 👍 @PeterEgan6 🙏 RT @AnimalHeroAward: Happy birthday @rickygervais  - thank you for always being a great supporter of our awards and an amazing animal advoc… @TVamp1 👍 @tonypaulway https://t.co/ql3eLKMl41 RT @themayhew: We want to wish a very happy birthday to our friend @rickygervais! All of our animals are sending lots of virtual cuddles an… @PipTomson @JaneFallon 🙏 @spencermillman This is what happens when you put me and you in a blender... https://t.co/bdTMePxBXp Thanks for all your birthday wishes 🙏\nHere's a picture of me with the best gift I ever received 💔 https://t.co/9rwEj5EtW9 RT @allontheboard: Happy Birthday Ricky Gervais. Hope you have a marvellous day. @allontheboard \n\n#RickyGervais #HappyBirthdayRickyGervais… @Rappish_ @paulofcharsky @rolandfoodcourt \"Naughty But Nice\" @paulofcharsky @rolandfoodcourt That photo looks like when a boy band reunites for one last tour. @CathyGarside Brilliant! @elliot_gonzalez @JaneFallon 🙏 @meowitsjoey @BiologyLorna Brilliant! RT @NickyAACampbell: Latest edition of my podcast #oneofthefamily. ‘Making the case for cats’ with @rickygervais. His life with cats and do… @PETAUK 🙏 RT @JoyceCarolOates: remarkable that Ricky Gervais in low-key comedy-drama \"After Life\" can take up issues of grief, depression, suicide so… @purbrooktony Toast Town https://t.co/dfzTKeQRiu @ampleartistry I think a Turner-esque palette would be nice. @nikkibedi @TheOliverStone @bbcworldservice Wall Street is the best film of the 80s. Have you started designing my Emmy campaign poster yet? \n\"For Your Emmy Consideration. Outstanding Lead Actor in a Comedy Series.  Ricky Gervais #AfterLife\" \nPop a little photo on it you like. Up to you. https://t.co/n1MS3ynzpo @craig_hj Your mum is shit. RT @Clark1995Clark: The scene that could NEVER be finished. #Derek @rickygervais \n\nhttps://t.co/0lx2YJsUce https://t.co/mVgAmQHSYa @mikepjazz Very optimistic hashtag 😂 @matthewcrosby “I’m not saying these two ladies were fat, but 88” RT @coleandersonJ: It’s Red Nose Day!? @rickygervais @DavidBrentMovie #theoffice https://t.co/a5lZ6kAsEV @MoFiyaDubz Damn You have to have one of these tattooed on your neck. \nWhich one? \nFannytastic, Minge &amp; Bracket, Clitoris Allsorts, AIDS, \nQueermint Rhino, Billy The Cunt, Harold Shitmum, Cock Smuggler,  Dick Licker, Your Mum's Shit, Bone Alone, Quimmy Savile, Michael Parkinbum, Jamie Redknapp. https://t.co/qYarB7Hdda @JoyceCarolOates Thank you so much 🙏 RT @kayleighorviss: Dads heat sensitive mug I got him made for Fathers Day 👍🏼 #afterlife @rickygervais he didn’t expect that 😅 https://t.co… @BenA64731998 The characters &amp; themes. And the dog. Thanks for all your lovely tweets about #AfterLife still flooding in, particularly all of your own stories of grief and loss and how you identified with the themes of the show. Stay strong 🙏 https://t.co/hJfdvknkke RT @richardmarx: Catching up on @rickygervais ‘ brilliant “After Life” season 2 and there’s Luther singing “So Amazing.” Kinda wrecked me.… @MykJam @piersmorgan I'm training him. When he's nice I give him a treat. @8L3XWC @JoyceCarolOates ✌️ RT @ArnasFederman: There's no actual DNA proof that Kjartan was Sihtric's real father... I'm conviced it must've been Rickjartan @rickygerv… @8L3XWC @JoyceCarolOates - Entitled person murders someone for gain. \n- Columbo works out how they did it. RT @elizabutter909: AHHHH THIS IS THE BEST DAY OF MY LIFE!!! The absolute genius and legend that is @rickygervais is a huuuuge fan of @TheL… 🙏 https://t.co/usBi7e4Zh1 😂 https://t.co/bwbXmpVWrg 🍻 https://t.co/xehVvZQ5vX @BeckJeppe 🍻 @JoyceCarolOates Thank you. RT @JoyceCarolOates: much moved by Ricky Gervais's \"After Life\"--low-keyed comedy of grieving, loss; \"coping\" when there remains no (eviden… RT @coleandersonJ: Makes you think, don’t it... @rickygervais #afterlife https://t.co/jW5nOHdCd2 @thisisacrapname @mohammed_hijab He believes in a god. I don't. It really is that simple and there is no point in further discussion. I wish him well :) RT @TonyBellew: Afterlife 2 was brilliant!! Funny, sad and just nuts at times! Well done @rickygervais 👏👏 @TonyBellew Thank you 🙏 @SFB2009 IPA @Clark1995Clark @TheLastKingdom 3 weeks? @DanGWestern And I'm leaving it all to animals. https://t.co/I19Zq7Epwt RT @rickygervais: @TheTweetOfGod Don't take it personally. I look down on all you gods equally. In fact, if I'm honest, you are probably my… RT @rickygervais: @TheTweetOfGod Why don't you send him down here again? Toughen him up a bit. Or is he still social distancing, like he's… RT @rickygervais: @TheTweetOfGod I get that. Look, you sent your only son, who was actually you, and you killed him (yourself) for a couple… @TheTweetOfGod I get that. Look, you sent your only son, who was actually you, and you killed him (yourself) for a couple of days and then returned him (you) to you (him) What more can you do? Happy Father’s Day. @TheTweetOfGod Why don't you send him down here again? Toughen him up a bit. Or is he still social distancing, like he's been doing for the past couple of thousand years? @TheTweetOfGod Don't take it personally. I look down on all you gods equally. In fact, if I'm honest, you are probably my favourite. Particularly in your first book before you went all 'woke'. @TheLastKingdom  Hurry up with the next season AND SEND ME TO VALHALLA! https://t.co/aEITmHiUSZ RT @awards_watch: Interview: Ricky Gervais (‘After Life’) digs deep about grief, honesty and Hollywood hypocrisy - https://t.co/KQDkyomyGC… RT @Clark1995Clark: The greatest moment in the history of Live television. 🔥 @rickygervais https://t.co/9LzLY9Zy2q RT @ScarlettBeagle: On #WorldDayForAnimalsInLaboratories please help @rickygervais call for a public scientific hearing, to end the false c… @tuppencetanner I don't even know what Parler is I'm afraid. RT @olliecomicstrip: Happy #FathersDay AND #PrideMonth ! \n#AfterLife @rickygervais https://t.co/hnkiXMeNrl RT @purbrooktony: Happy fathers day everyone. 😁 https://t.co/grjJFNevbv @DevRMaitra @msg_297 I'll die on the toilet. @we_are_atheism them Who needs FaceApp? https://t.co/qX8L2S8Se4 @WendyS1892 😁 RT @passeri_mazie: @wolfetone98 @rickygervais \"Mind you, if I were 20 years younger I think I could do better.\"😊 https://t.co/c3V23FVZKW RT @wolfetone98: @rickygervais @TelevisionAcad @TheEmmys Please make sure that @rickygervais's #AfterLife not only gets nominated but wins… RT @DTLackey: Officially campaigning for @rickygervais to be cast as the next Joker... #afterlife2 https://t.co/JoEPvAzWjq @SamanthaHayesL1 👍 @Inabarsomewhere It's about being lonely and isolated with no-one quite understanding your situation. @Bogart27 A large whiskey was sort of short hand for him not really wanting to be there. It's just the alcohol he wants, not the social drink. @taylorsimner @Clark1995Clark @NetflixUK 👍 RT @Clark1995Clark: 2020 may not be the best year but let’s be grateful we’ve still got @rickygervais. 😂 \n\nhttps://t.co/XK7fnm9RbE RT @wolfetone98: @rickygervais #AfterLife The Breast Milk Rice Puddings https://t.co/jBrSjy6O5G @ruth_tighe cheers @PaulGreenLaner thanks @SebastianJenn16 Doubt it but thank you 🙏 RT @wolfetone98: @rickygervais #AfterLife I May As Well Have Been A Tree! https://t.co/M942aoepnM RT @Clark1995Clark: RT if you think #AfterLife should be nominated for an Emmy Award. \n\n@TelevisionAcad @TheEmmys @rickygervais \n\n https://… RT @wolfetone98: @rickygervais #AfterLife Can I call you Dad? @MissJoHartley @tonypaulway @EthanDLawrence https://t.co/C0kcjnesLP @Catanzarite44 Tina and Amy are doing it, Torie. https://t.co/J63kinZKvi @Jonatha09789056 1. Aladdin Sane 2. Diamond Dogs 3. Ziggy Stardust 4.Young Americans RT @ScarlettBeagle: Dogs are the most precious thing in the world. They love us to the moon &amp; back.\n\nPlease tweet your MP in a comment on t… RT @CineroomTweets: #AfterLife2 has been out for over 6 weeks now, and the series still holds the viewers with its authentic writing and be… I've noticed every show has an Emmy Campaign apart from mine, so this tweet should sort that out. Vote for #AfterLife you fucking idiots. Please RT this to 1 billion Twitter accounts. Bound to reach a couple of Emmy Members. Cheers. https://t.co/m4yrPak4Ls RT @coleandersonJ: Yes you can, David @rickygervais @DavidBrentMovie #theoffice https://t.co/CptcsTDW6l @Chrispp007 It took a long time. @TheRossOwenShow Amazing. RT @TheEllenShow: I love it every time I get to talk to @RickyGervais. #BurningQuestions https://t.co/19eUJLaSqI @mikehughes86 I love a church window, yes. RT @awards_watch: Interview: Ricky Gervais (‘After Life’) digs deep about grief, honesty and Hollywood hypocrisy https://t.co/HUUUrbKQVx Best fans in the world 🙏 https://t.co/myuVG3lnrT @WeatherDog3 @netflix Brilliant. https://t.co/mxXblslLRo @KateRobbins 🙏 @Michael_Buffer 😄 @A2Porter Possibly my favourite line. @lope_anele Yeah I think some of the more normal moments get overlooked 🙏 @Dottiwilldo I think that's one of my favourite lines too 🙏 @HoneywoodSean I'm so glad someone picked up on that 😂 RT @Jamie_Dodger_: @rickygervais\n😁\n #RickyGervais #FaceApp https://t.co/7cEVH2V91l @newmanstings Haha. You actually took a selfie during the scene!!! 😂 https://t.co/V8o6VNs3aD @rockapepolitics But easier if you don't give a fuck :) @gary21095307 never As I write season 3, tell me your favourite quotes, scenes and characters from the first 2 seasons. Use #AfterLife so I can find them all. @keiths47 Haha. About 15 @IAR_updates Will do. Thanks for all your lovely tweets about #AfterLife still flooding in, particularly all of your own stories of grief and loss and how you identified with the themes of the show. Stay strong 🙏 https://t.co/XRiQXZe5uG RT @coleandersonJ: Ian Botham @rickygervais @DavidBrentMovie #theoffice https://t.co/KkCM9e70mq @OllieHand I was indeed. Thanks for making #AfterLife the most watched British Comedy in the world again, and thanks to the millions who just discovered #Derek because of it. The beauty of Netflix. https://t.co/mdtlgnglis @JohnHall001 Brewdog RT @latimes: #AfterLife's @Rickygervais says its underlying ideas about grief click with viewers during the pandemic because “people have h… @bykle_molton IPA @angwelz Think it's ep 6, no? https://t.co/UMeQdEQOxL @LowCompetence Grizzly. Unless the gorilla has a gun like in “planet of the apes. “ @Southrngirl77 Right here. The year started off so well. https://t.co/NuqoVfByt4 RT @coleandersonJ: Yateley... WINNERSH @rickygervais @DavidBrentMovie #theoffice https://t.co/tqWHlONF64 @michaelianblack It started off pretty well.. https://t.co/G7HDK0iVpx @Olive_Cummings A joke. @Jules16th @netflix Sorry for your loss. @Adam4600 No worries. @michaelianblack @MJMcKean I was including it in science. @MJMcKean Yes, music is the greatest art form but I wanted to give the others a little inclusion so I kept it vague. @Adam4600 But back to my original question, why do you assume that is all I've donated? @MaryDon03175158 @MJMcKean Yes and yes. The Arts Hour features #AfterLife. \nListen: https://t.co/wVtbPkwidK @MJMcKean Agreed. Completing the top 5 are language, science, art and wine. @Adam4600 Why do you think I only donate one percent of my net worth to charity? Do you hate the truth? I always feel sorry for the horses at these protests. I would like to suggest the use of armoured rhinos instead. @Dr4M4_N3RD 6pm @BikeMillman @balmediecats @dannywallace @GeoffLloyd You've just drawn a baby though. @architectom89 You might be right. All we have to do now is decide who decides what's offensive and what isn't 👍 @WeatherDog3 @Baddiel Fucking hell 😮 @Baddiel 👏 @Baddiel I'm very disappointed in you David. The First Few Minutes of #AfterLife2 @Netflix https://t.co/4v6yvP1Ht2 @dannywallace @GeoffLloyd (This is probably why I was kicked out of the Fire Brigade) @dannywallace @GeoffLloyd There's no baby there. It must be a joke. @joeheenan @JonathanPieNews haha RT @JaneyGodley: Thanks @rickygervais explaining wankers on twitter  https://t.co/2zU9QZgoi9 @architectom89 And the same with books? RT @coleandersonJ: Very interesting points... @rickygervais @DavidBrentMovie #theoffice https://t.co/cvMKJTzVMJ @robertlicuria @GoldDerby My pleasure 🙏 @Stevoo7 @JohnCleese Can they take the money back? https://t.co/CxsUmOu7Sz RT @LauraSpanbauer: @rickygervais something I put up for my teenage kids to remember. Simple and clear. #Afterlife https://t.co/Q4PisASueq https://t.co/dfzTKeQRiu RT @mariecurieuk: “With the complexities of grief rarely shown through the lens of a male protagonist, #AfterLife helps shift the dial on r… This GIF might come in handy. https://t.co/wco1A6XtT3 Terrible lack of diversity in this video. https://t.co/TY7zZGVcjd Vote for #AfterLife to win another award 👍https://t.co/y5T3p16CN1 RT @rickygervais: Thanks for making #AfterLife the most watched British Comedy in the world again, and thanks to the millions who just disc… RT @rickygervais: Watch #Afterlife. Now streaming on @netflix around the world. It’s funny, sad, and it’s not very long. Just like life. ht… https://t.co/fO4GMedchi RT @coleandersonJ: And that’s CRUFTS... @rickygervais @DavidBrentMovie #theoffice https://t.co/9QWgMI3Hqb RT @PeterEgan6: Thank you @rickygervais for always fighting the good fight for always giving your voice to the voiceless and for your amazi… @PeterEgan6 @ScarlettBeagle 🙏 @PeterEgan6 @CBTHunting Depressing. @IngramBilly great fun 👍 RT @robertlicuria: In @rickygervais’ moving and hilarious #AfterLife2 on @netflix, he gives us an unvarnished exploration of a man sufferin… RT @mariecurieuk: .@NetflixUK #AfterLife by @rickygervais tackles some tricky subject matter, including grief. \n\nWe recently joined cast me… RT @K9Magazine: #throwback Two years ago @rickygervais met @ScarlettBeagle for a photoshoot for our cover.  Scarlett was rescued from an an… RT @joannatweetweet: After designing and writing about his own one-eyed creature, Noah read about more crazy Flanimals, as described by Ric… Stupid cunts. https://t.co/DD5hmg6PoY RT @b_arry_: “Humanity”- the best stand up comedy I’ve ever seen. A must watch presented by @rickygervais. Absolutely hilarious and worth w… RT @RitaKdv: @rickygervais @netflix My father had cancer, my mum had cancer, my older brother had cancer, my husband had cancer and recentl… RT @cxaxbxa: @rickygervais I’ve been watching Derek today for the first time. It was great seeing all the same cast as After Life, is there… RT @TheVersion: . @RickyGervais leads the winners in The Version's Lockdown Awards!\n\nFull details and winners list at https://t.co/Osc71VkW… @IAMKEVBISH 👍 RT @theCALMzone: With #AfterLife, @rickygervais has created a very funny show that also captures real grief.\n\nSo we thought it was a great… @IAMKEVBISH You look strong but understanding, with great hair. Like Jesus, if he lived in Brighton. RT @timesredbox: TV show After Life taught me to have a ‘be more Tony’ approach to mental health, writes @MrJonnyBenjamin https://t.co/uHTZ… RT @bbcworldservice: \"I'm only a risk-taker because so many people don't take risks\" \n\nComedian @rickygervais on his latest comedy drama Af… @YOdanny_boy It wont be cancelled, it will be postponed :) RT @LeeCaLTrading: Great song but every time I hear it, I always think of \n@rickygervais Afterlife \"Pedo\" scene😂 https://t.co/VO0ZaBrWyU @AnimalSprint All 3 were fun. I think Derek was the most pure fun on set. After Life was a joy too but was more ambitious so it was only 90% silliness. RT @mailplus: Ricky Gervais's dark comedy on love and death is just heaven - and how I was charmed by an unlikely tale of a ten-year-old Na… @olliecomicstrip @gillinghamjoe Haha. I missed that one because of my eyesight. Just as well. https://t.co/JQ3Pr2QqAI @purbrooktony Yeah. Crazy. RT @nikkibedi: On this week’s @bbcworldservice Arts Hour I’m in conversation with writer, actor, director &amp; comedian @rickygervais &amp; the wo… RT @RebelWilson: Wow @rickygervais was really moved by this series and thought it was brilliant 💕 https://t.co/Hem5GRxM53 @RebelWilson 🙏 Watch #Afterlife. Now streaming on @netflix around the world. It’s funny, sad, and it’s not very long. Just like life. https://t.co/L5EFijPIWa Because you are the best fans in the world 🙏 https://t.co/myuVG3lnrT RT @jamesmullinger: The funniest scene in any sitcom this decade is also responsible for the funniest collection of outtakes ever. Have wat… @gilesgate No but it seems like it. RT @kerryfowler_: At a time when things might be getting you down. Remember Kev's first rule.\n\n@rickygervais #Derek https://t.co/4IDbqFKxDw RT @coleandersonJ: Another one 🤷🏼‍♀️ @rickygervais @DavidBrentMovie #theoffice https://t.co/TSqvZhYjSq RT @LimerickGerry: If you're recently new to @rickygervais and enjoyed #AfterLife #AfterLife2 I highly recommend watching #Derek. I'm a fan… @meowitsjoey If the script is good enough then I can cry quite easy. And yes, always get it in one take. After a good cry you feel better so you can't do a second. @Tommy7756 @WealthyGorilla I wanna use that as my passport photo. @Clark1995Clark The Last Kingdom @EmmaJoy14617816 FFS 🤦‍♂️ @richo_johnson Of course! https://t.co/8dUdqUdmw4 A Candid Conversation About Mental Health and Grief #AfterLife https://t.co/JwmyFThm9v RT @timesredbox: TV show After Life taught me to have a ‘be more Tony’ approach to mental health, writes @MrJonnyBenjamin https://t.co/uHTZ… RT @charlietantrum: Tom Basden and @MandiDhillon join @mariecurieuk &amp; @theCALMzone in - A Candid Conversation About Mental Health and Grief… @coleandersonJ 👍 @hamptonbaglady Don't know yet. @hanna_28 Sorry for you loss. @connorblades13 Don't know. RT @N1ckPayne: I'm totally with everyone who's been saying how much they've enjoyed #AfterLife with @rickygervais - I loved both seasons -… RT @SusieHope7: @rickygervais I lost my sister, and my beautiful special mum to terminal cancer and most recently my therapist in fur dog s… RT @mariuszgregory: @rickygervais I have Cystic Fibrosis and I’m on the active transplant list for a double lung transplant. So After Life… RT @SophieJovi: Watched all 6 episodes of #AfterLife Season 2 over the last couple days. Tremendous writing once again by @rickygervais. He… RT @BenjaminJJ03: Bedtime reading tonight with my 3 year old. He was belly laughing so much, with every turn of the page each monster was g… RT @coleandersonJ: @rickygervais #theoffice https://t.co/9cSFmV7bDl RT @fcompanionsouth: 'Grief is not a narrative; it is the silent madness that numbs a narrative into submission.' - Here's a look at @reelr… @TheJudyCollins 🙏 RT @TheJudyCollins: as a person who has suffered loss.. #Afterlife presents the brutal reality with humor and addresses the healing process… @PaulCol21722350 I don't know. @dalbone1978 These all sound like racehorse names. Thanks for all your lovely tweets about #AfterLife still flooding in, particularly all of your own stories of grief and loss and how you identified with the themes of the show. Stay strong 🙏 @luvmetendr Almost certainly. RT @methejulie: Just finished #AfterLife2 Ffs @rickygervais I’m balling like a fucking newborn RT @_MrP_89: #AfterLife needs to be seen by everyone! Grief and heartache portrayed exactly how it needs to be, in its truest form. I'm abs… RT @twelvebears: @rickygervais just binged watched Afterlife 2. You are an evil genius. Brought back so many thoughts and feelings about my… RT @Daydreams1812: Just watched the end of After Life season 2. Had me in tears. Beautifully written and acted. And I love that Tony had a… @Crispy_Crayon Always was Walker's cheese and onion. https://t.co/kIsQ0wP608 @FacileTalk I want to show the world I can annoy people in other ways. @1019caveman Amazing @petebuzz69 Aches and pains. @flamingfeline Ken Dodd @Woodspossee 😡 https://t.co/iAUGiFdI9G @WeatherDog3 @olliecomicstrip You look like a duffle bag. @purbrooktony I never bar all the strings. It hurts. https://t.co/WajuOrNypU RT @thebigissue: Our new digital edition is here! Featuring #AfterLife’s @rickygervais on the cover, and interviews with Warwick Thornton a… @BAFTA @KrishMajumdar Congrats, Krish. @lucystonenow Sorry for your loss. @S1linerM Probably less than an hour a day in lots of little bursts. I let my brain relax and it lets stuff in. RT @archerhocks: @rickygervais  Think my wife is just about to pass out after the line \"you dumpy little cunt\" 🤣🤣 RT @HillChar: “I’m fascinated with the anus. Always have been, always will be. The man who is tired of the anus, is tired of life.”\n- if th… RT @LeeLuu32: @rickygervais “I’m not well but I remember what it was like to be normal so I do an impression of that” - I felt exposed..I h… RT @CineroomTweets: #AfterLife2 has been out for 6 weeks now, and the series still holds the viewers with its authentic writing and beautif… @meowitsjoey Pop star (failed), Cleaner, pub DJ, receptionist, assistant events manager &amp; then events manager. @WeatherDog3 This coming from a creature who has more difficulty with stairs than a Dalek. RT @SES6521: I watched the final episode of #AfterLife2 last night. @rickygervais has us rooting for every character. I wish we were all mo… https://t.co/WajuOrNypU RT @AnitaEmilio: Loving #AfterLife2 but my husband is now filming me so he has video for when I die first. Thanks a lot @rickygervais RT @Paranoid_Nerd: Me and my friends are currently watching #AfterLife2. We discuss every episode which usually ends in sharing our own pro… RT @MancSel: @rickygervais I’m studying to be a counsellor and I’ve recommended #AfterLife to everyone in my class. I’m 99.9% sure it will… RT @TheVersion: Vote for your favourite subscription TV show on our Lockdown Awards at https://t.co/AMNX7hAfp9\n\nCongratulations to our nomi… RT @TheVersion: Vote for your lockdown legend in our Lockdown Awards at https://t.co/AMNX7hAfp9\n\nCongratulations to our nominees:\n\n@thebody… @damnfinelad Can he be sitting down? https://t.co/CccfWKnG5n RT @olliecomicstrip: For your consideration @TheEmmys: \n@rickygervais in #AfterLife2. https://t.co/zDfuwlUUy0 RT @NetflixUK: *checks to see if this moment is just as brutal one month on*\n\nOh, yep. Good. Thanks @rickygervais. https://t.co/113rcUAuhG https://t.co/F8l3IQeu7u Thanks for all your lovely tweets about #AfterLife still flooding in, and thanks for telling your friends. Word of mouth is better than any ad campaign. Best fans in the world 🙏 https://t.co/b1ndzcRvjy RT @pinkvilla: From dark humour to life lessons, here’s why #RickyGervais’ comedy series #AfterLife should be your #quarantine binge watch.… @WeatherDog3 I guess when I first went to the Golden Globes and saw Jack Nicolson, Clint Eastwood, Al Pacino and Sophia Loren just wondering around, it felt a little surreal, yeah. Another great video essay on #Afterlife https://t.co/dfqZvjEMlQ RT @sinclairclarion: #AfterLife is a clever concoction of comedy and drama and illustrates the ability of Ricky Gervais as a writer and per… @MissJoHartley Yeah. Water used to drip from the ceiling. @MissJoHartley Pure Alan Bennet-  \"My mum used to wash my hair in the sink downstairs, as I lay on the ironing board\" 😂 @Val166 yep Here's that charity thing I mentioned 🙏https://t.co/z0NSOSudYk https://t.co/0WkCGema4q https://t.co/YME4Q3GWE9 @MickP1964 Beautiful. https://t.co/WajuOrvX1k https://t.co/e5DPtNzPYk RT @TheVersion: Vote for your favourite subscription TV show on our Lockdown Awards at https://t.co/AMNX7hAfp9\n\nCongratulations to our nomi… @tonypaulway @EthanDLawrence Mine is probably reading poetry, charity work and reflecting on humanity. https://t.co/e5DPtNRrmU @ritchieguy @davethomasjnr Into White was my very first thought! @hotplinth @davethomasjnr Full title is 'A heart in New York'\nhttps://t.co/eEm4S2Pw3C @davethomasjnr New York by Simon &amp; Garfunkel \nLilywhite by Cat Stevens\nIf These Old Walls could speak by Jimmy Webb @tracytaylor624 👍 @FacileTalk I am Ricky's Butler and he feeds me well if I do a good job. Thanks for making #AfterLife the most watched British Comedy in the world again, and thanks to the millions who just discovered #Derek because of it. The beauty of Netflix. https://t.co/V1nlv76QTa RT @TheVersion: Vote for your favourite subscription TV show on our Lockdown Awards at https://t.co/AMNX7hAfp9\n\nCongratulations to our nomi… @Rasputi85364647 Worst Boy Band ever. @richardkoscher Apparently. RT @wildlifeaid: Thanks so much for the shoutout and kind words @rickygervais! So grateful that you and @JaneFallon are patrons! We have th… @WeatherDog3 I'd choose you. Then I'd play it on fast speed so it looked like a ballon being inflated. @77sylvia Lilywhite Here's that charity I mentioned @wildlifeaid https://t.co/Pl1bts4iCM 🙏 https://t.co/ZFydyyZ4WA https://t.co/jq6ncteGxY @cdelgreco9 Would think not. @NETFLIXTIMECOUK Last Dance, Tiger King, Don't Fuck with Cats, Bloodline, RT @Bethannestagram: Here's why @rickygervais' Afterlife\nSeries 2 needs to be on your Lockdown Binge Watch list.\n\nhttps://t.co/IDrR54pti9 v… @JustMissEmma I genuinely think I've never looked that good. @OrdinarySmog @gillinghamjoe @NetflixUK @netflix 👏 RT @OrdinarySmog: My little #AfterLife doodle featuring @rickygervais and @gillinghamjoe.\n\nhttps://t.co/EfyPrFndAm\n\n@NetflixUK @netflix htt… @AlexEdelman @NoamOsband @Memorywoman1 @noahroth @JerrySeinfeld I've been trying to find out who wrote the joke for ages. In fact I think the term joke doesn't quite do it justice. It transcends comedy as we know it. It's something else. But I can't quite explain what. It also contains about 50 themes to be discussed. Remarkable. @Danielcoutz Thank you 🙏 RT @wolfetone98: @rickygervais I've lost count how many times I've used this one..... 😂 https://t.co/pQnqq4eE7g The most useful GIF on Twitter. https://t.co/fQ20IShpcs RT @olliecomicstrip: Not for your consideration @TheEmmys: @rickygervais in #AfterLife2 https://t.co/CkljKSwvon @JoeBangles11 Used to be extra strong cheddar. @WeatherDog3 No idea. @adammichael_22 Beautiful. @slyfer2812 Cheers. RT @joncassar: I really enjoyed #RickyGervias #afterlifeseason2 He continues to write and produce original, funny, thought provoking televi… @blueboy361 @gillinghamjoe @slyfer2812 My pleasure. What's the piece of music you used? @AldrichHgvr Good point @warriorangel_20 From someone called Warrior Angel who only tweets about Vampires, I'll take being 'obsessed with death' as a compliment 🙏 You can vote for #AfterLife to win another award if you like https://t.co/y5T3p16CN1 RT @ShawnaMedia: @rickygervais I just finished watching all of #Derek after finishing #afterlifeseason2 as well.\nDerek was just as lovely.… https://t.co/WajuOrNypU @purbrooktony Yeah I listen on Youtube. @paulmonk63 Sorry for your loss. @joncassar 🙏 @newmanstings @RickyA86 Hahaha. Inspired. Best fans in the world 🙏 https://t.co/myuVG3lnrT @newmanstings @RickyA86 Yeah. Then Long Dong Silver really delivered the knock out blow. @Jimmyro82417377 Carrie. I like 'Miss you nights' too. @TatersEsposa @davethomasjnr @IMDbTV @netflix @YouTube 👏 @AshBash090506 😁 RT @asdf78: @rickygervais after watching and loving #AfterLife2 I've started watching #Derek. @KerryAGodliman is fantastic in it RT @RickyA86: My mum loves doing pottery so I thought I'd take advantage. What do you think? #afterlife @rickygervais @newmanstings https:/… @EmmaKennedy Hahaha @adamhess1 @SeanMcLoughlin hahaha If the cunt doesn't show himself soon, Cliff Richard will sing a fucking song. RT @ConnieSmithArt1: I had just finished watching #afterlife and drew this picture of @rickygervais because why not, I apologise for the bo… “Short Notice” https://t.co/MdMO5fGwad RT @JennieStencel: @rickygervais  oh Afterlife ....it’s just lovely 😂💔 just lovely RT @AlexandreKrausz: The rhythm is different. There's no SOS breaks from season 1 to help viewers cope with the emotional punches. #Afterli… RT @GeorgieALove: Episode 5 of #AfterLife2 might actually be the greatest episode of any TV show ever. Literal thigh-slapping laughter and… RT @THR: 'The Willoughbys', executive produced and narrated by @rickygervais, has been watched by 37.6 million households since debuting on… RT @CBTHunting: Dear @BorisJohnson \n\nAn editorial in The Times today about new book ‘Trophy Hunters Exposed: Inside the Big Game Industry’… @Lisa64314351 Not when it's a dog. @jpeachment13 Neville @PTempered all real https://t.co/rNhcoBbrhr @C_BOYCE He's my wife's brother. @trumpulist Yep @Helen4eight Luckily, no. @redgringrum Nope. @meowitsjoey 30 RT @Clark1995Clark: 5 months ago. Back when the world was a different place. \n\nhttps://t.co/9AddBijCgb RT @AfterLife_Fans: The best way to start the day! Like a fat toad eating a big creamy worm! #AfterLife2 is now on Netflix! https://t.co/ro… @lesleeallan7 https://t.co/mkEJUvv10q RT @_shinhead: Drawing of Tony and Brandy from #Afterlife ♥️ this show was so incredibly emotional and hilarious at the same time and it re… RT @GQ_France: C'est FA-BU-LEUX ! 🤗 Merci au génie @rickygervais 👏 #AfterLife \nhttps://t.co/eifQNWqyXE RT @NetflixUK: To celebrate After Life being renewed for a 3rd season we've...put all the most heartbreaking moments from S2 into one video… @Paprikaboy_ \"A man who is tired of the anus, is tired of life.\" @purbrooktony Surprisingly few as it didn't matter what the fuck they said 😂 @mappyjj Cheers @HeslopPj 😂 @katefutter Haha @purbrooktony Ratty shouting “wank as you die” &amp; The Nonce screaming “I’m doing a Hutchence”. Mental. ‘Psychiatrist wanking off The Nonce into a beer glass while Ratty hangs him with his tie’ &amp; 800 other #AfterLife photos https://t.co/RsKoVSJVxx https://t.co/6JtvdsmgkK Thanks for making #Afterlife Number 1 again. Best fans in the world 🙏 https://t.co/txlP0mou99 @Avalez_ Ventilation. @ArmatradingJoan @C4Gogglebox 🙏 RT @cbcradioq: Last week, @rickygervais spoke to @tompowercbc about his hit Netflix comedy-drama #AfterLife, the show’s complex portrayal o… @elliot_gonzalez After Wife RT @CineroomTweets: #AfterLife season 2 is poignantly beautiful from start to finish. The writing is so real and the performances across th… RT @DEADLINE: ‘The Willoughbys’ Animated Film Proves Big Draw To Netflix Viewers Locked Down By Pandemic https://t.co/63VwU7bJ07 https://t.… @mikeymifsud @purbrooktony camouflage @skeffmark Yes. I said so today on Myspace. @purbrooktony Would they work with a 15 year old iPod? Thanks to @C4Gogglebox for featuring #AfterLife2 and showing all the incredibly lovely and funny heartfelt reactions 🙏 https://t.co/ivaOiDJmm3 RT @charlietantrum: How @rickygervais #AfterLife inspired new song “Tomorrow’s World” https://t.co/SaDpqEynBy @HolliDee 😂 RT @NetflixUK: Everyone knows a frog. And a scorpion. @rickygervais https://t.co/b0ZfHHFctc Best fans in the world 🙏 https://t.co/G3yekzcyEK RT @VanityFair: Comedian @RickyGervais tests his knowledge of British slang: https://t.co/mG5fa9usGt https://t.co/UpHQz8nyL6 RT @CinemaStud: Now watching The Willoughbys. So far this film has given us the beat animated character of the year voiced by Ricky Gervais… RT @NetflixFilm: 37.6 million families met THE WILLOUGHBYS over the last 4 weeks. Don’t miss out on this high-flying adventure and the best… @Samanthawindell Ken Dodd RT @Clark1995Clark: How does this show not deserve an Emmy Award? \n\n#AfterLife2 @rickygervais \n\n https://t.co/w1NyeHGWCv https://t.co/isAZJwOjV2 @huhman16 I wrote the whole thing 😇 RT @nbc: Only @rickygervais would join #RedNoseDay from his bathtub. 😂🛁 https://t.co/aKs5Lj5V1O @Clark1995Clark Good. Lots of ideas 👍 @Mohammad_JasemT @Samanthawindell Pizza @_AdamStancill It will be postponed. @JennyCooney 😂 RT @hugonemet: Ricky Gervais - After Life #RickyGervais @rickygervais #AfterLife2 #afterlifeseason2 https://t.co/ITzrg1dgYp RT @RadioX: \"I think that’s a brilliant show.\"\n\nhttps://t.co/xml1upGhND RT @RadioTimes: Did you miss our exclusive interview with @RickyGervais? Catch up via the link: https://t.co/RTGEYBIFz9 #AfterLife2 #stayho… https://t.co/uP7HoO1MTz @SuanneReid 6pm @Damuke Not sure. Hopeful though. @JadeMaguirex It will be postponed. RT @BornFreeFDN: Thank you @rickygervais for your support! If you would also like to support Angela and Martin in their fundraising challen… @v_carolynv Yep. Twice. @DarrenDOfficial @SophieLadds 🙏 https://t.co/qSgsyESBpq RT @itsalexhenry: i recently watched the second season of ‘after life’ on netflix... such an amazing show! i really wanted to redraw this s… @Sachet_of_Vaz Only when it's a human. RT @boredpanda: 30 Celebrities Photoshopped Side-By-Side With Their Younger Selves Show How Aging Has Changed Them (New Pics) #celebrities… https://t.co/N6e2Xx9wlf Hanks got AIDS https://t.co/17NiBitq3W Sophie chooses boy. https://t.co/17NiBitq3W Schindler makes list. https://t.co/17NiBitq3W RT @SIRIUSXM: .@rickygervais recalls the time he co-wrote a song with @DavidBowieReal and managed to insult the music icon in the process.… RT @edibow: Been loving #AfterLife2 on ⁦@Netflix⁩ ?  Then head over to ⁦@soundtrackinguk⁩ to listen to ⁦@rickygervais⁩ be hilarious and bri… RT @kerryfowler_: #MentalHealthAwarenessWeek \n\nSomething that we can take away from @rickygervais’ #AfterLife is that kindness is everythin… RT @MahamSajid7: Season 2 was cathartic but season 1 was unabashedly refreshing to watch! \n\nA little late to the party but here’s why After… RT @wolfetone98: Oh my god I needed this laugh right now!!!!\nI haven't laughed so hard for a long time.....I even managed to leak a teeny t… RT @decider: #AfterLife Season 2 will surprise you with how powerful it is and how much it stays with you: https://t.co/T0uBS32G7N @rickyge… @tracy_a_roberts Thanks. @lynndeeloolar 🙏 @gsl200 Either @hammockmusic or @andywburrows I reckon. @skheather1 👍 RT @BestThingRadio: NEW EPISODE 🎙️ In contention this week: \n\nBOOKSMART @oliviawilde, HONEY BOY @Almaharel, AFTER LIFE (BLOOPERS) @rickyger… RT @Rabonagr: Έχοντας ως εφόδιο δύο σεζόν πραγματικής ψυχαναλυτικής δράσης για τον θεατή, το #AfterLife του @rickygervais είναι μια από αυτ… RT @sturoseheart: In the 5D Podcast we talk  #AfterLife taken by @netflix for 3rd season &amp; how @rickygervais beautifully, respectfully (&amp; y… @TheoPaphitis Thank you 🙏 RT @PeterEgan6: Hi everyone..it is terrific to be able to share some happy news during this horrible time here's a message to the brilliant… RT @JFrayWTOP: REVIEW: @rickygervais brilliantly balances humor, meloncholy in #AfterLife \nhttps://t.co/t9VxuXzEFc @j_fiddes Me! Thank you :) RT @NME: \"Give it to someone who gave a kidney to a stranger, not someone who invented a new type of mascara\" https://t.co/nlZWQreRVv RT @GQ_France: On dit évidemment 🙏 @NetflixFR et @rickygervais RDV en 2021 🤗\nhttps://t.co/a3Fw3LXCIE RT @cbcradioq: COMING UP Monday on q: Hear @tompowercbc's conversation with @rickygervais! Tune in at 10 a.m. ET on @cbcradio or listen onl… @JeffCross5000 @THR Cheer up, Jeff. @richardkoscher Straight in 🙏 @neenerbuzz99 👍 @cpnrushman Thanks @TonyGreyMan I have it delivered by Pandas. https://t.co/bWNkYO4okz RT @Vicky_McClure: @rickygervais Watched After Life series 2 today, proper hits the heart.  \n❤️👏and @MissJoHartley bloody hilarious 😅 xxx @Vicky_McClure @MissJoHartley 🙏 @boogen74 All scripted, yes. I ad-libbed a bit in the scorpion/frog conversation though. @UKastrology @andrewdoyle_com \"Reads astrology\" but \"Laughs at morons\" 😂 RT @PeterEgan6: .@rickygervais please rt when you get a moment...This book is a must read for all who support the @CBTHunting cheers everyo… @RizaTurker Amazing work. RT @RizaTurker: thank you mr. gervais... again... #afterlife #afterlife2 #rickygervais https://t.co/JyRqF9wV7D @stevennraven122 Not for about 50 years :) @Whiskey_General I’ve been to about 10 knicks games in my lifetime and that’s my entire basketball experience. RT @sarajcox: Me &amp; the hubby just made the duvet soggy - and not in a sexy way. Laughing and crying and loving the final 2 eps of #afterlif… RT @andrewdoyle_com: If you haven’t watched the second series of After Life yet, make it a priority. It’s superb. https://t.co/YGwe571qLF @joeylshort 🙏 @msSkarsbo No. Basketball. Thanks for all your wonderful tweets about #AfterLife still flooding in. You made the first series the most watched British comedy in the world last year, and it looks like the second series is going to be even bigger. Best fans in the world🙏 https://t.co/oa4aHvhPd9 With all the attention on #AfterLife2, I forgot to thank you for watching my new movie #TheWilloughbys. It’s my first animated feature as Executive Producer &amp; I also play the most important member of any family. The Cat! Now streaming on Netflix around the world 🙏 https://t.co/MXajL9z7j0 The day Ken Otley told us all about Liz Taylor's love eggs 😂#AfterLife2 https://t.co/RNRAVCWqS7 #AfterLife2 has finally been knocked off the top spot on Netflix by the brilliant #TheLastDance. Congratulations to the amazing team behind one of the best documentaries ever. RT @Clark1995Clark: Thank God @rickygervais isn’t homeschooling during lockdown. https://t.co/BKx3Zs3Fga @Officialphill_r @purbrooktony Agreed. @SteveSpeirs4 Most necks aren't wider than the head. Nice touch. @pkokga Agreed. @drchrxis That's what friends are for. Thanks for all the 10 star reviews for #AfterLife. Best fans in the world 🙏 https://t.co/rFsdCzV90q https://t.co/owFEiGH4kT @PerrinsDaryl Yeah, they always have someone dying of cancer in chocolate ads 😂 RT @Clark1995Clark: How was this show ever completed? 😂 #AfterLife2 \n\n@rickygervais @EthanDLawrence https://t.co/3u3MK6Pxgi RT @HalifaxToday: Ricky Gervais’ After Life returns and apocalyptic frat comedy This Is The End feels timely: This week’s best and biggest… RT @missfinemang: I have made a YouTube playlist with all the songs @rickygervais has played on his daily Wartime Broadcast during lockdown… RT @THR: Comedian @rickygervais discusses his philosophy on stockpiling in the COVID-19 era: \"I can’t believe people were going with toilet… @WeatherDog3 😂 @umang0202 Yep RT @brigidpresecky: Day 2 - A show you wish more people were watching. #30DayTVShowChallenge\n\nEven though many people watch this show, I'd… @ZMaiorca No, but I know I wouldn't handle it well :) @FiGilg Hope so. https://t.co/afiiRHa0xK @meowitsjoey @BiologyLorna Good Luck @BiologyLorna 👍 @NathanLeeArt It's amazing. @TGA441 💔 RT @BoyGeorge: Ha! I needed to hear this this morning @rickygervais is f**king hilarious. We should all start cold calling insurance compan… RT @cedarsjwsurvey: Finally brought myself to watch #AfterLife by @rickygervais. Intensely triggering for those who battle loss &amp; depressio… RT @garyhendershot6: @cedarsjwsurvey @rickygervais Was a rollercoaster for me too. Laughs &amp; crying my eyes out. I did think he acted beauti… @MickKel66487144 Amazing RT @MickKel66487144: @rickygervais Random drawing done by my nephew on lockdown https://t.co/qBqcudSCSq RT @WestwoodLee: I’m not sure why it took a lockdown but finally watched Humanity last night. @rickygervais is brilliant. The Mrs wasn’t im… RT @THR: Comedian @rickygervais discusses his philosophy on stockpiling in the COVID-19 era: \"I can’t believe people were going with toilet… @PaddyMcGuinness 🙏 @RobBlake123 Happy with both 😇 @alunscott2000 Dog being put to sleep. @PaddyMcGuinness 😇 @ohchandlerbing 🙏 RT @abc730: 'I'm even missing things that I didn't do.' @rickygervais talks life in lockdown and the second series of #AfterLife. #abc730 h… @LubaTV 🙏 RT @LubaTV: @rickygervais \"After Life\" is an amazing show. Thank you for working so hard in it. @philswales Keep me posted 👍 @NancyNBartlett1 @zashawwilkinson Old Geoff Midgley. @zashawwilkinson You're probably making the assumption that the man was the main breadwinner. If you assume that his wife earned a lot more than him it's easier to understand. Hope you enjoy it :) RT @TheHinduCinema: Actor-musician @shrutihaasan is binge-watching @rickygervais's #AfterLife during the lockdown: \"I think it’s a good ser… RT @tattoosbytoni: Quote taken from Afterlife • Hoping for normal life to resume soon, until then, check out @rickygervais Afterlife, seaso… RT @purbrooktony: I love seeing Tom Basden finally lose it at the end @rickygervais \n\n#afterlifeseason2 #Outtakes #Bloopers https://t.co/QS… RT @marchioreviews: MY REVIEW of @rickygervais's After Life Season 1 and 2 - NETFLIX REVIEW !!!!! https://t.co/Rgtty7N3i2 via \n@YouTube #Ma… RT @ElsBastards: Busqueu una sèrie amb un guió escrit amb tota la gràcia, diàlegs esmolats, moments còmics majoritàriament brillants i les… RT @KateRobbins: Watching #AfterLife2 outtakes is my new hobby.\nAfter a particularly sweary scene with Paul Kaye you can just hear @rickyge… RT @GauchaZH: Em \"After Life\", Ricky Gervais vai do riso ao choro, do belo ao incômodo (via @Ticiano_Osorio)\n\nhttps://t.co/GVcxVQNLhE RT @purbrooktony: Hey @rickygervais how the f**k did you manage to film this scene? 🤣 \n\n#afterlifeseason2 #Bloopers #Outtakes https://t.co/… @DPareanga Good idea @FiGilg @Clark1995Clark And Harold Shitmum. RT @rickygervais: Let's settle this once and for all. What was Ratty's best nickname for the Nonce? #AfterLife Forgot to say, see you Friday. Cheers 🙏 https://t.co/JtDeOrgIls https://t.co/TpcglH8L5l RT @THR: Ricky Gervais discussed his Netflix series #AfterLife, grasping a pandemic with an uncertain end date, and his appreciation for me… @Clark1995Clark I guess I should. @LisaCla43140367 Happy Birthday, Franky! Let's settle this once and for all. What was Ratty's best nickname for the Nonce? #AfterLife @Arsenal_Hev 99% scripted but in that scene a lot more improv than usual. @petercrouch 😂 @BebeNeuwirth 😂 There can only be one winner. \n#QuimmySaville #MichaelParkinbum #BillyTheCunt #ClitorisAllsorts #BoneAlone #HaroldShitmum #JamieRedknapp You decide. #QuimmySaville 😂 #AfterLife https://t.co/t3JesqbkXo @Clark1995Clark @newmanstings Imagine \"Your mum's shit\" being your nickname 😂 @jamespikaz Two massive cakes I believe. @Drummer_DS Michael Parkinbum really made me laugh. Good question 😂 https://t.co/NUDiLHhYTn What's your favourite nickname that Ratty calls The Nonce? https://t.co/NMZrh9ZCWB I can't stop watching this. It takes me months to write a series and then 2 idiots eating cake steal the show 😂 https://t.co/VPvwX8PPgI @FiGilg 👍 Thanks for all your wonderful tweets about #AfterLife still flooding in. You made the first series the most watched British comedy in the world last year, and it looks like the second series is going to be even bigger. Best fans in the world🙏 https://t.co/D8Tb8eIGKZ @JoshJoshieg98 👍 @shaungt German shepherd @nontoxicjen Unfortunately not. RT @krammelkamp: @rickygervais I’m sharing a drawing with you that was made by a very good artist, a friend of mine. I recommended it to he… RT @tonypaulway: The @BAFTA chat @rickygervais @MissJoHartley and I had with @edibow about #AfterLife2 is now available to listen to on Sou… RT @purbrooktony: \"Then you have been shoplifting from the local f**king butchers!\" 🤣\n\n#afterlifeseason2 @rickygervais https://t.co/6VLA2pp… I love this review. It breaks down each episode with a star rating and a 'cunt count'. Perfect 😆 https://t.co/BtfYVQgMeh @reversediorama @RoughTradeBooks @thesociallondon Is Chumbawamba still your favourite band? @jayAVFC_ Yep @caroldecker 🙏 @celiacole Annette Crosby and Steve Spiers. @ollie_harfield Afraid not. RT @BAFTA: It made us laugh, it made us cry and it made us hold our loved ones closer... Now it's time to do it all over again in the secon… @RedHourBen @MrEdByrne So sorry for your loss, Ben. @seannwalsh Thanks, man. @iains21 I think Brent is just TOO sad in his late 50s. @krammelkamp Brilliant! @WeatherDog3 Loved 'em both. @lestroy @netflix I honestly love every aspect of it. https://t.co/OIkUJ6JSgd https://t.co/c0fngkFc3i @StevenCats1 If the script is real enough I can do it once. Then I feel better. @happydcg @tonypaulway 🙏 @newmanstings @Clark1995Clark Cock Smuggler. @DennisVernooij Love it. RT @wolfetone98: The very best (or worst) of Brian Gittins cannot be shown in just one post, so here he is in part 1 of 2. @rickygervais #A… RT @wolfetone98: The very best (or worst) of Brian Gittins cannot be shown in just one post, so here he is in part 2 of 2. @rickygervais #A… @Connor_Ripley_ It was scripted but then we just kept adding to it. More and more mental. Thanks to everyone who watched, particularly Minge &amp; Bracket, Clitoris Allsorts, Quimmy Savile, Michael Parkinbum, Billy The Cunt, Bone Alone, Harold Shitmum and of course AIDS 🙏 https://t.co/bEQNQP4mqO RT @JackLinsdell: Follow us on Twitter or subscribe to our blog to read the latest articles about TV and Film. The newest articles include… @meowitsjoey Impossible to say. I laughed most watching the psychiatrist scenes and the two idiots eating cake. @mumblemcmumble Yes it drives me insane. RT @CineroomTweets: #AfterLife season 2 is poignantly beautiful from start to finish. The writing is so real and the performances across th… @purbrooktony There were outtakes for everything. @Clark1995Clark That line was, but I was laughing all the time. I couldn't cope. @Clark1995Clark You can hear I'm already laughing before he even gets the line out. @Clark1995Clark Either 'AIDS' or 'Billy The Cunt'😂 RT @JaneFallon: Our fabulous friends (combined age 181) are walking to raise money for charity. You can donate here. Help close down live a… @LuciLeachSmith 👍 @purbrooktony At one point I had my eyes closed with my fingers in my ears so I don't ruin the take. That's not how a director is meant to behave. @EthanDLawrence @MandiDhillon @wolfetone98 @tonypaulway We should clap him every Thursday really. @EthanDLawrence @MandiDhillon @wolfetone98 Poor @tonypaulway ate 7 rice puddings in one scene and didn't complain once. In fact he was asking to do more takes. Trooper. @meowitsjoey over an hour easily @CLanaway1 @SteveSpeirs4 👍 @EthanDLawrence @MandiDhillon @wolfetone98 😂The sound was the best bit. @EthanDLawrence @MandiDhillon @wolfetone98 By 'friends' do you mean free cake? @MandiDhillon @EthanDLawrence @wolfetone98 I love how no-one cared about David feeling sick. @wolfetone98 It was mental. I thought he was going vomit at one point. @KarinvanderKant 👍 @terrychelton It's weaker so I wont say anything mental. @luke15338974 Seth Cardinal. RT @olliecomicstrip: @rickygervais Looks like a couple of serial killers on the prowl in this #AfterLife2 outtake. https://t.co/ixgvGQkbiV @PaulTsanos So, hosting the Golden Globes then? https://t.co/0Lend0QTbg RT @nikkhiladvani: #AfterLife is possibly one of the best things on @NetflixIndia Sublime writing. 💔ing, but so poignant at the same time.… @FiGilg Not sure. #AfterLife2 Outtakes https://t.co/GlbH8iWveq @meowitsjoey 4pm @Clark1995Clark Wait till you see the extended outtakes. Gittins is impossible to act opposite. RT @NetflixUK: 🗣 After Life season 2 bloopers! Get your After Life season 2 bloopers!! 🗣 https://t.co/l9QBRlRcq1 RT @NetflixUK: If you want more, @rickygervais will post the full, *much* longer blooper reel on his YouTube later today ✌️ @Clark1995Clark If I was hungry I'd choose Snickers but Aero is just pure pleasure. Or Flake. RT @BBCRadio2: \"I thought... can people be laughing one minute, then crying the next? The answer is yes, because that's real life.\" \n\n💙 @ri… RT @elpais_tele: \"En ‘After Life’, tanto surrealismo, ternura, humor salvaje, sarcasmo y lirismo  me lo regala paradójicamente un personaje… RT @Vertele: Netflix renueva #AfterLife por una tercera temporada y blinda a @rickygervais con contrato multimillonario https://t.co/ZZYdPL… RT @szmagazin: Der Komiker @rickygervais kann irre lustig sein – er weiß aber auch, warum uns traurige Geschichten helfen. Nun wurde bekann… @PaddyMcGuinness 🙏 RT @PaddyMcGuinness: Last night I finally found time to watch series 1 of After Life.  I was doing ok, the odd lip quiver here and there bu… @mcewancreative That dog never dies! @toddlieberman 🙏 @purbrooktony Aero @realgammonchops Tony I think. @dat_pedro_fella All of the above 🥴 @purbrooktony Haha. I don't know how I'm even doing that. RT @THR: Actor, writer, producer and comedian Ricky Gervais has signed a multiple-year overall deal with #Netflix https://t.co/k64SJheruw RT @Variety: 'After Life' Renewed for Season 3, Ricky Gervais Signs Netflix Overall Deal https://t.co/M6nY8xa3xr RT @DEADLINE: Ricky Gervais Strikes Overall Deal With Netflix As ‘After Life’ Comes Back For Season 3 https://t.co/JrkQ6D3dwt https://t.co/… RT @Metro_Ents: It's official! #AfterLife season 3 has been confirmed - but @rickygervais warns 'this is the last one' \n https://t.co/VyrrR… @TVSanjeev @netflix If I can finish it this week I can have the whole summer off. RT @Snoodit: Exclusive: @rickygervais has signed an overall deal with Netflix and will create new scripted series (and stand-up specials) f… RT @NetflixUK: NEWS: After Life will return for season 3. https://t.co/eoRc0pyD3i Because so many of you watched #AfterLife2 so quickly and made it Number 1 again, the nice people at @Netflix have suggested that I get off my fat arse and do another season. This is all your fault. https://t.co/NDD2gGnFXx #AfterLife2 Still Number 1 on Netflix!\nBest Fans in The World 🙏 https://t.co/80vL4e9kc1 RT @JOE_co_uk: \"If we did After Life as a musical, we'd have called it 'After Wife'.\"\n\n@RickyGervais and friends answer the most Googled qu… @RachelGriffin5 Soon RT @clairefrost13: @rickygervais thank you 💙💙 https://t.co/WPObS6dFOD @JohnBishop100 Thanks, John. Hope you're well 🙏 RT @JohnBishop100: I have to join the rest of the plaudits for @rickygervais After Life. Well acted well written, well shot and with genuin… RT @whatonnetflix: Most Popular TV Shows on Netflix UK (May 5th)\n\n1. After Life\n2. Never Have I Ever\n3. The Last Kingdom\n4. RuPaul's Secret… RT @NZStuff: After Life: Ricky Gervais’ Netflix show speaks to Covid-19 life like nothing else https://t.co/zP9m7xkvN1 Good Girl https://t.co/UvIEowi3ek RT @kcrazychick_: @rickygervais so I couldn’t help myself #afterlife https://t.co/xJYVw86iVH RT @EstherThePig: “How Ricky Gervais helped fans of a Vancouver beer raise thousands for a special pig - Vancouver Is Awesome” On behalf of… @Matt14101985 Afraid not. RT @purbrooktony: \"Anyone who doesn't wanna rape Hitler is a f**king bender\"\n\n#afterlifeseason2 #AfterLife2 https://t.co/4c86CPtrO6 RT @Clark1995Clark: “Knock, knock who's there?” 😂\n\n#AfterLife2 @rickygervais https://t.co/EK7mhzdOog RT @NetflixIsAJoke: https://t.co/2aiBRVvEz5 @laura_patch @KerryAGodliman @bradders_david It felt like a real wedding. Such a fun day. @meowitsjoey tomorrow https://t.co/cykmYe9RBP @infinitexrauhl Laughing or crying? @boyzoneno1 Happy Birthday 🥳 RT @NewsfeedsMedia: Ricky Gervais insists he wasn't bothered about sending Annette Crosbie, 86, 'awkward' lines\nhttps://t.co/xXEbsHgt9k RT @chortle: What should we call Dame Judi Dench's vagina? @rickygervais reveals his weird debate with Golden Globes lawyers  https://t.co/… @jbaccili @NetflixFR Amazing @emmycarpenter Good idea @TVSanjeev @PeterEgan6 🙏 RT @TVSanjeev: #AfterLife2 is a beautiful piece of work. @rickygervais’ characters have a raw honesty which is moving and of course there a… RT @rickygervais: Thanks for all your amazing tweets &amp; reviews for #AfterLife2 🙏 https://t.co/AiNek2jrQb RT @rickygervais: I can’t believe #AfterLife2 is still trending on Netflix. Thank you so much. Let me know where in the world you’re watchi… @cbctom 🙏 RT @cbctom: @rickygervais Binged #AfterLife2 last weekend. With the tragic loss being suffered by so many right now, it was another emotion… https://t.co/uC94MyXyW7 @DawnCTownsend Amazing! @colinhoult @EthanDLawrence @MissJoHartley @TracyAnnO @briangittinspod A seaside special with a raffle. @vonniek2 Sorry for your loss. RT @kev_egan: Who else is watching #AfterLife2?! @rickygervais is a genius. It’s so unbelievably beautiful, funny and heart wrenching at th… @JohnnyDinlo Haha. No not at all. You send people the script and they tell you whether they want to do it or not. RT @AndyCookMedia: Please..if you’re not convinced by all the glowing reviews regarding #AfterLife by @rickygervais ..watch this wonderfull… RT @nytimesarts: Ricky Gervais talked about his darkly comic Netflix series \"After Life\" and about his own life since his celebrity-skewing… @DannyBMiller 🙏 I can’t believe #AfterLife2 is still trending on Netflix. Thank you so much. Let me know where in the world you’re watching it tonight 🙏 https://t.co/KQBkW3n6Pq @maxreestore Thanks you Max 🙏 RT @maxreestore: Tempted to throw out my TV as I’ve just finished series 2 of afterlife by @rickygervais and I honestly don’t think I’ll ev… @CLouiseGx soon Thanks for all your amazing tweets &amp; reviews for #AfterLife2 🙏 https://t.co/AiNek2jrQb @Clark1995Clark I think we all know the answer to that. RT @edibow: Brand new @soundtrackinguk episode up with the always entertaining rickygervais - big chats on netflixuk #afterlife2 @andywburr… RT @OC: Thanks for all the messages about the ⁦@rickygervais⁩ interview we did. Many of you saying you hadn’t heard him speak like that bef… https://t.co/QD2VAMb7Gf RT @NetflixIsAJoke: https://t.co/pbxj99eqOB RT @edibow: @AfterLife_Fans @rickygervais Get your ears round this folks. 🙌🏻https://t.co/uXzPgZBwTd @davethomasjnr 🙏 RT @JimmyAkingbola: Well @rickygervais and @charlietantrum have done it again! #afterlifeseason2 is brilliant. 🔥👏🏾🔥👏🏾 https://t.co/mzO0mORH… RT @davethomasjnr: Here is a live version of Silence, which many of you may recognise from *that scene* in #AfterLife2. A lot of people hav… https://t.co/bhjnbzGWlE RT @buzzdotie: After Life is about the human condition and how we can find hope in even the most adverse conditions. https://t.co/TWniGt2pw… RT @AaronRodgers12: #AfterLife is perhaps my favorite work ever from  @rickygervais which is saying a lot when you consider #theoffice #der… RT @CruseCare: Does this strike a chord with you? 💜\n\n#AfterLife2 #Grief https://t.co/Vrtjvfu9O5 https://t.co/NxfZhWt3vy https://t.co/eHV1wSv24a RT @TheVampsJames: Just spend ten mins crying with Kirstie over After Life. Sunday morning kicked started off well. Cheers @rickygervais RT @girlonetrack: I finished #AfterLife2 this morning and I’m still so choked up about it. It made me cry so much, but the humour - of whic… @smudge7723 lovely idea @CineroomTweets Love it. Can't believe the c**t count is so low in ep 6. @johnmarrs1 @NetflixUK 🙏 @JayWhiteNZ 🙏 @TheVampsJames 🙏 @tomskiweb Well, it is a real dog, but it's not mine :) RT @jameswilbraham_: Everything about #afterlife is absolutely perfect. By far the best bit of television I’ve seen in a long time. @rickyg… RT @MissJoHartley: Right folks, it’s cosy sunday — so that means, a bit of exercise, nice roast dinner, then later on get on that sofa, wit… @Clark1995Clark Working on it. RT @gillinghamjoe: Yeh, thanks so much for the lovely messages. That dog walked along a high wall and greeted us. We were late filming the… @KathyBurke @colinhoult 🙏 RT @KathyBurke: Watched 3eps of After Life 2 last night. Everyone is great of course but Ken played by the brilliant @colinhoult is my new… @ben_cajee 🙏 @purbrooktony Going Underground @Jack1Lawrence Thank you. @Michael_Buffer Thanks, Michael 🙏 @harry_osborne97 definitely @martinfry1971 amazing @Henhead78 👍 All the music I used in #AfterLife2 https://t.co/sc44LYofCf @elmylamine Probably Hammock. @CarlinaShawol @netflix Not sure I'm afraid. @BoyGeorge 🙏 RT @MildManneredMax: Have you watched #AfterLife2 yet?\n\nYou really should.\n\nFor all the reasons.\n\nIt is the best @rickygervais piece...whic… @Juli_Ram_26 tomorrow https://t.co/CgvDGSNZmK @DavidCain_Art amazing RT @filmandtvnow: After Life Season 2 Review: Ricky Gervais’ Show Continues to Shine \n\nhttps://t.co/J8xVY1PQmq\n\n#Netflix #AfterLife2 #Ricky… RT @HalfMeasuresPod: Kia ora from NZ! In this week's podcast, we talk about why #AfterLife2 from @rickygervais could be the best TV show of… @philwilks Afterthought RT @Omundson: Hey gang, here‘s my TV Tip for your weekend :@rickygervais  is a fantastic dramatic actor, don’t believe me? just check out h… @SalvioEspo 🙏 @tonyblackburn Thanks, Tony. @trigger914 Brilliant. Worst one so far. Here are a couple of charities I mentioned though 👉 @PDSA_HQ &amp; @themayhew 🙏 https://t.co/FmWaAjeVX7 https://t.co/IwVnax7mj5 RT @RadioTimes: .@rickygervais reveals why his shows have short lifespans: “The exciting thing is starting again”. To see the full exclusiv… @robinince Fluffy Egg. @DarrenDOfficial 🙏 RT @joshopgirl: #AfterLife2 is still the top at No1 on @netflix 1 week on!! 🎉          Amazing @rickygervais 👏🏻❤🐕 https://t.co/DAYUR0zLvQ Loving all the photos and vids of your dogs watching #AfterLife https://t.co/VbE1PidhPe RT @SteveMac765: Ricky Gervais absolutely nails this. #ClapForOurCarers #ClapForTheNHS #CelebrityCovid https://t.co/sPAb1UhLYw RT @RadioTimes: .@rickygervais defends bad language in #AfterLife2: “People appreciate it when you don’t patronise them”. To see the full e… RT @RadioTimes: Join us tonight to see https://t.co/BlQTUqFg0G's exclusive interview with @rickygervais, premiering on Facebook at 7pm BST.… @AaronRodgers12 🙏 RT @Rightcleverdick: Trying to watch #Afterlife2, but our pup has fallen in love and keeps running up to the screen planting dog kisses...… RT @morganjeffery: The first teaser for my @RadioTimes interview with @rickygervais - see the full Q&amp;A tomorrow at 7pm at https://t.co/T16Z… RT @GaryLineker: Finished #AfterLife2 and it’s finished me. Side-splittingly funny yet gut-wrenchingly sad. Poignant personally too given t… RT @katelawler: Thanks @rickygervais now my dog Shirley wants breakfast. #AfterLife2 https://t.co/mS60CownL2 @katelawler 😂 @pabathukpa yep RT @RadioTimes: Tomorrow night at 7pm BST https://t.co/BlQTUqFg0G premieres an exclusive interview with @rickygervais. Join us on Facebook… @GaryLineker Thanks Gary 🙏 RT @NetflixIsAJoke: https://t.co/KgaeplfKAt @welshjaci @BAFTA I saw your name pop up! RT @petermcm83: Just finished #AfterLife Season 2 Can the dog please be given a Bafta!? @BAFTA @rickygervais Fantastic show, raw as ever! F… RT @snowdog37: @BAFTA should have a category for animals, #Afterlife2 \"Brandy\" would defo be up for an award, especially the final scene, o… @welshjaci @BAFTA 🙏 RT @Livjernes: Yay finally starting series 2 of #AfterLife2 Winnie is enjoying too 🐶 @rickygervais https://t.co/vlUG7RyKJk @LpcBox yes @johnnystone3 Tomorrow A genuine Thank You for all the 10 Star Reviews for #AfterLife2 https://t.co/VAWj8577VM \nBest fans in the world 🙏 https://t.co/DeE1EpB6mL @ultrakravmaga 🙏 @purbrooktony Closest I got was The New Forrest. RT @KWilliamSk1: Is this the best on screen friendship? The answer is yes #AfterLife2 @rickygervais https://t.co/y3vlnreTkm RT @etiennettexx: If anyone wondered how I was getting on with #AfterLife2 https://t.co/mcLAb1pcMi RT @timhatfield87: Obviously @rickygervais is brilliant in #AfterLife but can we also get some appreciation for Penelope Wilton, who plays… @collettecooper 🙏 RT @TheVersion: Review:  @RickyGervais's After Life 2 is perfect ★★★★★ https://t.co/3uEyi7dwhP via @theversion https://t.co/OTtRWFDLfe RT @TheHinduCinema: #AfterLife season 2 review: The new season on #Netflix offers a paradoxical story arc, and none more so than the series… RT @buzzdotie: After Life is about the human condition and how we can find hope in even the most adverse conditions. https://t.co/TWniGt2pw… @lucyjbriers @marywoohoo190 @PeterEgan6 @KerryAGodliman So glad I got to work with him on Extras. #Legend @WeatherDog3 I'm not sure Rupe. All I know is I can only do it once and then I fell better 😂 RT @davethomasjnr: I recorded a live version of 'Little Piece of Nothing' this afternoon from my corner of quarantine in NY. Honestly I've… RT @OC: In our chat tomorrow @rickygervais says \"I don't distinguish between drama and comedy\". \nI love how great art, whatever it is, can… @jopage_ Thanks, Joanna 🙏 RT @BigIssue: OUT NOW: As the new series of After Life returns to our screens, @rickygervais talks to us about life death, grief - and his… RT @NetflixUK: Watch @rickygervais react to @MissJoHartley's emotional voice note that she sent after watching episode 5 of After Life s2 f… RT @olliecomicstrip: After watching 1 episode a day and reaching the season finale tonight, I believe I can sum up in three words everythin… @gkerr100 I certainly have a lot in common. @cmbspoon I think it's probably quicker to be honest. I have one less actor to tell what to do. Me. I already know :) RT @WOWalesOnline: 21 achingly funny, heartbreaking and just totally beautiful moments in @rickygervais After Life Season 2\nhttps://t.co/uj… RT @michelleisawolf: If you’re looking for something to watch, I highly recommend #AfterLife on Netflix. It’s so great Im surprised the US… RT @slyfer2812: A tribute to an amazing show. Spoiler for season 2.\n\n@rickygervais Thank you for making such an amazing and heartwarming sh… RT @Jo_Frost: Humanity,Hope,Vulnerability &amp; Courage are all captured beautifully in #AfterLife2 with @rickygervais and his talented cast th… RT @joshuahorowitz: I kind of live to make @rickygervais cackle and happy to say it it happened a few times in our latest. Hope you guys en… @Bluetooth1987 Yes. They'd talk about dogs. @slyfer2812 Amazing. One of the best tributes I've ever seen. Thank you. This is incredible https://t.co/WajuOrNypU RT @EveningStandard: Ricky Gervais branded a ‘genius’ for #AfterLife season 2 twist ending https://t.co/XtAyIHRNjS @MissJoHartley @tonypaulway @EthanDLawrence It looks like a 60s sitcom. 'The Madhouse'. It's the sort of photo you look at and go \"They're all dead now\" RT @JasminHughesx: I think Loki likes Brandy 😂 @rickygervais #afterlife https://t.co/RKEmc4Tmna @JasminHughesx 😂 @hollyreynolds__ 😂 @michelleisawolf Thanks, Michelle 🙏 @ttony111 @RickTheDick Yeah you pay for publishing and recording so if I did a cover of a Bowie song for example it would be half price so to speak. @RickTheDick anything from a few thousand to hundreds of thousands depending on the song/artist/publisher etc. So Led Zeppelin, Beatles etc are a bit pricey :) RT @filmandtvnow: After Life Season 2 Review: Ricky Gervais’ Show Continues to Shine \n\nhttps://t.co/J8xVY1PQmq\n\n#Netflix #AfterLife2 #Ricky… RT @Reallisariley: When watching @netflix @rickygervais “After Life” it’s GENIUS,as a viewer you just realise that it truly tackles every s… RT @sternde: Zweite Staffel \"After Life\": Zynisch, impulsiv, lustig: Ricky Gervais sorgt als trauender Stinkstiefel für Ablenkung https://t… @MissJoHartley @NetflixUK 😆 @kevinbridges86 @gillinghamjoe @KerryAGodliman @Roisinconaty thanks man RT @kevinbridges86: Afterlife season 2, brilliant. Well done @rickygervais and outstanding from @gillinghamjoe @KerryAGodliman @Roisinconat… RT @FallonTonight: Tonight: @rickygervais, @theebillyporter, &amp; a performance from @thelumineers! #FallonAtHome https://t.co/7BpBQJmNVa @naznomad Sorry for you loss. @patphelan 🙏 RT @charlietantrum: People often ask me what it’s like working with ⁦@rickygervais⁩ on #AfterLife2 for ⁦@netflix⁩  This photo by Natalie Se… RT @kp_est78: I think @rickygervais New show #afterlifeseason2  on Netflix was so beautifully made .it had a story of love mixed with a tou… RT @EveningStandard: Ricky Gervais branded a ‘genius’ for #AfterLife season 2 twist ending https://t.co/dLmJw3stSK RT @TheVersion: Read our Review:  @RickyGervais's After Life 2 is perfect  ★★★★★\n\n https://t.co/3uEyi7dwhP\n\n@netflix @netflixuk #AfterLife2… @retrosling It cost over £100,000 but it was worth it. RT @joshuahorowitz: I checked in with @rickygervais for our latest episode of STIR CRAZY! It's got drinking and all sorts of silliness. Wha… RT @FilmFunnies: Ricky Gervais has achieved the impossible. A second series that's better than the first. After Life is back and we've got… @kirstiealley 😆 RT @kirstiealley: Ok good news bad news @rickygervais ...GOOD news is that #Afterlife2 is as brilliant as season one and honestly ur killin… @aliamjadrizvi 🙏 RT @aliamjadrizvi: After Life Season 2 is devastatingly beautiful. Thank you again, @rickygervais. https://t.co/TJP8htQMY6 RT @trainingcarers: Vile,beautiful,hilarious,moving, heartwarming &amp; heartbreaking.\n@rickygervais-superb writer/actor who somehow connects w… RT @asjadnazir: I loved #AfterLife but didn’t watch season two straight away because I knew it would open wounds. Just watched #AfterLife2… RT @OShaughnessyK: I’m a mess @rickygervais after watching #Afterlife2.  It’s so beautiful. Everything about it strikes a cord. It’s phenom… RT @edibow: Brand new ep of @Soundtrackinguk Extra @youtube show is up with @Rickygervais talking @netflix #Afterlife2 @JALowden doing Trai… @welshjaci 🙏 RT @welshjaci: Seen all of  @rickygervais's #AfterLife2 So beautifully understated and touched me not in a sobbing kind of way, but with a… @alejandrasoto_ @HuluTheaterMSG @Ticketmaster Postponed. Details soon :) @boydhilton @bbc5live @TherealNihal You're in that tiny gang too, Boyd. @Stacey_Bland thank you RT @wolfetone98: Sometimes words are not required to set up a scene, you just need to watch...\n@rickygervais @MissJoHartley #AfterLife #Aft… @MissJoHartley @marley_morrison Brilliant 👍 @Ra_gupte 👍 RT @woodsphil: Right look here, if you are one of the strange, confused, odd people who haven’t seen After Life 2 by @rickygervais then you… @Bazil81 I vote Brilliant Actor. @MissJoHartley Thanks Jo. @bbc5live @TherealNihal Totally irrelevant, but I'd like to say what a great broadcaster Nihal is. Well on his way to becoming a national treasure. Informed, open-minded, fair, astute, caring and funny. A dying breed. RT @Vertele: CRÍTICA | 'After Life 2': Ricky Gervais (pre)siente y padece la angustia de vivir un presente indefinido https://t.co/424KHmxp… @ShonaBM Thanks, Shona 🙏 @BeeksMr I'm proud of them all for different reasons but I guess AfterLife was the most ambitious if that counts for anything. RT @bbc5live: Have you watched After Life 2 yet?\n\n@rickygervais joins @therealnihal in the latest #Headliners \n\nMore: https://t.co/aVqYKtDa… @matthew2cooper2 Yes. @mskkennedy Think so. @CurryKingWurst Yes 👍 @billytheyido Yes All the music I used in #AfterLife2 https://t.co/sc44LYofCf RT @purbrooktony: \"Yeah, he's got loads of other nicknames not just the Nonce ...\"\n\n#afterlifeseason2 #AfterLife2 https://t.co/mo8D90LVm1 RT @Clark1995Clark: “Eat some bloody fruit!” 🤣\n\n#AfterLife2 https://t.co/opIMMylVct @RightHonorableJ Yep @Tim_A_Roberts Yes. Cheers 🙏 @ChangerClimatic Sorry for your loss. @moylie69 Thanks Sarah 🙏 @purbrooktony @DerekCliveQuote 👍 @AndyBayes 🙏 @Clark1995Clark Lenny looks like a Giant Tortoise. @MissJoHartley 🙏 RT @purbrooktony: \"He was basically an arse peg\" 🤣\n\n#AfterLife2 #afterlifeseason2\n#RIPRogerElms https://t.co/qfCGqG6Pes RT @wolfetone98: @rickygervais We need the \"Outtakes\" soon please....I've wet myself several times watching this scene &amp; now I'm all out of… RT @Clark1995Clark: “I can’t understand a word you’re saying, but I love watching you eat.” 🤣 \n\n#AfterLife2 @rickygervais https://t.co/PV7i… @conflictor Most probably postponed I'm afraid. RT @Informe21: 🎬 After Life temporada 2: otra genialidad de Ricky Gervais https://t.co/bkErKbDHC7 #28Abr https://t.co/FCEJAsJHNR RT @filmandtvnow: Get your tissues ready... Ricky Gervais' After Life Season 2 will make you laugh and it will really break your heart too.… RT @Vertele: 🔴📝 CRÍTICA VERTELE | 'After Life 2': Ricky Gervais (pre)siente y padece la angustia de vivir un presente indefinido\n\n@Lorenzo_… RT @FilmCompanion: REVIEW: On a storytelling level, Season 2 of @rickygervais #AfterLife plays out like a repeat of Season 1. But grief is… @AshleyTheophane 🙏 @AlisonMoyet 🙏 @EthanDLawrence 😇 @welshjaci @MailOnline 😂 RT @Clark1995Clark: This scene is so beautifully written. #AfterLife2 https://t.co/96c28rY8ql RT @purbrooktony: \"Hmm! ...Just remember, there are children here\" 🤣 #AfterLife2 https://t.co/xseQdCibmd @seanpertwee Thanks, man 🙏 @leonalewis 🙏 RT @talkaboutloss: Has anyone been watching the new series of #AfterLife? It's amazing to see grief portrayed so honestly but we're sure it… @welshjaci Thanks, Jaci 🙏 RT @BlazingMinds: As @RickyGervais returns to @NetflixUK with AfterLife2, @WoodsPhil brings us his review of the brand new series and says… @woodsphil @NetflixUK Not filmed yet :) RT @AfterLife_Fans: Name a better cameo than Annette Crosbie in #AfterLife2? 😂🤣 https://t.co/iXRCcZm20i Thanks for all your amazing tweets about #AfterLife2. It was a joy to make and your wonderful comments make me even happier. This is me watching 2 idiots eat a cake. https://t.co/q5fDtcnFZL RT @NetflixES: El mecanismo de Tony de ser un imbécil para afrontar el dolor no le funciona y solo queremos abrazarle. La segunda temporada… @SchalkJacobs Lazy. RT @filmandtvnow: Get your tissues ready... Ricky Gervais' After Life Season 2 will make you laugh and it will really break your heart too.… @KerryAGodliman I love how newspapers these days make a story out of \"what a couple of people on Twitter think they saw\" 😂 @tanszshotsz @netflix @johnszu @darahimsa Great idea. #AfterLife2 still Number 1. \nBest fans in the world 🙏 https://t.co/sn50ecDCNi RT @eksiseyler: 2. Sezonu Yayınlanan #AfterLife Dizisinin Neden Çok Sevildiğini İnceleyen Bir Yazı https://t.co/1f4UjkaljS RT @NetflixJP: 彼女との生活が恋しいんじゃない\n       ただ彼女の存在が恋しいんだ\n\n妻を失い人生に失望していたトニー。そんな自分を支えてくれた周囲に恩返しをしたいと頑張る彼だが、「前向き」は中々難しくて..\n\nリッキー・ジャーヴェイス主演『After Li… Ricky: “We need a woman swimming in this scene.”\nProducer: “But that’s impossible. We’ll have to use CGI.” 😂 https://t.co/NpmF6JcKJe @chortle @Shaun_XL5 Fix what? It’s Kerry swimming in Hampstead pond. I filmed it on my phone. @chortle There are no effects. It’s real. Why would we need special effects? RT @TheView: THIS MORNING: We’re catching up with our friend @rickygervais and hearing about his show #AfterLife. https://t.co/6uxfvejui5 @SweetTale4u @netflix yep RT @purbrooktony: Knowing this bit was ad-libbed has made it even funnier now @rickygervais 🤣\n\n#afterlifeseason2 #AfterLife2 https://t.co/I… RT @Clark1995Clark: Loved this scene. #AfterLife2 https://t.co/p1AKLzPJNg RT @Clark1995Clark: Give the man an Oscar. #AfterLife2 https://t.co/r911ILuDRu RT @purbrooktony: \"Absolutely crammed with love eggs\" 🤣\n#AfterLife2 https://t.co/oOYPNUF50A @shinsokkutrash I did 🙏 @nemo8967 🙏 @acrossley2602 yes :) @nyb0r 🙏 @RebeccaStead9 IPA RT @newmanstings: Didn’t really think this through when I said yes did I? #AfterLife2 https://t.co/iGYEfN4Amt @Clark1995Clark Thanks. @MattSibson Proper Breakdown. @baikal @NetflixFR 🙏 @KimMartina Sorry for your loss https://t.co/cVq5T6jvce @JaneyGodley @Roisinconaty We recorded about 12 minutes and cut it down. The story about the blow job was amazing. I had to ask the audience not to laugh. Haha RT @NIAMonline: Will’s take on #AfterLife2 is now live. This beautiful yet dark-comedy is an emotional rollercoaster and well worth the wat… @AnnVandalay yep @thejasonbyrne @netflix 🙏 RT @thejasonbyrne: If the misery of Covid_19 is bringing you down, go to @netflix n watch the totally miserable, yet hilarious \"Afterlife\"… @Martina 😂 RT @beffshuff: Anyone else watched #AfterLife by @rickygervais yet? Absolutely beautiful.\nhttps://t.co/VR1Ss83JkA @martyswild We just don't know yet I'm afraid. @marcgoddard_uk 🙏 RT @LaurenHeraldSun: Just watched the last three episodes of #AfterLife alone in the dark and if anyone needs me I’ll just be over here dro… RT @pjhelliar: Binged After Life s2 today. I have no idea what genre it is &amp; I don’t care. It stands alone. Can’t think of any TV series th… @MissJoHartley @colinhoult @TheRyanFoat @robspratt @EthanDLawrence At one point in the argument Ken said to Sandy \"This is why I hate women\" Hahaha Cheers Tony 🙏 @NMBLAKE 🙏 RT @purbrooktony: \"I've seen FUCK ALL I may as well had been a tree\" 🤣\n\n#AfterLife2 https://t.co/EFAofu1PO2 RT @Peccleston: @rickygervais @purbrooktony @missdianemorgan I hope that's on @newmanstings CV! https://t.co/e5zauNuS7i RT @MasalaBai: #AfterLife2 just rips your heart out, doesn't it. What stellar work by @rickygervais. RT @RamVenkatSrikar: #AfterLife2 is the pillow you can cuddle on to, and laugh &amp; cry along. This is what we all need right now.\n\nWrote a pe… @purbrooktony @missdianemorgan RT @raintownmusic: If you’re looking for a great series to get you through, check out @rickygervais #afterlifeseason2 #brilliant Honestly b… RT @PaulTatnell: Adding to the chorus - #AfterLife2 is outstanding - well crafted and brilliantly written series. @rickygervais and cast ou… RT @KateRobbins: I’ve just watched the the first ep of #Afterlife2 and it’s even more powerful /funny /poignant/ beautiful/sweary than seri… RT @KubbraSait: Just need six episodes to tell you how valuable grieving is.\nSo grieve the loss - you need it, but promise yourself you won… RT @buffa82: Binging @rickygervais’ #AfterLife Season 2 and just like the first season, it gets so much better with each episode. I can’t s… RT @yousefcircus: @rickygervais Afterlife 2. absolutely brilliant Ricky. Can’t recall being so locked into a tv show for such a long time.… RT @suzipeep: #AfterLife2 is another masterstroke from @rickygervais Binge watched the six episodes in one go. He makes you think about the… @KubbraSait 🙏 @Manny_Alicandro 🙂 @matracaberg @afterlife 🙏 @allihagendorf @netflix 🙏 @AntonyCosta @gillinghamjoe 🙏 RT @StefanTetelepta: In the brilliant #Afterlife @rickygervais follows the Kűbbler Ross curve. So \n if Season1 was anger and S2 was depress… Thanks for all your amazing tweets. #AfterLife2 is still trending! https://t.co/Ave3Vk1Xib RT @ArmatradingJoan: Just watched the last episode of After Life 2\nGot to get this off my chest. Who does @rickygervais\nthink he is writing… @_LukeWilletts Just got a few ideas in case. @russellcrowe @rustyrockets 🙏 RT @Javier_Suarez_I: Según dice @RosaMartiS, @rickygervais es como lo esperas, pero aún mejor.\n\n@EsquireEs \n@NetflixES https://t.co/4D2Ew9Z… @purbrooktony 😂 @ArmatradingJoan 🙏 RT @TheVersion: Congratulations to @rickygervais and the cast of #AfterLife2 - it is currently the No.1 show on @Netflixuk https://t.co/oPS… RT @montie: #AfterLife with @rickygervais oozes life-affirming humanity. I’ve cried and cried during the six episodes of season two - alter… RT @rustyrockets: My podcast #UnderTheSkin from @hearluminary is out today with @rickygervais and it's on YouTube now too! Enjoy!\nYou can w… RT @filmandtvnow: Get your tissues ready... Ricky Gervais' After Life Season 2 will make you laugh and it will really break your heart too.… RT @ThatBloke_Jesus: Even though @rickygervais and me don’t get along, I do have to say what a masterpiece #AfterLife2 is. RT @elliot_gonzalez: The laughter is as loud and the sadness is as deep on a second watch of #AfterLife2. My favourite scenes are still tho… RT @wolfetone98: The wonderful Annette Crosbie! 😉\n#AfterLife #AfterLife2 @rickygervais @tonypaulway https://t.co/U8quocddIk RT @MMTipping: ‘Rocketman’ who ?!\n\nThe wonderful @EthanDLawrence and amazing @MissJoHartley showing how it should be done. #afterlifeseason… RT @BrianMcFadden: Thanks @rickygervais #AfterLife2 was incredible. More laughs, more tears ,brilliant soundtrack and wonderful character d… RT @wolfetone98: \"Can I call you Dad?\"\n\"Not at the moment!\" 😂😉😂\n#AfterLife #AfterLife2 @rickygervais @MissJoHartley @tonypaulway https://t.… I think this GIF could prove very useful on Twitter. https://t.co/tYIBJrjjMd @RoArquette 🙏 @hammockmusic 🙏 \"We try to make sense of it all\" is my new favourite Hammock track by the way. Perfect. @MattSibson FFS @Clark1995Clark Expect this scene to feature heavily in the outtakes package. https://t.co/DhDI0DBS2K @SeanMcLoughlin 🙏 @ElizabethChilm1 @afterlife I choose all the music 👍 @purbrooktony Think we eventually got this on take 15. @purbrooktony Did all his scenes in one day. I couldn't breath. Ruined nearly every take. Impossible. RT @rustyrockets: My podcast #UnderTheSkin from @hearluminary is out today with @rickygervais  and it’s free on iTunes/Spotify - wherever y… @bailey42a @NetflixUK Sorry for your loss. @charlietantrum Amazing. @blockjayne1 I wish. @IndiaWilloughby Thank you 😇 @ArmatradingJoan 🙏 @DreyfusJames 🙏 @Nedwell2002 No. We even had a read through. She's just an amazing actor :) @IndiaWilloughby 🙏 @BrianMcFadden 🙏 https://t.co/QYivKgiyT8 Good girl! https://t.co/oZ3XXCNPsi RT @NetflixUK: Things you should know:\n\n– After Life s2 is out today\n– The dog, Brandy, is back\n– Brandy is played by Anti\n– It’s Anti’s ac… RT @DEADLINE: Coping with COVID-19 Crisis: Ricky Gervais On Mourning, ‘Tiger King’ And Celebs Singing “Imagine” From Their Mansions https:/… RT @GalinHollywood: Thank you @rickygervais for helping break me out of my quarantine stupor with a wonderful conversation about life, deat… @GalinHollywood @netflix 👍 @JustMissEmma 🙏 @WeatherDog3 Cheers, sausage. @BBCRadio4 I once read one of those 'How to Write a Novel' books when I was about 17.  It said something like, never start a book with swearing or talk of the weather. Since then I've always wanted to start my novel with \"It was raining like a c*nt\" @davethomasjnr I listen to \"Little Piece of Nothing\" EVERY day. @wayofthemorris I thought you wanted the money to buy a new hoody. RT @HolliDee: Happy AFTERLIFE 2 Day. @netflix #afterlife #afterlife2 @rickygervais #cameo #butchersbin https://t.co/lqskU25fRd RT @woodsphil: I promised a review of #AfterLife2 promptly on the day of release. I am astounded that @rickygervais has reached and surpass… @O_Calceteiro Yes :) @SteveSpeirs4 State of this. https://t.co/rprMGzNsHe @MattSibson My favourite filming experience ever. We had to come back and do it again the next day. That has never happened to before. Wait for the outtakes of this. Mental. @_PatriciaV_ 🙏 @purbrooktony I didn't. I ruined most takes. RT @Clark1995Clark: So, I’ve just finished watching all of #AfterLife series 2 on @NetflixUK.\n\nIt’s probably the best piece of work @rickyg… RT @GQ_France: Franchement, c'est fabuleux 👏👏👏 #AfterLife @rickygervais @NetflixFR \nhttps://t.co/BxYkmGAXZq RT @RadioTimes: We're excited to have @rickygervais on this week's cover ahead of season two of his hit comedy After Life - on @Netflix tod… RT @tonypaulway: After Life series 2 has arrived! On Netflix right now. #AfterLife #AfterLife2 @rickygervais @netflix @NetflixUK @NetflixUK… RT @MandiDhillon: Happy #AfterLife2 day 🤗🤗🤗 hope you all enjoy it #HopeIsEverything https://t.co/Rg2uZPMSYX RT @AfterLife_Fans: NOW ON NETFLIX! #AfterLife2 https://t.co/xS652MQued RT @SteveSpeirs4: ⁦The second series of ⁦@rickygervais⁩ ‘s masterpiece has just landed on Netflix. I’m VERY PROUD to be a small part of it… RT @MissJoHartley: It’s world #AfterLife2 Day! @rickygervais \n#AfterLife season 2 is NOW on @NetflixUK — enjoy peeps! 🍿 https://t.co/nULUYG… RT @olliecomicstrip: Happy #AfterLife2 Day, @rickygervais @MissJoHartley @missdianemorgan @KerryAGodliman @tonypaulway @bradders_david @gil… RT @NetflixUK: After Life season 2 is now streaming. RT @elliot_gonzalez: Happy #AfterLife day! Here’s a little drawing I did of the #AfterLife2 poster... @rickygervais @KerryAGodliman \n\nSee m… RT @PatrickMulkern: #AfterLife2 is quite brilliant, very funny and piercingly sad –\n@rickygervais's finest. All of series 2 will be availab… https://t.co/cLi6z2njDx RT @mariecurieuk: #AfterLife by @rickygervais tackles some tricky subject matter. Here's why we'll be tuning in to series two - starting th… @moylie69 🙏 https://t.co/0y4sCgE4aW RT @awards_watch: 'After Life' Season 2 drops at midnight on Netflix. Read our review where @crspringer9 finds Ricky Gervais at his best an… @Clark1995Clark @elliot_gonzalez Wow. RT @daveleedwnundr: Once again, @rickygervais knocks it out of the park with his second season of After Life. Lighter, but just as hilariou… RT @lexyyyD: Had the absolute pleasure of binging #AfterLife season 2 in one sitting ahead of its release. Honestly brilliant stuff @rickyg… https://t.co/fHwNuAbi4Y @aisling_24 Postponed, yeah. Thanks for watching “The Willoughbys” on @Netflix 👍 https://t.co/sdGXN7pID3 RT @olliecomicstrip: They said it couldn’t be done, but somehow I’ve managed to make this extremely funny scene from @rickygervais’ #AfterL… RT @AfterLife_Fans: #AfterLife2 - this Friday, April 24th. https://t.co/UjwEplXoUh RT @bbc5live: ‘Millionaires in their mansions shouldn’t lecture normal people’\n\n@rickygervais tells @TherealNihal how he's finding the lock… RT @hearluminary: This Saturday = @rickygervais + @rustyrockets on #UnderTheSkin! https://t.co/GoXJ6qtzRt https://t.co/0m6AGFR8QH RT @bbc5live: 🤩 New #HeadlinersPod - @rickygervais \n\nHe chatted to @TherealNihal about series 2 of After Life, his love for dogs and life u… RT @JOE_co_uk: “I’m not French, am I? You can't just shout things and it’ll make me more French!”\n\n@rickygervais and the After Life cast an… https://t.co/JwVEzFpe7T RT @BritishGQ: With the second series of his smash-hit black comedy After Life set to arrive on Netflix tomorrow, we speak to @rickygervais… RT @NetflixUK: Reminder: Season 2 of @rickygervais' After Life arrives at 8am tomorrow morning. @Ross_Fisher Haha. He can't concentrate because he knows it was filmed in real places and not the fictional town of Tambury 😂 RT @DerekTVShow: I loves the dog!\n#AfterLife2 on Netflix around the world tomorrow! 🐶 https://t.co/Eek4pt6Oln RT @RealKevinPalmer: Just finished #AfterLife2 and it takes you on a journey that highlights so many of the best qualities in the human sou… RT @Clark1995Clark: Only 1 day left until series 2! #AfterLife\n \nhttps://t.co/XK7fnm9RbE RT @elliot_gonzalez: \"I had a dodgy nighty on and my (on-screen) son was around. It wasn't the most glamorous love scene!\"\n\nEarlier this we… RT @RadioTimes: Coming soon… https://t.co/BlQTUqnF98 in conversation with @rickygervais. Ever wanted to ask the #AfterLife2 creator, comedi… @ChrisAvern @RadioTimes Great question 👍 RT @elliot_gonzalez: \"Lenny's probably moved on more than most!\"\n\nEarlier this week, I caught up with the brilliant @tonypaulway about #Aft… RT @DavidBrentMovie: Sort of like the stuff I write... \n#AfterLife2 comes to Netflix tomorrow! https://t.co/u3C7ERtxmI RT @TherealNihal: Watched 5 episodes of @rickygervais second season of Afterlife back to back last night.  I couldn't stop. The man himself… RT @AfterLife_Fans: Tomorrow! 😱 #AfterLife2 https://t.co/rvtbUpOGfK RT @AfterLife_Fans: #DidYouKnow #AfterLife was the most watched British comedy in the world last year. It returns with a brand new series o… RT @alexdelasalle: Mr @rickygervais is worth every penny of the £110 Million that Google says he’s worth https://t.co/mCyiBJwYcK RT @pilottvmag: It's a huge pod this week, as @rickygervais talks about #AfterLife series 2, and we review that plus #NormalPeople, #Gangso… https://t.co/9WW209XULT @JimboFingers sorry for your loss @WeatherDog3 Yes I think so. @CineroomTweets Real. @Tooscie Lovely https://t.co/BJrCvbwrbk @therealidiotboy Amazing isn't it. @stuartdritchie 👍 .@boydhilton What a beautiful piece of writing in @pilottvmag 🙏 https://t.co/EJQkP9URlH @doodledawne Yes. Thank you. @OqieQuotes @ChicagoTheater As far as I'm concerned, if you can't make the rescheduled date you should get your money back. @mycroftsgirl Sorry for your loss. RT @NetflixUK: https://t.co/m9yD0KtGaV https://t.co/tSpT5VDcCC RT @bradblanks: Had a fantastic quarantine chat with @rickygervais about his very moving &amp; funny AFTERLIFE Season 2 - it comes out this Fri… @paulak1976 Binge! @PvtBuddybum @WeatherDog3 Happy Birthday! @KateStrike So annoying. RT @livenationdk: Hvad skal du lave fredag aften? Hvis vi må komme med et forslag, så kan vi varmt anbefale 2. sæson af @rickygervais' Afte… https://t.co/csq4BxJ8yM RT @BritishGQ: This week's #GQHype cover star is @rickygervais.\nWith the second series of his smash-hit black comedy #AfterLife landing thi… RT @NetflixUK: Back when they were allowed to sit this close to one another, @rickygervais asked co-stars @tonypaulway, @KerryAGodliman, an… RT @MashableItalia: After Life 2, Ricky Gervais non è mai stato così buono ma il lieto fine è molto lontano. La serie arriva dal 24 aprile… RT @alanivory: When the dogs just can’t wait until Friday to watch ⁦@rickygervais⁩ ‘s #AfterLife2 on ⁦@NetflixUK⁩ ⁦@netflix⁩  https://t.co/… RT @Clark1995Clark: @rickygervais is THE CAT. \n\nNow on Netflix. \n\n#TheWilloughbys https://t.co/PlBldeypwx RT @DEADLINE: ‘The Willoughbys’ Review: Ricky Gervais As A Chatty Cat Leads Cool Voice Cast In Frenetically Funny Netflix Toon https://t.co… RT @Clark1995Clark: Only 3 days until series 2! #AfterLife https://t.co/oyTzaTT6xl RT @rustyrockets: This Sat 25th April my #UnderTheSkin podcast with @RickyGervais will be available everywhere, for free from @hearluminary… @garry_crew 😂 @SteveSpeirs4 @MikeBubbins @distantpod @elisjames @SteffGarrero @ScottQuinnell I can confirm this. I once watched you try to stand up from a low, comfy sofa. It wasn't fast, but you never gave up. @Jaack Really fucking annoying. @sean_usmc @AfterLife_Fans 5 I think. It's mental. https://t.co/hXr039fF4e @benschwartz_ @jairbolsonaro @RTErdogan @GerryAdamsSF @khamenei_ir Maybe Baby \nLesbian Vampire Killers \nCats \nPeter's Friends \nSliding Doors RT @LiveNationES: ¡Este viernes en Netflix se estrena la segunda temporada de After Life con @RickyGervais! Ponte al día con la primera o m… @Flewthekupe It will be postponed till next year :) RT @brucedes: Picture Gallery: After Life Season Two with @rickygervais @kerryagodliman @PeterEgan6 @tonypaulway @EthanDLawrence @MissJoHar… @IndiaWilloughby @piersmorgan @susannareid100 @TonyParsons @BoyGeorge 5 Perfect Movies \nThe Godfather \nOne Flew Over The Cuckoo's Nest \nIt's a Wonderful Life \nWall Street \nDouble Indemnity \nNominate @KerryAGodliman @gillinghamjoe @tonypaulway @MissJoHartley @EthanDLawrence RT @jamescdyer: What’s that? The podcast isn’t long enough? Well, this week’s show features a *mammoth* interview with @rickygervais about… RT @LiveNationFI: TULOSSA ✨🎥\n\n@rickygervais After Life kausi 2 Netflixissä perjantaina 24.4.! 💛 Sarjaan pääset tutustumaan tästä: https://t… RT @TeamCoco: Listen to @rickygervais on \"Conan O'Brien Needs A Friend.\" https://t.co/RoHnQLaKpc RT @Clark1995Clark: Go add @rickygervais’ #AfterLife to your Netflix ‘My List’ and give it a thumbs up. \n\nhttps://t.co/PCByxxVdaF\n\nThis Fri… RT @Kickinnstreamin: Ep. 59.- Ricky Gervais Is Back With “Afterlife” Season 2 https://t.co/l8edBvXbMt https://t.co/tfkTLYzRlf 😢 https://t.co/G7I6tWdUFI @realpeteniro I like your little beard 👍 @therealidiotboy Looks great. @MrAdHutchinson IPA, then red wine. https://t.co/5ZTWe94Eor @wayneM7 Sorry for your loss. @HaydonAnstis Will do. @StungSting Is the top sealed? RT @RadioTimes: .@rickygervais says #AfterLife season 2 “might resonate even more” in challenging times https://t.co/mTzRY2OCKS https://t.c… @Kr0lis @ConanOBrien His body and my head was always going to be the better combination. RT @NetflixFR: Cette semaine, on a :\n\n✅ Les deux premiers épisodes de The Last Dance (déjà dispo)\n✅ The Midnight Gospel, par le créateur d’… RT @NetflixNordic: This week on Netflix: Morgan Freeman, nature documentaries and @RickyGervais 's search for happiness.\n\n22/4\nThe Story of… @NandoFJG Yes. All over the world! RT @DATSREC: Happy Monday, all. In these strange times, we thought it worth remembering this wonderful Ricky Gervais quote... https://t.co/… https://t.co/d4OpsXY1Y1 https://t.co/pCCM1Zr4e7 @leb_ans yes @Shanghaianddry 🙏 @TheIainAnderson I couldn't resist 😇 https://t.co/tSpT5VDcCC @meowitsjoey Happy Birthday, Joey! Could this be the most profound and beautiful 5 minutes of television ever made? https://t.co/RPeEfVy6mO @piersmorgan Brilliant. https://t.co/CvKLSKAi58 @ChefPollard1 6pm @jack_tosney @fdarena It's not looking hopeful but I really don't know. @loulabelle46 I'm hopeful for October but I really don't know I'm afraid. Sorry. @tlukowski Postponed https://t.co/IhN6vX3wol @RealKevinPalmer @NetflixUK Thank you, Kevin. @_londonfox Yes RT @playtusumag: ricky gervais'in bir kez daha \"ben dünyanın en huysuz ama komik insanıyım\" mottosuyla kalp kırarken güldüreceği dizisi aft… @anormalhuman9 @PatrickMulkern @netflix I am do that when no god because high five not prayer. https://t.co/fHwNuAbi4Y https://t.co/tSpT5VDcCC RT @Clark1995Clark: Favourite one liner from #AfterLife? \n\nGo! https://t.co/SnFPlbxuPb https://t.co/PWVE6Dl9mk @Catchasalmon88 Sorry for your loss. @kirstiealley 😂 @PatrickMulkern @netflix 🙏 RT @meowitsjoey: Can you tell my mum is bored in lockdown? Pulled out this giant whiteboard and drew this monstrosity 🙀 Apologies in advanc… https://t.co/fHwNuAbi4Y https://t.co/cWYWQgtlCO @ChrisSexyHeroes Yes. Early next year now. https://t.co/DsL8BIfFYO RT @JK_Vincent2: We’re not just here for us, we’re here for others. Watching #AfterLife again... little recap. @rickygervais You’re a geniu… RT @iiijohan: Just binge watched #AfterLife for the second time. So brilliant, thank you @rickygervais. Looking forward to #AfterLife2. RT @CrossyTweets: We got a preview of #AfterLife2 and man alive @rickygervais really is fantastic in it...\n\nYoull laugh and cry and then re… RT @awards_watch: TV Review: 'After Life' Season 2 finds Ricky Gervais at his best and most vulnerable #AfterLife https://t.co/JaIqAmGiDg @WeatherDog3 @JaneFallon @jim73194352 Yep. @WeatherDog3 She cheered me on and took the photo. @WeatherDog3 And now you know that if you ever lose your belly winkle, half a carrot with onion roots sellotaped to the end is a good replacement. @WeatherDog3 https://t.co/VZ26G490fU RT @Clark1995Clark: “It’s like a butchers bin!” 🤣\n\n#AfterLife @rickygervais https://t.co/nFWFooOyJb Watch it. It's the good type of crying. 😭 https://t.co/LSSuDwXXlD RT @fanni_walsh: Just watched #AfterLife again getting ready for #AfterLife2 and wow it was even better the second time round. @rickygervai… @BrillhartTy As your good book says, “God will turn this valley of tears into a city of everlasting joy.” 😇 https://t.co/mvLFTNxUqU @RealKevinPalmer Enjoy 👍 https://t.co/rc9zJjqDlz https://t.co/OjKq1Z6URw @ummilife Winston Churchill on WW2 @DanWarbirds 👍 https://t.co/OfXXYvmScJ RT @fizzywiggle: After watching first series of #AfterLife  hoped @rickygervais did not do a second series as it was that brilliant ..now i… RT @LaraObie17: I rewatched @rickygervais’ #AfterLife for the second time. It hits me in the feels every time. Looking forward to the secon… RT @TheVersion: \"Worth the @netflixuk subscription alone\" - Hear our five star review of @rickygervais's #AfterLife2 ⭐⭐⭐⭐⭐\n\nGo to https://t… @scolar1971 @mirrorjeffers @NetflixUK @netflix It's 8am UK on the 24th so late afternoon early evening across Australia. RT @mirrorjeffers: Only a week until #AfterLife2 drops on @NetflixUK 📺\nIf you are hungry for info then you can listen to 30 mins of chat fr… RT @TheGNShow: TONIGHT on our virtual red sofa, @SirPatStew, @rickygervais, @thandienewton &amp; @QueensChristine! Friday at 9pm on @BBCOne #Th… @dlclark0309 Cheers RT @Clark1995Clark: One week until series 2! #AfterLife https://t.co/d7qA95jy4K RT @Independent: Sir Paul McCartney and Ricky Gervais among 100 celebrities to contribute to NHS charity book https://t.co/2euJZnsWzr https://t.co/fHwNuAbi4Y RT @FakeRobHunter: \"Being healthy is just dying more slowly.\" -- I know @rickygervais isn't everyone's jam, but season two of #AfterLife is… RT @TheVersion: \"Worth the @netflixuk subscription alone\" - Hear our five star review of @rickygervais's #AfterLife2 ⭐⭐⭐⭐⭐\n\nGo to https://t… RT @TheSunTVMagEd: Happy ever #AfterLife… @rickygervais reveals all on the second series of his brilliant @NetflixUK comedy-drama, talks Th… @KateRobbins I just thought it was a really great impression. @TwitKevCollins @hammockmusic 👍 RT @RTE_Ents: Joining Ryan on the @RTELateLateShow  tomorrow night -\n@Paul_OConnell,@SamanthaJPower, Colm Meaney, @rickygervais, &amp; @CMOIrel… RT @ilvenerdi: È in arrivo su Netflix After Life 2, seconda stagione della serie scritta e interpretata da @rickygervais. Che continua a sc… @TheRossOwenShow haha https://t.co/rLHlr6A8Fa @DavidQuinn101 Definitely purple. @rustyrockets @hearluminary Tell 'em about our brilliant podcast wot we just dun. RT @TheGNShow: This week on our virtual red sofa, @SirPatStew, @rickygervais, @thandienewton &amp; @QueensChristine! Friday at 9pm on @BBCOne #… RT @SocietyOfficiel: Il est sorti !\n\nAvec, à l'intérieur, une interview de @rickygervais ; les portraits de Salomé Bourgeau, qui étudie le… RT @Clark1995Clark: If everyone in the world with Netflix clicked on ‘Remind Me’, it could possibly become the most watched show this year.… @WeatherDog3 Amazing. RT @dailystar: Well said @rickygervais\nhttps://t.co/DziUnTlDbe RT @TheVersion: Just watched #AfterLife2.\n\nMy god.  Didn't think it could be better than season one but it's absolute genius. I don't know… @Clark1995Clark Thanks, Daniel 🙏 RT @filmloverss: Ricky Gervais’in yaratıcısı olduğu Netflix dizisi #AfterLife’ın heyecanla beklenen yeni sezonunu ekibimizden @Cmzsfl incel… RT @ladbible: We paid @rickygervais a visit on the set of After Life 2.\n\nhttps://t.co/kA9ggifMmY RT @TheSunTVMagEd: This Saturday, an exclusive #TVMag interview with @rickygervais ahead of the brilliant series two of #AfterLife on @Netf… RT @cinefilosit: After Life 2: recensione della serie di e con Ricky Gervais #ILoveCInefilos https://t.co/EBNVROlKJ6 https://t.co/vGtpczqfkG @mw1ll1s Pickled Onions. https://t.co/yPYFLHMRxf @WeatherDog3 \"Good Boy\" George. @WeatherDog3 @ladbible Down boy! @connorratliff @ElvisCostello He recorded it one weekend as a favour. Amazing cover by an amazing artist. @dawn91833099 sorry for loss @meowitsjoey Midnight on Thursday LA time so 8am Friday UK. RT @Clark1995Clark: Great little interview with @rickygervais in this month’s issue of @pilottvmag. #AfterLife https://t.co/eCRsIUG9z4 @WeatherDog3 No. Sounds interesting. @blackwell_dgf The dog putting her massive paw right in my testicles. RT @NME: **Spoilers ahead** \n\n#AfterLife @RickyGervais https://t.co/decViKH76G RT @Clark1995Clark: Only 10 days until series 2! #AfterLife \n\n https://t.co/m0tWZkKaUH @RsPills Brilliant. https://t.co/CbzMeG5Hy3 RT @GervaisTrivia: #AfterLife was the most watched British comedy in the world last year. It returns with a brand new series on April 24th.… RT @TheVersion: Congratulations @rickygervais, our readers voted #AfterLife the best original comedy series in our Netflix poll.   #Netflix… @StephenKing \"Shut up, and deal\"  - The Apartment \n\"To my big brother George, the richest man in town\" - It's a Wonderful Life. @gillinghamjoe I'm in! @Milkers4C Mental 😂 @BalanceLDN @MissJoHartley @JamesGillComedy @NetflixUK Brilliant. RT @BalanceLDN: We chat with one of our finest actors - Jo Hartley - on the BALANCE podcast. Out now. We chat Ian Brown, Shane Meadows, @ri… https://t.co/TjtWOtmrTF RT @DailyMailCeleb: Ricky Gervais calls for end to 'wildlife wet markets' and warns that we WILL face another pandemic if they continue to… RT @LeeJefferies: Been on #LockdownEaster Finally got round to watching #AfterLife I can see why everyone was going on about is. @rickygerv… @gtlindley9 6pm Thank you 👍 https://t.co/Rt9XkZHO2b @jane_kjane Just realised that little thing is holding bottles too which makes me not want to bother :) @Tony_young78 Yep, that's a totally valid opinion👍 https://t.co/UWvqp4pJk0 RT @Micheleluc10: @rickygervais My 14 yr old and I just watched #Humanity. She said she likes how you explained why it's ok to laugh at con… @jim73194352 @purbrooktony @JaneFallon Keep your ideas to yourself 😫 @Stephanie_KJ Great @Twoshortplancs I have. Amazing. https://t.co/IO7ALbiYim Can't believe this was 14 weeks ago! https://t.co/NuqoVfByt4 RT @IAR_updates: Thank you for standing with us at this difficult time @rickygervais. The effect of this crisis on our sanctuaries is becom… @Ryllley @NetflixUK all at once RT @HSIGlobal: EXPOSED: Indonesia’s wildlife wet markets where bats and snakes are STILL on sale despite #coronavirus risk. https://t.co/9i… RT @NOWTV: #TheOffice is timeless and we can't be convinced otherwise...\n\nIt's also worth watching just to see *that* @rickygervais dance a… RT @Clark1995Clark: 8 years ago today the first episode of #Derek aired. \n\nhttps://t.co/0lx2YJsUce @filmandtvnow 🙏 https://t.co/iuJzc3iJH4 @ScottDrane Happy Birthday, Jane! @WeatherDog3 A quick one yes. @kerryfowler_ Anne is the easiest character to write for, mainly because Penelope Wilton is so utterly brilliant. RT @NetflixUK: The dog is back. @rickygervais is back. The genuinely gut-punching messages from his dead wife are back. It must be the trai… RT @NetflixIT: Brandy: ✅\nMessaggi tristissimi dal passato che lo renderanno una persona migliore: ✅\n@rickygervais: ✅\nOk, è la seconda stagi… RT @GQ_France: La deuxième saison de la série #AfterLife débarque sur #Netflix le 24 avril. 🥳 Pour patienter voici la bande-annonce avec un… @AmandaLarkinH No. Cheers. @Clark1995Clark Ep 7 tonight @HarpoArt It's based on a true story 🤮 @TravelAddict50 They'll definitely be postponed. @Sleak_17 AfterLife is worldwide. https://t.co/okD2baZXuR https://t.co/hWG5FgzHnw RT @getFANDOM: Netflix’s ‘The Willoughbys’ starring Ricky Gervais drops poster and key art\n\n(via @netflix) https://t.co/a1TltT9Qto @thehairycats @FiGilg Nope. @jobeone125 @JaneFallon @myleftfang Beautiful. @PhiladelphiAnne 12 @Mick_Chapman82 Of course 👍 @FiGilg No but it is a love song. #AfterLife2 🙏 https://t.co/OxTye2sZqq @signofthetwines @DerekTVShow @MrDerekNoakes 😂 Love it! https://t.co/4hGp9WimmV 'Hope Is Everything' \nHere's the poster for #AfterLife2 https://t.co/Xs6bweSQt3 @NotPrincessChar Sorry for your loss. @SanderBergeFan Yep. Twice as much as season 1 👍 @Sundaymusicnow 🙏 RT @etnow: Check out this exclusive sneak peek at Netflix’s #TheWilloughbys, featuring a talking cat voiced by the one and only @rickygerva… @WeatherDog3 @WetnoseDay You should sing them the song fatso. I’ll sign a photo. @WeatherDog3 @WetnoseDay I could post a signed Afterlife postcard to them if you got their name and address. @WeatherDog3 @WetnoseDay Pest. Can't we think of a better prize than that? RT @NewOnBritBoxUK: The Office [BBC] 3 Seasons [G] Ricky Gervais’ smash-hit comedy that spawned the legend, David Brent. Follow the lives o… This is the charity I mentioned on tonight's broadcast👉 @galgos_GIN 🙏 https://t.co/Tg9koAXogo @Clark1995Clark Early morning LA I assume. @FiGilg Not yet. Good idea. https://t.co/oMjdbW5Ha3 RT @HellfireFilm: @Dylan_Bostic We had to cancel our physical events but we launched Hellfire@Home Film Festival so we can all watch movies… RT @DavidBrentMovie: #WednesdayWisdom If you want to be like David Brent, stay indoors. Live fast, die old. https://t.co/l3Igq6n3WO @watsoncomedian Only one wee per night? Pathetic. Dear Twonks, please make yourself known if you're a health worker! My pals at Twitter might get in touch with a few of you and get you some goodies. Cheers 🥂 #worldhealthday https://t.co/fDZGMAf00b Dog Bless You 👉 follow @dotslondon &amp; @pupaid 🙏 https://t.co/Vg0aS25cFy https://t.co/soOo5jwef3 RT @ScarlettBeagle: Rescued ex-lab @ScarlettBeagle is with @rickygervais &amp; @PeterEgan6, in a @K9Magazine article by medical doctor Ray Gree… @simon_price01 I bet the lying twat won it on 'Bullseye'. This is what goes on in my brain when I'm playing with a dog. https://t.co/bTrbMv3yes @LaplaceSimone So sorry for your loss. @OurKelly Happy Birthday, Belle🥂 @kirstiealley 😇 @Janeanvandusen I'm sure they'll be postponed I'm sad to say. @Clark1995Clark I think I've managed to do all the ones scheduled if not more. RT @Ennuigo17: Wednesday 4/8-Sun 5/12 5pm GMT Raffle In honor of @myleftfang Hosted by a Parrot! @ParrotStanley to benefit @jerseycatsorg r… @AgnstModFball Ah, ok. @J_Lutz8 Yep @HetOeditions I don't think they sell enough for publishers to bother. @MRKD26 Baftas https://t.co/xiPRLlSXhR @Clark1995Clark Day before hopefully. RT @marcthevet: 'New Legislation Called #LucysLaw Will Crack Down On Puppy Farms' Thanks @ladbible for this excellent article about today's… RT @themayhew: As of today, #LucysLaw officially comes into force! 🙌 This new legislation will ban third party sales of puppies and kittens… RT @JBDT: Hi Ricky, I know you won’t reply but did you know GhostTown is trending on Netflix ? Anyway, when is the next season of Afterlife… @StevenWTheGreat Or a jousting pole. @Flat__l1ned Increased. https://t.co/GgMOfvS5nQ RT @NatKutscher: Hi @rickygervais - just a quick one, I'm a big fan &amp; it would make my day if you could share this as I've been balling it… 13 weeks ago. https://t.co/HUsq4c5CKF RT @Clark1995Clark: .@MissJoHartley great little interview on @SundayBrunchC4. Bring on April 24th! #AfterLife \n\nhttps://t.co/FBwrPU1hxi @MissJoHartley @SundayBrunchC4 You were so good Jo! \nLove the fact that Linda the budgie vet got a shout out 😂 @Bailey_MP_ Everyone needs a hobby. These are the 2 charities I mentioned on tonight's broadcast 👉 @Paws2RescueUK &amp; @wildlifeaid 🙏 https://t.co/kpSp8W1jsP https://t.co/1Mhyxs59Dx RT @Clark1995Clark: 3 weeks until Series 2! #AfterLife\n\nhttps://t.co/XK7fnm9RbE RT @amberlmtthws: Everyone is loving this so have it here. @rickygervais #AfterLife #tubbyginger https://t.co/2LOWR1am1I RT @PajumaaKerli: I absolutely love Afterlife! Thank you @rickygervais But when you have to be in quarantine with your family! 😂😂 #tiktok #… RT @DavidBrentMovie: Right, going for a walk, by the lakeside, just south of Didcot. https://t.co/E1ZuK6Vr0B @TherealNihal Hope we're doing another interview for AfterLife😇 @TherealNihal 👍 RT @Paws2RescueUK: On World Stray Animal Day, please spare a thought, a share, and £1 if you can and help us to send food to rescuers to ke… @WeatherDog3 At least my winkle isn't on my stomach. (Although, my stomach is on my winkle these days.) @WeatherDog3 It looks like the bag of offal you get in a supermarket chicken. @DonnaCKE Sorry for you loss, Donna. @therealidiotboy Although, I feel I may well literally erase all these Twitter broadcasts in a couple of weeks 😂 @therealidiotboy I'm worried I haven't done enough to start erasing anything. https://t.co/l0wfXUAErC @WeatherDog3 He was one of the greats. @D_Peters458 @Ticketmaster @TicketmasterUK @TicketmasterDK @LiveNation @livenationdk @LiveNationUK I don't get this. I've checked with my promoter here and they have promised me that anyone who can't make the new date is entitled to a refund. @LiveNationUK RT @MissJoHartley: Argh, I Loved #GhostTown @rickygervais — it made me cry! What’s new? 😂 Such a heartwarming story. Great job. 👌 some crac… RT @ALR8: Anyone needing a laugh during lockdown watch @rickygervais ‘humanity’ on Netflix 😂😂 The @ASPCA is urgently seeking donations for their COVID-19 Relief and Recovery Initiative to help pets, pet owners, and animal welfare organizations impacted by the pandemic. Please consider supporting their lifesaving efforts: https://t.co/ZQPackuUyh 🙏 https://t.co/4sUlDPtVCf RT @NHSEngland: Our @CNOEngland Ruth May is joined by some familiar faces to say a very big #ThankYouNHS to all of the incredible staff, ca… @KateRobbins 😇 RT @EmyaInk: Since being a #NHS keyworker is making it harder for me to draw. Here's an old classic of the amazing Derek ❤️\n\n\"It's more imp… These are the 2 charities I mentioned on today's broadcast 👉 @themayhew &amp; @AllDogsMatter 🐶 https://t.co/StDxXBdhgM @SteveSpeirs4 hahaha https://t.co/H10ZFX3tjA https://t.co/X7645553oj https://t.co/Vv5NzEz2ye @RussBlack85 @TherealNihal @JaneFallon So sorry. RT @mrsbiffy: @rickygervais #GhostTown in my top 20. I don't cry much but this one always gets me. Amazing film. @teresalawrie 👍 RT @corrinegwest: Just watched #ghosttown starring @rickygervais - so good! Turns out my sneezing isn't hayfever after all! 🤣 - watch it an… RT @Spoonfedstill: \"I would rather be nowhere with her, than somewhere without her\". No matter how many times i hear @rickygervais say that… @omid9 @DavidBrentMovie 🙏 RT @Clark1995Clark: After Life Series 2, coming to Netflix Friday 24th April. \n\n#AfterLife @rickygervais https://t.co/pnnujMnwCQ RT @AfterLife_Fans: Got a recorder? Bored in isolation? https://t.co/h8l58Lo0JR Stay in. Stay safe. Watch #AfterLife, #Humanity, #TheInventionOfLying, #GhostTown, #LifeOnTheRoad or #Derek on Netflix🍻 And be nice to animals. https://t.co/yXY5tQ2wzA @kirstiealley 😂 @missfinemang 👍 RT @wzkphc: @rickygervais Used to dislike you for no reason really, you're annoying. Finally got netflix and heard a lot about After life s… RT @Joluckykai: @rickygervais just watched #ghosttown. Bertrum is a cross between Andy Millman #extras &amp; Tony Johnson #AfterLife, forgotten… RT @RSPCA_official: We're over the moon to have the suppawt of our friend, @rickygervais, for our #Coronavirus emergency fundraising appeal… @Wills_Princess1 Sideways by Citizen Cope. @neetha_1 The Mire RT @Clark1995Clark: .@rickygervais’ ‘Ghost Town’ is now available on @NetflixUK. https://t.co/d9G2TJYDYx @PHillyPHanne Haha. Sorry 😂 Here are the 2 charities I mentioned on today's broadcast that you should follow @PocketsWarhol &amp; @EstherThePig https://t.co/vZ9ua8kFdG https://t.co/ypoD2D1CMM RT @WeatherDog3: Getting Very excited now for #Afterlife2 24th April cannot come soon enough... At least I’ll have something decent to watc… RT @Daily_Express: RSPCA launches emergency appeal to keep rescuers on frontline amid coronavirus outbreak @RSPCA_Frontline @rickygervais h… RT @Omundson: Dearest,@netflix   can you give us the newest season of @rickygervais  beautiful #AfterLife ASAP.We think we’ve earned it., p… @romemc33 @TicketmasterDK @Twickets As far as I'm concerned if you can't make the new date you should definitely be allowed a refund. I don't know why they would tell you otherwise. Dear @LiveNationUK can you confirm? @AndyBizarre @KateRobbins 👍 Lovely little no spoiler teaser for #AfterLife2 https://t.co/fUTI34qPW0 RT @AntonyCosta: I started to re watch #afterlife last night bring on the next series 👌🏻@rickygervais #AfterLife2 @ImMarkSouls Happy Birthday, Justine 🥂 RT @Clark1995Clark: After Life Series 2, coming to Netflix Friday 24th April. \n\n#AfterLife @rickygervais https://t.co/TTwKRsm07b RT @bluejaylover49: Otis has a message of #StayAtHome &amp; also remember that #AfterLife2 comes out April 24th, if you haven’t yet watched #Af… @EyupYasar2 All at once. RT @Clark1995Clark: 24 days until series 2! #AfterLife \n\nhttps://t.co/XK7fnm9RbE @LoveSeenByClare MegaPhone in Tesco. @sutton1012 Stay in. I'm starting to get used to it now. @SusieSeptember Lazy. https://t.co/YiP6CMQyV2 https://t.co/OkMdO59mlJ Do what Robin says 👍 https://t.co/gBXJiU0ifP @nush_nush82 24th of April @olliecomicstrip @robinince Robin is a very naughty boy. @Kalirae12 Don't think so. RT @GhiyaRushidat: I added The Invention or Lying movie to my feel-good-movies list. I’ve always been a fan of @rickygervais and whatever h… @Stephke_C @myleftfang Love it. @tonypaulway Wait, does this mean you want to do more or less PR for #Afterlife2? Either way, congratulations 🥂 RT @BenMinsterFM: Been putting off watching After Life on @NetflixUK, didn’t feel ready to go to dark places with @rickygervais, but given… @MjjteresaTeresa It's less than 4 weeks. Here's tonight's wartime broadcast. It tackles the big issues like favourite toys and TV shows as a kid. https://t.co/aNhr8puMXp @olliecomicstrip Haha. Well, if you're going to take some of my insightful musings out of context.....😂 @amyamymae Yes. RT @onlyspurs: Lockdown has meant that I got another opportunity to watch ‘After Life’ on Netflix. I’m not ashamed to say this @rickygervai… https://t.co/fkWQsdJJaU @Joluckykai @anne_hegerty RT @NFTSFilmTV: That’s one way to kick start the week!\n\n@NFTSFilmTV students &amp; staff laughed the whole way through a brilliant lunchtime #V… RT @jonwardle: Everyone @NFTSFilmTV just spent their lunch break chatting with @rickygervais on Zoom. Thanks for the masterclass Ricky. Can… RT @CompanionLifeUK: @rickygervais supports a new @RSPCA_official appeal, launched today to care for hundreds of rescue cats and more durin… RT @elliot_gonzalez: Just previewed the entire second series of #AfterLife in one sitting and (sadly) that’s all I’m allowed to say for now… RT @Clark1995Clark: Imagine being in quarantine with Derek and Kev. 🤣 https://t.co/0lx2YJsUce @Clark1995Clark There are a few scenes like this in AfterLife2 that we nearly couldn't get through that provide the most outtakes. Brian Gittins is involved in most of them. RT @BBC: Remember the time Sir @IanMcKellen gave @rickygervais an acting masterclass?  👏\n\n#Extras is streaming now on @BBCiPlayer.  🙌\n\nhttp… RT @Clark1995Clark: After Life Series 2, coming to Netflix Friday 24th April. \n\n#AfterLife @rickygervais\n\nhttps://t.co/RNB5V2BkuA https://t.co/Qja7fW4gle RT @Protect_Wldlife: #DerekSays \"Be The Person Your Dog Thinks You Are\" ~ @RickyGervais. https://t.co/rKf7rHEraY @purbrooktony Oh my god. @william97330173 @elliot_gonzalez 🙏 RT @McfaddenDayna: So after 5 days, over 70hrs, 19 cups of tea, my bodyweight in food, crying, sleepless nights, hissy fits and a few cuss… @McfaddenDayna @myleftfang @JaneFallon Stunning 😿 RT @charliesxworldx: this is me every single time i use the selfie camera.. @rickygervais https://t.co/SayoH0B7j4 RT @Clark1995Clark: Poor @JaneFallon! 🤣 https://t.co/Jyjnm9qTSt @purbrooktony Oh yeah. Haha. https://t.co/0fMKWeyKEK https://t.co/iki79CiT3w RT @RichOnOWN: Started watching #Derek on @netflix again. It was a show that brought levity and comfort while I was #caregiver for my Dad.… RT @DannyRadlo: @rickygervais just finished afterlife. My wife is fighting cancer, it really hit a nerve. She's nearly done and clear now👍🏻… RT @MarisaM1110: #theinventionoflying was brilliant.  As usual @rickygervais makes you laugh and cry and feel all the good feels. @IANGIBBONS3 Top of The World By The Carpenters Watch my wartime broadcast from yesterday and send me a question or suggestion to help me out with tonight's 🙏 https://t.co/R3XHqNLg9X RT @Clark1995Clark: Which is better, ‘Hamster on a piano’ or ‘Monkey on a pig’? \n\nControversial question I know. #Derek https://t.co/CNJPN7… Now streaming on Netflix 👍 https://t.co/Ls08WfKaOf RT @dan_grooms: I’ve cried for the second time watching the hospital scene in @rickygervais’ The Invention of Lying. It has to be one of my… RT @rickygervais: https://t.co/SKLJOrQkP4 RT @Clark1995Clark: Cannot believe this was only 3 months ago this weekend. #GoldenGlobes \n\n@rickygervais \n\nhttps://t.co/9AddBijCgb @HuntyAJ A little IPA RT @GoldDerby: Hey @rickygervais, our readers want YOU to host the #Emmys this year! https://t.co/3CNzKIqnsV https://t.co/XPCSFdex8x RT @Clark1995Clark: .@rickygervais’ ‘Ghost Town’ will be available on @NetflixUK from Wednesday 1st April. https://t.co/6pLnYMgSY9 RT @PeterEgan6: .@rickygervais @grumpyoldrick. @marcthevet Please read &amp; share this statement from @AnimalsAsia : Statement on bear bile us… @sherimillmanya1 I used the get the bus to Millman Road in Reading to go the dentist. @WeatherDog3 1. Yes. But it's getting more difficult every year. \n2. Yes. \n3. Yes.\n4. Whatever Jane buys me. @JustineLloyd_ Knowing that they had a lovely life 🐈 Thanks for joining in 😇\nHere are those charities I mentioned @galgos_GIN,\n@AnimalsAsia &amp; https://t.co/VDqieTXLus 🙏 https://t.co/R3XHqNLg9X https://t.co/SKLJOrQkP4 Just Watched: Before We Die\nNow Watching: The Black Godfather\nNext Up: Sunderland Til I die 2 \n\nI nominate @KerryAGodliman @missdianemorgan @MissJoHartley #StayHome https://t.co/SD0FPrX3kC @TheSunTVMagEd @TheSun @DaisyHaggard @laurasolon @BBCiPlayer @skyatlantic @NetflixUK 👍 @Clark1995Clark I'd like it to be \"Hope is Everything\" Feel free to use this as pornography. #EveryonePullingTogether https://t.co/MeBW7O9pJq RT @Clark1995Clark: 4 weeks until Series 2! #AfterLife\n\nhttps://t.co/XK7fnm9RbE RT @sibbymeade: Oddly, @guidedogs Marty and Sammy are Fixated with @RickyGervais impersonating Bobo the chimp on #Humanity. Who knew that d… RT @thechrismartins: @rickygervais @netflix \"#AfterLife\" I'm watching for the second time preparing for the second season, \"#Derek\" I thoug… RT @divyenmistry: @rickygervais what can I say, just watched your stand up, ‘Humanity’. Absolutely brilliant! 👏🏽👏🏽👏🏽🙌🏽🙌🏽🙌🏽 RT @JordanByager: Why have I never watched The Invention of Lying before!? @rickygervais is the best. RT @deladoggy: @rickygervais watching the invention of lying, 🤣🤣 staying in bed eating and crying, after week one we’re not quite there yet… RT @djiveson: Watching Derek on @netflix.  Season 2 episode 5. @rickygervais you made me tear up. They do become part of our family. RT @davebenning_Art: Finished the live fbook painting!! @rickygervais @JaneFallon @purbrooktony @MarkLeneve @myleftfang https://t.co/Z8MMMn… RT @rickygervais: Stay in. Stay safe. Watch #AfterLife, #Humanity or #Derek on @Netflix 🥂 Oh, and hug your pets 😢 https://t.co/qyRQfm7eHk @mufc44 Funny you should ask. I wrote this to explain my position :) https://t.co/Yshc1NNjzg @jasonbright16 Good point. https://t.co/pDM403h7RW RT @watto583: The missus and I watched Series 1 of @rickygervais' #AfterLife over the past couple of nights and we're hooked; spellbindingl… RT @BBCTwo: Remember the time Sir @IanMcKellen gave @rickygervais\nan acting masterclass? #Extras #WorldTheatreDay \nhttps://t.co/h8dD8wBN5b @andrewhughes30 If the connection allows it 👍 @McfaddenDayna @_MyLeftFang @JaneFallon Amazing RT @trickyvicar: A little mind reading for lock down!\n(Me thinks you’ll like this @rickygervais) https://t.co/PwLYInv62T @AnimalsAsia Thanks 🙏 @purbrooktony Yep. Still can't quite believe the response. Heartwarming. @WeatherDog3 Yes. @isdisHell No. @purbrooktony @KateRobbins Yep @paulcarr77 I think @liamgallagher should do that himself 🙏\nhttps://t.co/uRVsKWFf6N @KateRobbins I'm the one in the middle. https://t.co/KTCAj14Y5U RT @wolfetone98: I'll be honest, I find this scene hard to watch. I'm kind of envious as I never had a father figure in my life, so never g… RT @wolfetone98: This one scene, just 60 seconds, is what inspired me to write my blog \"Is There A Secret to Life?\" &amp; has helped me so much… RT @wolfetone98: Without a doubt my absolute favourite scene in @rickygervais's fantastic #AfterLife \nJust an incredible scene...a beautifu… Thought I'd post some old shit for a laugh. This is David Brent &amp; Foregone Conclusion, live on Children In Need. https://t.co/5Ocoe1oPg1 RT @Clark1995Clark: Am I the only one who thought this was genius? 😂 @rickygervais https://t.co/bNwvswUPaC https://t.co/S8RHzaMe6k @cndrela37 Not yet but it really isn't looking good. @Prefect_Timing Always been cheese and onion for me. @RickyPedo LillyWhite What should we talk about tonight? https://t.co/36wuBr12ai RT @themayhew: Thank you so much to Ricky for spreading awareness of our work! 🐶🐱💜 https://t.co/ygYNCVnYI7 RT @BathCDH: Thank you @rickygervais for the shout out on your daily chat, much appreciated! All our staff are buoyed and ready for #woofwe… RT @rickygervais: A summer classic https://t.co/pzd5M8lseb Literally no different. https://t.co/0sdHZPVDaF @richardmarx Except one of us is wearing a wig and I'm not saying who. @MylesWardenOwen Happy with that 👍 @BrianMcFadden I actually asked and they can't unfortunately. \nHope you're well 🙏 These are today's 2 charities I mentioned 👉 @BathCDH &amp; @themayhew 🙏 https://t.co/4Wx3VG34Yl RT @NetflixUK: After Life 2 arrives on April 24. If you were hoping it would be less devastating than season one, you may be disappointed b… RT @NetflixUK: @MissJoHartley @rickygervais You can find the full episode here: https://t.co/GF0EgZEy3G RT @Clark1995Clark: 31 days until Series 2! #AfterLife \n\nhttps://t.co/XK7fnm9RbE RT @NetflixIsAJoke: If you’re looking for wit, don’t worry. Here’s some Ricky Gervais! (@RickyGervais) \n\nAfter Life\nThe Invention of Lying… https://t.co/W77Po4a6bB @VictoriaS @Nowzad Happy Birthday Alex 🥳 Self Isolation, week 2 https://t.co/sGi5xAq3v7 @Clark1995Clark Yes. Although it's a huge machine that makes every episode that I got credit for :) @RealBobMortimer Agreed. @KB_Tweeter 👍 @SirJoshFord Fuckin' 'appy with that 👍 @Clark1995Clark Every fucking time. I press END but it doesn't. This is that charity I told you about 👉 @Paws2RescueUK \nStay safe and don't be a knobhead. Cheers 🥂 https://t.co/3tMOZvTV4w https://t.co/yI5YaZRrcH @bradcoopa Correct. @LouLou2109 😂 @RickyPedo Hmmm...I guess the \"normal\" characters, because they have to be realistic and drive the plot but they also have to be interesting without being crazy. Matt, Sandy. Luckily all the actors are amazing so it's made easy for me. @Clark1995Clark Alexej Little Twat Here's the trailer to my first animated feature as Executive Producer. I also play the cat 🐈 https://t.co/YL4gzF4RFx @KerryCosti I told it in the end 😇 @WeatherDog3 Cheers Fatso. We played Table Tennis today. https://t.co/Y3t318rncL @gramorjac Impossible to answer I'm afraid 🤔 @JordanCMulligan @ashs97 I agree. @katelawler @ashs97 🙏 @TammyBracken1 I choose all the music for my shows 👍 @lfcmm79 A couple of scenes in Afterlife2 got me even when watching them back for the 50th time in the edit. @ashs97 Maybe The Invention of Lying. @RH_SoundDesign Very similar 👍 @KarinvanderKant I'll have a think for tomorrow's broadcast 👍 @johncbrannen Amazing. RT @Clark1995Clark: RT If you think @rickygervais’ #AfterLife Series 2 should be released earlier on Netflix. #COVID19\n\nhttps://t.co/XK7fnm… RT @wolfetone98: @rickygervais #AfterLife The Rice Puddings 👇👍😂 https://t.co/nGsDy0LfgR RT @wolfetone98: @rickygervais #AfterLife Fish Fingers &amp; Beans......Twice 👇👍😂 https://t.co/Wfq6f6yIOp RT @wolfetone98: @rickygervais #AfterLife Fantasy Dinner Party Guests 👇👍😂 https://t.co/d1rfH3szwR RT @wolfetone98: @rickygervais #AfterLife Tony's Pub Rage 👇👍😂 https://t.co/c2kMLBrJtk RT @wolfetone98: @rickygervais #AfterLife Kath Inducing Coma 👇👍😂 https://t.co/Ba4PwAaICg Legend. https://t.co/ZdUwRXVhLv @liamgallagher Cheers, man. @NetflixIsAJoke Milligan, Cleese, Everett. \n\nSessions. RT @wolfetone98: @rickygervais #AfterLife The Five Birthday Cards 👇👍😂 https://t.co/iosKgx5Mpz @FiGilg Never again. @mdqmatias Lowell, near Boston. @liamgallagher I missed your comment on Twitter Live because my eyes are shot to shit. As you were 👍 https://t.co/rdkPVbk8l2 @WeatherDog3 How dare you? I’m only spending my evenings drunk. @JustMissEmma 👍 https://t.co/vmFZK8ojNn @robinince @michaellegge Ahhhh! Robin! Is that your room where you go and sit with your books? Good boy. Kiss one of the books. KISS ONE! @ParrotStanley 👍 @purbrooktony Yep. RT @DavidBrentMovie: Happy #WorldPoetryDay https://t.co/957MCQdei7 @ScottFeinberg Spinal Tap, Play it again Sam, Team America, Caddyshack, Tootsie, Airplane, Most Laurel &amp; Hardy, Marx Brothers &amp; Monty Python. https://t.co/AfKW7QMO8G RT @olliecomicstrip: “Be a Jane - Not a Ricky”\n(* sound up) #coronavirus #BeAJaneNotARicky \n@JaneFallon @rickygervais https://t.co/CYf4TYFd… @michaellegge @robinince I think we all know what I'm doing as I watch this, right? @WeatherDog3 👍 https://t.co/DKgg0eh3KX RT @myleftfang: Our lovely friends at @AnimalsAsia have sent us this beautiful tribute to Ollie.❤️💔\nhttps://t.co/ukAELwMLMd @DannyMcQuaid April 24th Imagine being this good at anything. The most beautiful, inspirational fusion of Jazz, rap, poetry and soul 🙏 https://t.co/8duTcYhjwF RT @DerekTVShow: Kev shits himself - the outtakes! #Derek https://t.co/gzmEmvhKqG @sterose2010 Coronavirus. @andygoldstein05 Can't. They have to translate it into 160 languages. Takes time. @WeatherDog3 @AnimalsAsia @Nowzad @IAR_updates @WetnoseDay 👍 @WeatherDog3 Stay! These are the 3 charities I mentioned: @AnimalsAsia, @Nowzad and @IAR_updates. Please follow and support them if you can 🙏 https://t.co/Kgy1XkKrmW @Calabastu No. Similar though. @HudginsShelia Not for ages https://t.co/3inX3QDFPf @sasontour1 Simple 😂https://t.co/NaFJzx2I7k 6pm. Any questions? https://t.co/sva1LdJrx5 @tonypaulway You wont regret it. RT @Clark1995Clark: “That is mad innit?” 😂 #Derek https://t.co/2b2lSKyw5o @GoldDerby I'm flattered. Even tempted. But, no thanks 😇 RT @GoldDerby: Cheeky devil Ricky Gervais is your pick to host the 2020 Emmy ceremony … if there is one [POLL RESULTS] https://t.co/3CNzKI8… @richnairn 😂 RT @DerekTVShow: Baby Monkey! https://t.co/aTxejgIOQI RT @NetflixUK: Coming to Netflix in April:\n\nAfter Life s2\nMoney Heist pt 4\nSunderland ’Til I Die s2\nCommunity s1-6\nPeaky Blinders s5\nHowl’s… https://t.co/O2gAK6J2rG @michelledh @Kred 👍 I’ll do another little wartime broadcast at 6. Any requests? https://t.co/EW5qv9KRLH RT @SECGlasgow: Due to the current situation surrounding COVID 19, @rickygervais tour dates are being rescheduled for later in the year. Al… RT @BrightonCentre: POSTPONED || Due to the current situation surrounding #Covid19 @rickygervais #Brighton dates are being re-scheduled: \n2… RT @DerekTVShow: Hamster on a Piano.... https://t.co/Yf5WT08Ms0 @MattGreaves Haha 😂 Amazing! @MattGreaves Can you just tweet it? We'd all love to hear it 👍 @gnomagno “In the midst of winter, I found there was, within me, an invincible summer. And that makes me happy. For it says that no matter how hard the world pushes against me, within me, there's something stronger – something better, pushing right back.” - Albert Camus @donnyshemroid Good idea. @LouisaJRae @instagram Good idea. RT @AnimalsAsia: As the COVID-19 continues to cause global chaos &amp; fatalities, and Indonesia reports its first human infections, @rickygerv… https://t.co/hYZWr9P3m9 I'll do another little wartime broadcast tonight at 6pm on Twitter and then on Instagram for all the cool kids like me. Same hair. Different jokes. Tune in. Stay safe. Get fat. https://t.co/Q9u1wQ5Z9j @brandhouse_ brilliant @Galahad08 They'll be rescheduled. https://t.co/6ghp6WuN3D Just did a little test with Instagram live. I’m drunk &amp; old but I got it to work. If people enjoyed it I’ll do one every day for all you lovely people stuck at home. Stay safe. Look forward to brighter days 😊 https://t.co/sjC0jivJit RT @AfterLife_Fans: Less than 6 weeks away! #AfterLife2 https://t.co/Dv5m4iTRF7 @RJDEU Almost certainly not. Will reschedule though. @taylorprobably @reversediorama Did you write this song, Dave? RT @RoArquette: @rickygervais @netflix I have been watching binge watching after life it is deeply moving  touching (every episode ) the pr… @andrealemay7 Yes. @JustMissEmma Here’s Ollie dreaming of a tuna flavoured ice cream 🍦 https://t.co/OblWfrGJTZ @sillytiki @JaneFallon @MarkLeneve 😢 RT @Federosa96: Quando penso a #Coronoavirus, penso a questo momento di #AfterLife, splendida serie di @rickygervais \n\n“A society grows gre… RT @SweetWednesday7: I've been stuck home not because of Coronavirus but the weather has been crappy due to rain. I started #AfterLife with… RT @johnpawson: @rickygervais just rewatching Humanity on Netflix. Making me forget about the current state of it all, for a moment at leas… RT @annmarietierney: Lads, I have found the most precious little gem on @NetflixUK called #Derek. It is hands down the most beautiful, hila… RT @kerryfowler_: Scary times😷. But I just wanna put this out there.\n\n”Good people do things for other people. That's it. The end.” - Anne… What he said 👇 https://t.co/fn5p14WU3c Business as usual. https://t.co/uJERqL1NAo @Clark1995Clark Hoping things will be better then, but who knows? Stay well. Take vitamins. Wash your hands. Don't be selfish. Make sure an elderly relative has everything they need. Some are too proud to ask. Be sensible. Drink at home. Everything you love doing you can do in a few weeks. Cheers 🥂 https://t.co/zcZ8BQFSSw @robtGagnon Sorry for your loss 🙏 @lubeeeey I'll definitely try to reschedule 👍 @Fabo80s My favourite @Clark1995Clark A month if I shoot anyone who comes to the house. @BRhonnie Yep @Janeypi3 It's my favourite thing in the house. @ThePatrickLambe @JaneFallon @myleftfang 🙏 @olliecomicstrip @JANE32199986 @DavidBowieReal Wow. @olliecomicstrip @myleftfang https://t.co/lrqsmsXHq5 @gillinghamjoe I had a thought today. If you wanna be remembered fondly after you die, why don't you let me and a few 'science mates' inject you with whatever the fuck we like? Might find out something useful. Worth a shot isn't it? To help humanity. Try not to be selfish. @ErickFernandez @ParkerMolloy Genius. 10 weeks ago https://t.co/wnZ9svYYt6 Keep y’fuckin’ bog roll... https://t.co/YinD20ZuSV Social Distancing: Advanced Level https://t.co/CYOvl76pPN @RossBainesArt https://t.co/ltABANCpoQ @Clark1995Clark https://t.co/78Ne6YK4J1 @JustMissEmma 😂 @Jesshalseyxo yes @Baddiel @GaryLineker @Sheridansmith1 It would be pregnant within 8 minutes. @KateRobbins 🙏 @Max_Winter_ Not sure but it's not looking good is it. @Baddiel @GaryLineker @Sheridansmith1 The first thing I'd do is impose a 'no wanking rule', to preserve toilet roll. Or give you a special sock. Stay in. Stay safe. Watch #AfterLife, #Humanity or #Derek on @Netflix 🥂 Oh, and hug your pets 😢 https://t.co/qyRQfm7eHk @GaryLineker @Sheridansmith1 I got @Baddiel. I don't know how I feel. RT @DavidBrentMovie: Out of toilet roll and hand sanitiser? https://t.co/mXWsvWxsf8 @GaryLineker And a great goalie, once they squeeze me in between the posts. RT @Clark1995Clark: You would get worse than the Coronavirus in this house. \n\nhttps://t.co/7LovDyFJJi RT @Paws2RescueUK: 🆘 Please help us and donate so that we can buy food! Hysteria in Romania has meant that some rescuers cannot find dog fo… RT @jamieeast: It’s the season finale of #whattowatchonnetflix and we’ve saved the best till last. An exclusive look into the making of #Af… RT @robertlicuria: #AfterLife2 available to media on @netflix this weekend... thank you @rickygervais I really needed that laugh! It’s fuck… https://t.co/B2XtafAIMe RT @EthicsInBricks: Newton discovered gravity in quarantine.\n\nShakespeare wrote King Lear in quarantine.\n\nI just bingewatched everything Ri… @craigstone_ Like a constant health warning. @BoltonBarnet Don't see why. To be fair, wiping my arse was already getting more &amp; more difficult every day anyway. https://t.co/9UTvH8vBLg RT @colinhoult: I went to a screening of the new series of After Life and its marvellous darlings. Amazing stuff from @rickygervais @tonypa… RT @Clark1995Clark: After Life Series 2, coming to Netflix Friday 24th April. \n\n#AfterLife @rickygervais\n\nhttps://t.co/M29dMhrrLU @robertlicuria @netflix 👍 @DrunkenWrench Not sure. Thank you for all your lovely #FeetieFridayForOllie pics. What a beautiful idea. This is the last photo I took of my little fangaroo’s dainty feeties. 😢 https://t.co/OAivEhnnl9 @JadeJaneRussell No news yet. @asherlambert19 At the moment, yes. Happier Times 😂 https://t.co/XV0mpXf7GM @badly_drawn_boy @VirginRadioUK @Baddiel 😂 @purbrooktony @WeatherDog3 Oh I’m sure I have a bit of that &amp; phobias and irrational fears and hypochondria. Just not superstitions. @VirginRadioUK @Baddiel @badly_drawn_boy Is that The Grumbleweeds? @WeatherDog3 I don’t have any superstitions froggy. @Elsie19811 Yeah me too but if it doesn’t I’ll find another date 👍 RT @stereoboard: EXTRA // Due to phenomenal demand, @rickygervais has lined up another Leeds @fdarena show on his #SuperNature Tour!\nTicket… RT @LiveNationUK: ON SALE: Due to HUGE demand @rickygervais has added a show at @fdarena, Leeds on Fri 12 June 👏\n\nFind tickets → https://t.… RT @TicketmasterUK: #tmFriday @RickyGervais new show in Leeds on 12 June 2020 is now on sale! Get tickets here: https://t.co/9DIktOS8r2 htt… @Jasonis86 Yes. RT @fdarena: Tickets for @rickygervais #SuperNature at @fdarena are available now!\n\n👇\n\nhttps://t.co/B5fih6VJJO https://t.co/akKpJC2AAK RT @TheListTickets: #Leeds, Ricky Gervais (@rickygervais) has kindly added a huge show at First Direct Arena, tickets are on 📣sale 📣now!\n\nh… RT @bestticketguide: Extra @rickygervais show\nLeeds @fdarena 12/06/2020\nOn Sale 10am here:\nhttps://t.co/abEQPJD1jC https://t.co/Ij5MangFHm @SchouSteffen So far, only tonight's show in Vienna is cancelled. I fear there will be more though. @BigBoyler @hammockmusic Lovely. Cheers, Chris 🙏 @jptame April 24 @RossBainesArt @hammockmusic I've decided it's too beautiful not to keep. I'll take it and just give £1,000 to @CeliaHammond Animal Trust. You're a good man, Ross. @RossBainesArt @hammockmusic Oh my word. That's beautiful Ross. Maybe we should auction it. I have enough beautiful things. I'm crying again 😿 Every night at 6pm, I would give Ollie her treats, pour myself a glass of wine, and sit with her in my arm as I listened to @hammockmusic https://t.co/ZSRyNIzqLZ https://t.co/A152vWg60W @PerezHilton 🙏 @WernhamBlogg @DanielS49086124 @TheOfficeBBC @DAVlDBRENT Absolutely incredible. @watsoncomedian @ed_son That just makes it worse. @WeatherDog3 @JaneFallon Thanks, Froggy 😢 @Patrickghy One of my favourite pieces. @ampleartistry One day maybe, but other things just kept getting in the way. @Ahutchga1972 😢 @reid_nacho Happy Birthday Nacho. @Clark1995Clark @NetflixUK Yep. It looks like I've just broken the news to him and he dropped the flower he'd brought for her 😿 My first animated feature as an Executive Producer. I also play the most important member of any family. The Cat 😢 https://t.co/EeG1Szh7nV @TheTweetOfGod Ah, shit. This made me cry. @TheTweetOfGod Your final and most mysterious way. @PaulyCornell I won't cancel but someone might. @TheTweetOfGod Remember, if we all die, so do you. RT @AfterLife_Fans: Excited? #AfterLife2 https://t.co/WnZYcqonxe She’s not here, Monty 💔 https://t.co/zzfinYmOra @hammockmusic @YouTube Absolutely Beautiful 😢 @meyerrichard I would never cancel but the authorities might. @YearyMd @fdarena No it's been postponed til November. Naps won't be the same. https://t.co/RxBEmHKzwN RT @fdarena: 🆕 The one and only @rickygervais has announced 2020 UK and international tour dates, which will see him take his newest live s… @TheEllenShow 🙏 RT @LiveNationGSA: .@rickygervais jetzt am 13. November in Wien\n\nDer behördlich abgesagte Termin von Ricky Gervais in der Wiener Stadthalle… @LuuNaaTiiC Postponed. @hodgman 🙏 A heartfelt thank you for all your lovely tributes to @myleftfang. I can't quite bring myself to respond at the moment, but your kindness is very much appreciated. 🙏 https://t.co/ltIXtb392O Just had to say goodbye to the sweetest little soul I’ve ever known. RIP Ollie \nJuly 9th 2003 - March 10th 2020 https://t.co/CwqIuWKRww @darthregis Yes Thanks for all your amazing tweets about #AfterLife still flooding in after all this time. Only a few weeks to wait till #AfterLife2 streams on Netflix around the world on April 24th. The Love Story Continues 🙏 https://t.co/j0gmslb383 https://t.co/HGm3WjALps RT @Clark1995Clark: Can’t wait to find out why Postman Pat is wearing a suit! 😂 #AfterLife2 https://t.co/3obw3zquJJ And I'm bringing #SuperNature to Leeds Arena on Friday the 12th of June. Tickets go on sale this Friday. https://t.co/9lqgzmk9CC RT @Clark1995Clark: After Life Series 2, coming to Netflix Friday 24th April. \n\n#AfterLife @rickygervais\n\nhttps://t.co/jBAi32NAgI @Clark1995Clark @TicketmasterUK Not sure if there's a presale but the gig is 12th June. I met @LesDennis once. https://t.co/QDTe5ZEJq6 RT @Clark1995Clark: After Life Series 2, coming to Netflix Friday 24th April. \n\n#AfterLife @rickygervais\n\nhttps://t.co/XK7fnm9RbE Absolutely kippered. Sweet dreams. https://t.co/sfK4XSDBpc https://t.co/xiEMGYYdJc @Clark1995Clark That's the idea, yeah. @Clark1995Clark Spoilt for choice. Might put out 2 completely different ones. And I'm bringing #SuperNature to Leeds Arena. Tickets go on sale next Friday. https://t.co/9lqgzmk9CC My first animated feature as a producer. I also play the most important member of any family...The Cat. https://t.co/ksnAmzIN82 @Yfielding 👍 @Breaking70Bars Good idea. There’s no one safer. #coronavirus https://t.co/C0QxREluKl @boyanakl As far as I know, yes. @Clark1995Clark Impact is hard to predict but I certainly think there are a dozen scenes as funny. Maybe in different ways though. @WeatherDog3 @Art71Rachael Of course I haven’t blocked her, haggis. RT @Clark1995Clark: This premiered on Netflix a year ago today! 😂\n\nAfter Life Series 2, coming to Netflix Friday 24th April. \n\n#AfterLife @… #AfterLife was released a year ago today.  🥂\nYour lovely comments still flood in every day, which is pretty heartwarming. Soon you'll have new episodes to watch as the 2nd season streams on Netflix around the world on April 24th 🙏 https://t.co/b9YvGhxgLJ @Lloyd_Cole My first thought was \"Russell Grant\" but that didn't fit, so it's 'medium'. @KatrineKatwin Hope not. RT @Clark1995Clark: After Life Series 2, coming to Netflix Friday 24th April. \n\n#AfterLife @rickygervais\n\nhttps://t.co/I6rE57aYPP RT @AfterLife_Fans: That’s Friday, April 24th sorted. #AfterLife2 https://t.co/05wVAmdlQM RT @DavidBrentMovie: If Brent's album \"Life On The Road\" was re-recorded for charity, but with real artists, which stars would you want to… @Denlesks Can't believe I've only got 12.7% on one of these options. @Clark1995Clark They never would. Also, Emmy's and Oscars way too much work. They make you rehearse. Fuck that. https://t.co/X3f4gYcHPv RT @jacks84: @rickygervais Not only did he plug Afterlife 2 for you, he also squeezed in a cheeky joke 😂 https://t.co/4cgBW2OmJs @asib78 My new favourite cartoon 😢 @TherealNihal You should see my wine cellar at the moment. Spectacular. @UNILAD Cheeky fucker 😆 @Donnelly7Graham Same chef. RT @ireland_travels: Ricky Gervais responds after Dublin date sells out in minutes - Lovin Dublin https://t.co/MCjw208OYs RT @3ArenaDublin: Due to massive demand, a second @rickygervais date has just been added on Saturday 30 May at 3Arena. #SuperNature https:/… RT @TicketmasterIre: Due to demand, @rickygervais announces a second date to his ‘SuperNature’ show at the @3ArenaDublin on 30 May.\n\nTicket… RT @mcd_productions: ✵ 𝗘𝗫𝗧𝗥𝗔 𝗗𝗔𝗧𝗘 𝗔𝗗𝗗𝗘𝗗 ✵ \nDue to insane demand, a second @RickyGervais date has just been added at the @3ArenaDublin on Sa… Yep. Sold out. 2nd show on sale and that's your lot 🙏 RT @NoelMcHale: Awoogah ! AWOOGAH ! @rickygervais @3ArenaDublin Gone in Sixty Seconds --- Second show on sale in a few minutes .. @Ticketma… Tickets on sale now! https://t.co/tgcO5Iaq69 @bk_yourway Every day. @CitizenZero4 I played to 10,000 people there last Friday. Tickets to #SuperNature in Dublin go on sale tomorrow at 9am \nhttps://t.co/fZ4OdaDdtu https://t.co/9lqgzmBKua @alex_sasha1 I played Zurich last month Alex 👍 2 months ago today 😇 https://t.co/wnZ9svHn4w @Philipj36847906 Yes. I’ll put out a few 👍 @fan2500 Don't think so I'm afraid. Weird search https://t.co/3CGQvhEfZ5 @purbrooktony 😂😂😂 @IndiaWilloughby 👍 RT @mcd_productions: 𝗙𝗥𝗘𝗦𝗛 𝗡𝗘𝗪𝗦 ✵ @RickyGervais is bringing his brand new live show SuperNature to the @3ArenaDublin on Friday 29th May 202… @sean_usmc @netflix yes RT @TicketmasterIre: » @rickygervais will bring his newest live show ‘SuperNature’ to @3ArenaDublin  on 29 May 2020 as part of his Internat… Don't panic. This was only on presale. Tickets go on sale properly this Friday. #SuperNature https://t.co/2CMtTFjc3r RT @TrailRunRob: #Humanity challenges the comedic boundaries, questions societal priorities and ultimately proves why @rickygervais will al… RT @IAR_updates: This month, we will be sharing Peni’s story – we believe her mother was beaten, tortured and then thrown into a pool of wa… https://t.co/lydgTanRF8 RT @_mom_of_4girls: Watching #Humanity on Netflix. Omg! It’s hilarious!!! 😂😂@rickygervais is so funny!!! RT @brucedes: News: Advance Screening Of After Life Season 2 Plus @RickyGervais Q&amp;A  https://t.co/5a7h8F1pvP And I'm bringing #SuperNature to one of my favourite cities in the world in May. Yes, DUBLIN!!!!!! \nTickets go on sale this Friday. https://t.co/9lqgzmk9CC My first animated feature as a producer. I also play the most important member of any family...The Cat. https://t.co/ksnAmzIN82 RT @alicham72: @theJeremyVine @BBCRadio2 Hi Jeremy! My son went to World Book Day as a Puggled Humpdumbler from Ricky Gervais’ Flanimals bo… RT @dignityindying: A heartbreaking example of our broken law.\n\n“The bravery it took her to walk further than she had been able to in month… RT @mcd_productions: 𝗙𝗥𝗘𝗦𝗛 𝗡𝗘𝗪𝗦 ✵ @RickyGervais is bringing his brand new live show SuperNature to the @3ArenaDublin on Friday 29th May 202… RT @livekindlyco: Drink beer &amp; save animals all thanks to @rickygervais ❤️🐷\n\nhttps://t.co/GLJVBKOW7Y RT @WeatherDog3: I’m doing a raffle for the amazing @AllDogsMatter https://t.co/lWt3VgfAVS £5/$5/5€ click link donate, show me receipt on p… @Clark1995Clark Bag of shit. And I'm bringing #SuperNature to one of my favourite cities in the world in May. Yes, DUBLIN!!!!!! \nTickets go on sale this Friday. https://t.co/9lqgzmk9CC @MissJoHartley @NetflixUK @KerryAGodliman @tonypaulway Tony looks like he'd break someone's fingers if they owed him money, in that photo. @tonypaulway So much more fun with you lot 👍 RT @DeltaOptimist: Drinking Ricky Gervais’ favourite Vancouver craft beer will now raise funds for a famous pig https://t.co/uyiVviPQJk RT @TV_Monkey_BE: ‘After Life’ seizoen 2: Alles wat we al weten\n#AfterLife2 @netflix @rickygervais\n\nhttps://t.co/1onKqGTWPV https://t.co/Sp… @matthewcrosby “Anyone fancy a risotto-filled brioche?” Is my favourite middle class prison slang. @Richard02788679 On just after 8, off before 9.30. About 75 minutes. @YogaDjanohla Platinum tickets are official and the extra profit goes to charity 👍 RT @3ArenaDublin: .@rickygervais will bring his newest live show SuperNature to 3Arena on 29 May!\n\nTickets on sale Friday 6 March at 9am. @… @MissJoHartley @morgan_war @psyote_comics @NetflixUK Yes. 12am PT 8am GMT RT @LiveShowsNearMe: NEW: Comedian @RickyGervais has added a new date to his upcoming SuperNature tour at Dublin's 3Arena.\n\nHe will also be… RT @the1878Dublin: Just announced. The incredible @rickygervais will bring his newest live show SuperNature to @3ArenaDublin on 29 May.\n\n#t… @MissJoHartley 🙏 RT @MissJoHartley: As an actor, throughout my career, I’ve experienced a lot of rejection. It’s not personal, it’s business. So I just kept… RT @alannarizzo: The @netflix comedy special by @rickygervais is everything.  #Humanity is a must see.  The man speaks the truth.  I realiz… @robertkelly @RichVos @YKWDpodcast @adamferrara @PaulVirzi \"Look at the pinky, look at the pinky, you gotta look at the Pinky\". Haha. You're like a prison bully. \nP.S. The foot is fucking disgusting. Britain's loneliest cat looking for home after no one turns up to birthday party. https://t.co/XtLgyT5D4Z @MuskokaPlays @netflix 👍 RT @JamieWells96: Can’t believe I’ve only just watched #Humanity for the first time. If my mums funeral isn’t like @rickygervais’s mums fun… https://t.co/xiEMGYYdJc @BFTTtherapper It is certainly decent, but you should aim higher than decent. And you should certainly aim higher than Newsjack. Good luck. And don't give up 👍 @jacquesj85 🙏 @MandTsDad Loved York. https://t.co/vbdKFIs591 \n6.06 \"So Ugly\"😂 \"Really Ugly\" 😂 @TeresaFitzell1 Derek I guess as it was a fake documentary with more improv. @Kelloggs1978 He just did the tune :) Bye, Stockholm. \nYou Fucking Rock! https://t.co/2VmMFsqHP6 @MattisWriting Nearly impossible to say. Might just be AfterLife by a whisker. RT @EstherThePig: One of the funniest people in the world happens to be one of the kindest, too. Huge thanks to ⁦@rickygervais⁩ and ⁦@Paral… RT @dailystar: Trophy hunter safaris let children slaughter wild animals in sick 'kids go free' deals: @rickygervais speaks out\n\n#AnimalRig… Desperate. https://t.co/rk1GfgnBBl @ChrisORourke12 Perfect. RT @ChrisORourke12: @rickygervais Rupert the sausage barking mad for his new moose! https://t.co/7iTFeXA5gC RT @ChrisORourke12: @rickygervais Got it @rickygervais https://t.co/n3PNmVC8eF If you find him, he’s yours! Photo or it didn’t happen. Happy moose hunt. https://t.co/I4vVoUFfpn The old Swedish custom of “Bathing with Moose”. Gonna sign the little chap &amp; leave him somewhere in Stockholm. #SuperNature https://t.co/N1yTEncnAF @GoranStrandberg 👍 @Tatey2005 🙏 @auris98 👍 @Awkwardswede Cheers @RoryLeslie2 🙏 RT @ericernerstedt: Thank you @rickygervais for that clever, silly, ridiculous and amazing show #supernature in Stockholm tonight! So many… @rfranco92 @SeanMcLoughlin 👍 @Yoosefa_sch 👍 @Lajvan 👍 RT @justinaldridge: My face hurts from laughing so much! Thank you @rickygervais  what an amazing performance! Not sure what you're going t… RT @TessGoesInsane: @rickygervais as the presumably only ginger and epileptic in the crowd I applaud you for making both jokes. Feeling inc… RT @adam_rodwell: Just watched @rickygervais new show, what a knobhead 😂😂, absolutely ridiculous... absolutely brilliant! @tess_schmidt90 👍 RT @mange_mange: That was bloody brilliant @rickygervais! What a night in Stockholm. @AntonN40 👍 RT @MsLaurenThomson: @rickygervais Stockholm show was amazing! Thank you @rickygervais 😂 #benicetoanimals ✌🏽 RT @Rami_mli: The #SuperNature show in Stockholm just finished. I have pain in my face and got even training pain of laugh. Thank u so much… RT @DavidBrentMovie: Thank Fuck It’s Friday! https://t.co/C66oUHxU3k And tonight I’m playing the monster arena in beautiful Stockholm! #SuperNature https://t.co/SJoD6GwWBB I nominate https://t.co/evtbKAQRUz 🙏@EstherThePig https://t.co/dHLGc4azsK @SBookstaver Yep. @FiGilg Worse, because there's an arrogance to it. @Purrpatrol Yep. @pbowker7 Honestly, I want to scream “Shut the fuck up you boring cunt” Drink ruined. We’re leaving. Jane’s already out partying in Stockholm. https://t.co/p1l4D6cHV4 @EagleHeartFra Love it. About to land in Stockholm. #SuperNature https://t.co/7fmxOy9fAZ @thedazzler1984 @netflix I think it’s better but it’s impossible to say. @WeatherDog3 The crowd are far enough away from me I hope. @robertpopper Boney Me @robertpopper Them Beatles. @robertpopper Lead Zepplin. Am I doing this right? @WeatherDog3 @PeterEgan6 Absolutely disgusting. Thanks for all your amazing tweets about #AfterLife still flooding in after all this time. Only a few weeks to wait till #AfterLife2 streams on @Netflix around the world on April 24th. The Love Story Continues 🙏 https://t.co/GGfzB1yC3b @WeatherDog3 🙏 @GSpellchecker Rules are rules. https://t.co/hVIPNOIanM https://t.co/RRxYbnt9Wf @Baddiel I don't think the political alliances of a turd matters much either, to be honest. This isn't really about an actual turd, remember. This is about you, David. You are none of those things really. Except soft. And even that is metaphorical. And literally come to think of it. @fran_mac75 @GSG4Freedom @1996Trainsptr I've had ones I've loved and some I've hated. @Baddiel Actually, of all the words he chose to describe you, I feel 'soft' is the only word that is at all accurate. @AndyBailieArt @BuggleJ Good Point. @behaviournomics @1996Trainsptr Ha. Amazing. @denmark98 Yep @Clark1995Clark Yep. @BuggleJ 🥳 https://t.co/TEwAbgTatM @simonplewis @grahamalright @1996Trainsptr 👍 @getoffthefence @grahamalright @1996Trainsptr Yeah love it. @Philipcornish_ @JCC27Photos @grahamalright @1996Trainsptr Yes it's still dead. @JediAvenger10 🙏 @JCC27Photos @grahamalright @1996Trainsptr I like really smooth malts. Nothing too peaty. Jamesons is pretty great. @grahamalright @1996Trainsptr I love whiskey, and I have an amazing collection, but it's just too dangerous to have more than 1 or 2. @willgho @GSG4Freedom @1996Trainsptr I can drink it all night and not get too pissed. @jim73194352 @1996Trainsptr Makes sense. @GSG4Freedom @1996Trainsptr I haven’t had a red I couldn’t drink but I prefer full bodied ones. I like crisp whites with not too much fruitiness or after taste. Hate Chardonnay. @Clark1995Clark @1996Trainsptr Ruinart @1996Trainsptr I like so many and I can't remember all the names. I like Brooklyn lager and loads from different micro breweries around the world. I remember thinking 'Gypsies Tears' in Vancouver was the best beer I'd ever tasted though. @ADicko09 Glad you're enjoying it. @toddbarry https://t.co/3Uhth31I87 @adam_buxton14 Always Double Demin! @adidarlow70 Just here 👍 @wolfetone98 🙏 https://t.co/hVIPNOIanM RT @Clark1995Clark: I’ve said it before, but honestly the greatest thing about #AfterLife is actually hearing other people’s stories on Twi… @Debby41Allen @netflix More than ever. https://t.co/GmrSpFkbr9 @sean_usmc @StephenMangan No. But I agree. https://t.co/MVszJuFNCB 2 months till #AfterLife2 streams on @Netflix around the world! https://t.co/ZLtqzPgvLP RT @NetflixUK: After Life returns for season 2 on 24 April, but for now let's remember Penelope Wilton's Heartbreaking Bench Wisdom™ from s… @JustMissEmma @SausageVerlan @thewhitmore 👍 @JustMissEmma @SausageVerlan @thewhitmore 🙏 @SausageVerlan @thewhitmore Your questions are making me lose the will to live. Are you going to stop? @SausageVerlan So basically you're asking me, if my jokes caused ACTUAL harm would I still tell them. If telling a joke caused the listener to get terminal cancer or shoot themselves.. no, I wouldn't. Or I'd use that superpower wisely. I'd travel back in time and do a tight five for Hitler. @zoonation People who don't get sarcasm on Twitter are even worse 😆 RT @NetflixIsAJoke: https://t.co/o053HkOK0Y It's not my fault. I'm addicted to eating and drinking far more than I need. Also, it's glandular. And I'm sad. When I'm not full. https://t.co/dpGeaZKO19 @omgogrvp @Clark1995Clark @NetflixUK Yep @Clark1995Clark @NetflixUK That's brilliant. Gotta love Netflix. RT @HSIUKorg: URGENT: The government’s #trophyhunting consultation closes TOMORROW! Our new poll shows 76% of Brits support U.K. import ban… @PabloSzymanski1 @Clark1995Clark That's a pretty good description actually. @DanielKinNJ @iamcolinquinn @toddbarry Were you there the night he wore a red shirt against the red backdrop? @Ted_Hammond @JaneFallon @myleftfang When she was tiny she jumped up onto the side of the bath to look at me wishing. She fell in. It was like a fucking cartoon. Squidly Diddly turning into a helicopter for 3 seconds and she was out! She looked like a little drowned rat. @stevethickett61 @SausageVerlan As the fat twat who left all his money to animals. @SausageVerlan What, you don't believe I won't care about what people think of me when I'm dead because I care about marketing my work when I'm alive? OK. @SausageVerlan Remembered by who? Strangers? Don't care. @danijade85 No. https://t.co/hVIPNOIanM RT @jennifer_hulst: So excited for S2 of @rickygervais #AfterLife @netflix on 4/24! If you haven’t seen, it watch it now! I ❤️ it so much t… @Nathanielhodgk1 @TheSundayMirror I wouldn't mind them making jokes about ripping a defenceless animal to pieces, as long as they didn't actually do it. In return, I won't actually kill any babies or give people cancer. Deal? @quickfella yes RT @bluejaylover49: @rickygervais you do so much for animals that Otis wants to give back by helping to spread the word about the release o… @0MarkHIlls0 Easy. The testicles and steel toe cap boots. @DrJlieberman Thank you Doctor. How much do I owe you? @deborah_change It's different to the one that's on Netflix now (Humanity) but this one (SuperNature) will be on Netflix next year. @PeterEgan6 Thank you, too 🙏 RT @PeterEgan6: .@rickygervais Thank you Ricky for always speaking up for the defenceless creatures savaged by these morons: Ricky Gervais… @WeatherDog3 Nun of your business. RT @LovePopcorn6: \"Happiness is amazing. It doesn't matter if it's yours or not\"\n@Netflix @rickygervais #AfterLife #MustWatch #Getthetissue… https://t.co/VgKyNyz9WR @bluejaylover49 I'm going to do some publicity with her soon 😇 @mrTonyLaw 😇 @KiKi_loves_KiKi 🙏 @terrorbalde 👍 @scottwellard Do it! @Clark1995Clark @Moet_UK 👍 https://t.co/wv5svKvm2V @realnicemills I’m gonna try this idea. @WeatherDog3 It would be a bit one-sided as a sandbag can’t really leap. They said it could never be done. Armpit, cuddle and brush, all at the same time. https://t.co/DgUDela9Iw Hearing from loads of people that are having #Afterlife parties on April 24th &amp; inviting over friends who haven’t got Netflix to binge watch the new season. What a brilliant &amp; lovely idea. I want photos🥳🥂 https://t.co/QMVPHRVWSi Best fans in the world 🙏 https://t.co/h8H31yn4yw Just discovered that over 7 billion people haven’t watched #AfterLife. What can we do about this? https://t.co/AuxXwt1Js8 @TheVersion Yeah probably. @Knowledge_Tree I think it’s a Greek proverb. Not sure. RT @Clark1995Clark: That’s why I went platinum today. The money goes to charity and not in @rickygervais’ pocket. 😂 Hoping that #SuperNature is even bigger. If it is, it's all down to you. Thanks again to the best fans in the world. https://t.co/9lqgzmk9CC @therealhanksr So annoying. Don't buy from touts, kids. I'd rather see empty seats than see those dirty scum make money from real fans. At least the extra profit from the official Platinum tickets goes to animal charities. #FuckTheTouts https://t.co/DXbGmfNMSf @_dunken 👍👍👍 Lay your hand on your dozy cat’s head. With your thumb and index finger, gently squeeze the bottom of the ears. Et Voilà! A furry space hopper. https://t.co/XFjPCYGiNJ @DamienElifritz 👍 @CoreyLangy @NetflixUK Definitely not. RT @rickygervais: @BBCWomansHour you should have the brilliant female cast of #AfterLife on. At least the ones that don’t drink during the… @BBCWomansHour you should have the brilliant female cast of #AfterLife on. At least the ones that don’t drink during the day. @KerryAGodliman @missdianemorgan @MandiDhillon @MissJoHartley @Roisinconaty @Clark1995Clark Yes. My first animated feature as a producer. Yikes. Today is #MentalHealthNursesDay2020\nAll the lovely tweets and letters I received about #AfterLife helped me realise just how many people you meet everyday are grieving or have some sort of mental health issue. 1 in 4, actually. You are not alone. https://t.co/KZP2zxZGaa 2nd Brighton &amp; Glasgow dates on sale now, and that’s your lot https://t.co/FbJIah8i9x @watsoncomedian Colgates of Heaven. #SuperNature Tickets on sale NOW! https://t.co/FbJIah8i9x @Clark1995Clark Yes. He's the narrator too. https://t.co/OPojSXqYaK @TheVersion @kpprtweets 👍 @gogoxoom Cheers @NakramR I guess new viewers. @TheRightColumn Or After Wife. @Samanth52795666 🙏 @fekete_doug Thanks. @DinnaFacher @LuisAdrianoUK Yeah he was in the long trailer but not the short one. @RebelDimond @NetflixUK Cheers @HermieLFC 👍 @Clark1995Clark 😂 Did you like this trailer? Now you've watched the show do you think it summed up all the important points? What should we have included or left out? Basically, I'm working on the trailer for series 2 and I want some clues 😇 https://t.co/EvffBwvlUu @Blacklabdog2 👍 @SpaciusImpetu Thanks. @tom26richardson Guaranteed. @mestlea66 Cheers @MartinDevon I agree. Cheers @velogator thanks @NeilJonNUFC Why? Giving away a punchline or not representative or just not very good? @JimJamLFC Cheers @caffeiene Yeah I agree. @Anitajenta Thanks @HiM4nos Thanks @tomgrechin Yeah it's a tricky one. @Skuddy Interesting. @7aiderB I know what you mean but sometimes they can really grab your attention. @Buddylimbeck Thanks @Balcidebava They're both there but not for long. @MGN_11 Thanks. @Michael_Buffer Haha. The trailer should just be you saying that 🙏 @KeithReef Interesting. Cheers. @Clark1995Clark Cheers @j_eyes_harrison Cheers @FrostyIrish1 Cheers @rockollector Yeah I guess I was too scared to show how dark it was in a trailer in case it put people off. @Gallimaufry22 Cheers @johnthe92611772 I know what you mean but it really summed up the character really quickly. Thanks for all your amazing tweets about #AfterLife still flooding in after all this time. Only a few weeks to wait till #AfterLife2 streams on @Netflix around the world on April 24th. The Love Story Continues 🙏 https://t.co/Osl9SeACxm RT @Quirk22: @rickygervais \n\nJust finished Season 1 of After Life. \n\nHow can a show as abusive, acerbic and cruel also be gentle, lovely, a… Enjoy 👍 https://t.co/FB4T5SxDK4 RT @NotObamaAtAll: @rickygervais I avoid EVERYTHING new about After life since I got the release date.\n\nI want to go into it without a hint… RT @DdLov99: If you haven’t seen the first series,\n... omg why? \nIt is one of the best shows I’ve seen. All the characters are so well deve… https://t.co/epI8gkpKDT @GaryOldgreg Fury. Yep. Deontay Milder Vs Tyson Furry https://t.co/IlPak9y4Ar RT @Clark1995Clark: @rickygervais @netflix @rickygervais your French is so good. https://t.co/QSvSGSQcVm @purbrooktony @ConanOBrien Don't know. It was his podcast. Finished #AfterLife2 this week. @Netflix boffins now have to stick on subtitles for 190 different countries and then it's available to stream from April 24th. https://t.co/3ZyA2lj7LA More #SuperNature tickets for Brighton, Glasgow &amp; Watford go on sale tomorrow at 10am 👍 https://t.co/9lqgzmk9CC Just spent a delightful hour or so chatting with @ConanOBrien &amp; we recorded it for your listening pleasure. He’s one of the smartest, loveliest people in show business. Obviously I didn’t say any of that to his face. Quite the opposite in fact. I crushed him. Like a ginger bug. @purbrooktony Still lazy. Happy #LoveYourPetDay to my furry little feline friend Ollie. https://t.co/Ux0wTSyrzS @Caroline_qu25 Never thought it would be this popular. @StRita99 april 24 @Patrick54575653 I'm afraid not. RT @Clark1995Clark: “If you enjoy seeing an animal terrified or in pain you are a c*nt.” - @rickygervais \n\n                   GO EMAIL NOW!… @WeatherDog3 @olliecomicstrip No, it's \"Wobble Wobble\"-  he wrote it about you. @olliecomicstrip No more clues. @olliecomicstrip There is a Bowie song but not that one. The next few hours are crucial to end Trophy Hunting. The UK Govt public consultation closes TOMORROW. Hunters are lobbying for NO BAN. We may NEVER get another chance to STOP this evil trade. \nEmail huntingtrophyconsultation@defra.gov.uk ASAP: “I support Option 3 Total Ban”. 🙏 @purbrooktony Yep 😂 @purbrooktony Ring of Bright Water &amp; Old Yeller. Gutted. Happy Birthday, in case I forget on the day. https://t.co/DWar8hMwJl Nice of you to warn him. https://t.co/piV0PVIUOl Thanks, James 🙏 https://t.co/OrZwfqQPCQ Why did you make chocolate kill dogs? https://t.co/aCpjlONonG Plenty of time. Also, the first one is always late, apparently. I’m not a doctor, though. https://t.co/DlgSQfIhmC Just found this in my belly button... https://t.co/dT22CBb9nM @Stella20203126 @JOE_co_uk I don’t eat any animals, no. RT @mariecurieuk: #AfterLife by @rickygervais tackleS some tricky subject matter. Here's why we're already planning our binge-watch of seri… RT @JOE_co_uk: “It’s the closest I get to spirituality, just watching a dog.”\n\n@RickyGervais on why dogs are the best thing in the world 🐕🐶… RT @JoshDenny: “The Invention of Lying” is such an incredible, original movie. I watch it every few years and I feel like it gets better an… RT @Clark1995Clark: “People confuse the subject of the joke with the target of the joke and they're very rarely the same.” - @rickygervais… @Susan_Hill77 A boat. @HodgePodge2010 🙏 @Michael_Buffer 😂 @jcairney10 24th of April Just seen that #AfterLife has a 4.9 out of 5 average audience rating. \nThat’s fucking mental. \nI mean, Thank you 🙏 https://t.co/9cBGl2mcjf RT @Clark1995Clark: “To Pat, stop reading my postcards....” \n\nAfter Life Series 2, coming 24th April.\n\n#AfterLife @rickygervais\n\nhttps://t.… RT @LeagueACS: It’s high time someone said ‘no’ to the hunts. Today is the fifteenth anniversary of the Hunting Act, yet wildlife is still… @Clark1995Clark I think they don't do trailers till a couple of weeks before release. @AlexFletcher4 I'm fine with emotional scenes, but the funnier the scene, the more I ruin it. The scenes with Brian and one with the psychiatrist were nearly impossible. @Clark1995Clark @tobyfoster Nope. He plays another character. Ken Otley is played by @colinhoult. @JaseLFC91 @Clark1995Clark Maybe this one, yes. @Clark1995Clark Yes! @Laughingmelt @netflix A few yes. @FiGilg @netflix Nope. @skabmaluke @4TPete @halfpintperry Just so you know, I donate all the extra profit from those Platinum Tickets to charity. There is one scene in #AfterLife2, involving a new character, that is much shorter than planned because we couldn't get through it without laughing 😂 24th of April @Netflix https://t.co/be0fPi6Eao @misterhsk 🙏 RT @wolfetone98: After the last 24 hours, this means more than ever. And not just a mantra for today but a message that should be repeated… @tgibson484 Already done a couple but will probably do more. @purbrooktony haha @CWylie26 2 @panzerwurst22 @thefinalpapito Bot is not. @TeresaFitzell1 soon @icouldbegod Hypocrisy. That I knew the right thing to do but did what was \"right\" for me. A few more dates have been added to the #SuperNature tour! Brighton, Glasgow and Watford coming March-May 🎉 Tickets go on sale at 10am This Friday.  https://t.co/qEaClo8tzu @ceili221 yes @JaneFallon @britishairways https://t.co/Gj4UNpBX3V @Montydogge @Susan_Hill77 @JaneFallon I’m not made of money. @Susan_Hill77 @JaneFallon I took her all expenses paid to Barcelona. #SuperNature Bye, Barcelona. One of the most beautiful places on Earth. The #SuperNature crowd fucking rocked too! See you again 🙏 https://t.co/8rMa00S6uk @harrybakerpoet This makes Perry Como’s ‘Magic Moments’ seem vague &amp; irrational. @MWhateley I'm afraid I know nothing about the publishing industry. Good luck though 👍 @Clark1995Clark Not sure yet @danijade85 “The Love Story Continues” @MLG999 That’s how I think of it now. @AussieSamurai Yeah, I’ve come to view it simply as a love story. @Rachelwills76 🙏 @AlanCambs 👍 @marketmodel I like that 👍 @snapintuit Haha. Good point. @LouLou2109 Yeah, I think that was a surprise to me though too. It's been good knowing that making series 2. @DoctaBeak Cheers. Yeah, I guess I wanted to warn people it had harsh/sad bits. This is how I described #AfterLife before anyone had seen it. Did it entice you? Was it accurate? Now you've seen the show, how would you describe it to someone who hasn't? https://t.co/UjXdwVST9G RT @DavidBrentMovie: Hope everyone’s had a good #ValentinesDay.  https://t.co/E1ZuK6DQ93 Jane at her beach party. https://t.co/zqPOwUpShg @MrSeanCullen @ThomasH37515666 @anafardella That’s because you are an Aidiot. @PeterEgan6 @entertainmentIE I can't wait for comedy fans to see the little surprise 🙏 @newmanstings Haha. Yeah..they can’t watch it for a good few years. Off to Barcelona! https://t.co/iaRXvKtHeg @Clark1995Clark @SteveSpeirs4 It’s amazing. https://t.co/X3Uw9rF1xe @socialparanoia_ @netflix Maybe not. @olliecomicstrip @myleftfang More like fat thumbs. @GeorgeWoollard3 @netflix yes @MissJoHartley @NetflixUK And you're great in it Jo! RT @EW: Ricky Gervais' After Life season 2 reveals first look photos, premiere date https://t.co/8FwzAuH2Ad @SteveSpeirs4 @BKurvie @netflix An amazing performance. Can't wait for you to see the finished product. @hamisharnold @netflix Lots more. @SteveSpeirs4 @netflix Your cameo makes Gittins look healthy. @birkirbjorns @netflix Yes. #AfterLife returns April 24th on @Netflix around the world! \nFunnier. Sadder. Doggier. https://t.co/9mH2AljmYU @Clark1995Clark He's in series 2 even more. @manx_boy Well they're nothing to do with me but I guess they're not breaking any copyright laws. Still funny. @Clark1995Clark Yep RT @NetflixUK: After Life returns on 24 April. Yes, the dog will be back! @rickygervais, too. But the dog!! https://t.co/75wIb96KSr RT @NetflixDE: OB IHR BEREIT SEID FÜR NEUE FOLGEN AFTER LIFE MIT @rickygervais HAB ICH GEFRAGT!!!?\n\n(Fyi: Ich schon *kringelt 24. april im… RT @NetflixPL: Ricky @rickygervais pyta, czy jesteście gotowi na kolejną dawkę śmiechu przez gorzkie łzy?\n\nTak, my też. After Life wraca z… RT @NetflixNordic: Life isn't always easy. But hearing that @rickygervais ' After Life is returning for a second season on April 24 makes i… RT @DEADLINE: ‘After Life’: Netflix Sets Premiere Date For Season Two Of Ricky Gervais Comedy https://t.co/WFtJ76LkhT https://t.co/TaxkeN5c… RT @AfterLife_Fans: Yes!!! #AfterLife2 comes to @netflix on 24 April! https://t.co/0dmBQzOAYS @bobby4good It's sarcasm Bobby. I don't really think speaking a foreign language is racist. It's taking the piss out of virtue signalling people who make a mockery of the term racist. So, you'd actually agree with the sentiment if you understood the tweet. Hope that helps. @DannyB_87 👍 RT @AfterLife_Fans: The #AfterLife2 release date is announced later today! https://t.co/udtLbCXTDM @SNJPatriot Haha. No. He’s definitely not a nonce. I’ll have the #AfterLife2 release date for you by the end of today! https://t.co/hqTi5miHTa RT @willtravers: ⁦LISTEN! @BornFreeFDN⁩ &amp; 200+ experts call on ⁦@WHO⁩ ⁦@UNEP⁩ ⁦@OIEAnimalHealth⁩ &amp; governments to close all #wildlife marke… @sueverity beautiful @olliecomicstrip Haha. They're just meant to be squiggles that sort of look like letters at first glance. I wasn't really writing anything to be honest. @sean_usmc Bit of both. RT @Clark1995Clark: Apart from Tony, who’s your favourite character from @rickygervais’ #AfterLife? https://t.co/z8VVqcqAgh https://t.co/zFvUfI0W6q @illistation @Baddiel I think it needs to be someone more Jewish like @watsoncomedian @Unnamedinsider @Baddiel haha @Baddiel Haha. Fuck me. Keep a diary and send me it. I'll book a studio. @Baddiel I'd like to see a sitcom with you as the central character. A scholarly intellectual with the social skills of Frank Spencer. You end up always saying the wrong thing and getting covered in shit somehow. It's called \"Having a Baddiel Day\" @John_DoeOfLB Or as some call it “making jokes”👍 @KateEmerson88 @tandigi You simply don’t like my jokes. That’s fine. Don’t worry about it. I don’t 👍 @purbrooktony Dog, cat, rabbits, and a goldfish pond that I filled with frogs. My mum hated it, as they would jump out and frighten her. I was born the 4th child of an immigrant labourer. My mum was a homemaker and she could do anything except give me money. Luckily, learning was free. So was nature. I was rich. Happy Birthday Darwin. https://t.co/3mGwi7xn0E RT @TheVersion: Icymi @rickygervais and #Afterlife are nominated in our Unofficial Global Netflix Awards. Vote for your favourite originals… @Clark1995Clark This week. RT @HSIGlobal: The @NIH has chosen to betray 40+ chimpanzees who were supposed to be retired to a sanctuary after years of testing and rese… @Lockers75 🙏 Whenever I'm abroad, I make sure I only speak English. To use a foreign language would be 'cultural appropriation', and that's racist. @Clark1995Clark Schindler's List @scottokun Yeah it doesn't carry the misogyny here. In fact it's sometimes used as a team of endearment amongst friends. @Steffan_Juul Cheers @jacqu23 Who? I didn't mention anyone. @MGCChambers Woah...this is violence. @myleftfang Idiot. Have a peaceful night. And if you die, I hope you die in your sleep, dreaming about a dog. 🙏 https://t.co/RbQ0SzLnYL Disagreeing with me is hate speech. @Steewartj1 I'm not backing off. I'm not being bullied. And I'm always right 😇 @Alexandrakis It depends on what your definition of 'better' is, I guess 😇 @drmistercody @ggreenwald I'm happy with the opposite effect. I just love saying stuff. Remember... https://t.co/DwGTSK4Tz7 @ggreenwald Yes it's annoying when people don't listen to our lectures. Even though we're celebrities. How dare they? But that's what happens. That's all I'm saying. Best fans in the world 🙏 https://t.co/h8H31yn4yw @davelukasek I meant the humanitarian stuff really. I have nothing against the most famous people in the world using their privileged, global platform to tell the world what they believe. I even agree with most of it. I just tried to warn them that when they lecture everyday, hard working people, it has the opposite effect. Peace. @michaeljnewport My point was, if you're annoyed by jokes instead of hard hitting political activism you shouldn't follow a comedian. You're welcome, but don't expect me to tweet to order. Thanks for following 🙏 RT @TheVersion: . @rickygervais and #Afterlife are nominated in our Unofficial Global Netflix Awards. Vote for your favourite originals and… @WeatherDog3 They are ALL beautiful. But, if I have to pick one, then it’s Mr Tickles RIP. 😢 @WeatherDog3 Hmmm. Tough decision. Let me have a think. @WeatherDog3 Get it down to your favourite 10 &amp; I’ll pick a winner. @WeatherDog3 @kpfallon Idiot @kpfallon I want to make a movie of the true story that leads up to this moment. RT @DEADLINE: Ricky Gervais Trolls Oscars With Online Zings, Provides His “First Best Joke” On The Show https://t.co/NmeFybeY7o https://t.c… @joelcomm @netflix Thank you. Life goes on. America! \nBinge-watch #AfterLife on @Netflix tonight. It’s about a man who realises that humanity is a disgusting, narcissistic plague, and so becomes angry &amp; depressed and loses the will to live. Or watch The Oscars instead and actually experience those feelings first hand. https://t.co/3mUo4bOpte RT @Protect_Wldlife: #Derek explains why he loves #dogs.\n\n#BeLikeDerek and check out my new page dedicated to ALL things dogs. It's All Abo… RT @debsjim69: @rickygervais “It’s great to see such diversity in the room tonight. Rich sex pests of all shapes and sizes” https://t.co/fsFbdDkv6u “I can’t wait to hear all your inspirational speeches about equality, and it’s great that the 3 hours you’re here tonight is the only time your badly paid migrant house staff will get some time off to sleep this week” https://t.co/fsFbdDkv6u @Evcimen @joshisyourhero Yep. Forget him. @joshisyourhero Chappelle, CK, Rock, Stanhope, Norton @yoCunat Yes in May. And I'm bringing #SuperNature to Barcelona next week! https://t.co/9lqgzmk9CC Best fans in the world. https://t.co/9k8sDMFKjU RT @geekmasterflex: FFS @rickygervais can you get some new fitted jeans when you get your next $40 million from Netflix please? #oslo #norw… @10theri 🙏 @Timothyjanatkin Don't think so. @snooksy Hampstead, Hemel Hempstead and Beaconsfield. RT @COlsenRuud: Just saw Super Nature by @rickygervais in Oslo. Absolutely brilliant! The best of his shows yet. RT @justJar1: Cheers @rickygervais for making my trip to Oslo a remarkable one. #SuperNature is a must see!\nAlso @SeanMcLoughlin earned him… RT @Noorajokakolis: SuperNature by @rickygervais in Oslo was definitely worth of travelling from Finland. Will be laughing at that Aids jok… RT @FalkBruskeland: I just came home from watching Super Nature by @rickygervais. I haven't laughed so much in my entire life. Order ticket… RT @NetflixIsAJoke: https://t.co/XaijBJlaAT @EleonoraGalluz3 👍 @geoffcarrington spring RT @haikel_areff: Why can't adults order from the kid's menu https://t.co/jzxCESPoV0 @Brandon_f04 luckily it was the first take. And they were vegan so no fishes died. @EJKrausJr @andywburrows Of course I am 👍 @hilmartor What’s the weather like? Recorded the score for #AfterLife this week with @andywburrows. Start grading picture next week. Might have a release date for you to stick in your diary soon. Have a great weekend. https://t.co/NkpWlYKEd4 @purbrooktony Some people are fucking scum. About to land in Oslo. #SuperNature https://t.co/bqdfc6wwss Off to beautiful Oslo! \n#SuperNature https://t.co/HkudLn248x RT @danielkempe: My wife’s review of #Afterlife on Netflix...\n\n“I love that @rickygervais just wears his own clothes” https://t.co/TefirO6l… @JimNorton This photo will be on the news one day. Then in a Netflix documentary. @Byoussef @netflix 🙏 @RobBrydon 😂 RT @DogsMonthly: From tortured laboratory animal to Beagle Ambassador, read about rescued ex-lab @ScarlettBeagle and her campaign with @ric… 😂\n https://t.co/rcmINBAxWR @WeatherDog3 @Fortnums I agree @Fortnums! Send one to Rupert for an influencer review. @EstherThePig 🙏 @Clark1995Clark Yep. 2 cameras, 1 take. @sharrond62 👍 @JimNorton @NetflixIsAJoke Brilliant. @azdesertskies1 Yes And I’m bringing #SuperNature to Oslo this weekend! https://t.co/SJoD6GwWBB A month ago. https://t.co/wnZ9svYYt6 @RyanGuinness Tony @woodsphil 👍 RT @woodsphil: Here is a podcast review of After Life by @rickygervais for those who can’t be arsed reading. A genius piece of writing by R… RT @DanielNorris69: Watching @rickygervais After life for second time, my 20 month year old boy just walks past saying \"Fuck Me\" after hear… RT @Clark1995Clark: Probably the saddest scene in the history of television. #Derek @rickygervais \n\n https://t.co/QsAf6LpXQO Thanks for all your lovely comments about #AfterLife still flooding in after all this time. Lots of new fans &amp; lots of old ones watching the show again &amp; again 🙏 https://t.co/i3PTMw958Q RT @ajbwfc86: Just watched @rickygervais  afterlife for the 5th time and still everytime it gets to me...never watched a show with so many… RT @iKtz: \"Happines is amazing. Is so amazing it doesn't matter if it's yours or not.\" #AfterLife by @rickygervais RT @liamkay1986: Just watched @rickygervais #AfterLife for the 4th time in preparation for the 2nd series. If anyone is yet to watch it I u… @alex_cairnie I get the blame for everything. @Rjmed558Joe Yes I understand that. It’s a satirical account. The character is an over-woke narcissist who gets everything wrong in their quest to virtue signal. The reason why you’re confused is that it’s so accurate. 👍 @alex_cairnie I don’t desperately want to believe anything. I follow the evidence 🙏 https://t.co/qHSkq6xaoT @wolfetone98 @reidy100 I’m afraid it won’t even be finished by then. @mvorn44 Fan appreciation. @LuiseArese @TitaniaMcGrath It’s a satirical account. Very proud of all these actors calling out the lack of diversity at award shows. I bet if they’d have known the nominations in advance they wouldn’t have even turned up in the hope of winning themselves. @reidy100 Spring 🙏 @boydhilton It doesn’t work grammatically or as a hashtag. @EthanDLawrence @nowthisnews Let’s see her play the double nose recorder though. @nowthisnews @EthanDLawrence @kirstiealley 😂 Best fans in the world 🙏 https://t.co/h8H31yn4yw RT @DeseretNews: Opinion: Comedians like @rickygervais are popping the ideological balloon | By Ralph Hancock #goldenglobes2020 #comedy \n\nh… @snbodad It’s whatever you think it is. RT @Clark1995Clark: “Have you got a jokes page?” \n\n#AfterLife @rickygervais \n\n https://t.co/I6rE57aYPP RT @AfterLife_Fans: “What?! He is not a fat, hairy, nosey, cocksucker; bad girl!” #AfterLife https://t.co/xE7qcZeL3C RT @AfterLife_Fans: “Gay” #AfterLife is streaming now on Netflix around the world! https://t.co/c7Nxbi6Ivt RT @AfterLife_Fans: “To Pat, stop reading my postcards you nosey, scruffy cunt.” #AfterLife, streaming now on Netflix! https://t.co/44Uddso… RT @wolfetone98: Needed this right now. These life lesson/words of wisdom scenes between Anne &amp; Tony in @rickygervais's #AfterLife are just… RT @FeralMother44: @rickygervais My  beloved elderly parents,  in their mid 80’s, have rung me to say they’ve just watched the entire seaso… @SkyAndyHughes 🙏 RT @woodsphil: So the new series of After Life by the magnificent @rickygervais is coming soon. If it’s as good as series 1 we are in for a… @anna_higgybilly 🙏 @WeatherDog3 Yeah I think series 2 could be my best work, froggy. @Anthany_Scamp 👍 Started reading an article that said just 5 years of moderate drinking can cause some brain damage. I didn’t read on but I’m assuming it eventually said that 40 years of much heavier drinking can have more positive effects. Cheers! https://t.co/ESr6RhnzOq This tweet will help me explain to Americans how Brits compliment each other 😂 https://t.co/92BiIuzJmN RT @Clark1995Clark: After Life has been voted by viewers as the Best New TV Sitcom of 2019 in the @BritishComedy Guide Awards.\n\nCongratulat… RT @dignityindying: . @rickygervais speaking sense as usual.\n\nGive dying people the choice to end their suffering. https://t.co/IfbKOS0OTK Thanks for all your lovely comments about #AfterLife still flooding in after all this time. Lots of new fans &amp; lots of old ones watching the show again &amp; again 🙏 https://t.co/UPz2el0c2u @lukeatiyah Tell her the clue is in the title. @Baddiel As my Nan use to say “you can’t take it with you”. She also used to knit socks &amp; swap them down the pub for free gin. True. @Baddiel I can’t use my bank account either now it’s gone all computery. @Baddiel Yeah really annoying, but I’m willing to accept that might be user error as I can’t even work the TV remotes without Jane’s help. @Ladyhkt The Wells definitely allows dogs. @Newport64Nobby 🙏 @EthanDLawrence Yeah but imagine losing at the National TV Awards. @ManMadeMoon Mrs Brown’s boys keep swinging. @ManMadeMoon You voted for Mrs Brown’s Boys didn’t you. @BenjieDevlin @danthfcuk He’s in it even more. @danthfcuk Spring @mandcoops @myleftfang @Gareth_j_h Spring The beauty of Netflix 🙏 https://t.co/2UU5BCqlHQ RT @NATFilmAwards: Congratulations to @rickygervais nominated for #BestActorInATVSeries at the 6th annual #NationalFilmAwardsUK. Vote now h… RT @NATFilmAwards: Congratulations to #AfterLife nominated for #BestTVDramaSeries at the 6th annual #NationalFilmAwardsUK. Vote now @ https… @DanGWestern Never mind the money, look at my great hair! @joezimmerman Winkle. We nearly didn’t make it through this scene. https://t.co/REbdi6cLtZ And I’m bringing #SuperNature to Oslo next week! https://t.co/SJoD6GwWBB RT @BritishComedy: Best New TV Sitcom 2019: After Life by @RickyGervais \nFull results: https://t.co/nVNnn1AFdE https://t.co/Gf6xdevegD Yes. It really was a lovely gesture. Respect. https://t.co/uJlpHjc9mX RT @TheVersion: Let's just take a moment to recognise that @RickyGervais has won FOUR awards in The Version's TV Comedy Awards 2020 for #Af… RT @TheVersion: To celebrate all of @rickygervais / #AfterLife success we're giving away a Netflix gift card and a selection of Ricky's sho… @DJRustyEgan @DavidBowieReal Lovely to meet you 👍 This is absolutely false. She was lovely and gracious. She said she loved my Golden Globes monologue &amp; I said I loved her stint in I’m a Celebrity. And that was it. No snubbing. No awkwardness. No rudeness. @Caitlyn_Jenner https://t.co/wo3cuwQVRH RT @FuehrenWriter: PENETRATING PLOT\nPlot Analysis of Ricky Gervais’ “After Life” S1 : E2\nAnother Breakdown of character construction, dialo… RT @TheVersion: Your votes won @rickygervais @tonypaulway @MandiDhillon @missdianemorgan @KerryAGodliman @OfficialAJensen @MissJoHartley @b… @mouthwaite 🙏 What a fucking bunch of losers. Congratulations to Mrs Brown’s Boys. Democracy always wins. Be nice in defeat and know that you are still the best fans in the world. Thanks to everyone who voted 🙏#AfterLife #NTAs https://t.co/Grzk7o6k8r @MikeSouthon @JaneFallon Yep RT @TheVersion: Congratulations to @rickygervais who has cleaned up in our TV Comedy Awards 2020 with After Life! \n\nFull details and list o… @davidwalliams @OfficialNTAs @ITV 👍 @JonWinegar Fosters RT @TherealNihal: \"Dogs are made of good\" - @rickygervais 😥😍👍 @lestroy @lukenlukenluken Different award 😊 @BritishComedy @tonypaulway @MandiDhillon @missdianemorgan @KerryAGodliman @OfficialAJensen @MissJoHartley @bradders_david @EthanDLawrence @Clark1995Clark @BritishComedy Cheers 🍻 Another win for #AfterLife! \nThank you 🙏 https://t.co/b3nZpsIqdR @DaBritishbiscit Spring @BBCNews @robinince @kelseypaigexox 🙏 @WeatherDog3 @FloydtheJack Idiot @Zoe_Curtis_ 🙏 Please vote for #AfterLife https://t.co/XRfZaM6lva https://t.co/T4aDcSFz3Y @awjeez2 👍 @DebbieHardy11 👍 @NikiDawn6 👍 @NikiDawn6 👍 @LolaGrace888 👍 @simpeeboy 👍 @ThatFrancHughes 👍 @Christo72794916 👍 @Beatric13888318 🙏 @saveza_only1 🙏 @azdesertskies1 🙏 @Snoeps @OfficialNTAs 👍 @CathyH61Sc 👍 @elviscarzolio 👍 @Jayne1412 @SundayBrunchC4 🙏 @elviscarzolio 🙏 @TheJimmyMelty Actually, the crucifixion was done in the name of Roman Gods to a Jewish guy. Just sayin’ 😎 @Brig_Supernova @eltonofficial 👍 @SherryS65160129 🙏 @owl_of_truth 👍 @FreeSPCNordin 🙏 @JAaronChambers 🙏 @SandraCrazycat The fact that I am fat myself shows my laziness even more. @CPT_d1cknose 🙏 @karenedaye 🙏 @manders_r 👍 @then0rthernpoet 👍 @reddevilbaby007 👍 @LisaAnd78942765 👍 @Clark1995Clark Nope. @ramsesvienna 👍 @morganwright___ 👍 @tran_surfer 👍 @JakeOverland Spring @FrancesBride I don’t have any ✌️ @GirayDlg 😆 @wateryh0e 👍 @_TightenUp_ 😫 @Bodhi3323 Yeah it seems to be tricky for some to grasp that there’s a difference. That’s not quite right. I wrote this to explain my position. Enjoy 😊 https://t.co/sWauZUBHst https://t.co/GBFT2vYE2J @andy62syl I’d be safe these days. @IndiaWilloughby 😂 @amoffa50 Spring Thank you 🙏 https://t.co/6hkgxa8aAU @cbctom Yep @orencamera Cuddle it. @WhittonAl ✌️ @FacileTalk I’m going. I have a 15 minute speech about fracking. @KallPer 👍 @CraigGilks 👍 @KateRobbins 👍 @lucylou18 👍 @simonsquibb I hated it at first but now I’m over it. It’s just like the weather to me now. If I don’t like it I can just stay indoors. @simonsquibb I guess it depends on what you’re famous for &amp; what you do with it. RT @Clark1995Clark: “As an atheist, I see nothing ‘wrong’ in believing in a God. I don’t think there is a God, but belief in him does no ha… @RealKblairwitch Not yet @sdazzled @WeatherDog3 🙏 @BuggleJ Started working on the trailer this week. @tommy_stables I’d rather roast actors in real life 😊 @davidstoryman Spring RT @cassiefinds: Finally watching @rickygervais’ #Netflix special Humanity. And I didn’t realize how much I love Ricky Gervais and agree wi… @trickyvicar @WeatherDog3 Thanks @sshdevelopments Not yet. @FacileTalk Laughed out loud at “young Frank Bough” Is it sad that most of my time on Twitter is spent reading tweets from pets chatting to each other. Here’s my mouthy little fur bag, Ollie. https://t.co/8uxlTeHHsX @thesturge @absoluteradio Call Camfield! @oxbridge13 @Clark1995Clark Coincidence, although there were a lot of shows in the 70s like it. RT @FiGilg: @rickygervais They should vote #AfterLife for Anti. https://t.co/nuLYpKkBGO RT @Clark1995Clark: @rickygervais Because of this. \n\nhttps://t.co/XK7fnm9RbE RT @ScarlettBeagle: @bluejaylover49 @rickygervais @WeatherDog3 @AnimalHeroAward @TheEllenShow @DeborahMeaden @dementiadogsuk @Protect_Wldli… RT @bluejaylover49: @rickygervais @ScarlettBeagle @WeatherDog3 @AnimalHeroAward @TheEllenShow @DeborahMeaden @dementiadogsuk @Protect_Wldli… Why should people vote for #AfterLife? https://t.co/Qaqaaia7Bz @liz6153 My favourite too."}