{"tweets": "LET IT RAIN!!!! SÃO PAULO!!!!! The fucking BEST. Maybe the best show we have ever had. Thank you isn’t enough. You truly blew us away. ❤️❤️❤️ 👽👽👽 https://t.co/hrreUUOU5g While you’re at it, follow @taylorlockemusic for insane celebrity Deep Fakes! Hey, do yourselves a favor and go see @dontstopthemusical on Feb. 1st @largolosangeles!! Some very old friends of mine wrote and created this hilarious show. Its selling out fast at https://t.co/sOX5xkN5kl. Guest starring my pal Ray Romano. I may be available. Best kept secret in celeb basketball circuit. #SASCelebteam https://t.co/zCiWtcXSct #SASCelebteam https://t.co/aqAbsfv6zf Y Live \nYves Saint Laurent\n@yslbeauty #YSLbeauty #thatsY https://t.co/xmZXZ8Y9O8 This is what makes it all worth while. Speechless. • @PS22Chorus \nhttps://t.co/cUAWP2ioMB When I first heard Joe Pesci sing, I was astonished. I begged him to let me produce a record with him. He finally let me. I’m so happy his musical talent is no longer the best kept secret in town. Congrats Mr. Pesci. https://t.co/GPjVyiqcAl https://t.co/tlNjBU9IZ8 Y Live \nYves Saint Laurent\n@yslbeauty #YSLbeauty #thatsY https://t.co/1Qvj4Cml9Z #Memories video out now. https://t.co/qytIEA9h5w https://t.co/Rdv6RuDrWi And again and again and again and again https://t.co/sO3rzbZPCO Yves Saint Laurent Y Live\n@yslbeauty #YSLbeauty #thatsY https://t.co/rYmCB7DgA3 This is a collection of memories; with family, friends, and each other over the last 35 years. Watch the full video on \n@applemusic and make your own #Memories video, using the Apple Photos app and our song 'Memories'  for a limited time #MadeWithMemories https://t.co/btVqQN7QK7 https://t.co/nRJ0Z1Dqdz This one is the nearest and dearest to my heart. And to see people connecting to it touches me in ways I cannot fully explain. Humbled. ❤️ https://t.co/CoCUMgwxAH This song is for anyone who has ever experienced loss. In other words, this song is for all of us. https://t.co/kQDn7gX9It https://t.co/vFb3G3ZplY #Memories 9.20.19 https://t.co/XYyfSj7YNs @yslbeauty #YSLbeauty #Y #LIVE https://t.co/B5CR854E8i and asking you to help us improve the health of our planet overall! Head to https://t.co/emPg4W5wfF to donate! Support the Red Cross Disaster Relief Fund to help the Bahamas and Carolinas with their efforts to combat Dorian. People around the world need our help! https://t.co/3ek7LjY7oN Over the last couple weeks, there have been a staggering number of environmental disasters occurring around the world. It is now more important than ever to step up and help! The President has recently proposed huge cuts in aid to disaster relief; we are making donations https://t.co/nxX3AuhkZP Fuck a Thursday. I’m throwing back today. Me and Shawn somewhere about to do something. And yes. Probably something awesome. https://t.co/fv1EQSswXY .@NBCSongland is back tonight! Tune in at 9pm/8pm CST https://t.co/kymCuPUFLE I’ve never done a #tbt so I thought I’d really come correct. WTF https://t.co/lEkts6darb AD!!!!!!!!!!! #golakers Being a dad is my #1 job. Join @Pampers to help dads this Father’s Day. Share a photo or video of your ritual moment using #LoveTheChange to contribute towards the installation of additional changing tables in public restrooms across the US &amp; Canada. #PampersPartner https://t.co/tqWmjsW15Q Flight Club https://t.co/uvOfj97Wj9 #Songland premiere is tonight! 10PM local time https://t.co/qAKW6UzF4W About 8 years ago, Mark Burnett convinced us to sign up for this show where you sit in a big red chair with your back turned away from the singers on the stage. First thank you must go to Mark. ❤️ We had no idea what… https://t.co/XjbaOu55PR A rare moment of tenderness. ❤️ https://t.co/z6fF7WKuWk Great opening last night. Welcome to LA, Dogpound! https://t.co/XO0HLdouFO RT @LBCrew: #voicesaveLB RT @marijones: i need your help guys! please RT to save me! #voicesavemari RT @NBCTheVoice: Retweet to #VoiceSaveMari Rt to #VoiceSaveMari Rt to #VoiceSaveLB RT @NBCTheVoice: Retweet to #VoiceSaveLB Voting is OPEN! Vote now on https://t.co/F30B7LmifI #TeamAdam https://t.co/N9RGAFpyUr Tune in to hear the fan’s song choices live @NBCTheVoice tonight! #TeamAdam #TheVoice https://t.co/TdxzNyGy5V Vote now!! https://t.co/CINWTuN9JM #TheVoiceTop24 https://t.co/Gdr8pjt9kl Tune in at 8PM EST TONIGHT to see my amazing team perform and vote for #TeamAdam https://t.co/foRCjHVnFT Voting has opened for #TeamAdam. Head to https://t.co/ToHSjkT8Qc now to cast your vote! https://t.co/EfA4PdHDu6 Vote for Team Adam tonight. Or, trust him. 😬 Watch Part 2 of the Cross Battles tonight. #TeamAdam https://t.co/bsQ2oIIfgF Happy Earth Day! https://t.co/GOBJBlvB7W Support the EARTH! https://t.co/C0LxBsMwQY 100% of proceeds go to help save the world #WeLoveTheEarth https://t.co/WiCspMVKvu RT @adamlevine: Vote now for #TEAMADAM on @NBCTheVoice https://t.co/Pe2mXqanrQ https://t.co/e3hPyEeb4m Vote now for #TEAMADAM on @NBCTheVoice https://t.co/Pe2mXqanrQ https://t.co/e3hPyEeb4m RT @NBCTheVoice: Are you ready for LIVE #VoiceCrossBattles?! Stay tuned for Carson’s signal, because voting opens at the END of the show! RT @adamlevine: Be sure to check out an all new episode of @NBCTheVoice, starting LIVE tonight #VoiceCrossBattles  #TheVoice https://t.co/l… Be sure to check out an all new episode of @NBCTheVoice, starting LIVE tonight #VoiceCrossBattles  #TheVoice https://t.co/lGVsNKd4Me RT @NBCTheVoice: This changes EVERYTHING 💥\n\nWitness the first-ever Live Cross Battles MONDAY and Results TUESDAY on @NBC. 🔥 https://t.co/vd… Nothing sweeter than profiting off a hillbilly’s mistake #VoiceBattles I’m sorry for calling you a mistake @blakeshelton. You aren’t a mistake. You are annoying, but you aren’t a mistake #VoiceBattles These two right here - next level. Awesome job, Celia &amp; Karly. You make me look good #VoiceBattles Don’t forget to watch the #VoiceBattles tonight at 8... Blake admits that I’m a better coach than him and that he is actually my #1 fan… it’s sweet. Pathetic. But sweet. Find out more about the songwriting process in the @nbcsongland studio May 28TH on @NBC! https://t.co/aW50kbGs27 Both of these guys are incredible. Couldn’t be more happy with what they did tonight. #VoiceBattles Well @blakeshelton just screwed the pooch on that one, now didn’t he? #VoiceBattles We're back for another round tonight on @NBCTheVoice #TheVoice https://t.co/xa5P2i4lpb Tune into @NBCTheVoice TONIGHT. 8/7c. #TheVoice #TeamAdam https://t.co/pyp0ULphbQ Behind every great song is a talented songwriter. Welcome to @NBCSongland 🎵 https://t.co/lpZamH2UBn I am rubber you are glue. Everything @blakeshelton says is dumb and I hate him. Eat shit, cowboy. Love you! .@blakeshelton people don’t even believe your insults anymore. You’re slippin boo. #VoiceBlinds #THEVOICE is back tonight! Tune in, starting at 8/7c https://t.co/eaVK8t4dnX **Blake Suck #VoiceBlinds Patrick. I’d like to congratulate you on not going with @blakeshelton. You chose wisely #VoiceBlinds It’s so nice when these guys make my job this easy #VoiceBlinds TONIGHT! @NBCTheVoice is on at 8/7c! #TheVoice https://t.co/RTaRxAhHPo I’m sorry @johnlegend… there was just no way I could risk losing this one to you. It had to be done. #VoicePremiere .@NBCTheVoice is back on tonight!! Just WOW #TOKYODOME https://t.co/s38SyOQHWn Trey is not just Trey… Trey is smart. Trey will not be fooled by the idiot that is @blakeshelton #VoicePremiere TONIGHT. @NBCTheVoice is back! Tune in 8/7c https://t.co/vWWNzG7FuU ... just wish I coulda seen all of it Drake's speech for the win Every dad knows diaper duty is a right of passage. #LoveTheChange #StinkyBootyDuty #PampersPartner @pampers @johnlegend @chrissyteigen https://t.co/DC8dCcAojj Bet. https://t.co/8VVShxuBof https://t.co/RReHqgn5WF RT @NBCTheVoice: https://t.co/37eoRllako #SBLIII https://t.co/wCOXAEk4G6 Ready to Rock! @lorealmenexpert #menexpert #hydraenergetic https://t.co/AjRbuWsRrR KUUUUUUUZZZZ!!!!! #golakers RT @NBCTheVoice: What a season!!!!!! Thanks for taking this journey with us. Have a safe and happy holidays, y’all!! https://t.co/aLOJGtIcHT RT @NBCTheVoice: RETWEET because the #VoiceTop4 are performing LIVE starting NOW on @nbc. 😘✌ https://t.co/lzxcMKX4bd RT @NBCTheVoice: #VoiceFinale voting is OPEN! Do your thing, fam. \n✅ https://t.co/8xDTMM7CwT\n✅ https://t.co/aXmvWog9bN \n✅ https://t.co/M1Mf… RT @lgelliss: Retweet to #VoiceSaveReagan !!! RT @mandiosborne: #VoiceSaveReagan You Got this Sweet girl!! RT @adamlevine: RT to #VoiceSaveReagan RT @maroon5: RT to #VoiceSaveReagan RT to #VoiceSaveReagan RT @NBCTheVoice: It’s official. @imkennedyholmes @itsMaKenzieT &amp; @imreaganstrange are up for the #VoiceSave tonight. RT @NBCTheVoice: RETWEET because #VoiceResults are LIVE starting NOW on @nbc. We’re having our LAST #VoiceSave of the season at the end of… RT @NBCTheVoice: RETWEET to vote for @imkennedyholmes and @imreaganstrange’s duet of “Happy / Tightrope!” #KennedyReaganDuet https://t.co/6… RT @NBCTheVoice: A hauntingly beautiful tune. RETWEET if @imreaganstrange’s take on “You Are The Reason” by @calumscott is getting your vot… Vote for @imreaganstrange on @NBCTheVoice #voicetop8 tonight!!!! https://t.co/TwPXOmlb3a #VoiceTop8 is on tonight! https://t.co/qSaCtzei6L RT @deandreknico: RT to save me! #VoiceSaveDeandre RT @imreaganstrange: #voicesavereagan RT @NBCTheVoice: Retweet to #VoiceSaveReagan https://t.co/vMCiPuhiTd RT @NBCTheVoice: Retweet to #VoiceSaveDeAndre  https://t.co/vMCiPuhiTd RT @maroon5: RT to #VoiceSaveReagan RT @maroon5: RT to #VoiceSaveDeandre RT to #VoiceSaveReagan RT to #VoiceSaveDeandre RT @NBCTheVoice: RETWEET if you’re READY to meet the #VoiceTop8 TONIGHT! FYI: we’re having an Instant Save at the the end of the show so ge… RT @NBCTheVoice: Are you ready for tonight’s Instant Save?! Presented by @Xfinity #TheVoice https://t.co/vMCiPuhiTd Tune in tonight!!! #TeamAdam #VoiceTop10 #TheVoice https://t.co/YhCN79SiLL RT @NBCTheVoice: RETWEET if @imreaganstrange has you “Cry”ing and voting for her with her rendition of this @FaithHill classic! 😭😭😭 https:/… RT @NBCTheVoice: OKAY @deandreknico! RETWEET if his FUN take on “That’s What I Like” by @BrunoMars has you tossing votes in his direction.… RT @NBCTheVoice: PSA: you can still vote until 7 AM ET TOMORROW. \n✅ https://t.co/8xDTMM7CwT\n✅ https://t.co/aXmvWog9bN \n✅ https://t.co/M1Mfy… RT @NBCTheVoice: Hey West Coast! \n\nIt's #VoiceTop10 time. 😍👏 https://t.co/tP6PLadxpj Voting begins NOW for #TEAMADAM! https://t.co/FkBWAVgCgD https://t.co/rGmb8RsmS2 RT @NBCTheVoice: Retweet to #VoiceSaveDeandre \nhttps://t.co/rGUG6rhWkk RT @adamlevine: RT to #VoiceSaveDeandre RT @maroon5: RT to #VoiceSaveDeandre RT to #VoiceSaveDeandre Fuck em. https://t.co/HJReNhZJF6 VOTE for @deandreknico &amp; @imreaganstrange on the #VoiceTop11 tonight! https://t.co/FkBWAVgCgD https://t.co/AyPHpkQhEW my dear friends wrote this lovely little book. It’s become one of my daughters go to’s. Check out @someonethebook https://t.co/Ouf9DUwsTD RT @adamlevine: RT to #VoiceSaveTyke @tykejames_ https://t.co/gCT6wiTFP6 RT to #VoiceSaveTyke @tykejames_ https://t.co/gCT6wiTFP6 RT @NBCTheVoice: Go ahead young @imreaganstrange! She’s bringing SWEET emotions to “You Say” by @Lauren_Daigle. RETWEET if this performance… RT @NBCTheVoice: RETWEET if @deandreknico’s take on @mercyme’s “I Can Only Imagine” has you SOBBING and throwing votes his way. #VoiceTop13… RT @NBCTheVoice: .@tykejames_  is slowing it down singing “(Everything I Do) I Do It For You” by @bryanadams. RETWEET if this performance h… RT @NBCTheVoice: PSA: you can still vote until 7 AM ET TOMORROW. \n✅ https://t.co/8xDTMLQ18j\n✅ https://t.co/aXmvWoxK3l \n✅ https://t.co/M1Mfy… .@JonahHill u up? Wanna watch a movie w me on @Oculus Go? LMK #Ad https://t.co/FFLyq5uERD Expecting a week full of energy! #thatsy #yslbeauty @yslbeauty https://t.co/Je9Jkq4RvF Vote for #TeamAdam tonight on @NBCTheVoice!! #VoicePlayoffs https://t.co/249QyK7C7U RT @NBCTheVoice: Are you FALLING for @SteveMemmolo singing “More Today Than Yesterday” by Spiral Staircase? ‘Cause SAME. Y’all voting for h… RT @NBCTheVoice: .@deandreknico is slowing it down and heating UP singing @johnlegend’s “Ordinary People!” RT to tell him you’re sending vo… RT @NBCTheVoice: He went out looking for trouble and he found GOLDEN VOCALS. RT if @Kameron_Marlowe’s take on \"I Ain't Living Long Like Thi… RT @NBCTheVoice: We ALL could “Use Somebody” like @tykejames_! He’s doing @KingsOfLeon PROUD. RT to tell him you only have eyes (and votes!… RT @NBCTheVoice: Tonight's gonna a real knee slapper! 😂\n\nSee ya in ONE HOUR for #VoiceKnockouts. 😘 https://t.co/4EcBPa8qrd I’m not sure I can lay it out any better than this. #VOTE https://t.co/RbBUqW2481 Can’t say we didn’t truly go for it. https://t.co/BwN35jIxiB I’m so proud of this moment. I love when we stumble upon these little moments that define the show. So so special. Proud of you both. #VoiceBattles Those aren’t two little girls up there tonight. Those are two amazing young women with bright futures. Love to you both. ❤️❤️❤️ #VoiceBattles Sweet pick up! Thanks dummy! Love you! @blakeshelton #VoiceBattles My brother @JonahHill really went and made one of best movies this year. Go see #mid90s now in NY/LA! Nationwide next Friday. https://t.co/BUmlvSyBh4 @VanityFair @MonicaLewinsky @Hannahgadsby Zdx0 I’m so happy that Emily is the artist that closed out my team! You’re so special. I could tell from the first note. #VoiceBlinds Ooooo feeeel the Burn @kelly_clarkson and @IAMJHUD. Feel it! Can youuuuuu feeeel it!!! Funshoooooo let’s goooooooo!!!! #VoiceBlinds ‘97 y’all https://t.co/wpANWR20YN So happy I could protect sweet Regan from the evil clutches of @blakeshelton and his thuggish country empire of doom #VoiceBlinds I solve equations on blackboards during my off hours when no ones looking. I have a rough exterior but a good heart. Clearly I’m best friends with Ben Affleck. Who am I? #VoiceBlinds My team was great… and now DeAndre? I’ll be shocked if I lose this season #VoicePremiere I really am sorry @IAMJHUD you know I love you. I just needed this one, okay? we good? 3 out of 4 coaches just made a huge mistake. I won’t say which ones. Hint: I’m definitely not one of them #VoicePremiere #VoicePremiere is on now! https://t.co/cai7ZknViB .@yslbeauty #thatsy #yslbeauty https://t.co/EDeff08vDZ RT @Lakers: 👀 @adamlevine was #6. Who will be #7? #ChosenFew 👑\n\nhttps://t.co/F8VrnAloyR https://t.co/WmrtF1zvVL Thanks to everyone who helped make this show happen...we are really proud of how it turned out and hope you enjoy watching it as much as we did making it. @charlieputh @FifthHarmony #BadBunny @kelly_clarkson @blakeshelton @SnoopDogg @ASAPferg https://t.co/SagU6LBTQ7 Just heard @trvisXX's Astroworld. 🔥🔥.  Check it out here - https://t.co/sY07x0ohVq Check out my man @JordanSmithLive's new album https://t.co/R4gzru87aa Shit. I don’t usually put my foot in my mouth. But this time, I did. ‘This is America’ actually WAS nominated for 7 VMAs. How I didn’t  get the right info is beyond me. I stand corrected. I’m sorry MTV.  Still hate you though. but mostly, I’m sorry. https://t.co/sypPvLB8HN Beyond proud of my brother @JonahHill. The movie is incredible!\nhttps://t.co/1bAWzfPZw1 My boy @ItsBennyBlanco steppin out and releasing a truly refreshing and honest video for his new single #Eastside Very proud! https://t.co/piCIoWGJw4 😂😂😂 https://t.co/k5ftXZRGbk I signed up for this @juliamichaels meet and greet and she never showed. What an asshole. https://t.co/8b367PoyF1 That’s me. embracing the chaos. Nice stealthy photo @milodecruz ❤️❤️❤️ https://t.co/wWIqE3CbtG What was that? Nothing matches? PERFECT. https://t.co/OZs88232xk Adrenaline greatly improves my vertical leaping abilities. #REDPILLBLUESTOUR https://t.co/T17lX9OqXO The sports car of tomorrow. Today. Awesome time driving the @Porsche #MissionE at the Porsche Experience Center, LA. Watch the flim at https://t.co/o4uGzg6Ikm #PorschePartner #MissionE, #SportcarTogether #Porsche https://t.co/ULlwCnUD0H Thank you so much to everyone involved with this very special project; honored to share this with you all! https://t.co/uDjATd1b1I #GirlsLikeYou https://t.co/JQFYWMY02A Showed James Corden how to really drive a @Porsche Cayenne on the @latelateshow. Check out the full video here https://t.co/u6P8StK8Gm #CarpoolKaraoke #PorschePartner https://t.co/lRK48l4kcW RT @latelateshow: .@adamlevine #CarpoolKaraoke!\nhttps://t.co/6woH4RVzTo RT @latelateshow: We’re shifting gears and hitting the road in a shiny new ride thanks to @Porsche. #CarpoolKaraoke with @AdamLevine drops… RT @NBCTheVoice: RETWEET IF YOU THINK @BrittonBuchanan is THE VOICE! #VoiceFinale https://t.co/JikHfRlVI5 The Queen turns 30 today. She’s a legend. She’s THE baddest. In just a few years we have laughed and loved harder than most. I wake up every morning thankful that it wasn’t all a dream. Here’s to a thousand more years. I love you @BeePrinsloo with everything I got https://t.co/QCH9A6Dytg RT to #VoiceSaveBritton RT @NBCTheVoice: .@ItsJackieFoster and @RayshunLaMarr have definitely made us *believers* They’ve blended up “Believer/Radioactive” by @Ima… RT @adamlevine: Vote for @RayshunLaMarr tonight! #TheVoice #TeamAdam https://t.co/BvruYx3tTL RT @RayshunLaMarr: VOTE NOW!!! #JackieRayshunDuet #RayshunLaMarr https://t.co/UD8FGqWfko Vote for @RayshunLaMarr tonight! #TheVoice #TeamAdam https://t.co/BvruYx3tTL Welcome back! https://t.co/l7pQBwuXPj #VoiceSaveJackieV #VoiceSaveRayshun Vote for #TeamAdam!! #VoiceTop10 https://t.co/2ssq44EQlW RT @NBCTheVoice: RETWEET if you can you see through your tears well enough to send @itsjackieverna your votes! #VoiceTop10 https://t.co/H3J… RT @NBCTheVoice: PSA: YOU KEEP VOTING UNTIL 12 PM EST TOMORROW! #VoiceTop10\n✅ https://t.co/8xDTMM7CwT\n✅ https://t.co/PhA3aWTJGW\n✅ https://t… RT @NBCTheVoice: .@RayshunLamarr singing @mrjukesmusic’s “Grant Green” has got us feeling SO HAPPY! 👏 #VoiceTop10 https://t.co/oE7QYuRrw0 RT @NBCTheVoice: Hey West Coast! Are you ready for the #VoiceTop10 to knock it out of the park? It starts NOW. ✌️🎤 https://t.co/WbVf6UtHu5 That is a colorful work station. https://t.co/yBqU1bk7TC RT to #VoiceSaveSharane Vote for #TEAMADAM starting now until 12pm EST tomorrow! #TheVoice https://t.co/RI7QqassJR RT @NBCTheVoice: VOTING IS OPEN, Y’ALL!  Here’s more info on how to vote! #VoiceTop11 \n✅ https://t.co/8xDTMM7CwT\n✅ https://t.co/PeAzNFr9s2… Yeah. All of that. Watch #TheVoice top ten tonight. Do it. https://t.co/QFzxcDYumU For that first day of school when you know you’ve gotta do it right. End the lunch box game before it begins. My girls will be ready. 👊🏻👊🏻👊🏻 https://t.co/232xh2lqYG Can't wait for tonight's episode! #VoiceTop11 RT @NBCTheVoice: Too cute to function. 😭 Claire Crosby is everything pure in this world. Obsessed with this interview. 😍#TheVoice https://t… Musics. https://t.co/BFx7hx3AXB RT to #VoiceSaveRayshun RT @maroon5: COMING SOON!!! #THEVOICE #VOICETOP11 #WAIT RT @NBCTheVoice: Bet you didn't think Tuesdays could get any better. THINK AGAIN! 😏#TheVoice https://t.co/WdAKjCuRjp Voting is open for everyone on #TEAMADAM. Let's get them to the next round! #VoiceTop12 https://t.co/RH8IEn7Kvr RT @maroon5: You know what to do! Vote for #TEAMADAM on @NBCTheVoice tonight! https://t.co/qLUCIP6jId RT @NBCTheVoice: VOTING IS OPEN. Here’s how you can vote! #VoiceTop12   \n✅ https://t.co/8xDTMM7CwT\n✅ https://t.co/aXmvWog9bN \n✅ https://t.c… RT @NBCTheVoice: RT to save @ReidUmstattd from elimination now. #VoicePlayoffsReid RT @NBCTheVoice: RT to save @RayshunLaMarr from elimination now. #VoicePlayoffsRayshun RT @NBCTheVoice: RT to save @miaboostrom from elimination now. #VoicePlayoffsMia RT @NBCTheVoice: RT to save @itsjackieverna from elimination now. #VoicePlayoffsJackieV RT @NBCTheVoice: RT to save @DrewColeMusic from elimination now. #VoicePlayoffsDrew RT @NBCTheVoice: Voting is open for #TeamAdam. Tweet to save your favorite artist from elimination NOW! #VoicePlayoffs https://t.co/mxw4SA7… RT @NBCTheVoice: This is #VoicePlayoffs voting on #TheVoiceOfficialApp:\n\n✌️ https://t.co/9gikDfD7EB \n✌️ 10 votes per artist\n✌️ Windows open… RT @NBCTheVoice: RT to save @SharaneCalister from elimination now. #VoicePlayoffsSharane RT @NBCTheVoice: RT to save @ReidUmstattd from elimination now. #VoicePlayoffsReid RT @NBCTheVoice: RT to save @RayshunLaMarr from elimination now. #VoicePlayoffsRayshun RT @NBCTheVoice: RT to save @miaboostrom from elimination now. #VoicePlayoffsMia RT @NBCTheVoice: RT to save @itsjackieverna from elimination now. #VoicePlayoffsJackieV RT @NBCTheVoice: RT to save @DrewColeMusic from elimination now. #VoicePlayoffsDrew RT @NBCTheVoice: Voting is open for #TeamAdam. Tweet to save your favorite artist from elimination NOW! #VoicePlayoffs https://t.co/rbyJFLr… RT @NBCTheVoice: RT because the three-night LIVE #VoicePlayoffs begin NOW with performances AND results on @nbc. 😁✌️ https://t.co/bEymyN51iH RT @NBCTheVoice: Tonight is the night to make your voice heard! 🗣👏\n\nWho are you voting for in the #VoicePlayoffs? https://t.co/X82JM1o0F6 #GOLFCHELLA https://t.co/BFyIRX0tp9 Words not necessary. #vibe https://t.co/2HuqminFF4 Flippin 🦅’s https://t.co/z1qsgYBk31 Whatever the opposite of love and respect is. That’s what I feel for @blakeshelton #VoiceKnockouts Man. This is one of those moments that feels totally impossible.  #VoiceKnockouts Help my amazing friend @Aly_Raisman spread the word... https://t.co/t9tJNUmC82 https://t.co/9L9sgpzpdc Fortunately, @blakeshelton’s opinion means nothing to me. Proud of you lovely ladies! You are both incredible. #VoiceBattles We did it! I’m so impressed with you guys. Truly did me proud tonight. #VoiceBattles You both were outstanding. I hate having to make this choice. #VoiceBattles This guy. https://t.co/a6mEyTocUu My team is full. And Blake is full...of 💩...... see what I did there? #VoiceBlinds Blake drinks his own pee… #VoiceBlinds Coaches were sleeping on Miya. Rather than wake you, I'll just win now. Nite nite. #VoiceBlindspop I have a new best friend named Tish. She loves me more than you. And by you, of course I mean @blakeshelton #VoiceBlinds Yup. That's her alright. ❤❤ @BeePrinsloo https://t.co/mCaRBWFWZm You and me baby...... https://t.co/OqU5uGVyXI First time in Equador!!! Vibes were strong. We had a BLAST and can't wait to return! Thanks for coming!!! We're glad we did! https://t.co/vuQ8RnxQSS It’s that time again. @nbcthevoice #season14 https://t.co/pZLLanmBsM My maniac. ❤️❤️❤️❤️❤️❤️❤️❤️ https://t.co/HvAUgGDoul Partnered with my friends at @Tinder to spread the love for Valentine's Day! #sponsored https://t.co/FcOFobkc3M Getting ready to celebrate Valentine's Day with my friends at @Tinder. Stay tuned... #ad https://t.co/XsN1ipRb6R #newM5video #WAIT #Ihatehashtags #especially #when #peopleuse #toomany #itsacomplusion #stop #notagoodlook #takeyourownadvicebro #seriously #noseriously #stop #icant #whynot? #because #ibase #myentireconcept #ofselfworth #onsocialmediastats #jk #idgaf https://t.co/laqYZoiIzT https://t.co/580PR94JBU .@imjmichaels is soooooooooo annoying and stupid. Her extreme amount of talent only slightly makes up for it. ❤️❤️❤️ https://t.co/uG1QqJqzMY Beating the Celtics always feels good. Especially THESE Celtics. #freethrowsthough Work smart..not hard...this photo was taken during the rigorous video shoot for our new single “WAIT” which you can now see. Check it out. But only if you want your mind BLOWN. https://t.co/BabNaOshlK https://t.co/PHFUW95xOz Another shot from perhaps the most expensive video ever made. “WAIT” is available now WORLDWIDE for your viewing pleasure. Caution: may lead to euphoric bursts of happiness. https://t.co/BabNaOshlK https://t.co/POLWKownaT New video coming soon....#M5 #WAIT https://t.co/36OpRfq3UQ Tonight it goes down. Vote for @addisonagen for the finale. Lets get her the biggest win of her life! #VoiceFinale https://t.co/qiHw2uPnVl Our video for #WAIT is out now on @Spotify. Watch it here https://t.co/ymYhYSXxYR https://t.co/cSO3OxEeAb #WAIT. The writing's on the wall. https://t.co/aVnxwjspsm RT @maroon5: RT now to #VoiceSaveAdam RT now to #VoiceSaveAdam RT @NBCTheVoice: RETWEET TO #VoiceSaveAdam It's time! Vote for @adam_cunningham to pass on to the next round #VOICETOP8 #TEAMADAM https://t.co/EV7fiiaCBd Vote for the amazing @AddisonAgen now to move on from the #VoiceTop8 on @NBCTHEVOICE. #TEAMADAM https://t.co/tAwH2ZjZlu Vote for #TEAMADAM's @Adam_cunningham &amp; @ADDISONAGEN tonight! #VOICETOP10 https://t.co/IMglm4AVnp proud of my @lakers tonight. Stuck with it and showed GS that we can play. Learning more all the time. #golakers Let's make it two for two. Vote for @Adam_Cunningham tonight to see him move on from the #VOICETOP11 https://t.co/HAA7ZXM0qr Vote for #TEAMADAM's @ADDISONAGEN to move on from the #VOICETOP11 #THEVOICE https://t.co/ZfxPihiat9 RT now to #VoiceSaveJon RT now to #VoiceSaveAdam Vote now for everyone on #TEAMADAM to move on to the next round #VoiceTop12 https://t.co/Oh35uwUbIZ RT @NBCTheVoice: VOTING IS OPEN.  Here’s how you can vote! #VoiceTop12  \n✅ #TheVoiceOfficialApp\n✅ https://t.co/aXmvWoxK3l\n✅ https://t.co/Ee… Proud of both of these guys tonight. What a way to end the night #VoiceKnockouts https://t.co/A5udOCWGBO Help female vets &amp; new music by @xtina @Pink @GwenStefani @natashabdnfield @itsdorothysucka @ServedLikeAGirl https://t.co/c3kchzO9iU Shit. #redpillblues is getting some amazing reviews. This can’t be a good sign. 😳 Hey! @blakeshelton has a new album coming out on the same day as @maroon5. Congrats number 2!!! Super proud of my team tonight. These performances keep getting more insane. #VoiceKnockouts Happy birthday @ZO2_! Can’t wait to see the greatness to come. #golakers #REDPILLBLUESTOUR is here. Going out on the road all next year with @imJMichaels. Tix on-sale Nov 4th. All dates on https://t.co/GwYnibofri https://t.co/VrS9QJ6GpP Well, that could have gone two ways. Luckily it was the way I wanted -  Finally got Addison. #VoiceBattles Two class acts up there. They did me proud. #VoiceBattles #GoLakers Thank you, Dennis . Thank you for saving yourself from @blakeshelton. He’s a nasty SOB. I'm glad you’re finally home. #VoiceBattles This makes me smile. I love you Los Angeles. You've been so good to us all these years. #redpillblues #maroon5 https://t.co/KxiDeyK8Qv I aint sayin dont pick @blakeshelton, but just dont pick @blakeshelton #VoiceBattle These are my most favorite sunglasses. I wanted to share. They're also very comfortable on my face. Thank you. https://t.co/D0OuraJu4b https://t.co/KPZ9NX7YJQ Arts n' Crafts? https://t.co/9DOJuwxT1m Had to hold out for the right voice. Excited to move forward with my team this season. You’re all awesome #VoiceBlinds RIO https://t.co/zIJTwxZhOs Just when you count me out… I swoop back in and get shit done. right @IAMJHUD? #VoiceBlinds Incredibly happy that Ignatious made it through the Blinds, but I’m even more touched by the fact that he didnt choose Blake. #VoiceBlinds Back at it again. Tune in to @NBCTheVoice tonight! https://t.co/eB7KN3MAoy https://t.co/2s8X9u2SdJ https://t.co/K4SHLol6En Pre-order our new record, #RedPillBlues https://t.co/fip7cOcxe0. Album out 11.3 https://t.co/ruTOFoaoEQ New album #RedPillBlues. Pre-order on 10.6.17 https://t.co/URWKxdCC7h I had almost forgotten I was good at this! Phew! Welcome Emily! #VoiceBlinds DED ZEPP Halloween 2016. We kicked a whole lotta ass... https://t.co/clvHXHXQQx Thank you. You inspired us all so much. https://t.co/0Sb0GUU9N5 https://t.co/mIDGCAYsaL Who are these idiots? Wow talk about a throwback. #tbt so hard right now. https://t.co/Nn3sTHkFl6 WHAT LOVERS DO- VIDEO- FT. @SZA. Out now https://t.co/FNNxdI5BOg Step off @IAMJHUD… this is my house! #VoicePremiere RT @KingJames: U bum @StephenCurry30 already said he ain't going! So therefore ain't no invite. Going to White House was a great honor unti… TUNE-IN tonight for Season 13 premiere of @NBCTheVoice .@blakeshelton I ain't touchin that one… #VoicePremiere Guatemala City, we love you and we are so sorry, but we promise to make it up to you! So this was chill...#rockinrio @bootswallace https://t.co/jOBtqDNgt9 So Alive this city! https://t.co/0eEDpuyNSZ I miss Nate Dogg #WhatLoversDo, ft @SZA, is out now. https://t.co/Co8CAjVMBe https://t.co/ADNmIegZqP RT @maroon5: Here it comes..... #WhatLoversDo https://t.co/2m9JZBSWfS Our new single #WhatLoversDo is out August 30th, featuring our friend @SZA https://t.co/erK96WC6MZ Julia Michaels gets cut off while she's singing and Lorde gets to NOT sing her whole song It's always exciting to see how utterly horrible the VMAs will be. They really delivered so far this year. #HOLYFUCK My girl @imjmichaels is in the final round for Best New Artist at the VMAs! Use hashtag #VoteJuliaMichaels to vote. Retweets don't count! 😄 Be sure to watch my buddy @SammyHagar join me for a ride to the studio and a special performance- today at 8/7c or Sunday at 9/8c on @AXSTV. https://t.co/Rfb59WheRJ https://t.co/UZPNBZN2oH This is my Israeli uncle Shalom back in the 70s. People say we look alike. I don't see it. https://t.co/mSwkIoWg8Q Not much has changed @JRCarmichael except maybe our terrible personal style. https://t.co/wLar3qMfN6 Switzerland 🇨🇭 https://t.co/y6zh5ufOIV Never thought I'd be on one of these magazine covers with the MOST epic partner @sammyhagar https://t.co/eCNbt5hFg1 .@samfarrar found these original lyrics to a song from our first album...But....which song is it??? https://t.co/5vS2QgaRCS Dear @sammyhagar, I hope your Friday is going as well as mine...#santo https://t.co/DhsidauQ4o I wanna be Carl Reiner when I grow up. Organize. Mobilize. Take to the theaters and speak truth to power. Sign-up for free screenings here: https://t.co/QU9iRxmZwr #ParisAgreement ....it's worth holding onto...👀📷 by @milodecruz and permanent illustration by Bryan Randolph https://t.co/uCeVTk4NXE RT @NBCTheVoice: .@JLarsonguitar and @CeeLoGreen are seriously twinning with this epic performance of “Shining Star.” #VoiceFinale RT @NBCTheVoice: .@JLarsonguitar and @adamlevine are brothers through and through. #VoiceFinale Heartbroken and praying for all the families in Manchester. Vote now for @JLarsonguitar on the #VoiceFinale #TeamAdam. https://t.co/SDEVWtRQvb RT @NBCTheVoice: VOTING IS OPEN. #VoiceFinale\n\n✅ #TheVoiceOfficialApp\n✅ https://t.co/fjHuXzhCvH\n✅ https://t.co/EesjVHrDcT\n✅ https://t.co/Hk… RT @NBCTheVoice: We like everything we see while @JLarsonguitar takes on “Takin’ It To The Streets” by @TheDoobieBros. #VoiceFinale #MicJack video with @BigBoi is out now on @VEVO!!!! https://t.co/TR6FMN7OD4 RT @NBCTheVoice: Retweet to #VoiceSaveJesse RT @maroon5: Retweet to save @JLarsonguitar! #VoiceSaveJesse RT RT RT to save @JLarsonguitar #VoiceSaveJesse Casual Tuesdays with @BigBoi at @NBCTheVoice #micjack https://t.co/xaTjJjFnSo Happy birthday to the baddest bitch on planet earth. baddest mom...baddest wife...baddest bad ass...My Queen ❤️️❤️️❤️️❤️️❤️️❤️️❤️️❤️️❤️️❤️❤️ https://t.co/bY8z1XLg8P Vote for @JLarsonguitar on the #VoiceTop8 tonight! #TeamAdam https://t.co/5rGBnPb4g4 RT @NBCTheVoice: VOTING IS OPEN. #VoiceTop8 \n\n✅ #TheVoiceOfficialApp\n✅ https://t.co/fjHuXzhCvH\n✅ https://t.co/EesjVHrDcT\n✅ https://t.co/Hkp… RT @NBCTheVoice: RT to VOTE for @JLarsonguitar and @TSoulMusic’s duet of “I Wish” by Stevie Wonder. #JesseTSoulDuet https://t.co/QIEbxoARpM May The Vibes Be With You... https://t.co/lHOe7wINyY RT @lillipassero: #voicesavelilli RT @Markisaiahmusic: RT to save me NOW. You have 5 MINUTES! #VoiceSaveMark GO! GO! GO! RT @NBCTheVoice: Retweet to #VoiceSaveMark RT @NBCTheVoice: Retweet to #VoiceSaveLilli RT @maroon5: RT to save @lillipassero now. You have 5 MINUTES! #VoiceSaveLilli RT @maroon5: RT to save @Markisaiahmusic now. You have 5 MINUTES! #VoiceSaveMark RT to save @Markisaiahmusic now. You have 5 MINUTES! #VoiceSaveMark RT to save @lillipassero now. You have 5 MINUTES! #VoiceSaveLilli Vote now for @lillipassero and get her to the next round! #VoiceTop10 https://t.co/rvccbgjnSn Give it up for @Markisaiahmusic. Vote him on to the next round. #VoiceTop10. https://t.co/2krT1onuMx .@JLarsonguitar is ready for your vote. Vote now for the #VoiceTop10 https://t.co/cyKBu6TGmK RT @NBCTheVoice: RT if there’s no way you’re going to forget to vote for @lillipassero tonight. #VoiceTop10 https://t.co/zHZ21hf91D RT @NBCTheVoice: RT if you’re voting for @Markisaiahmusic tonight once you stop your crying. #VoiceTop10 https://t.co/qtMTtkv1sb RT @NBCTheVoice: VOTING IS OPEN. #VoiceTop10\n\n✅ #TheVoiceOfficialApp\n✅ https://t.co/fjHuXzhCvH\n✅ https://t.co/EesjVHrDcT\n✅ https://t.co/Hkp… RT @NBCTheVoice: If you know you love @JLarsonguitar and you want to show it, RETWEET and vote. #VoiceTop10 https://t.co/DTAjt5jmAD Can anyone hook me up with @BeePrinsloo? BIG fan. https://t.co/VAVNWHhetj RT @Markisaiahmusic: RT to save me NOW. You have 5 MINUTES! #VoiceSaveMark GO GO GO RT @maroon5: RT to save Mark now. You have 5 MINUTES! #VoiceSaveMark RT @NBCTheVoice: Retweet to #VoiceSaveMark RT to save Mark now. You have 5 MINUTES! #VoiceSaveMark Vote now for @Markisaiahmusic #VoiceTop11! https://t.co/soBh2PLU2g .@lillipassero is up for the #VoiceTop11. Vote for her now! https://t.co/LF2y5FPGaB Vote for @JLarsonguitar now for the #VoiceTop11! https://t.co/R82IgV6Jih RT @NBCTheVoice: VOTING IS OPEN. #VoiceTop11\n\n✅ #TheVoiceOfficialApp\n✅ https://t.co/fjHuXzhCvH\n✅ https://t.co/EesjVHrDcT\n✅ https://t.co/Hkp… RT @Markisaiahmusic: RT to save me NOW! You have 5 minutes!! #voicesaveMark RT! #VoiceSaveMark RT @NBCTheVoice: Retweet to #VoiceSaveMark RT to save Mark now. You have 5 MINUTES! #VoiceSaveMark Voting is open now, here's how to vote for @Markisaiahmusic… go go go!!! https://t.co/Rk3oxXRyi8 Voting is open now, here's how to vote for @lillipassero… go go go!!! https://t.co/toTNygRQiR Voting is open now, here's how to vote for @JLarsonguitar… go go go!!! https://t.co/FjT9CbCnI9 RT @NBCTheVoice: RT because the #VoiceTop12 are ready to slay the stage LIVE starting NOW on @nbc. 😘✌ https://t.co/F4TaWdVpPv RT @NBCTheVoice: VOTING IS OPEN. #VoiceTop12 \n\n✅ #TheVoiceOfficialApp\n✅ https://t.co/fjHuXzhCvH\n✅ https://t.co/EesjVHrDcT\n✅ https://t.co/Hk… RT @BigBoi: Happy Release Day Bro Ski ! @adamlevine #MicJack 🔥🔥🔥🔥🔥 https://t.co/Kk1cJWtYPC #JOHNWILLIAMS #COACHELLA 2018 Please help my brother @MichaelNLevine raise awareness 4 Multiple Sclerosis as he walks w/ @CourtneyGaliano https://t.co/iBlxzprAZD #MSWalk RT @NBCTheVoice: RT to save @hannaeyremusic from elimination now. #VoicePlayoffsHanna RT @NBCTheVoice: RT to save @JLarsonguitar from elimination now. #VoicePlayoffsJesse RT @NBCTheVoice: RT to save @JoshWest4Music from elimination now. #VoicePlayoffsJosh RT @NBCTheVoice: RT to save @TheJohnnyHayes from elimination now. #VoicePlayoffsJohnnyH RT @NBCTheVoice: RT to save @lillipassero from elimination now. #VoicePlayoffsLilli RT @NBCTheVoice: RT to save @Markisaiahmusic from elimination now. #VoicePlayoffsMark RT to save @Markisaiahmusic from elimination now. #VoicePlayoffsMark RT to save @lillipassero from elimination now. #VoicePlayoffsLilli RT to save @TheJohnnyHayes from elimination now. #VoicePlayoffsJohnnyH RT to save @JLarsonguitar from elimination now. #VoicePlayoffsJesse RT to save @JoshWest4Music from elimination now. #VoicePlayoffsJosh RT to save @hannaeyremusic from elimination now. #VoicePlayoffsHanna RT @NBCTheVoice: Voting is open for #TeamAdam. Tweet to save your favorite artist from elimination NOW! #VoicePlayoffs https://t.co/BuCB31N… https://t.co/icaYDh9eB7 https://t.co/se48u1NYaO https://t.co/vDAjOJ6Ja3 Posting is like, so whatever. 🐇 https://t.co/jijIeruvdr Ok I'm not gonna NOT post this. https://t.co/M20clD1Sls This is why the Clippers will NEVER be the Lakers. https://t.co/w2xrhtJ3Jv How I was the only person to hit my button for these two is pretty astounding. These guys are incredible. #VoiceBattles Still can’t believe Johnny didn’t make a team last season... I couldn’t let him go #VoiceBattles I can’t even let @blakeshelton’s terrible jokes ruin this moment. #VoiceBattles His look of disgust was palpable... https://t.co/M27sif81yA Literally all @aliciakeys has to do is say people’s names… At least @blakeshelton knew the gondoliers were in Italy... We are making progress in his worldly knowledge. These things take time. I know. I know. This outfit is incredible. I get it. Enough already. https://t.co/VsMSEN6T4c Hi there. https://t.co/QWEBIxgDLH Well, I can’t say we didn’t see that coming... #VoicePremiere Julien, you have no idea how much trouble you just saved yourself by choosing me over Blake. #hestheworst #VoicePremiere .@gwenstefani @blakeshelton Yeah, you guys didn't stand a chance after that, sorry... Wait... how in God’s name am I the only person who hit their button for Jesse? I don’t know how that is even possible… #VoicePremiere It's very important to note that @blakeshelton just used the word \"Poser\" .@gwenstefani I hope this doesn’t become a regular occurrence... 4 chairs are sort of my thing... #VoicePremiere .@BeePrinsloo Taking \"I'm a cool mom\" to a whole new level. #youresocoolyouresocoolyouresocool https://t.co/JO8Bi3PgpL So proud to be part of something that brings people together instead of tearing them apart. https://t.co/NduUzoYZEv \"The Good Land\" (Milwaukee) https://t.co/BtijGRZ4mU Thanks for watching our performance of #COLD on @TheEllenShow. Now watch the video on @VEVO- https://t.co/SJyXhVuCbQ https://t.co/i0DBABfsdA Our new single #COLD, featuring @1Future is out on @AppleMusic. Grab it now! https://t.co/oRr3nrZgzt https://t.co/OX6FYDvyvT Whaaaaaaaaat!?@ https://t.co/WzYYtZGE5b So excited to see Jake on Broadway!  Get tix here- https://t.co/9OsdEMClcY https://t.co/zIWz5vpFAK Happy New Year mama https://t.co/zHjjp5yiua Timeout. https://t.co/1U4Ms85eiQ Vote for @BillyGilman now for the #VoiceFinale https://t.co/mcyXTxrH5h &amp; https://t.co/X7gMW7TeKf https://t.co/PpH7GfzZti Vote now for the great @joshgallmusic on the #VoiceFinale - https://t.co/g7umCq4Hdu &amp; https://t.co/Hwla5bLyuV https://t.co/1eQ5dTIBlB Vote now! #VoiceSaveJoshG RT @maroon5: RT to save! #VoiceSaveJoshG RT to save #VoiceSaveJoshG RT @maroon5: #VoiceSaveJoshG #VoiceSaveJoshG Vote now for @joshgallmusic on @NBCTheVoice https://t.co/1xVphjoLvR https://t.co/0yg9v1mnvN Vote for @BillyGilman now #TeamAdam https://t.co/OwDp7y9Sgn https://t.co/6EeKMnALQV Vote for #TeamAdam's @brendanjfletch now- https://t.co/NJuxNFLTgk https://t.co/zcFnLDqih1 Levine...Levine...Levine... https://t.co/LRlqdp8By8 Every day is a new adventure https://t.co/IodvMcE1sc Vote now for @joshgallmusic now! https://t.co/00EgWiJtJH #VoiceTop10 https://t.co/Q6xIlmHd22 Vote for the amazing @brendanjfletch now! https://t.co/zshXBOK1Ux #VoiceTop10 https://t.co/ISbjbkCA0U Vote for @BillyGilman NOW! https://t.co/wkeihpxJCV #VoiceTop10 https://t.co/77aw3GEdzh .@BeePrinsloo has raided my dressing room https://t.co/FwMX0Zc8TR Vote for @joshgallmusic- https://t.co/TPEmBm6duo #TeamAdam https://t.co/7FLqywdVLQ Vote for @brendanjfletch now- https://t.co/gy8GfmWSX7 #TeamAdam https://t.co/16MnKRhixi Vote for @BillyGilman now- https://t.co/1cMJnA6jIC. #TeamAdam https://t.co/pGNyy31Fe0 I can assure you that whatever is being said here is wildly inappropriate. https://t.co/0I0Zghg7y3 Looks like Xmas came early this year. Hey @sammyhagar ya thirsty? https://t.co/p8uHn3M4he Vote for @joshgallmusic today on @AppleMusic now! https://t.co/qjKJvqk3gd https://t.co/rgIAsNj31p Get @brendanjfletch past the #VoiceTop12. Vote now! https://t.co/0YghMRtEOD https://t.co/cp1wYthec5 Vote for @BillyGilman on @AppleMusic here- https://t.co/zuVaiG7F1c https://t.co/xucpg0iAUE Everything I need is right here. (Beach optional) https://t.co/bsBnfl38or https://t.co/P44HFBIKbz RT @NBCTheVoice: RT to save @SimoneGundy from elimination now. #VoicePlayoffsSimone RT @NBCTheVoice: RT to save @brendanjfletch from elimination now. #VoicePlayoffsBrendan RT @NBCTheVoice: RT to save @BillyGilman from elimination now. #VoicePlayoffsBilly RT @NBCTheVoice: RT to save @joshgallmusic from elimination now. #VoicePlayoffsJoshG RT @NBCTheVoice: RT to save @rileyelmore from elimination now. #VoicePlayoffsRiley RT to save @SimoneGundy from elimination now. #VoicePlayoffsSimone RT to save @rileyelmore from elimination now. #VoicePlayoffsRiley RT to save @joshgallmusic from elimination now. #VoicePlayoffsJoshG RT to save @brendanjfletch from elimination now. #VoicePlayoffsBrendan RT to save @BillyGilman from elimination now. #VoicePlayoffsBilly #golakers https://t.co/vCdhxKQOed Not surprised that my girl @AliciaKeys new record is brilliant. I expect nothing less. Get it folks! https://t.co/y0xsNL0moY I wanna punch young @blakeshelton's face so hard https://t.co/5Z2AuFTWXe Only a few days left to stream #BeforetheFlood for free! Tune in. Get informed. Take action. https://t.co/GGhIK60fTc https://t.co/Cz6lL41AHX Billy Gilman, ladies and gents. Tell me this guy can't win this thing! #VoiceKnockouts I can’t wait to beat @blakeshelton at his own country game. #VoiceKnockouts It's hard to express with words what it feels like to know you've helped someone in this way. So instead, I'll just share. Nice job kid. :) https://t.co/IuTSZPhntZ Brendan might have literally shattered the earth with that voice #VoiceBattles Only real men can take on Peter Gabriel. You guys handled it masterfully #VoiceBattles PuRpLe StUfF https://t.co/CC8kOgWcOM NEW VIDEO #DONTWANNAKNOW IS HERE!!!!! CHECK IT OUT ON @VEVO!!!!!!!!!! https://t.co/5fBRJDCH6Z https://t.co/J2qRVCJvMY Our new single #DontWannaKnow ft. @KendrickLamar is out tonight! https://t.co/HB3Rw3LESs Just observing @jamesbvalentine's shred clinic... https://t.co/2XAnAmYnRE Pleased to announce that one of my best buds ever @mrgenehong wrote tonight's episode of his new show #lethalweapon. 8pm. Fox. Watch it! RT @NBCTheVoice: Drum up the excitement because the #VoicePremiere continues in TWO HOURS. 🥁🥁🥁🥁 https://t.co/l3cr1GQkLm I am so sorry for the inconvenience and look forward to seeing you all very soon. More at: https://t.co/GwYnibofri https://t.co/PVhPLOvLJ3 Check out my pal @Usher in his new movie! #ManosdePiedra #HandsofStone https://t.co/tLP8558VHy Point. Cyrus. #TheVoice Own @singstreetmovie on Blu-ray, DVD, Digital HD, &amp; On Demand today: https://t.co/3VkieBXKMW Go to https://t.co/oohLYqh4Un and join us in making a change\nhttps://t.co/GtKkAGO3fP Behati and I are absolutely devastated and heartbroken by Christina Grimmie’s death. Our hearts go out to her family https://t.co/y4OMkm0uXu RT @NBCTheVoice: 30 MINUTES until #TheVoice of Season 10 is revealed. \n\nARE. YOU. READY?!?!?!?\n\n#VoiceFinale Vote for @LaithAlSaadi on #VoiceFinale on @AppleMusic https://t.co/wXkAEhBH0G https://t.co/jfwIErH5yy RT RT RT #VoiceSaveLaith #voicesavelaith #VoiceSaveLaith Vote for @LaithAlSaadi now for #VoiceSemiFinals https://t.co/UVtO01p3Jj\n#TeamAdam https://t.co/lJZCbd2MD6 Vote for @ShalyahFearing for the #VoiceSemiFinals https://t.co/K7orBqWIC0\n#TeamAdam https://t.co/8EzZtMs5KE .@conner4real If a genie gave me 3 wishes I’d say “make me as dope as conner4real” for all 3 wishes. #WouldTake10WishesToGetHalfAsDope .@conner4real We are the dynamic duo. You’re Batman. I’m your humblest Robin. #BestAtBeingHumbleSideKick .@Conner4Real Wondering if you want to join Maroon 5? #Maroon6 #SoHumbleCantMoveNeedDoctor911HumbleEmergency .@Conner4Real You’re the reason I get up in the morning. #SoHumbleMightBarf .@Conner4Real Wow, you killed it in rehearsal. #SoHumble Check it out- https://t.co/ua8XLV3COr https://t.co/TuOfbnPxmN Vote for the great @ShalyahFearing on tonights #VoiceTop9 @NBCTheVoice https://t.co/qVUnbE97U5 https://t.co/LPt7kZQTuv Vote for @LaithAlSaadi on the #VoiceTop9 @NBCTheVoice https://t.co/Y5opoYVn95 https://t.co/9ADXiZ3X67 Vote for @ShalyahFearing right now on @AppleMusic- https://t.co/2wFFZnEtLN #VoiceTop10 https://t.co/NMKemQkzJ6 Get on it and vote for @LaithAlSaadi on tonight's #VoiceTop10 on @AppleMusic- https://t.co/TsdQLEjM0Y https://t.co/TMQmHbvX22 RT @owendanoff: Please please RT this and everything else that says #VoiceSaveOwen to save me! As many RTs as you can RT in 5 minutes!! WE… RT @NBCTheVoice: Retweet to #VoiceSaveOwen #VoiceSaveOwen! RT's count! Vote for my boy @LaithAlSaadi now! #VoiceTop11 https://t.co/umO0MviFmV https://t.co/7bHcbfeDjg Vote for @owendanoff now now now! #VoiceTop11 https://t.co/g5sCHJCoIE https://t.co/egAhHUN6Dw Vote for @ShalyahFearing now #VoiceTop11 https://t.co/5mznuGGyLo https://t.co/MLjlzXGU58 RT @NBCTheVoice: Retweet to #VoiceSaveOwen #VoiceSaveOwen Last one from #TeamAdam. Vote for @ShalyahFearing right now! #VoiceTop12 https://t.co/VMJOCTiRBd Vote for @owendanoff now on @NBCTheVoice! #VoiceTop12 https://t.co/kpuBOG0X3p Vote for the amazing @LaithAlSaadi right now! #VoiceTop12! https://t.co/AZEIXn07L1 My bro &amp; Season 1 winner of @NBCTheVoice @Javstwtr has a new album- https://t.co/XhtjUNeB1W. And check him out live! https://t.co/kFFqvQyZJc Kobe. Legend. Thank you for 20 years of inspiration. #MAMBA Recorded a new song for the @SingStreetMovie soundtrack-love this film! Check out the video #GoNow #SingStreet https://t.co/0Q8ls0rpAy Be sure to tune into @etnow tonight for a sneak peek of what I have been working on…#SingStreet How are we already headed to the Live Shows? Excited to see what happens this season with my team. #VoiceKnockouts Awesome time on #CallawayLive w/ @CallawayGolf &amp; @HankHaney! Check it out TONIGHT at 6:00pm PT: https://t.co/CKK0RZ04T6 I feel like I win The Voice every night these days… #VoiceKnockouts Making these decisions is the worst ever. I should probably get liquored up before like @blakeshelton… #VoiceKnockouts These dudes are so incredible. Happy that a moment like this could happen on the show. #VoiceBattles Guys, @JordanSmithLive’s debut album Something Beautiful is finally here and it’s awesome! You gotta get it https://t.co/IXYzwgjbFu I'm not even mad @blakeshelton. I'm more mystified by your utter stupidity and incompetence. #VoiceBlinds https://t.co/RUzILcTsp0 Watch the trailer for my boy Conner4Real’s Popstar: Never Stop Never Stopping and follow @Conner4Real @Popstarmovie\nhttps://t.co/qzIrjH00k0 I Just woke up from a vivid dream in which Amy Schumer moved into my basement. She dialed in a sweet little pad down there. Anyway... Check out this assholes new single y'all! @blakeshelton https://t.co/dyuDgMxQh2 Check out this assholes new single y'all! @blakeshelton https://t.co/dyuDgMPr8A little known fact: Blake is actually an amazing tennis player. #VoiceBlinds I'm gonna DVR that moment so I can watch the hope drain from Blake’s face on repeat every day, for the rest of my life. #VoicePremiere Welcome to Team Adam, Mike! You have EXCELLENT taste in music. #VoicePremiere Pre-order @JordanSmithLive's new album on @applemusic! https://t.co/ydmaU3M1Gv https://t.co/iTPqDFykqC I feel like people have become more interested in showing people what they're doing than actually doing what they're doing. No more ironic flips of pop hits into sad ballads in 2016 please. Wow! Congrats to @JordanSmithLive on winning #TheVoice Season 9. #VoiceFinale 3 chances to VOTE for @JordansmithLive on @AppleMusic https://t.co/F2oaOskcc4 https://t.co/0HTL2Jl8J1 https://t.co/IjlGjoWRz6 #VoiceFinale .@JordanSmithLive @Applemusic https://t.co/0HTL2Jl8J1 https://t.co/IjlGjoWRz6 https://t.co/F2oaOskcc4 #VoiceFinale https://t.co/AEVDUlc501 RT @DollyParton: Well hello everybody! I thought I would kick this off with a bang, so I brought some friends to… https://t.co/Fxmwmb2Qzk #VoiceSaveJeffery VOTE for @shelbygailbrown  on @AppleMusic by getting her song here- https://t.co/TbOayVmz4O https://t.co/kXZaHMe5Zg VOTE for @Amyvachal on @Applemusic by getting her song here- https://t.co/1MU1yaZzlz #VoiceTop9 https://t.co/jRDtrVNmHv VOTE for @JordanSmithLive on @AppleMusic by getting his song here- https://t.co/yxDtd08W9o #VoiceTop9 https://t.co/IHFnLBH6XP VOTE for @JordanSmithLive now! Get his song on @AppleMusic here- https://t.co/BzDO9RJ0v5 #VoiceTop10 https://t.co/ZaR2oSF9TO VOTE for @Amyvachal now! Get her song on @AppleMusic here- https://t.co/EIAekEK82V  #VoiceTop10 https://t.co/gScySVSVsS VOTE for @shelbygailbrown now! Get her song on @AppleMusic here- https://t.co/YITp99Jjwq #VoiceTop10 https://t.co/KbtyXdF1WA Vote for @JordanSmithLive by getting his song on @Applemusic here- https://t.co/tpLIVLJthn #VoiceTop11 https://t.co/sp7B9ZU5U3 Let's vote for @Amyvachal by getting her song on @Applemusic  https://t.co/OC2hOIVW9d #VoiceTop11 https://t.co/RY5f22dIx1 VOTE for @shelbygailbrown by getting her song on @AppleMusic here- https://t.co/MFvTZ2nq1q #VoiceTop11 https://t.co/2cotHeExOz VOTE for @JordanSmithLive! Get his song on @AppleMusic https://t.co/zyLb6cMZae #VoiceTop12 https://t.co/kgy4aqgCRZ VOTE for @Amyvachal! Get her song on @Applemusic https://t.co/f0W1eKquoY #VoiceTop12 https://t.co/t3mwZjTP1Y VOTE for @shelbygailbrown! Get her song on @AppleMusic https://t.co/HnrSkeL3t0 #VoiceTop12 https://t.co/ttvjNhAbtM Yup, caught him on tape. @blakeshelton https://t.co/pP4H1fXju6 VOTE for @shelbygailbrown! Get her song on @AppleMusic - https://t.co/q2fa5yTwBU   #VoicePlayoffs https://t.co/hJTkBAi5Im VOTE for @keithsemple! Get his song on @AppleMusic - https://t.co/9hOZx2SQqu    #VoicePlayoffs https://t.co/2lwtBb37ta VOTE for @jordansmithlive! Get his song on @AppleMusic - https://t.co/jzUnTJpowf  #VoicePlayoffs https://t.co/QjshRYgtPv VOTE for @Chance_Pena! Get his song on @AppleMusic - https://t.co/R6WgOZUF9C #VoicePlayoffs https://t.co/xoMdL5CRQt VOTE for @blaine_mitchell Get his song on @AppleMusic - https://t.co/Q19YrPNtkH #VoicePlayoffs https://t.co/9BI6xRATDS VOTE for @amyvachal! Get her song on @AppleMusic - https://t.co/0HlJkBGn07  #VoicePlayoffs https://t.co/Ao9dhIHZBX North America! Catch #M5OnTheRoad in Sept and Oct with @ToveLo, @RCITY and @Phasesmusic.  Dates at https://t.co/JxETn14ka4 GENIUS. https://t.co/R64j970F2E Excuse me. Lex Luthor was bald. I have \"shaved\" my head. Meaning, shaved by choice. Big difference. Ok?!! Ok?!! I'm speechless. On Twitter, I guess I'm textless. I have no text for what I just saw. Whoah. #VoiceBattles Hey @blakeshelton remember that time when Shelby picked me and not you? That was awesome. #VoiceBlinds I see what you did there @blakeshelton. Clever. You're a really great guy with a quick wit. You should be proud. #farmersonly .@blakeshelton Please. Don't. Ever. Do that. Again. #VoiceBlinds Hey Blake...you feel that? That  was my city foot goin' straight up your country ass! Boooom! #VoicePremiere Good Job buddy. I really thought you had me there. Just kidding I knew you had literally no chance. #VoicePremiere I really admire Blake and his super unique sense of humor. Jokes about my voice being high...Super innovative... #VoicePremiere Have you heard my Blake impression? Goes like this..\"I'm a stupid idiot. I slow dance with sidewalks. I'm literally the dumbest moron alive\" Jordan!!!! Are you a unicorn? Did I just find a unicorn? #VoicePremiere I dropped a name. @gwenstefani picked it up and had a slumber party with it. Touché G. #VoicePremiere .@blakeshelton please take that hat off before somebody gets hurt. #VoicePremiere Check out our maniac friend @Physicalfix trying to do 10K burpies in 48 hrs! And donate to help kids with HIV/Aids! https://t.co/8qdiguhTUq Hey guys sorry we had to reschedule... See you Thursday! My best bud @MrGeneHong wrote the movie #BreakPoint and it's SO GOOD!!  Catch it on VOD or in select theaters TODAY! http://t.co/pIR34r59eE I'm five minutes into the #VMAs and I already need a shower. http://t.co/8IHc2Hh6bb Welcome @Rihanna to @NbcTheVoice as an Advisor for this season #VoiceRIHveal Ladies, go see #SOUTHPAW.  Don’t let the boxing fool you, I took my girl and she loved it! Wow! Thanks @MTV! Vote for #M5Sugar at the #VMAs here- http://t.co/0pz06IsS3i http://t.co/PTwAn8JZc3 yes folks...it's official. There's nothing this woman can't do. Check out @TheEllenShow 's new clothing line http://t.co/AOg0u2lNfn #LAtoLA http://t.co/1zMIYTSASt Just like that, @Alesso’s version of #ThisSummerM5 is up on @AppleMusic. Get it here- http://t.co/7G54MQNn9i I am so thankful to our fans, my band, and my family for helping me to achieve this monumental milestone; thank you so much @WOFstargirl! .@alesso did an awesome version of our #ThisSummerM5 song. Listen to it on @saturdayonline #saturdaynightonline http://t.co/1km4631FhW My buddies! Check it out! @PHASESmusic https://t.co/VrPGZUEoqV Smells like raw spirit http://t.co/19TO13VpWG My girl @RozziCrane dropped the #PsychoMusicVideo today on @Vevo! So happy for her. Watch it here- http://t.co/NLNcNOqnpN .@katperkinsmusic has a new tune out. Check it out! https://t.co/KYlzuvqKXF Here it is guys! Completely uncensored as it should be! #thissummerM5 on @Vevo!!! Watch it! http://t.co/mo2bEZ6g9w Oops... We dropped our new video...https://t.co/wLXh6yZr2i Feeling Better today. Saw The Doc. Resuming tour in Birmingham tomorrow! We’re Baaaack! Guys, I HATE having to let you down tonight. My chords are toast. We resume Sunday in Birmingham. Apologies. :( Not learning EVERY WORD of a song whilst preparing for lip sync battle is the weakest sauce imaginable. The only thing worse than being in LA traffic is commuting with Blake. #VoiceUnlock https://t.co/6bQt5IZ2p6 That's what happens when you carpool with an idiot. https://t.co/nz6YKMpoGw #VoiceCommute Get @joshuadavis77 songs 'Hallelujah' http://t.co/bEwLmPYj1k and 'The Workingman's Hymn' http://t.co/crkGB78dpD on @itunesmusic .@joshuadavis77 is up for the #VoiceFinale.  Dial 855-864-2303 OR Text 3 to 8642 http://t.co/UVMJZZ4bwc RT @NBCTheVoice: Voting is officially open now ONLY on #TheVoiceOfficialApp! http://t.co/u04Y1VZrt6 http://t.co/UXSfDQSQlE The charming, charismatic beauty on the right is my cousin. So so proud!\nhttp://t.co/xQOaZQRW6w #ThisSummerM5 is up on @itunesmusic http://t.co/xXoaYgseAF\nand lyric video is on @vevo http://t.co/KdIozAM1fq. Vote for #TeamAdam's @joshuadavis77 on @NBCTheVoice now! Call 855.864.2301 OR Text 1 to 8642 #VoiceTop5 http://t.co/5XGJarESIY Join us and make your #RedThumb promise http://t.co/fEVh8VMoPd http://t.co/fGy5ImPCgo Vote for @joshuadavis77! Dial 855.864.2302 or Text 2 to 8642. #VoiceTop6. http://t.co/aizt06AjBF RT @NBCTheVoice: RT if you have a “Desire” to vote for @joshuadavis77 all your life, but like mostly tonight. #VoiceTop6 http://t.co/xGT8yy… RT @NBCTheVoice: Give your fave artist a head start! Voting is open now ONLY on #TheVoiceOfficialApp! http://t.co/u04Y1VZrt6 http://t.co/tb… We lost a true great today. We love you Ben E. King. Thank you for the music. .@RozziCrane just performed “Psycho”! Show your love for this talented girl! Get the song! http://t.co/fyWep9lvrf #RozziOnTheVoice .@MattMcAndrew performed “Counting On Love”. Use #MattOnTheVoice and show your love! Get the song on @iTunesMusic http://t.co/lXq7J5o3sT RT @maroon5: WOW! What a performance. Get his single #CountingOnLove on @iTunesMusic here- http://t.co/DRu30jXvDl. #MattOnTheVoice Vote for @joshuadavis77 now! Text 2 to 8642 or dial 855-864-2302 http://t.co/snILaoskz6 RT to #VoiceSaveJoshua RT to #VoiceSaveDeanna Vote for @joshuadavis77 855-864-2302\nText 2 to 8642\nhttp://t.co/XHhVqJ7t5b http://t.co/doA690sh1R Vote for @DeAnnaJohnson23 \ndial 855-864-2306\nText 6 to 8642\nhttp://t.co/nREn65MMML http://t.co/yCr38Wjcr4 #VOTEMIRANDA at http://t.co/Vx20lyBYdb! @mirandalambert #ACMawards50 http://t.co/Ni3nqlqLfR RT now to #VoiceSaveDeanna !!!!! RT now to #VoiceSaveBrian !!!!! RT to #VoiceSaveDeanna !!!! RT to #VoiceSaveBrian !!!!! Lunar landing in Los Angeles - NIGHT 1 - DONE https://t.co/5WpXlaHgEl Every time I jump I wonder if maybe this time I'll actually fly. Never works. https://t.co/YWYmX3oyXT Close enough to look in my eyes, Tacoma! - 📷 @bootswallace https://t.co/gXdk1BC1T5 Met a sassy blonde in Saskatoon https://t.co/9naDk1wxqE LET THERE BE LIGHTS! https://t.co/VmrMayzzZy I’m so glad my team doesn’t have to deal with @blakeshelton as much as I do. I should get a medal for shielding them from contact with him. CHICAGO, CHICAGOING, CHICAGONE https://t.co/1bSvBN0d6I DETROIT. ROCK. CITY. https://t.co/VgqkXBpDpo Sweet moves @pharell, sweet sweet moves. Thank you for not karate chopping your way into that one. #verbalhashtags #iLoveyouP #FBF #MSG https://t.co/WH0L2G7XW3 Take me to your leader... https://t.co/sjpYRRdMsH Thanks, Boston - Tonight, The Garden. #NYC #MaroonVTour https://t.co/rNRDWtRZZp You can thank your wife for that one. You literally had nothing to do with it. It Was Always You - #MaroonVTour https://t.co/4U7LpNIh98 .@blakeshelton My mother is a saint. Leave her outta this. Super shocked about that one… #BlindsContinue Memories of Tampa https://t.co/PDgpwAFWZa SUNRISE, FL show me one problem pink balloons can't solve https://t.co/A2DOzxmvmZ I'd drop the mic, but instead ill just beat @blakeshelton over the head with it. #nightnight So cliche. Of course Blake has a special relationship with his cousins. REAL special. .@blakeshelton just got SERVED. how does that feel? ya like that cowgirl? much thanks to my side of the audience for...NO HELP AT ALL. #ihateyoublake #suckit @blakeshelton #dumbestpersonever #VoicePremiere .@blakeshelton Hey. Bigfoot. Make yourself useful and fix me a sandwich. .@blakeshelton You are literally stupid. Another victory for Geography #VoicePremiere Just left #OSCARS rehearsals. Not a big deal. Relax. #ATLANTA #MaroonVTour http://t.co/rP1MTee5F9 RT @EW: Exclusive: Watch @nbcTheVoice coaches perform 'Are You Gonna Go My Way': http://t.co/M76S1l36Vj http://t.co/LLwsG8DKc2 #HOUSTON #vibes #MaroonVTour 📷 @bootswallace http://t.co/mSzRAL8mrl #openingnight #dallas #spaceship #maroon5 http://t.co/Hw1S8nz5hP My girl @Rozzicrane released her debut EP on @iTunesmusic and it's incredible! Get it now- http://t.co/fyWep9lvrf\n#RozziCraneSpaceEP I'm pleased to announce that all of #Maroon5 will be \"@maroon5: performing alongside @adamlevine at the #Oscars2015.\" Check out my boy @luccadoes's new album on @itunesmusic here- http://t.co/M36yw9P40p So...I'll be singing at the #OSCARS!!! Whaaaat??!?!? Thank you @theAcademy! #LostStars Make sure you watch @blakeshelton tonight on @nbcsnl! Hopefully he won't suck! My new years resolution is to address and combat the hideous way people treat each other via social media. Please, be kinder to each other. RT @VoiceGlam: Our eyes are down here! Thank you Adam for our swag. #AdamLevineCollection #222 #ShopYourWay http://t.co/VeCutxLl2G Sup twits. I've decided to begin tweeting  things again. So I'll begin with just saying \"fuck shit ballz\" just to test the mic again. Be safe and put your phone down while driving. #NissanUsa #RedThumb http://t.co/qXIXw3afAD Damien's song link is http://t.co/G9VM7ynC8v Vote for Chris now!!!\n@iamchrisjamison\nText 4 to 8642\nhttp://t.co/A4vacY46iN\nhttp://t.co/qExHtIHGGR \n8558642304\nVote now!!! Vote vote vote!!! @mattmcandrew\nText 3 to 8642\nItunes: http://t.co/TmjXJicyLY\nAnd http://t.co/SfVrCpZZ1L\n8558542303\nDo it now!!! Vote now! @iamdamienmusic\n8558642301, text 1 to 8642 and buy his songs on iTunes at http://t.co/XL6uHzkZlO\n htt://itunes.com/asongforyou Vote for @iamdamienmusic!! Dial 855-864-2301 or TEXT 1 to 8642! Go!! #VoiceFinale #TeamAdam http://t.co/fAgrbMxZNZ Vote for @MattMcAndrew now!!! Dial 1-855-864-2303 OR Text 3 to 8642 #VoiceFinale #TeamAdam http://t.co/87eOnpIOlr Vote for @iamchrisjamison Dial 1-855-864-2304 OR Text 4 to 8642 #VoiceFinale #TeamAdam http://t.co/ypTocln2ag Vote for @iamdamienmusic! Vote! Vote! Vote! tonight!! Dial 855-864-2306 or TEXT 6 to 8642! #VoiceWildcard. http://t.co/aTisqLBC4T RT @NBCTheVoice: FYI: #VoiceWildcard voting is open now ONLY on #TheVoiceOfficialApp. http://t.co/fEPoWaQjiM RT @NBCTheVoice: RT if you want @iamdamienmusic to sing his heart out as a finalist next week. #VoiceTop5 http://t.co/a71Ew8GNiN RT @NBCTheVoice: RT if you’re all about sending @mattmcandrew to the #VoiceFinale with your votes TONIGHT! #VoiceTop5 http://t.co/LY5AxQ9CnT RT @NBCTheVoice: RT if you’re hoping that your votes will send @iamchrisjamison to the #VoiceFinale. #VoiceTop5 http://t.co/w1iB4xorHQ Vote for @MattMcAndrew now!!! Dial 1-855-864-2304 OR Text 4 to 8642 #VoiceTop5 http://t.co/9it3Knp7gX Vote for @iamdamienmusic!!! Dial 1-855-864-2301 OR Text 1 to 8642 #VoiceTop5 http://t.co/gE9dUh1o3a Vote for @iamchrisjamison! Dial 1-855-864-2305 OR Text 5 to 8642 #VoiceTop5 http://t.co/PrsjobMPYJ Do it again! RT to #VoiceSaveChris RT to #VoiceSaveChris Hey guys it's gonna be close so be prepared to vote for #voicesavechris Guys! Vote @iamchrisjamison into the top ten he's so close!!!! Dial 1855 864 2305 or text 5 to 8642 Vote for @MattMcAndrew now!!! Dial 1-855-864-2308 OR Text 8 to 8642 #VoiceTop8 http://t.co/h63hoyeOW1 Vote for @iamdamienmusic!!! Dial 1-855-864-2304 OR Text 4 to 8642 #VoiceTop8 http://t.co/nTBN8zKfuh Vote for @iamchrisjamison! Chris Jamison! Dial 1-855-864-2305 OR Text 5 to 8642 #VoiceTop8 http://t.co/DJbgSATIk3 RT @NBCTheVoice: RT if @mattmcandrew fixed you and you’re ready to give him all of your votes after tonight's episode. #VoiceTop10 http://t… RT @NBCTheVoice: Don’t cry. Dry your eye and RETWEET if you’re voting for @iamdamienmusic tonight. #VoiceTop10 http://t.co/XEdHoqjBIx RT @NBCTheVoice: RT if your ready to vote for @iamchrisjamison right now. #VoiceTop10 http://t.co/dW50IkPRXd Vote for @MattMcAndrew now!!! Dial 1-855-864-2301 OR Text 1 to 8642 http://t.co/kpQx2FOcfD Vote for @iamdamienmusic!!! Dial 1-855-864-2303 OR Text 3 to 8642 http://t.co/cnq91JICPt Vote for @iamchrisjamison! Chris Jamison! Dial 1-855-864-2310 OR Text 10 to 8642 http://t.co/HOG9EYz1t2 Best day ever! http://t.co/2AqCxEv3UH. @NissanUSA #VoiceOffTheStage http://t.co/1vH57biRwN I'm so proud of my boys on #TeamAdam. Vote now! http://t.co/2GTwmaxPTi Vote for @MattMcAndrew now! Dial 877-553-3709 or Text 9 to 8642 #VoiceTop12 http://t.co/9xXJT0oD9R Vote for @iamchrisjamison now! Dial (877) 553-3711 or Text 11 to 8642 #VoiceTop12 http://t.co/BQbO3sGDvi Vote for @iamdamienmusic!!! Dial (877) 553-3704 or Text 4 to 8642! #VoiceTop12 http://t.co/ijNoHd807S Vote for @iamdamienmusic now! Dial (877) 553-3704 or Text 4 to 8642! #VoiceTop12 http://t.co/e87XknzXsA Vote for @iamdamienmusic tonight!! Text 9 to 8642 or Dial (877) 553-3709 #VoicePlayoffs http://t.co/ikdXdcYzwf Vote for @miapfirrmann now! Text 8 to 8642 or Dial (877) 553 3708. #VoicePlayoffs http://t.co/PZj3hLr9ze Vote for @taylorphelan tonight. Text 7 to 8642 or Dial (877) 553-3707 #VoicePlayoffs http://t.co/I6lgDH0dua Vote for @MattMcAndrew tonight! Text 5 to 8642 or dial (877) 553-3705 #VoicePlayoffs http://t.co/ci27mYxSDQ Vote for @iamchrisjamison tonight! Text 2 to 8642 or dial (877) 553-3702 #VoicePlayoffs http://t.co/RHsc77kqvW Super tough decision, but happy to welcome Chris to the Live Shows. My team is beastly. .@blakeshelton Go ahead cowboy, make my day I can think of 62 other times you've been completely wrong @blakeshelton. You have no idea how happy @pharrell is right now… Check out the trailer for my bud's new film! http://t.co/cuV5OUM459 .@pharrell And I absolutely loved his work in \"Walk the Line\". Twice in one night @gwenstefani?? You're cold! I guess \"Stefani\" is not Italian for \"Blessing\". Sorry @gwenstefani, but thanks for keeping me on my toes. .@blakeshelton Settle down, Shelton. I don't appreciate the added pressure there @blakeshelton. Plus, you didn't tell me your 57th birthday was today. Happy birthday, man! How do I get rid of the commentator on the far end? He just doesn’t seem to serve a purpose on this show… How have there been zero steals yet tonight? This season is just too good. Yep… he still has no idea what that word means… Do we dare ask @blakeshelton if he still knows how to do that Algebra he claims to have learned? Even I was getting scared watching that intense battle… @blakeshelton are you okay, buddy? Man, did you see the determination in @pharrell's eyes? That was scary for a second. #WatchingBlinds Find out who I am tonight on @nbcsnl http://t.co/NAz5scsmZQ .@blakeshelton you're giving me anxiety There are certain things in life that I'm sure of, beating @blakeshelton is one of them… at anything, really. I'm pretty sure we would have lost @pharrell for the night if she didn't choose him. #BlindsContinue Well that was a no brainer… @blakeshelton is also a no-brainer. .@blakeshelton I've been trying to separate from you for years, buddy. … oh shut up @blakeshelton. Don't feel bad @gwenstefani. I call that the \"Blake Shelton Geographical Pull\" effect. It seems to work 92% of the time. I can't BELIEVE you @blakeshelton. Gloves are coming off, cowboy. Collusion! That is straight up collusion. @pharell @gwenstefani I'm sorry you have to deal with Blake @gwenstefani @pharrell. Now you know my pain… #VoicePremiere See us live!!! http://t.co/F5Sg1Kjtox #MaroonVTour Guys check out http://t.co/ITBy8klcdu @THVMatelier new collab with @BeePrinsloo it's the best, she's the best. get it http://t.co/ACN9XBF74v Me and my friends at @nbcthevoice will be on @TheEllenShow today!! Get our album on @itunesmusic! I sang really good on it. http://t.co/kqwzhiIMQu New album- http://t.co/izOnYjQUlr. New Tour- http://t.co/JxETn14ka4. #VDay #MaroonVTour #ANIMALS http://t.co/Jbh4Xa1D5g #V is number one on iTunes!!!!!!!!!!!! Thank you all!!!!!!! Ahhhhhhhh!!!!!! Also get a little preview here... http://t.co/T298NZRwJe Who hasn't pre ordered our album on iTunes yet? Do it do it do it!!! http://t.co/7cDAIKWMTc Just need to take a moment to thank @maroon5 fans for being the best fans on earth. Thanks for giving us the best jobs ever!!! RT @NBCTheVoice: The first of many showdowns with @blakeshelton @adamlevine @pharrell and @gwenstefani is right here! #TheVoice http://t.co… \"She's not wearing pants? Fuck it. I won't wear pants either.\" -every dressing room backstage at the VMA's Only thing missing from the VMA's this year? #pants @katperkinsmusic has released some music!!!! Check it out!!!! https://t.co/58k8hdc9vS To this day any time paradise city comes on I still have the same response. YES! Followed by a clenching and raising of the fist. Ladies and gents, it's official! @Maroon5 is performing at the 2014 MTV #VMAs! Can't wait for 8/24: http://t.co/kk4XsaIe6l Two things: new song on iTunes you get here http://t.co/7cDAIKFJRc secondly, album out in September but pre order it now @iTunesMusic!!! Check out @COLLECTION_LA !!!! Awesome stuff!!! If you share my love for golf, you have to register for @DriveChipPutt. Chance to play at …. @The_Masters!! http://t.co/YYv2fumaJz RT @heartrae4: @adamlevine thanks for you awesome clothing line 😘 RT @Camerons_Baee1: Got some of the @adamlevine collection :3 ♥♥ http://t.co/PiOXMRk7Zb Part of being a TRUE champion is not running away at the first sign of trouble. My man @CeeLoGreen’s new TV show #TheGOODLife on @tbsveryfunny has been hilarious! I definitely suggest you tune in Monday nights! Happy 4th. Party safe. Party hard. #BeginAgain is now playing in theaters EVERYWHERE! Tickets Tickets Tickets! http://t.co/LRWJuHs4Hk The #MapsVideo is now on @Vevo! Watch it here- http://t.co/dMpO11IO2V It's finally here!!! The lovely @Tessanne has a new album check it!!!! https://t.co/V4Al88rmqG RT @BethStern: Loving my new @adamlevine denim vest.  Thank you, Adam! http://t.co/QCaTKd6Csj Lyric video for #LostStars from the #BeginAgain soundtrack is debuting today! Watch it here- http://t.co/lRKUn0Nq1j Watch the #BeginAgain TV Spot http://t.co/WXoNibaSQb and trailer http://t.co/Rr2ObdwSAv and grab tickets http://t.co/1CwslusImU for NY &amp; LA Exciting!!!! http://t.co/FNl7s7b6WU My man @willchamplin's album is out now! Check it......http://t.co/Ku7LK8gcll This debate about the Washington Redskins shouldn't even be a debate. It's literally a derogatory term and should no longer be used. Period. Maps is already top ten on iTunes!!!! Woooooo hoooooooo!!!! Happy birthday Tupac. :) we love you. Guys!!!! Our first single from #V, #Maps, is out today!! Head to @itunesmusicand get your copy NOW!- http://t.co/6aNNnU94ox Sending thoughts and prayers to Tracy Morgan... And that's a make up call. That's walk. And no foul. The NBA officially has the worst refs in the world. This is a joke. Man Miami stop flopping. Yo.  Check out my friend Lisa Robinson's new book THERE GOES GRAVITY: A life in Rock and Roll!!!!!!! I always feel like every character Brian Cranston plays is secretly selling crystal meth. THAT'S how good he is. Ok Spurs. Get one more. Watch the brand new trailer for #BeginAgain on @ENews &amp; @WeinsteinFilms YT channel http://t.co/t7SR89P5GJ #LostStars Our new single #Maps is coming out June 16th! http://t.co/1ALnzyhvjj Please support @jamesbvalentine's lovely and talented sister http://t.co/9nr77PCo82 designerAmanda Instagram is like twitter with a shittier personality. I love it. Jack Black and Jack White should make a record together and call it \"black and white.\" RT @JamesPWolpert: I STRAIGHT UP NEED YOUR HELP, GUYS! https://t.co/IGyyoEr3jy Id like to congratulate @TheRealGrimmie on winning a record deal. Either as the winner of the Voice, or with me on my label! Vote for @therealGrimmie http://t.co/hod1wD67aq! http://t.co/JBje0L1ZNW Before you go to sleep don't forget to vote for @TheRealGrimmie because this girl needs to win!!!! @TheRealGrimmie don't you mean number 4? Ahhhhhhhh!!!!!!!! RT @kelly_clarkson: “@in9uyenatlife: @kelly_clarkson what do you think of @TheRealGrimmie ?! :)” She is stellar! RT @justinbieber: Just got the call from the big bro @adamlevine. I got u man. I started on YouTube and so did @TheRealGrimmie so... Vote vote vote!!! @TheRealGrimmie RT @selenagomez: Vote now for my girl @TheRealGrimmie to win The Voice!\nhttp://t.co/FSzLOxfxiH #GrimmieForTheWin Vote for @therealgrimmie here http://t.co/ta8bRfedeZ or here http://t.co/BwDXHzQy8D or by dialing 855-VOICE-01 http://t.co/cgmF5LmDOG @TheRealGrimmie people!!!! Believe!!!!! Just heard @TheRealGrimmie rehearse. WOW. RT @Lalex75: @TheRealGrimmie @adamlevine @NBCTheVoice 4 hours till the voice starts. SO EXCITED!!.  #GrimmieForTheWin RT @harperst12: In honor of the two day season finale of @NBCTheVoice wearing my team @adamlevine shirt! Hope @TheRealGrimmie wins !! http:… Everyone ready to vote ten times for @TheRealGrimmie tonight on the #VoiceFinale??? I am. I absolutely must become I racecar driver now. It just feels right. Just found out Patrick Dempsey IS a racecar driver. Awesome! Now the only thing that seems weird is the mattress commercial part. I'm pretty sure I just saw a mattress commercial starring Patrick Dempsey dressed like a racecar driver driving a Porsche. Twitter is doing this charming thing where it decides to follow people randomly. The machines have become self aware. RT @TheRealGrimmie: Team Grimmie crashes every kind of party in the best way. Check this out dudessss! http://t.co/QK2TlCuzqd @TheRealGrimmie and I have decided that we are going to win The Voice this season. Cool? #voicesave Kat!!!!!!! Retweets count! #voicesave Christina !!!! Retweets count!!!! #VoiceSaveKat do it!!! Go ! #VoiceSave Christina!!!!!! Retweets count! And how could we ever give up on our girl @katperkins ...#voicesave Kat to come as well!!!!! Looks like twitter may have to #voicesave Christina...get ready to move those fingers guys this girl can win if you help ! Donald Sterling has become America's  racist grampa. Ok so I look a little bit like a drug dealer. Vote for @therealgrimmie here http://t.co/zoLKCMCJN8 or here http://t.co/dzDJ1JosG7 or by dialing (855)-VOICE-05 http://t.co/O5kb40tszp Vote for @katperkinsmusic http://t.co/SOz5MiqWAD or here- http://t.co/I8jQCa281R or by dialing (855)-VOICE-03 http://t.co/K0kJdaa8ZE Anyone criticizing Michael Sam for kissing the person that he loves passionately on the most exciting day of his life are wrong. Period. The musical. Not the actual Book. If you don't like Book of Mormon I'm not sure we are going to get along. Do it now!!!! #VoiceSaveDelvin #VoiceSaveKat And for KAT! #VoiceSave KAT Still have time!!!! #voicesavekat #VoiceSaveDelvin Do it guys! #VoiceSave DELVIN Have you done it???? #voicesave @drchoice @katperkinsmusic DO IT!!!! Instant save!!! #voicesave @katperkinsmusic @drchoice do it do it do it!!!!!!!! #voicesave @katperkinsmusic @drchoice theydeserve it! Everyone send em through!!!!!!!!! Kat Perkins is so close to the top ten on iTunes!!!!! come on guys lets get her there!!!!!!!!! @TheRealGrimmie cracked the top ten AGAIN! Let's make sure we get @katperkinsmusic and @drchoice up there too!!! Vote people vote!!! Everyone! Vote for @TheRealGrimmie here- http://t.co/Id9Q7KHW7J or dialing (855)-VOICE-08 http://t.co/zyWekd4BM8 Vote for @katperkinsmusic here  http://t.co/zrTv5855LX or by dialing (855)-VOICE-03 http://t.co/L9tCS5oY0W Vote for @drchoice http://t.co/oJiwB9Jcoc or by dialing (855)-VOICE-05 I hope people understand that when they say my hair looks creepy i take that as the highest compliment. Apocalypse prep course complete. http://t.co/muvPDrIa59 Kareem's skyhook and Dirk's fadeaway jumper might be the hardest shots to defend in the history of basketball. My pompa-hawk just won't stop growing. http://t.co/GX87fvuN2b I can finally tell @gwenstefani that her twitter slogan should read \"I ain't no follow back guuuuuuuurl\" I can't wait til the word \"selfie\" goes away. #andhashtags Whenever Twitter recommends I follow people who are apparently \"just like me\" I start to realize I'm not as awesome as I thought I was. A cat after my own heart. http://t.co/iE11qO5moV Tweets on a plane. 3 hours of word vomit coming up... Bad lip reading is seriously the best thing in the world. Youtube that shit! And...one more time save @katperkinsmusic #VoiceSave Do it again! #VoiceSave @katperkinsmusic #voicesave @katperkinsmusic Come on!!!!!!!!!!!! Go go go!!!! #voicesave @katperkinsmusic @katperkinsmusic @katperkinsmusic @katperkinsmusic do it now!!!!!!!!! End of the next commercial break make sure you include #voicesave and the artists KAT's first name!!!! Get ready people! @katperkinsmusic @katperkinsmusic @katperkinsmusic @katperkinsmusic be on stand by and have your finger on the trigger!!!!! @katperkinsmusic deserves to be here guys save her now!!!! She's one of the best singers I've ever heard Welcome to the party @gwenstefani!!!!! Shits about to get real Vote people! @drchoice @katperkinsmusic @TheRealGrimmie Vote for @drchoice http://t.co/3hv5LiSZMM or DIAL 855-VOICE-08 Vote for @TheRealGrimmie http://t.co/x5VABbhvD5 or DIAL 855-VOICE-05 Vote for @katperkinsmusic http://t.co/0rMyLH3If8 or DIAL 855-VOICE-01 @TheRealGrimmie @drchoice @katperkinsmusic #TeamAdam .@blakeshelton your threats are so cute. I'm seriously amazed at @blakeshelton's stupidity… California is the greatest... I know a place where the Clippers can go that accepts all shapes, sizes, AND colors.... Especially purple and gold. #golakers I'm gonna start carrying a mic around just so I can drop it when I do something awesome. #STRONGBEACH http://t.co/kbOBKhWqAW @shakira Save #Teamshakira!!!! Come on guys we don't wanna see two of her artists leave! Go go go! Get ready to tweet! VOTE for @drchoice http://t.co/CZBk1T7xOz\nDIAL 877-5-KEEP-02 OR (877) 553-3702 http://t.co/AFmuq9zZM1 VOTE for @TheRealGrimmie http://t.co/3CQHsaWJoK\nDIAL 877-5-KEEP-06 OR (877) 553-3706 http://t.co/O2tiXfhvoo VOTE @katperkinsmusichttp://tw.itunes.com/PerkinsMM\nDIAL (877) 553-3709 http://t.co/umww20g8zN Vote for @katperkinsmusic http://t.co/gfpcQA5YAv\nDial 877-5-KEEP-09 OR (877) 553-3709 http://t.co/vmHPf1OqzJ Vote for @TheRealGrimmie http://t.co/j71rX3jqDs\nDial 877-5-KEEP-06 OR (877) 553-3706 http://t.co/mlbVpm9ePC Vote for @drchoice http://t.co/wSy54pp0Hg\nDial 877-5-KEEP-02 OR (877) 553-3702 http://t.co/ofD3WyJ01z .@katperkinsmusic  @drchoice @TheRealGrimmie hardest working team in show business- http://t.co/O05e90ZfN1 Vintage things are just better than new things. They feel better. They look better. They sound better. They taste better. They ARE better. RT @NBCTheVoice: It’s #FinalPlayoffs time! RETWEET if you’re watching with us, East Coast. http://t.co/n6TJ1nhncs http://t.co/jidluAh4gQ ok everyone. Clear the way. @christinagrimmie is in the building. Show stopping moment my dear! @morganwallen has the dirt in his pipes that singers dream for. Amazing voice brother! @katperkins that was absolutely flawless. I am truly blown away! @jakebarker's first live performance was in the blinds. What a long way you've come my friend! My man @delvin. Pure wow. Unearthly talent RT @NBCTheVoice: The #PlayoffsContinue now! RETWEET if you’re watching with us, East Coast! http://t.co/QyNosQMUjT http://t.co/G5RdV0U7UL Ok.  I mean this sincerely. The Golf Channel is actually more inspiring than Coachella right now. For real. Check it out! @luccadoes new album! http://t.co/smFSEYzNqm I feel out of place at coachella because I left my slutty jean shorts at home. Coachellallapaloozabonnarroo!!!!!!!! RT @NBCTheVoice: The #VoicePlayoffs start NOW! East Coast, RETWEET if you’re watching with us. http://t.co/ZUiHBa28OI http://t.co/SkogggUqwf GO OUTSIDE AND PLAY. LEAVE YOUR PHONE INSIDE. RT @NBCTheVoice: RETWEET if you’re watching the #FinalBattles with us NOW, East Coast! http://t.co/RBANlmXYvo http://t.co/74Ct2wrsGn RT @NBCTheVoice: .@adamlevine rocks an acoustic cover of Queen's \"A Crazy Little Thing Called Love\" @TheSayersClub. #TheVoiceatSayers http:… There is something about this Morgan Wallen. I'm gonna get to the bottom of it! Welcome to team Adam! I have no words. How do you expect me to formulate a sentence after that? #Delvin #Josh #blah As if the first round of Battles weren't hard enough… I don't want to choose. Everybody wins RT @NBCTheVoice: RETWEET if you’re watching the first-ever #BattlesRound2 with us NOW! http://t.co/YcwCETp2rL http://t.co/YorMjk9y3q @Pharrell Welcome to the circus dude! Actual smile. http://t.co/5hyJBdnJ2S https://t.co/XBkotBFBtI RT @NBCTheVoice: East Coast, it’s time for the final #VoiceBattles! RETWEET if you’re watching with us NOW! http://t.co/xYB1XDMCKf That was lovely. I can almost feel the sawdust beneath my feet. Me want \nbeer. #VoiceBattles What rhymes with oscillate? Honestly, I don't think anything. Sweet word choice @shakira #VoiceBattles RT @NBCTheVoice: East Coast RETWEET if you’re watching the #VoiceBattles with us NOW! http://t.co/356JEIFENY http://t.co/sPOfpu1uR0 RT @coldplay: Chris is to work with @adamlevine @blakeshelton @usher &amp; @shakira as a Key Adviser on this season's US #TheVoice. A http://t.… .@Shakira is prettier than all of us #BattlesBegin .@blakeshelton Don't hurt yourself. #stoptrying Check out new music from @willchamplin! http://t.co/6EQEas65C5 RT @NBCTheVoice: Adam Levine should follow me because I'll be watching @nbc when #BattlesBegin tonight at 8/7c! RT @NBCTheVoice: To be eligible, RT our last tweet by 10p ET/7p PT today! Winner chosen by pre-designated RTs. Must follow us &amp; live in U.S… Not creepy...Not creepy at all... http://t.co/X88cRQh1yd http://t.co/4OOslJRQP7 #YourMomCares Nice final addition to the team #DonutsForEveryone RT @NBCTheVoice: Time to meet the final members of our Season 6 family. RETWEET if you’re #WatchingBlinds now, East Coast! http://t.co/Iu9U… Welcome @iamjoshkaufman to #TeamAdam http://t.co/aBjeHdPF2D Welcome @joshmurleymusac and @austingellis to #TeamAdam Just to clarify @blakeshelton, that was definitely not a compliment Welcome @katperkinsmusic to #TeamAdam http://t.co/HGWba4howa RT @NBCTheVoice: Is your button ready? We’re #WatchingBlinds now, East Coast! RETWEET if you’re watching with us! http://t.co/2O3Rjah2Ym .@blakeshelton shut up drunky pants #BlindsContinue RT @NBCTheVoice: Season 6 starts now! RETWEET if you’re watching the #VoicePremiere! http://t.co/Ypb2l0kU7v http://t.co/FWDSXjkV0D RT @NBCTheVoice: The #BlindsContinue right this very second. RETWEET if you’re watching #TheVoice! http://t.co/8MO89H6Qqb Think about how many more incredible verses Billy Joel could write for 'We Didn't Start The Fire' today. Right? RT @NBCTheVoice: Sit back, relax and enjoy night 2 of #VoicePremiere week now! RT if you’re watching http://t.co/KMk64TNL28 http://t.co/U8r… .@shakira you're so cute when you swear. #VoicePremiere Wow… what an awesome #VoicePremiere. Only note: Not enough @blakeshelton Alright, last #VoiceFact: Each coach has scheduled time with @blakeshelton every day, so we can all learn from the Voice master May as well give up!! @blakeshelton has the best team… AGAIN #VoiceFact #VoiceTakeover Another #VoiceFact: @usher paid off @shakira for the Chair next to @blakeshelton... Said he wanted the victory to rub off on him... #VoiceFact: I made the producers put my trailer right next to @blakeshelton's so he'd be forced to hang out with me. Did ya'll see me roll on the floor after I won that?!?!?! I'm so crazy… but seriously, I'm crazy. #VoiceTakeover I actually have the audio recording of the Voice audience yelling \"ADAM\" and it plays on loop in my house 24/7 #VoiceFact Every time I lose an artist to another coach on The Voice, I pick up People Magazine to remind myself I'm sexier than they are. .@shakira is so right about the Flower Arrangements. Right this very second I'm stuck between lilies and daffodils… SO MANY CHOICES!! These sneak peaks really show off how ridiculous I am as a person… Everything that comes out of my mouth: Bullshit Bullshit Bullshit #VoiceFact So crazy. Every time I hear @blakeshelton talk on the show, I'm just amazed by his wisdom. I would choose him as my coach. Fun #VoiceFact: I actually have a crown from winning #4Chair turns. To show it off, I wear it around set. In only my undies ;) Should have given ya'll a heads up… this account is about to get weird. #itsBlake #onAdamsAccount #VoiceTakeover I hate being such a show off… guess that's what to expect from the sexiest man alive #sorrynotsorry #VoiceTakeover I like these intros. They remind people that @blakeshelton has won THREE times and is therefore the best coach #VoiceFact So crazy… @usher sings \"Love Somebody\" better than I do… #weird OMG You Guys!!! I can't wait to see myself on the voice tonight!!!! xoxoxoADAM #VoiceTakeover RT @NBCTheVoice: File this under “Best Thing Ever,” please. #VoiceTakeover http://t.co/cEmXCqR0h4 O.G. http://t.co/2GF0e7uxIX If you learn from a loss doesn't that make it a win? I say yes. So \"you can't win 'em all\" is bullshit. This is one of my best friends. Why? I have no idea. http://t.co/pqhyogpknq Reggae music. Party like a nerd at ComicCon AND raise money for charity at the same time! #iwantmynerdHQ Support my girl @MelanieLBBH !!!! Check out her new single! http://t.co/6vjlmnhhLN RT @BeePrinsloo: Please everyone watch this documentary. And maybe when you're thinking of ever going to #SEAWORLD or… http://t.co/49rZ2J55… Check this shit out. http://t.co/y6bZT5wOYM Seeking advice from an A&amp;R person about your music is kinda like asking a musician to help you with your taxes. Paris...Foooooooood....awesome..... The commercial for \"brain games\" didn't blow my mind. Not a good start. This guys vibe is STRONG to say the least. #england http://t.co/udeWxpO9o1 Thank you fans for voting @xtina @blakeshelton @CeeLoGreen @NBCTheVoice best reality on @peopleschoice awards! One of my New Years resolutions was to neglect my twitter account. It was going great until Jet Lag. When depicting ainchent times of any kind, please dirty up these actors gleaming white perfect teeth. It's ridiculous in this context. Check it!!!! https://t.co/8KqZKpgi4f Sadly, Santa put me on his naughty list because I'm Jewish and I should be celebrating Hanukkah. St. Nick keeps it real. I respect that. You can get up to 50% off select categories from my #AdamLevineCollection here- http://t.co/NkPmLAPqWq http://t.co/t1dqFSY2Aw Holidays are here! Shop my #AdamLevineCollection, up to 50% off select categories &amp; be good to go for the holidays. http://t.co/ZFH5WWkmtj Please support....http://t.co/P5Y9fkSZAe Everybody give a RT for @Tessanne for winning @NBCTheVoice! #TeamAdam #TessanneIsTheVoice RT @NBCTheVoice: Everybody tweet #TessanneIsTheVoice! RT @NBCTheVoice: We’re live! RETWEET if you’re watching the #VoiceFinale! http://t.co/lEd5mOIAJS Sorry to annoy you. But...have you voted for @Tessanne and @willchamplin  yet? #TeamAdam @NBCTheVoice Vote for @Tessanne and @willchamplin! Do it do it do it!!!! @Tessanne @willchamplin RT @iTunesMusic: .@NBCTheVoice 2-day finale starts tonight. Will it be @Tessanne @jacquieleemusic or @willchamplin? http://t.co/OBXhs0U3oZ Vote now for @Tessanne and @willchamplin http://t.co/6P22UOOTHo #TeamAdam #VoiceTop3 RT @NBCTheVoice: Retweet if you’re voting for @willchamplin! http://t.co/Ujej3qYjpt #VoiceTop3 http://t.co/3RuDuje5sh @Tessanne @willchamplin....I'm calling on you guys to vote for #teamadam @NBCTheVoice watch... Then VOTE!!!! RT @NBCTheVoice: Retweet if you’re voting for @Tessanne! http://t.co/Ujej3qYjpt #VoiceTop3 http://t.co/PJrCGSQ7Zg RT @NBCTheVoice: We’re LIVE on the first night of the #VoiceFinale! RETWEET if your’e watching the #VoiceTop3! http://t.co/2IkOW7JBXf Shop the #AdamLevineCollection for up to 40% off select categories + points for SYW members. Check it out here: http://t.co/zzqnooc0g6 California is where I call home. Now you can #GetCovered if you're a resident. So hurry! RT to enter to win the COMPLETE outfit from my recent #AdamLevineCollection Commercial http://t.co/QtoAEwe2mh https://t.co/4adWBA9Yz7 RT @NBCTheVoice: We have a #VoiceTop3! Congrats, @Tessanne @jacquieleemusic &amp; @willchamplin! #TheVoice RT @NBCTheVoice: Retweet if you’re watching #VoiceResults! http://t.co/2yHXPgB4Kz RT @ilujameswolpert: “@NBCTheVoice: Retweet if you’re voting for @JamesPWolpert! http://t.co/zhQxAdxuC4 #VoiceTop5 http://t.co/ZJNdJB4jg7” … RT @SierraEStopper: Did y'all notice that @JamesPWolpert 's face is the first you see on @NBCTheVoice 's voting page? :) Just voted 10 time… RT @Tessanne: Feels like I'm in a dream :) Thank you for making this such an amazing moment :) I am grateful to each and every single one o… DONT forget @JamesPWolpert. his version of with or without you is INCREDIBLE. let's get em ALL in the top ten!!!!!!!!!! @willchamplin about to crack the top ten at itunes which is HUGE!!!!!!! get him there guys!!!!!!!!! and if you voted...VOTE AGAIN!!!! @willchamplin @JamesPWolpert @Tessanne VOTE NOW!!!!!!!!!! @willchamplin @JamesPWolpert @Tessanne Vote now for @Tessanne @willchamplin @JamesPWolpert http://t.co/6P22UOOTHo #VoiceTop5 #TeamAdam RT @NBCTheVoice: Retweet if you’re voting for @Tessanne! http://t.co/Ujej3qYjpt #VoiceTop5 http://t.co/7QTpGS198w RT @NBCTheVoice: Retweet if you’re voting for @WillChamplin! http://t.co/Ujej3qYjpt #VoiceTop5 http://t.co/9d8E1p5VY5 RT @NBCTheVoice: Retweet if you’re voting for @JamesPWolpert! http://t.co/Ujej3qYjpt #VoiceTop5 http://t.co/dduRezvOoH RT @NBCTheVoice: We’re LIVE: RETWEET if you’re watching the #VoiceTop5! http://t.co/trNwBGInhO Vote for #TheVoice for Favorite #CompetitionShow at the #PeoplesChoice Awards. RT to vote or vote here http://t.co/HMsEKC67px!\" Ahhhhhhhhhh!!!!!! RT to save @JamesPWolpert now!! #VoiceSave James RT @NBCTheVoice: Retweet to #VoiceSave James Save @jamespwolpert NOW!!!!! Shit. Wrong twitter handle. @JamesPWolpert is the right one! Whoops!!! Save save save!!!!! Save @jameswolpert! I have a feeling he may be at the bottom this week. If he is....SAVE HIM! Ok twitter! I'm not sure what is going to happen but let's make sure we get ready to save #TeamAdam at ALL costs!!!! @NBCTheVoice RT @NBCTheVoice: We’re LIVE with the #VoiceResults! RETWEET if you’re watching: http://t.co/WTKJEpIDKB https://t.co/sFbAHsKr0T Just watched @MikeTyson's  'Undisputed Truth.' Amazing. You told your story with refreshing honesty, humility, humor, and heart. Thank you. Guys. I need you tonight. Vote for @jameswolpert! He was under the weather but he deserves to stay! Keep #TeamAdam together! Vote now for @Tessane @willchamplin and @jamespwolpert here- http://t.co/bQz8fVC2HO #VoiceTop6 Shop the #AdamLevineCollection for Cyber Monday: http://t.co/1k5eZ00LBk. Also check my commercial for @Kmart here- http://t.co/flWVUIa9a8 RT @NBCTheVoice: Retweet if you’re voting for @JamesPWolpert! http://t.co/Ujej3qYjpt #VoiceTop6 http://t.co/UvGYhLpInZ RT @NBCTheVoice: Retweet if you’re voting for @willchamplin! http://t.co/Ujej3qYjpt #VoiceTop6 http://t.co/5i2XwpHiCX RT @NBCTheVoice: Retweet if you’re voting for @Tessanne! http://t.co/Ujej3qYjpt #VoiceTop6 http://t.co/ujbZLOHXhu RT @NBCTheVoice: RETWEET if you’re watching the #VoiceTop6! Going live right now: http://t.co/vUMZLoZbyq Support @MelanieLBBH !!!!!! She's the greatest!!! http://t.co/tXd8D8rCMs RT @NBCTheVoice: We’re live! Performances by @elliegoulding @CeeLoGreen @GippGoodie &amp; the #VoiceResults. RETWEET if you’re watching: http:/… RT @NBCTheVoice: Retweet if you’re voting for @willchamplin! http://t.co/Ujej3qYjpt http://t.co/LfiYmXZk5K Get ready to vote people! @Tessanne @jameswolpert @willchamplin!!!! #nbcthevoice RT @NBCTheVoice: Retweet if you’re voting for @JamesPWolpert! http://t.co/Ujej3qYjpt #VoiceTop8 http://t.co/dAW2lsJUJi RT @NBCTheVoice: Retweet if you’re voting for @Tessanne! http://t.co/Ujej3qYjpt #VoiceTop8 http://t.co/CbT2uuHtVP RT @NBCTheVoice: We’re live! @RobinThicke is about to perform &amp; then the #VoiceTop8! RETWEET if you’re watching #TheVoice http://t.co/rrQJM… NB80's? A documentary about the best pro basketball of the 80s? Stop it. Greatest television program idea EVER. Check out this Behind-the-Scenes video from my #AdamLevineCollection commercial shoot! http://t.co/VWa1AHUqNr RT @JimmyKimmelLive: .@PeopleMag's #SexiestManAlive @AdamLevine will be officially accepting his award live on #Kimmel tonight! http://t.co… RT @peoplemag: #SexiestManAlive @AdamLevine is ready to go on @JimmyKimmelLive. Tune in to ABC tonight to see him on #Kimmel! http://t.co/c… RT @peoplemag: Here he is, your Sexiest Man Alive — ADAM LEVINE! http://t.co/kKT8nb2N6U  #SexiestManAlive RT @NBCTheVoice: We’re live! RETWEET if you’re watching the #VoiceResults! http://t.co/5tkN9BmiBq RT @NBCTheVoice: Retweet if you’re voting for @JamesPWolpert! http://t.co/Ujej3qYjpt #VoiceTop10 http://t.co/CEdsHcEjNQ So proud of my team! Unreal performances tonight guys!!!!!!!! RT @NBCTheVoice: Retweet if you’re voting for @willchamplin! http://t.co/Ujej3qYjpt #VoiceTop10 http://t.co/ze5Xyy4ipg RT @NBCTheVoice: Retweet if you’re voting for @Tessanne! http://t.co/Ujej3qYjpt #VoiceTop10 http://t.co/p7biYm1jgL RT @NBCTheVoice: We’re live with the #VoiceTop10! RETWEET if you’re watching: http://t.co/eTCPYlBxwD #tacos #GoLakers RT @NBCTheVoice: We’re live! RETWEET if you’re watching #VoiceResults: http://t.co/bHwDT3crXS Haha. I love how people just assume I'm talking about someone I'm not talking about. Love that. It's a big big world. Don't assume. I prefer talent over antics. Vote for @Tessanne @willchamplin @jameswolpert!!! http://t.co/tcyqfVBKUr #VoiceTop12 RT @NBCTheVoice: And we’re live! RETWEET if you’re watching the #VoiceTop12! http://t.co/xwFOsE80W4 RT @NBCTheVoice: Retweet if you’re watching #VoiceResults! Going live NOW! http://t.co/mxfoSMrbSg Check out my homegirl @SarahSimMusic new song!!!! Lovely as always! https://t.co/P450lPIAJW RT @RoseAstro: @adamlevine @OneRepublic said \"Just watched Will singing \"Secrets\" Hands down the best cover of it we have EVER heard! VOTE … RT @1SexyJamieLynn: What does @adamlevine look like peewee Herman tonight in the @NBCTheVoice Lol. VOTE NOW!!!!!!!!!!! @Tessanne @jameswolpert @MusicbyGrey @willchamplin @@PrestonPohl @MusicbyGrey @Tessanne @JamesPWolpert @willchamplin @PrestonPohl #teamadam #fuckyeah I'll be a guest on @FamilyGuyonFOX this Sunday at 9PM ET/PT on @FOXTV .@jayleno liked his #AdamLevineCollection shirt! Get the exclusive offer for my collection: http://t.co/ga5LDEISC1 http://t.co/7NjAzeTtGn Tacos. I'm literally jumping up and down like a twelve year old. What a beautiful statement game this is. #GoLakers Literally no foul. Bailout. #GoLakers My man Jordan Hill touches every ball under there! Love that shit! That's right baby! Let's Keep LA purple and gold! #Golakers #golakers RT @NBCTheVoice: Here we go! RETWEET if you're watching the #FinalKnockouts! http://t.co/ayzeCjLXRD Madden has been a video game for 25 years. I've been a fuckin' dork for THAT long. Stop it. Just stop it. http://t.co/Lybid511hu Meet me in LA tomorrow 10/24!  #AdamLevineCollection http://t.co/xvAAnkU7Sm Keeping it in the family...please check out my cousins AWESOME new store \"FOXHOLE\" 3318 sunset blvd..,go. Now! .@BarryBlack you're a pro, dude. We're going to miss you #FinalBattles I had no doubt Will would get stolen. Did you see how great that performance was? #BattlesContinue .@CeeLoGreen you're awesome I’ll be at the LA @Kmart this THURSDAY @ 5PM to check out my collection! First 100 fans who shop will get a pic w/ me http://t.co/prmPrYQF6x Dudes. Take off your fancy fedora indoors. If you're gonna dress old school you gotta act old school. Harsh. http://t.co/5Qt7b2ZauW Jeff Buckley's Lilac Wine is the most beautiful thing ever recorded... Shit is getting real. http://t.co/YoZBMkOy7V Shocked no one snatched up @DonnaAllenMusic. Talk about a timeless voice #BattlesPremiere I'm sad to see Nic go, but excited to see @blakeshelton grab him. They're a mismatch made in heaven. #BattlesPremiere A watched pot totally boils it just takes longer if you stare at it. That saying is dumb. My obsession with golf is growing exponentially by the second. I love this shit. http://t.co/3TsuRdRb1i Check out my girl @SarahSimMusic and her lovely new music! https://t.co/f95Fu2sZUG support support support!!!! RT @NBCTheVoice: Here we go! RETWEET if you're watching #BestofBlinds! http://t.co/xK9fnbUotq Welcome to #TeamAdam @MattCermanski and @MusicbyGrey I don’t know what’s worse: Blake’s dance moves or…Blake’s dance moves. #WatchingBlinds .@blakeshelton Correction: I paid someone to remove your chair completely. I don’t know what happened here RT @NBCTheVoice: Here we go! RETWEET if you're #WatchingBlinds! http://t.co/j8uE5Jr1z5 My collection is finally here!!  http://t.co/ROCPrxGPeh #AdamLevineCollection http://t.co/GtwWivhTxI Welcome to #TeamAdam @AshleyDuBose!!! #BlindsContinue @blakeshelton Sorry guys, I've mastered the art of the 4 Chair. Welcome to #TeamAdam @jameskirwinstl!!! #BlindsContinue Redemption is a beautiful thing. Congrats, James! Is that another four chair for me? #lostcount #BlindsContinue Welcome to #TeamAdam @willchamplin!!! #BlindsContinue RT @NBCTheVoice: Here we go, #BlindsContinue right now on The Voice! RETWEET if you're watching with us! http://t.co/ZAOuJtIa9I Welcome to #TeamAdam Justin Blake and @PrestonPohl I’m sorry @CeeLoGreen – I really wanted Preston. You know I love you. #VoiceBlinds @blakeshelton you just sit at home and laugh at your own tweets, don't you? RT @NBCTheVoice: Week 2 of #VoiceBlinds begins now! RETWEET if you're watching with us!  http://t.co/gKijMkqwwv I'm so sorry we had to cancel tonight guys. We will make it up to you. We had to take safety into account. We hope you understand. :( The old Beatles movies were so awesome. This is happening.... http://t.co/iyu7yUnMSY Swing for the fences? No. Swing for the parking lot. @stephaniej1414 you're the one with a snowman as your icon. Very adult...dude. @stephaniej1414 grow DOWN. Kids! Trade in your retainers for guitars! Just keep em clean and lookin mean! The thing about idiots is that they don't know they're idiots. Which is why it's so easy for me to sleep at night. Sup with all these perfectly straight chompers people get now? Crooked teeth are sexy as F. The calendar on the new iPhone software is NOT amazing. RT @BeePrinsloo: So excited about my collaboration with @stylepupa I had so much fun designing. Thanks guys. #deepsea http://t.co/FFksWUk3iT Emu? Really? @blakeshelton .@blakeshelton you got SERVED son! #VoiceReunited while we're at it we should call the grammar police. by the way,  im NOT an artist. i sing in a band and i make music with my friends. Methinks thou dost protest too much...yikes!!! Welcome to #TeamAdam @DonnaAllenMusic @MrNicHawk @JamesPWolpert!!! #TheVoiceisBack RIDDLE: What’s tall, hairy, and due for a loss? #TheVoiceisBack @blakeshelton well if I'm a dreamboat, then you're a nightmare boat. You should have Kat teach you how to high kick @CeeLoGreen Seriously @xtina @CeeLoGreen it's time to take @blakeshelton down. He's due for a loss. It's getting old. Paul McCartney. Fuck YES! I unabashedly love writing and performing pop music for both myself AND everyone around me. That's It. It doesn't need any extra sauce. Ugh..recycling old art for a younger generation doesn't make you an artist. It makes you an art teacher. I am FEELING this new Pope. I'm not ok with the fact that they never brought Officer Powell back for ANY of the other Die Hards...they had undeniable chemistry. RT @bethany_stout: Me right after @adamlevine gave me his guitar! Definitely one of the happiest moments of my life ❤ #hondacivictour http:… #shirtlessjames New school Star Trek is better than new school Star Wars. However, old school Star Wars destroys old school Star Trek. Say that 3 times fast New Star Trek is cool. #stillnerdy I'm obviously a t-shirt person. Are you? http://t.co/88cl1Avvxt #AdamLevineCollection Hey guys. Please support the remarkable work of @charitywater.  http://t.co/oXU7LZrcp9 Thanks @millionseconds app for my new obsession. @RyanSeacrest Good luck and check it out Mondays at 8/7c on @NBC http://t.co/oHJ7uMHpt8 I just saw a movie review on rotten tomatoes that only 2 percent of critics liked. Holy shit that movie must suck. RT @zachbraff: George Zimmerman was probably just trying to get his sports memorabilia back. Already see myself locked in a room playing the new Grand Theft Auto for days on end. Showers optional. @blakeshelton well at least I don't have my belly button pierced. Oops! It's true everyone. Blake has a belly ring. If @blakeshelton had wound up being vaguely athletic, he mighta looked exactly like this dude. http://t.co/WMDWUa4Mxh Watch the coaches of Season 5 of @NBCTheVoice reuniting. Show returns September 23 at 8/7c on @NBC http://t.co/POd1Obswqu Just found out that my iPhone gives flood warnings. They chose a particularly terrifying sound that causes panic and stress. Thanks Apple. Go get #AgeAgainstTheMachine from my  compatriots @CeeLoGreen &amp; @GoodieMobMusic http://t.co/897BlhJr17  #nowplaying The VMA's seriously used to be so awesome. I heard terrible news that 93.5 KDAY is being replaced by talk radio. Say it ain't so!!!! Come on Los Angeles! Save KDAY!!! Pure sex. http://t.co/fxNq6C6OuX Breaking Bad starts up again tonight at the same time we go on stage at Jones Beach. If you're in the crowd, don't yell out what happens. I don't tweet unless I have something to say. So, this tweet is a rare exception. Hey man. Big fan. http://t.co/InNkt5l4lq RT @rickyrozay: #RT My acting debut @magiccity_starz Episode airs 9pm Friday! #Bossup #MagicCity http://t.co/MTaJR1Xnud http://t.co/40QE8F5ezC Abrupt, ill advised style makeovers and wearing a costume are for sure the same thing. Love is my religion. How long has Pat Sajak been 49 years old? RT @maroon5: @luccadoes new EP on 222 Records is up for pre order @itunesmusic - http://t.co/sEuvUpybV6. Check out the vid here: http://t.c… @AndyRichter hey man thanks! Season 5 of @NBCTheVoice is shaping up quite nicely. So much talent it's kinda unbelievable. Craaaaaazy!!!!!!! Hey twitter! How was your spring break! This summer, bring hope to those who need it! Join me &amp; help @cityofhope fight cancer. Donate now http://t.co/F2mNN5LG8O #SUMMEROFHOPE Id rather be loud and misunderstood than quiet and bored. So proud of @ambercarrington. It's as simple as that. Great to see @luccadoes perform his first #222Records single #nevergonnaletyougo tonight on #thevoice - http://t.co/QyV6tYzrDR #Top5Results Check out the YOLO song with @thelonelyisland guys. Get 'The Wack Album' at @iTunesMusic : Audio Only Version: http://t.co/gTcg90NXJc Thanks so much to e everyone who helped make it happen!!! We did it! @ambercarrington cracked the top ten at iTunes!!!! Ahhhhhhh!!!!!! If you all voted for @ambercarrington or purchased her song on iTunes. Thank you! Now go do it ten more times please!!! @ambercarrington so close to breaking the top ten! Vote vote vote!!! Ahhhhhhhhh!!!! Hey Guys! Vote for @ambercarrington! She sang a @maroon5 song better than I can. So proud! Vote!!!!!!!!!! #teamadam unite!!!! Vote for @ambercarrington on @NBCTheVoice . Dial 1-855-VOICE-05. Download #Sad or #Firework on @iTunesMusic here- http://t.co/c4Qnq4uMRb Everyone was great tonight. But @ambercarrington did it with the understated ease and grace that I prefer. Vote for amber! @NBCTheVoice Couldn't be prouder of @ambercarrington. Wow. Wow. Vote for @ambercarrington because she is the SHIT! Do it!!!! Her performance is coming up!!!!!!! RT @Usher: Retweet if wanna get #Twisted? I'm bringing it #VoiceTwisted with a special performance tonight! http://t.co/dD1NQmZSZ5 You should have to apply for poetic license. Vote for @ambercarrington on @NBCTheVoice dial 1-855-VOICE-06. Buy #IRememberYou or #Crazy on @iTunesMusic http://t.co/c4Qnq4uMRb #VoiceTop6 @ambercarrington folks. That's all I should need to say. @ambercarrington. @NBCTheVoice... I love this Pacer team. They play basketball they way it was intended to be played. Like a TEAM! I'm starting to have trouble differentiating between the Dos Equis guy and the Men's Warehouse guy. Similar vibe. I prefer it when my iPhone screen is cracked. It looks more soulful that way. Help @BlakeShelton tonight! Tune-in to Healing in the Heartland. Head here http://t.co/4ZmYNDO7Nl and donate whatever you can. #HealOk mis·un·der·stand \nPronunciation: \\(ˌ)mi-ˌsən-dər-ˈstand\\\nDate: 13th century\n1 : to fail to understand 2 : to interpret incorrectly light·heart·ed \nFunction: adjective\n1 : free from care, anxiety, or seriousness : happy-go-lucky 2 : cheerfully optimistic hu·mor·less   (hymr-ls)\nadj.\n1. Lacking a sense of humor.\n2. Said or done without humor joke-\nnoun\n1. something said or done to provoke laughter or cause amusement, as a witticism, a short and amusing anecdote, or prankish act To vote for @Judith_Hill, dial 1855-VOICE-01. @SarahSimMusic, dial 1855-VOICE-05. @ambercarrington, dial 1-855-VOICE-08 #VoiceTop8 #TheVoice RT @maroon5: To vote for @Judith_Hill, dial 1855-VOICE-01. Download #thatPOWER on @iTunesMusic http://t.co/aaQ9kuOdjB #VoiceTop8 #TheVoice RT @maroon5: To vote for @SarahSimMusic, dial 1855-VOICE-05. Download #SomebodyThatIUsedToKnow on @iTunesMusic http://t.co/aaQ9kuOdjB  #Voi… RT @maroon5: To vote for @ambercarrington, dial 1-855-VOICE-08. Download #Skyfall on @iTunesMusic http://t.co/aaQ9kuOdjB #VoiceTop8 RT @NBCTheVoice: Look at young @AdamLevine strumming away. #VoiceFamilyAlbum #TeamAdam #VoiceTop8 http://t.co/wldpx992mZ Experiment Rhino. Sat down with @Oprah on the set of #TheVoice this week for #NextChapter on @OWNTV. Check it out on June 2! http://t.co/l5r44vOmQP The tag line for the new superman should be \"let's try this ooooooonnnne moooooooooore tiiiiiiimmmmmme!!!\" Go download @ambercarrington @Judith_Hill and @SarahSimMusic's songs on @iTunesMusic now!!! Now!! http://t.co/c4Qnq4uMRb #VoiceTop10 RT @blakeshelton: Love the new single from @maroon5 and @adamlevine. Always a great performance gentlemen http://t.co/ROrskAzoa8 #LoveSomeb… RT @Usher: Great performance from @adamlevine and @maroon5! http://t.co/qTgEE2xUyO #LoveSomebody Tonight @robinthicke @Pharrell &amp; @Tip are performing #BlurredLines together! Plus @HillaryScottLA and @ladyantebellum #TheVoice @SaraBareilles no. I don't like @blakeshelton Myself + @Usher performing AND other amazing performances now when #TheVoiceIsLive !! RT @Usher: Rehearsing with @adamlevine  for something special tonight #TheVoiceIsLive http://t.co/11OIaCL5AK I'm over social media. It's boring when people know too much. I'm gonna do my best to make this twitter account as corporate as possible. A message to all former laker fans who abandoned us for the clippers. The answer is NO. We will not take you back. #golakers New Orleans...jazz fest...rain...can you dig? introducing the lovely ladies!!! @ambercarrington @CarolineGlaser @judith_hill @SarahSimMusic #Knockouts http://t.co/2Di4GqhNXC @blakeshelton @Usher @shakira @CarsonDaly @CMilianOfficial Awww buddy. Feeling is mutual. Love you crazy kids! And yes, you too cowboy #puke It's kinda dope to have an earring if you're old. It's so cool to see artists connect through this show. #duncan &amp; #sarah were awesome tonight. #Battles #TheVoice I feel like my #Battles keep getting better. #midas #patrick #awesomedudes Tonight’s another round of some sweet #Battles on #TheVoice, #stealsaremyfavoritepart We need offense. The Spurs have got to be the least intimidating team in NBA history. We got this. #4thquarter It must be nice to be Tim Duncan. Refs never call anything against you. I'm counting two extra fouls and a blatant T. What? #golakers I love me a country battle! #michael, you were awesome. Rough to see you go #Battles #TheVoice RT @NBCTheVoice: Tweet using #VoiceBattlesTonight NOW for a chance to get a follow from @AdamLevine! Sending love to Everyone in Boston. #golakers Anytime anyone ever says \"personal brand\" in my presence my hand just reaches out and smacks them in the face. Weird. I wish we would stop telling our kids theyre good at everything and allow them to fail sometimes. Come on @lakers. RT @yamahaentertain: new video from @PJMORTON! http://t.co/JKBUAH5onE Fancy cars and not fancy cars are starting to look the same. That's a huge win for not fancy cars. Hey guys. My best buddy @mrgenehong wrote tonight's episdode of Community. 8pm. There are gonna be puppets. Who can resist puppets? Not me. Welcome to #TeamAdam @ambercarrington #TheVoice !!!!! \"@blakeshelton: AM I YELLING RIGHT NOW?? I CAN’T TELL… TOO EXCITED. #Bluntry #TheVoice\" Yes. Please stop. Welcome to #TeamAdam @AmyLynnWhitcomb #TheVoice !!!!! .@blakeshelton's Spanish is only marginally better than his English. #ImWatchingTheVoice Welcome to #TeamAdam @sashaallenmusic #TheVoice !!!!! ouch. That's gotta sting a little. @UsherRaymondIV @shakira @blakeshelton #TheVoice #4Chairz #TRU Welcome to #TeamAdam @MAustinCountry #TheVoice !!!!! .@blakeshelton is a #TFI. (Total f***in idiot) but that just makes me love him even more. #ImWatchingTheVoice @UsherRaymondIV @blakeshelton Probably Blake's atrocious dance moves so excited for the #HondaCivicTour w/ @Kelly_Clarkson this summer! Tickets are on sale today !!! http://t.co/dg2dnK1YPr “@blakeshelton: Wait, does this make me a parent? #VoiceAdoption #BlindAuditions @adamlevine can’t compete with that dedication” nope. Welcome to #TeamAdam @patrickdodd77 #BlindAuditions !!!!! Welcome to #TeamAdam @aginamusic #BlindAuditions !!!!! Oh damn @blakeshelton – I’ve never seen you shut down so hard! #HA #BlindAuditions Welcome to #TeamAdam @wsmusicsc #TheVoice !!!!! Boom. Told you. @ blakeshelton #BlindAuditions Damnit! @blakeshelton you may have won this one, but I’m coming for you. #BlindAuditions Welcome to #TeamAdam @DuncanKamakana #TheVoice !!!!! Welcome to #TeamAdam @karinaiglesias_  #TheVoice !!!!! in my defense, @shakira did tell me that cállate means I love you. @blakeshelton I wonder how I can still be friends with you after that joke. Hey @blakeshelton, you ready for tonight? http://t.co/Yo9xgnlXOV #TeamAdam @kellyoxford if I ever read a book I've decided yours will definitely be my first. Welcome to #TeamAdam @SarahSimMusic #VoicePremiere !!!!! They call me \"cap'n four chair turn.\"  Actually, I call myself that. No one has ever called me that. #VoicePremiere Welcome to #TeamAdam @midaswhale #VoicePremiere !!!! Anyone who is serious about singing: this guy changed my life. Check out his app. It's called VOIXTEK. People! send me your inspiration for a chance to get a video message, front row tickets and meet the band. Go to http://t.co/YdjTqSzXbc I know it's too early to call it...but I'm calling it. #TEAMADAM wins. Welcome to #TeamAdam @judith_hill #VoicePremiere !!!!! @blakeshelton #hater #VoicePremiere #BieberCard #VoicePremiere I commend you @UsherRaymondIV - you know how to play it Wow. I'm not sure what just happened. But I like it? #twins #VoicePremiere @shakira Oh you think you’re so cute, don't you? Seriously though… #TEAMADAM #VoicePremiere @blakeshelton @UsherRaymondIV  @shakira @NBCTheVoice HA busy drinking! This coming from Blake “I don’t stop tweeting” Shelton… @shakira @blakeshelton @UsherRaymondIV @NBCTheVoice Coming out the gate with guns blazing like that… Newbie’s got jokes! Clarification: I was referring to taking an Epsom salt bath.  Not ingesting it. Please do not do that. I love you epsom salt. You make my muscles and bones feel good. Yeah. Because all I ever wonder is \"why haven't they made a cool ranch Dorito taco? Keeps me up most nights. RT @NBCTheVoice: Exclusive: @AdamLevine dishes on new #TheVoice coaches (VIDEO): http://t.co/a2QVZAkZ1N via @examinercom #TeamAdam The Internet can be a vicious, nasty, manipulative place. I urge certain people to attempt using it for some kind of good. #bottomfeeders ARE YOU READY #TEAMADAM RT @NBCthevoice 10 days until #TheVoiceMarch25! http://t.co/Qn6RsydTBu Listening to the lakers beat the pacers in the car on my way to play Staples! Booyah! Ill keep it warm for you fellas. #golakers Staples Center tonight. Home sweet home! #golakers I just realized that my taste in interior decoration is based solely on Marcellus Wallace's apartment. #PULPFICTION The Matrix is so incredibly badass. I'm totally a red pill kinda guy. Why do we idolize celebrities? If you guys knew how lame most of them were you'd be amazed. Myself included. So lame. If you tell Someone that you think they are cocky, they will totally agree with you. our dear friend's first restaurant opens tonight in LA! Eat there! Before it becomes impossible to get a reservation. http://t.co/0y1Gnk0w8J Whoever is singing this song is heavily influenced by Nick Drake. In fact, \"heavily influenced by\" is a kind way to say it. RT @LeoDiCaprio: Thx to all 1.4 Million of you that called on #Thailand to end the #ivory trade @World_Wildlife &amp; @Avaaz  http://t.c ... Tower Heist. The movie that we have never started, never finished, usually started watching in the middle, and NEVER known what was going on I'm turning 34 this month. What the fuck is that all about? Damn Nebraska! You made us feel incredible tonight! We are so blown away! #overexposednorthamericantour I prefer even surfaces with good traction over slippery slopes. This Sunday, tune in to @History at 8/7c for the premiere of @bibleseries - produced by my friends @MarkBurnettTV &amp; @RealRomaDowney! RT @LeoDiCaprio: .@Avaaz has joined us in the fight to save #elephants! Pls sign to ban the bloody #ivory trade in #Thailand: http://t.c ... RT @LeoDiCaprio: #Thailand considering ban on ivory trade. Let's push for a win at UN #CITES meeting now! Sign &amp; RT: http://t.co/x0c ... I'm pretty sure it's gonna be way too hot this summer for Justin and Jay Z to wear suits and ties. That's more of an indoor thing. Ok Kansas City. Lets give this another shot. I'm ready!!! Feeling so much better. Thank you all for your well wishes. I won't let ya down!!! This \"nothing beats an astronaut\" campaign is ridiculous. Ninjas. Ninjas beat astronauts. No contest. Just ask... i dunno...ANYONE? Have I mentioned how much I dislike not being able to talk? This is bullshit. I want blueberry pancakes with tons of butter and maple syrup. And I want them NOW. On vocal rest for the next 24 hours.  This means a lot of tweets. I apologize in advance. My apologies to our fans in Grand Rapids tonight. First case of laryngitis. I HATE not being 100% for you. But we still had fun! #THANKYOU 4PM EST http://t.co/PGbMmjxKIq Technically speaking, less isn't ACTUALLY  more. Thank you Dr. Buss for putting together  some of the most soulful and exciting basketball the world will ever see. We're gonna miss you. Ok MSG...lets dance. These screens are huge. Better do a solid \"boog check\" before I hit that stage. http://t.co/GBe1xvcJ Ahhh NYC...it's just like Los Angeles. Except totally different in every single possible way. It seems like life's most poetic moments never occur when you want them to. I guess that's part of what makes them poetic. Thank you Detroit!!!!! Just turned on the game and the refs have clipper jerseys on again. If twitter is word vomit, then Instagram must be....picture vomit? 90's guitarist vibes. http://t.co/waRC3dEz EPIC. http://t.co/wxyv841K Ok Instagram. Here we go. This is me pretending to be smart. http://t.co/wmUKPrGo What an INCREDIBLE way to start the #overexposedUStour! Can't sleep. Still buzzing with excitement. Thanks to all who showed up tonight! Some special surprises on this tour. And MAYBE one of them is a guest appearance from @rozzicrane? Maybe? Ok kids! The Circus is back in town! First stop...Columbus, Ohio!!! You ready? #overexposedUStour I can't remember The last time there were so many BANDS in the top ten at iTunes. So refreshing! Hooray for BANDS! RT @jamesbvalentine: Thanks #Grammys that was really fun... Extremely excited for the @TheGRAMMYs tonight! Performance is going to be EPIC. And I kinda really wanna win one. Ok? Just one will be fine. Drones...they just don't feel right... mostly because of Terrminator 2. 2 facts about my fragrance 1 men wont smell like a bad 80s movie 2 women wont smell like a stripper (not that theres anything wrong w/ that) Woke up this morning and put on Catch a Fire...THEN i realized it was Bob Marley's birthday. Happy birthday Mr. Marley. I love the Daily Show. I just love it. A lot. Like, a lot a lot. proud to release my fragrance. its like other celebrity fragrances but tastefully done &amp; actually smells good. get it at @macys or something Guys! Please support the bija project http://t.co/JfELf6JQ. I've signed a mat you can bid on to support this non profit program for kids. RT @sutterink: If you decorate your motorcycle helmet with mohawks, spikes or horns, you're a douchebag. @blakeshelton miss you dickhead. Stop yelling at me twitter. Optimism and delusion are two TOTALLY different things. @SarahKSilverman they were a big influence on the Beatles. Loving the way the @lakers are playing. Defense. Unselfish offense. Lets go! @ellisgreg says \"golf is like sex...put it in the hole, and let it come naturally\" RT @thelonelyisland: The music video for \"YOLO (ft. @adamlevine &amp; @kendricklamar)\"is up on YouTube! http://t.co/9w7piSmD #SNL You're going to want to watch #SNL tonight! Here we go... I dont think you should pay for a palm reading if they don't get any shit right. RT @samfarrar: I got a sneak peak of the stage for the M5 tour yesterday. Wow. You guys are going to lose your minds. Come on Lakers lets beat these guys tonight. @MrGeneHong we need to talk about that. There's something you should know. BE an artist. Don't claim to be one. It just never sounds good. \"I'm an artist.\" #puke Once again, thank you to \"the people\" for choosing Our band as your favorite two years in a row! GOLF. @NICKIMINAJ OHHH YEEEEAAAHHHH!!!!! :) http://t.co/y4eOXT5q RT @NICKIMINAJ: oh yea? @adamlevine&gt; RT @NickiMNewspaper\nNicki Minaj &amp; Adam Levine launch huge new retail lines http://t.co/NdWtt ... Ladies and gents, I will be making my hosting debut on #SNL saturday january 26th with kick ass musical guest @kendricklamar!!! New Years resolution: be more awesome. When someone tells me \"grow up\" I always answer with, \"why?\" The Lakers are getting dangerous again. We needed a full scale blowout. I love it! #GOLAKERS Wow. At least let The game start before you start calling it against The Lakers. I'm scared of the refs, not the Knicks. #GOLAKERS These refs are a joke today Merry Xmas everyone! Sending love to everyone via the twitterwebcyberverse The Lakers have arrived. Better late than never! #GOLAKERS End of the world my ass. I love this show. @NBCTheVoice. So fuckin much. Sometimes I just simply wonder why certain things have to happen. http://t.co/1djzCPzP Me and my identical twin brother played dreidel last night at Chelsea Lately http://t.co/DZnodHqN The only thing cooler than not liking \"cool music\" is not even knowing what \"cool music\" is. The video for #DAYLIGHT is finally out! So proud of this. We have the greatest fans on planet earth. Check it out!!!! our US tour is gonna be ridiculous. Don't even come because I don't think you'll be able to handle it. #justkiddingtotallycomeplease The success of this new \"Paleo Diet\" has got to have something to do with the fact that men love any excuse to behave like cavemen. Most under appreciated part of Lebowski is that Walter was right about every single thing that happened. Genius. Except Larry Sellers. I think I could probably win a how much Ben and Jerry's can you eat contest. I'm not proud. Do i even need to say it? #SAMJACKSON RT @Slate: Cobra Bites Man Aboard Commercial Flight in Egypt http://t.co/OZ6mVbBU via @gawker @TheRealXtina why thank you miss Xtina!  :) :) :) Two Grammy noms! Holy balls! Simon Cowell kinda reminds me of Bennett from Commando. Which instantly makes him more bad ass. I will never apologize for having opinions. the song 'eternal flame' by the bangles makes me feel horny and insecure all over again. Congrats @MelanieLBBH and @amanda__brown for being one of the six winners on that stage! I love you both!!! @kidvive95 @MelanieLBBH that's actually an awesome idea! RT @KaRi_Ann86: “@Fans_AdamLevine: @adamlevine @Amanda__Brown @NBCTheVoice 1-855-VOICE-03 1-855-VOICE-03 1-855-VOICE-03  call that numbe ... People. I want @MelanieLBBH and @amanda__brown to be saved!!! Vote now! #teamadam!!! @NBCTheVoice!!! VOTE! amanda brown - 1-855-voice-03  sprint users can text 3 to 8642\nmelanie martinez - 1-855-voice-06\nor sprint users text 6 to 8642\nVOTE! @MelanieLBBH killed it!!!! I'm a happy coach....now vote people vote!!!! @amanda__brown just killed it!!! Now get ready to vote America!!! @NBCTheVoice!!! My throat is being an asshole. @HartHanson no tattoos are the new tattoos and boring haircuts are the new cool haircuts. RT @LeoDiCaprio: Need more evidence of #climate change? Check out @ChasingIce - http://t.co/UCNjIyIT. Incredible, breathtaking documentary I want a baby tiger. RT @maroon5: Watch @50cent's new video for #MyLife featuring @eminem and @adamlevine http://t.co/o8t8Av7x Huge night on @NBCTheVoice. so incredibly proud of @MelanieLBBH and @amanda__brown!!! #teamadam. Aw shit!!! @NBCTheVoice!!! Vote for @amanda__brown and @MelanieLBBH!!!! Do it!!!! Now that I have the correct twitter info...tonight America votes for the best team. @amanda__brown and @MelanieLBBH!!!!!!!!! #teamadam #boom And...can't wait to perform with my friend @50cent! It's all happening.... America: tonight you must vote for my two amazing ladies #MELANIEMARTINEZ and #AMANDABROWN!!! DO IT! #TEAMADAM Actual text i just received: \"Amiri, Happy Thanksgiving.  May God bless you and your family. With gratitude Afshin.\" Sweet. But wrong number 1. I'm dead serious. 2. I'm DEAD serious. If Pearl Jam needs a temp drummer while Matt Cameron tours with Soundgarden, I've been practicing to your records since I was 11. I'm READY. RT @NBCTheVoice: Season 2's @Luccadoes rocks his new song \"Like Love!\" Check out the music video: http://t.co/uj41NsKu #TheVoice I am genuinely #THANKFUL for all of you lovely fans and supporters out there. Without you guys, none of this could have ever been. when they say \"you won't want to miss it,\" it usually means I definitely DO want to miss it. #GOLAKERS. It's coming together... I'm scared of television. Make it stop. #SNL! RT @JerrySeinfeld: Just found out Gene's Korean. Makings of an incident here.\n#Jewsbuildjokes\ncc: @adamlevine @JessSeinfeld Wow guys. I'm overwhelmed by all of the #peopleschoice nominations. Thank you!!!!!!!! Headed to NYC for a little SNL...And I'm SDE...(super duper excited) Hey dorks, chill out. I'm sorry I spelled Gandalf wrong. Jeez Louize. We can't watch @lakers games on tv. Figure it out. This is total bullshit. #areyoukiddingme? RT @Lakers: Halftime: Lakers 43, Spurs 38. LA has 12 assists on 18 made baskets, led by Kobe's 5 dimes. Holding SA to just 37% shooting. ... Cee Lo is giving me serious Gandolf vibes tonight. Someone in the crowd told me I looked like woody from toy story. #thanks? Here we go...@NBCTheVoice...I love this friggin show. Big fan. #teamadam RT @TheRealXtina: #LOTUS RISES! http://t.co/2NPmmKId I always thought that \"gossip girl\" was an exclamatory statement. Like, \"yeah girl! Gossip girl! Gossip! Go on! Gossip Girl!\" It disturbs me to see people actually upset about my tweet to help people in Guatemala. Wow. This is awesome sounding. Check it out! https://t.co/iOnsvMMx Guys, let's help raise funds for the @RedCross for those in need in the #Guatemala #earthquake http://t.co/6u9oY7sh @BonnieEagerton You're right. What would I know about being a good businessman? Tonight we are debuting our new single #DAYLIGHT.  it's my favorite song on the album. Please watch us play it live on @NBCTheVoice! Donald Trump is one slip into a vat of toxic waste away from becoming an ACTUAL comic book super villain. RT @NBCTheVoice: Show some love to #TheVoice band! RT @TheVoiceBand: Today we are rehearsing for tonight's show...DON'T MISS IT!! 8PM LIVE! RT @rozzicrane: Ladies &amp; Gentleman 'Rozzi at the Roxy' returns! This time with the fabulous @LilyElise :) DEC 7TH! Tickets on sale n ... Inspired yet again by @NBCTheVoice ! Tonight was fun! I'm reaching out to you guys because without your parents consent we cannot use your amazing footage. The video doesn't work without you!!! https://t.co/JDpyYH9w https://t.co/HzTrX4bv https://t.co/ReVVoWzM https://t.co/jKcreTw4 https://t.co/pE5XDPRv https://t.co/JD8PJzYv https://t.co/b21lmErJ https://t.co/BDkcvPwP still need to get parental consent for their contribution to the #Daylightproject. The following people have made the final cut... Daniel Day Lewis looks more like Abraham Lincoln than Abraham Lincoln looks like Abraham Lincoln. #AbrahamLincoln That's what happens when you fuck with Sesame Street. PHEW! Check this out guys. http://t.co/cUQDzdZK #PLEASEVOTE Man. @NBCTheVoice is just so unbelievably fun! I can't stand it! RT @BarackObama: How the Romney-Ryan campaign lost its own credibility in five easy steps: http://t.co/UDR8iANy RT @maroon5: .@jamesbvalentine &amp; @JJAMZmusic are performing at @theTroubadour in LA on November 7th! http://t.co/j6nYT4L1 http://t.c ... #GOLAKERS Sending love to those who need it on the east coast. You are all in our thoughts. Shooting @NBCTheVoice today. So inspiring. I'm lucky to be inspired this much in one lifetime. Hey guys. Make a bid at my dear friend Jake's upcoming auction! Do it! http://t.co/vMTA2DgG RT @BarackObama: FACT: The Washington Post fact-checker called Romney’s jobs claim a “bait-and-switch,” because the math “doesn’t add up.” RT @TheRealXtina: #LOTUS song titles revealed! So excited for you all to hear the album. Weeks away! XoXtina http://t.co/Dgh1IOx6 Let's build massive public pressure to defend #Antarctica's ocean &amp; create a marine sanctuary. Join me http://t.co/MWDLHlY6 @Avaaz Letterman http://t.co/ZWSJcKlm 'There Will Be Blood' has had a profound impact on Williamsburg fashions. Will someone tell Donald Trump that we don't live in Gotham City? But for now, I'm back in the states and I wanna watch these battle rounds. @NBCTheVoice Guys! We are performing #daylight live on @NBCTheVoice November 8th! It's my favorite song on our album!!! I can't wait!!! .@BrandonsDreamz deserved a #steal - that was a killer performance. Your confidence onstage tonight was inspiring. #TheVoice @blakeshelton aw thanks buddy! You're pretty amazing too ya big lug. RT @jamesbvalentine: New US tour dates announced on http://t.co/2mxdgeHY!!! #OverexposedWorldTour Check it out people! http://t.co/FuJ2hJkc Romney's America is one of the more terrifying prospects I could possibly imagine. I urge you all to take a closer look at who this man is. @JonahHill Mitt Romney \"but slutty\" RT @BarackObama: \"Gov. Romney said it’s fair that he pays a lower tax rate than a teacher who makes $50,000. He’s wrong.\"—President Obama keep at it @benjikuriakose! you have the one thing that cant be taught. you have #THESCREAM! great job today man… #TheVoice Sometimes I look at the 70s and I'm like, \"what the fuck was that?\" LA, how I love thee... Thank you Mexico, South America, Southeast Asia and Australia!! amazing days. Some of the best shows of our lives! #OVEREXPOSEDWORLDTOUR!!! I love double kick pedals. Hours of fun. Here's me trying to play my favorite drum fill...and screwing it up.  http://t.co/tpzwmjL7 Follow @rozzicrane right now and I'll bake you a cake... RT @rozzicrane: Two new surprises are up on my website :) http://t.co/qgm2hTWO RT @rozzicrane: http://t.co/1aFvhepn @ariannahuff so many holes in this way of thinking. Riddled with fallibility and uncontrollable variables. #MELBOURNE!!! #OVEREXPOSEDWORLDTOUR!!! The only thing I didn't like about Dark Knight Rises is that Alfred likes the taste of Fernet-Branca. @kellyoxford watching what? I just died inside. If you use the term \"yeah I tapped that\" or \"I'd tap that\" it probably means you ain't tappin SHIT. Thank God for this new #steal thing... Just snagged Amanda Brown from Ceelo! #TeamAdam #TheVoice RT @ItsBennyBlanco: I wish we lived in a world where all guns were replaced by super soakers filled with fruity cocktails ok BANGKOK, let's see what you got!!! #OVEREXPOSEDWORLDTOUR!!! Love seeing my @Lakers updates. This is getting exciting!!! Honestly, my friends will be here any minute. I have friends I swear!  http://t.co/Pf7GDT10 ok season five of breaking bad, lets do this... Thailand is hot and shwwwwweaty and I love it. Indonesia was incredibly loud and passionate and amazing! We love you!!! Off to Thailand... #OVEREXPOSEDWORLDTOUR!!! Ok Jakarta...ready for round 2? #OVEREXPOSEDWORLDTOUR!!! Happy birthday to the best guitar player with mystique, @jamesbvalentine... Love you buddy! Don't grow up. It's a trap. Seriously happy with the team I've built.  I may be biased, but I think mine's the best one! #TheVoice Japan was epic tonight. The liveliest crowd we have ever played for...live at Budokan!!! #OVEREXPOSEDWORLDTOUR!!! Thank you @GreenDay for Always making the best \"I'm wearing headphones and ignoring your bullshit\" records I can ignore the world with. :) Aw that had to hurt @blakeshelton. I'm sorry. #noimnot #TheVoice happy birthday @SharonFeldstein !!! @JonahHill thanks mang! Favorite Crayola Crayon color: burnt siena... Obviously... There's a difference between being a child at heart and being trapped In your childhood. One is essential and the other is straight creepy. Annoyed by that hipster thing where everyone pretends they're fuckin twelve. Lunch boxes and muppets and shit. Well, muppets are cool. @PJMORTON wanna hit Prada? Hahah Flight to Japan cancelled. Sup Taiwan! hey guys. @maroon5 is asking you to help make our next video! send in submissions it won't work without your creativity http://t.co/Hbpc7TAv why you should follow @MrGeneHong: he's hysterically funny, handsome, talented, and single. And he owes me in and out burger when I get home @MrGeneHong is in a follower battle with co-workers that will remain unnamed.  Follow him so he can win the pot. And the ego satisfaction. Don't try and sound like the bands you worship. They did that already. Do something else. The problem with listening to your body is that sometimes you it tells you things you don't want to hear. Keep getting mad dogged by dudes in the sauna. What's up with that shit? @samfarrar @PJMORTON shit is crazy. I love you like spike lee loves the Knicks. RT @BarackObama: FACT: Romney has said it’s “fair” for him to pay a lower tax rate than a worker making $50,000, despite making nearly $ ... Nice one Lo. I'll set em up, you...throw a gutterball! Haha. Its ok. Just had to get your back. Next time, speak up! #TheVoice #CHINA!!! Goodbye social life...hello Breaking Bad... #SINGAPORE!!! #OVEREXPOSEDWORLDTOUR!!! What's App is like text messaging with a better personality. I'm ECSTATIC to be part of the bench family. Great people and great clothes! \"Breaking Bad\" sounds kinda like the name of a 90's alt rock band. Which is awesome. @jamesbvalentine for now... how awesome is it gonna be when we are updating the software.......in our BRAINS. .@CeeLoGreen's inner monologue: \"happy feet don't fail me now\" #buttheydid #TheVoice Go see #ENDOFWATCH. RT @mrmailbox: Saw End Of Watch tonight...wow, what a great movie. Seriously, go see it. Hey people, our guitar player with mystique @jamesbvalentine is almost at 100,000 followers. Let's get him there!!! Actual conversation: Adam: Hey @JamesValentine, what are you doin?\" James: oh, not much bro. Just, hangin...expanding my personal brand. Good morning Manila! Home of the most energetic, enthusiastic @maroon5 fans on earth! #OVEREXPOSEDWORLDTOUR!!! That’s the 2nd time @blakeshelton tried the #vestcard and it failed. Don’t worry, pal, someone will match vests with you one day #TheVoice I'm just sayin If he offered me candy I'd start running. No one really ever talks about how creepy old Ronny McDonald is.  http://t.co/rQm8mfTQ All misunderstandings aside, Korea was #maximumawesome. Thank you!!! Manila here we come!!! The manager totally stonewalled me. I sang  Gangam Style and did the dance and everything. Silence. the cops didn't like it either. @jamesbvalentine you've got Seoul but you're not a Seouldier I assured them it wasn't a real tiger and it wouldn't harm anyone. They didn't think this was funny. Thank GOD they didn't see the shark. They tried to kick me outta the gym in Korea because I had tattoos. RT @SarahKSilverman: A bull in pretty much any shop is gonna be a mess KOREA!!!!!!! Amazing shows thank you all so much for an incredible little run! #OVEREXPOSEDWORLDTOUR!!! @gisellatellez I can't. I just can't stand it. Ok guys, I'm gonna begin following our wonderful fans!!! It seems to be a popular request!!! Jet lag wounds my soul. Wow. Id prefer not to! Haha RT @Yjoysa: @adamlevine Still you remember this? hahaha. Soap Disco - Kara's Flowers: http://t.co/9Arblon0 @HarMarSuperstar coolest day EVER. RT @zachbraff: If you're reading this on a date, you're already bored. Go home, eat ice cream and masturbate. Chemistry cannot be purchased. Not like I should really be talking. Maroon5 ain't the best name either. Band names are useless. Good one RT @Styla73: @adamlevine still think ours was the best: \"raging whore moans\" #shittyhighschoolbandnames If there in fact is a band with that name, I'm sorry. I don't necessarily think you're shitty. Shitty highschool band name: Agro-Culture RT @ariannahuff: James Fallows: \"Mitt Romney Drops His 3 a.m. Phone Call\": http://t.co/sJTb8shr RT @TheRyanAdams: I love Rock and Roll music so much. What a great thing Busan is beautiful!!! http://t.co/oYur6i9k Seems like everyone is loving @NBCTheVoice so far! This season feels good. Very warm and extremely fuzzy. RT @sutterink: WE ARE KINGS, BITCHES! http://t.co/KdM5s9qB http://t.co/t1jl2zKN Hello KOREA! It's been toooooo long! !! RT @maroon5: Pre-sale tickets for our shows in the UK and Ireland are now on-sale! http://t.co/zA9cXCn4 #Overexposedworldtour http://t.c ... that kia commercial doesn't make me want to get a kia as much as it makes me want to get a hamster. Listen up. The season premiere of my friend @sutterink's brilliant show #SOA is tomorrow at 10pm!  watch it! @jamesbvalentine @thevoice love you pumpkin. Wanna come watch at my house? Hahaha Think you can handle \"the chair\"? Tweet me throughout the show to #PUSH when you love a performance. #TheVoice When did marriage become a test drive? RT @BeePrinsloo: The mystery man was found behind the picture more trees less assholes! Thank you @MIKEPISCITELLI   http://t.co/iB4Mdy16 ... RT @NBCTheVoice: TONIGHT: http://t.co/WZ4h8gRq #TheVoice Today is the day! Season 3 of @NBCTheVoice begins tonight at 8pm! Everyone make sure they go and see #endofwatch. It's one of the most real, raw, emotional, and amazing movies I've ever seen. This video is totally bananas...in the best way... I can't believe it's taken me this long to start following @chrisrock. What is wrong with me? \"one good thing about music, when it hits you feel no pain.\" -bob marley @RealWizKhalifa happy birthday man! http://t.co/yc7Ht43W RT @cool_breeze777: @adamlevine PLEASE dont start \"acting\" leave it 2 the TRAINED Pro's that have made it ther craft. We already have As ... @samfarrar how'd you guess? Shooting a video today. Let's just say it's a BOLD concept. It all begins again on Monday...@NBCTheVoice! In my not so humble opinion, the best season yet! Fuck juice cleanses. #ilasted10hours Thank you Mr. President. I'll never forget that speech. RT @MagicJohnson: Backstage @JayLenoTonight w/ @AdamLevine &amp;amp; @JayLeno. http://t.co/bIihPymY RT @MagicJohnson: The winning 3 to beat @AdamLevine.  He did make a few good shots though. http://t.co/Ntece6cU If you're wearing a tux at 4:43 in the AM, chances are you're awesome. @MrGeneHong Hahahaha. You just miss me. It's perfectly fine to admit it. RT @samfarrar: Asuncion ... Asuncion ... Here we come ...  http://t.co/QcXenGwx I so badly want to see Roddick go out with a poetic and inspirational victory at the US Open. #teamroddick! @AndyMilonakis don't make me punch you in the dick. I never thought that home would be my favorite vacation destination. @KurtSchlichter @adamsbaldwin I'm not a democrat. And stop looking up words in the dictionary before you tweet. To those who called me a bigot:  the Mormon Church didn't allow black people to hold priesthood until 1978. @tdcmomma @pepper2005 I completely agree. @pepper2005 I believe in having choices. religion, presidential elections, marriage, abortion. Take away our choices? Take away our freedom @m5fanpage I love you too!!!!!!!!!!!!! @pepper2005 @Scott_M_Jones if they were funny and not mean spirited? WHO CARES. @Garrett_R_Hall @michellemalkin stop talking like Gandolf. This is the 90's! @avaasiastasia :) :) :) @pepper2005 @tdcmomma my heart is very open and very big. If you could get past your bizarre, displaced anger, maybe you'd see that. :) @pepper2005  You have every right to be offended by my light hearted joke. And I have every right to think that you completely overreacted. @pepper2005 how do you feel about homosexuality? @pepper2005 every needs to have a sense of humor about everything they believe in. Lighten up. RT @BeePrinsloo: John Lennon. http://t.co/jErGOjb2 RT @SarahKSilverman: Someone make this Tshirt: IF YOU'RE AGAINST REPRODUCTIVE RIGHTS THEN YOU'RE AGAINST ME RT @billmaher: Who can type fast enough to keep up with all the lies? Go ahead...boo other countries like they're sports teams. My blood is boiling. Help me @johncusack! Help! Clint Eastwood has gone fuckin nutterbutters yo. \"Magic underwear don't fail me now!\" Now that Jersey Shore is over maybe MTV can start playing some videos again. Field of Creams: \"if you milk it, he will come\" #alreadyregrettingthis Correction: \"fuuuuuuuuuuuudge\" #causehesmormon Mitt Romney on Paul Ryan: \"Fuuuuuuuuuuuuck\" Hey guys. Our good buddies in @OneRepublic have a new single out called #feelagain. Check it out! http://t.co/hDY9AE88 Peruvian paraphernalia http://t.co/VhHLdkmV Sao Paulo, you guys were amazing!  http://t.co/KMFoYsMX Hearing amazing music inspires me to aspire to make amazing music. You follow? #Pharcyde #passinmeby. The greatest. Was so much fun getting the Luis Castillo Ledon School ready for the kid's first day of school!  http://t.co/nN13DrkS Mexico City knew all the words!! Thank you guys for a great night! http://t.co/sjD25Xdx It's been a brief but wonderful time in Brazil. Thanks to everyone for making this a tour stop we won't soon forget!  http://t.co/JO98f0vN @HartHanson big difference between Jewish and \"a fan of final destination.\" @HartHanson @Quakeprediction oh you Canadians just dont get it. Earthquake warnings are useless! You sure you aren't Jewish? \"what a fuckin day...\"  http://t.co/sta3rfbZ Oh, and I'm sure @TheRealXtina Would be pleased to know that last night in Brazil there was someone with a #teamXtina sign at our show. ;) What an amazing show tonight in #RIO!!! The crowds keep getting more and more amazing. Life feels like a dream. Thank you Brazil!!! Here we come! RT @tavares_nubia: Rio is waiting for you, guys! @adamlevine @jamesbvalentine @PJMORTON @maroon5 Off to Rio...Weeeeeeeee!!!! Better late than never #Curitiba!!!!! Thank you for being one of the best crowds ever ever ever! @Sralevine ive never tasted it. What is it? I'm so happy puberty is over. That shit SUCKED. Hang in there little fighters. @Our_Demi yes!!! I wanna get out on that stage already!!! @Hooligan5858 hi! @MRassoolbee 222 @Victoria_Gurjao hahaha questions I can answer! :) @soleseekersd size 11 1/2 @redha1233 I'm a big basketball fan actually. #GOLAKERS!!! Anyone who is waiting at the venue in Curitiba right now feel free to ask some questions. I can help you kill the time! Hang in there Curitiba! Our gear got held up. We hate being late, but we WILL be performing tonight! We're moving as fast as we can! Unvelievable. RT @CarsonDaly: @adamlevine here ya go http://t.co/P76S0i4L Watched \"Being Elmo\" last night. Faith in humanity: restored. #BRAZIL!!! Being able to admit fault is an underrated leadership quality. It doesn't make you weak or indecisive. It makes you HUMAN. @andersoncooper he's stumped. Because there's literally no way to put a positive spin on such incredibly ignorant and insensitive comments. When you travel abroad, it really makes you realize how informative ACTUAL news sources can be. #onemorenight number two on iTunes. Shit yeah! I'm so happy you guys dig this song. I dig the fact that you dig this song. You dig? My girls... :)  http://t.co/OgJLC4Z8 Just to clear up the confusion, I am NOT engaged to Chad Kroeger of Nickleback. @StratfordNative @maroon5 early next year!!!! Cant wait!!!!!!! RT @Lalabucater_222: Maroon 5 is trending in Brazil!!!! We love you SO SO SO SO MUCH! Only 3 days guys ;) Round 2 tonight in Mexico City! #OVEREXPOSEDWORLDTOUR!!! Here we come! RT @SHAQ: Question were is smush parker @samantharonson boom. Im an Independent all the way. I'll vote for whomever I feel will do the job well. These days Republicans are just easier to tease. RT @footagenotfound: @adamlevine I'm waiting for the debate when he asks @JoeBiden, \"Do you like Huey Lewis and the News?\" Anyone who talks about body fat maintenance that articulately has Patrick Bateman written all over him. Ding ding ding! RT @TheHillaryBanks: @adamlevine patrick bateman Trivia: which Christian Bale character does Paul Ryan remind me of? Hint: it's NOT Batman. A wise man once said, \"more trees, less assholes.\" Amen. I'm pretty sure @KeithOlbermann just said \"obvs.\" #AWESOME @lindagalvan @miriamgalvan better late than never. It's sitting right here in my hotel room! :)  http://t.co/DSrdbi6Z Do bands that talk shit about other bands realize how transparent their  insecurity is? Need a hug? RT @Slate: This is 'Jaws' in three spectacular .GIFS: http://t.co/eIcp0o87 #SharkWeek @LuanaFergie_JLo wow. Thank you!!! @NJistrulymine that was you? @fucktyler #THURNIS Oh man. Guadala-HOLLA!!!! #OVEREXPOSEDWORLDTOUR!!! What a night! @sutterink  I had a dream last night that Charlie Hunnam was trying to run me over with a blue 1964 Ferrari Lusso. go figure. 3 million followers? What? Thank you guys! I promise to step it up and deliver thoughtful, mature,inspirational tweets. #justkidding En route to Guadalajara...third stop on the #OVEREXPOSEDWORLDTOUR!!! Here we come! Things that DO sound sexy. @jamesbvalentine crushing it during his singing debut at our Mexico City show. #OVEREXPOSEDWORLDTOUR!!! Mexico City gave us everything tonight. Mexico in general is shaping up to be the most incredible audiences we've ever had! Things that do not sound sexy. #vocalwarmups One thing that Los Angeles and Mexico City have in common is...#BADTRAFFIC! RT @SaraBareilles: Bob Marley is always the music I was looking for. On our way to the venue in Mexico City. In honor of the rain,  we will be in our Thursday Blues! #OVEREXPOSEDWORLDTOUR!!! Everyone check out our dear friend Nancy Silverton's new show #TimeMachineChefs tonight on ABC at 9pm!!! #YUM Hey guys, please check this out...A kidney will save a life, go to http://t.co/Ea96TEpw to read about @Mattneedskidney How could anyone not always wear slip on shoes?  Its so convenient. I've wasted too much valuable time dealing with shoelaces... Here we come! RT @tavares_nubia: Brazil is waiting for you guys! @jamesbvalentine @adamlevine @PJMORTON @maroon5 http://t.co/yAnISdaI Mexico might have the best fans ever.  Thank you Monterrey for an unforgettable evening!!! #OVEREXPOSEDWORLDTOUR!!! RT @jamesbvalentine: “@anegutierrez: @maroon5 @adamlevine @jamesbvalentine awesome concert in monterrey!!! Lov u guys!!! http://t.co/K26 ... Just finished Soundcheck in Monterrey! So excited to play the first show of our #OVEREXPOSEDWORLDTOUR!!! RT @Obama2012: President Obama: \"Homegrown energy like wind energy is creating jobs all across the country and all across Iowa.\" @samfarrar so excited you're coming with! It's about time! DirectTV is down. Good job guys. Its ok I wasn't watching the closing ceremonies or anything. #boo a long but inspired day...the best kind. Just kidding guys. Thats not me. My eyes were green and that baby clearly has brown eyes. Otherwise we are literally identical. In every way Gotta say, I was the cutest baby.  http://t.co/DO8prjEs #DREAMTEAM!!! Actual fact: Tom Cruise is the same age as Wilford Brimley was when he starred as the grandfather in cocoon. Allyson Felix is my favorite person. She's a ray of sunshine! A REALLY fast ray of sunshine! #USA @CaitlynMinuto @LukeDraper27 this is all it would take? Easy!!!! Headed to Mexico on monday!!! Are you guys ready??? RT @karladavismusic: HUGE thanks to @nbcthevoice for sharing my acoustic cover of \"Payphone by @maroon5 @adamlevine Here it is! http://t ... Dear all band wagon jumping @Lakers  fans: NO. RT @Lakers: #LakersDay - @DwightHoward  #DH12LA Be afraid of the @Lakers. Be very afraid...Welcome Dwight! Containing my excitement until it's official...#GOLAKERS!!! #THEHUGE3 @samfarrar party time McDonalds continues to be the \"official restaurant of the Olympics.\" That will never make sense to me. Im a little offended! :) RT @NBCTheVoice: By the way, where's the @adamlevine Muppet? http://t.co/4EEjrRhi Just wondering. o___O #TheVoice @SharonFeldstein on twitter? The world may never Be the same... Sarcasm is sooooooooooooooooooo cool. #thatmeanitannoysmebutistillloveusingit Local news just continues to pump fear and neurosis into the atmosphere. #STOP! Sneaky bastards! RT @NBCTheVoice: We spy @adamlevine on #TheVoice stage. Who ya Tweeting, Adam? http://t.co/Dt3vnXvb @HarMarSuperstar try and remember that some people don't have a passat to piss in. As much as I love watching the Olympics, sometimes it just stresses me out. RT @scooterbraun: “Don't cry because it's over, smile because it happened.” \n― Dr. Seuss Yknow....the basics... http://t.co/kgJdlP2m Just saw a 13 year old kid at the market wearing a fur coat and loading groceries into his motorcycle helmet. #onlyinLA RT @MFredric: Owner, @fred_levine talks to @WWDMAGIC about his memories at the show &amp; @adamlevine special performance with @maroon5  ... Hey twits. Just wanted to share a moment of appreciation for your love! Thank you!!! @JessSeinfeld @mrgenehong @jerryseinfeld ok ok take it easy. The only thing he won was bragging rights. And he's about spent ALL OF THEM! Hey guys. Auctioning some sweet M5 items @Charitybuzz to benefit our friend #zoefeldman. You can bid here http://t.co/vrauxvgJ thank you!!! The battle rounds have inspired me to improve my own craft. Had those guys on my mind at band practice. #NBCTheVoice... The Real Dream Team http://t.co/HmW0qkWc Here we go...@NBCTheVoice! How I've missed @CeeLoGreen @TheRealXtina and even @blakeshelton!!!!! My brothers and sister! @shawnbarton always...see you fools soon! #sharkweek. Best week of the year. Greatest thing I've ever seen. You're welcome... http://t.co/9MkxTUsu @tish919 we love you brad! And we appreciate you back home! Another epic day of shooting with the lovely @jennaldewan and the wonderful #AHS crew. It's an honor to be part of such an amazing show!!! @ItsGettinBetter we spent sooooo much time working on those words. Happy to see you quote them! Shit. Ive really gotta figure out how to win a gold medal at the Olympics. Fake blood tastes like artificially sweetened vomit. sometimes true colors can have a hard time shining through so many layers of bullshit. Shooting A.H.S. It's C.A.F. (Creepy As FUCK) RT @LeoDiCaprio: The 11th Hour is now. Grt article by @billmckibben: Global Warming's Terrifying New Math http://t.co/HFsHMONT via @roll ... @bigdragon1979 is an elusive Zen Master/ninja/philanthropist/family man. He wastes no words and speaks only profound truths. #hashtag Other than the fact that his twitter name is @bigdragon1979, he's pretty cool. Please follow @bigdragon1979. He's an awesome dude with a heart of gold. Chances are if you begin a sentence with, \"I'm not a stalker, but...\" you are most likely a stalker. @MrGeneHong you can file that one under \"things people with restraining orders say\" Someone should rhyme \"gym-nast\" with \"biz-nass.\" next Olympics. Just thinkin ahead... @TheRyanAdams hahahahahahhahahahahaha I feel like highschool is so slutty now. What ever happened to a good old fashioned \"4 hour dry hump over jeans\" sesh? @Mariobatali damn you Batali! Oh man. Alice in Chains 'Jar of Flies'...I used to make out and dry hump to that album on repeat for hours. #highschool It's getting to the point where I can't stand driving automatic. Manual has become a way of life. @cambrialyon that is now officially an untrue statement. Dear followers who misunderstand tweets. Stop misunderstanding tweets. Thank you. RT @lizziedulien: There Is an Olympic volleyball player named Destinee Hooker ..\nMy coverage for today is complete. #ff @MrGeneHong I'd love to get through one fucking meal without my best friend bragging about how @JerrySeinfeld follows him and not me. RT @MrGeneHong: I've been fighting Asian stereotypes since 27^(2/3) x (15^2 - 5) I applaud Romney for ruining his campaign on his own instead of having Sarah Palin do it. Shooting Mens Fitness today. I've been on a steady diet of cupcakes, whisky, and spaghetti. RT @Lakers: RT @LakersReporter: Jamison on @SteveNash: \"I just stuck out my hand and the ball was there. I haven't played with anybody l ... http://t.co/lMsMR8wF I can't. I just can't.  http://t.co/RrWV6sqF \"Comedians think that they can sing, while musicians think they're funny.\" -Dave Chapelle Thank you teens. You have chosen...wisely...#teenchoiceawards I wish I could draw. That's one thing I just kinda forgot to learn how to do. Manhattan Beach is a weird name for a place. It's like if there was a place in manhattan called \"Los Angeles Burrow\" @Mariobatali  @HankDHaney  thundercats forever! @HankDHaney I'm playin at this thing next year. Mark my words! @savannahbuffett's new show @ExPats premieres today on youTube  http://t.co/aaaK5QJg...check that shit out! Not too shabby Lake Tahoe. Not too shabby at all http://t.co/sAy91xYk Tahoe...dig it... Just a tip if you're looking for good Mexican food in LA. I feel like I work for the food network right now. Everyone should know that the best Mexican food in LA is always from the trucks. RT @MFredric: #throwbackthursday Here's an oldie and very goodie! #1985 Owners with a very young #adamlevine... http://t.co/eeZ30ble RT @sutterink: congratulations to @adamlevine @CarsonDaly on the VOICE nomination. apparently cee lo's kitty did the trick. bring on the ... I liked it better when music was slower and cooler. Dudes look like such penises when they dance to fast shit. Just started following @TheRealRoseanne. 49,000 tweets deep. Damn woman! Porno title: \"American Whore Story\" Inspired today. So much talent! Really excited to wear my new sweatpants. Is that sad? Can't wait to see the wonderful @maryjblige today!!! Watching \"Game Change\" on HBO. I love when they combine comedy AND horror. RT @Wildaboutmusic: Saw a cut of the POWERFUL new #GoodieMob video with @CeeLoGreen and @GippGoodie yesterday. http://t.co/Ud7ztcJX I quite like the way the Irish say the word \"soul.\" I LIKE. RT @Lakers: First look at @SteveNash wearing the @Lakers home gold. What'd you think? http://t.co/sdsonejF Good morning NY. I'm so happy you've cooled down. I like you better this way. Fine line between art and bullshit http://t.co/Yy8cDdPh @thebearjew_ @frank_ocean shit. I hate when that happens. RT @jamesbvalentine: Tonight... http://t.co/Ia8V2moG Do it! JJAMZ!!! RT @jamesbvalentine: You can stream our whole record. . . Then go buy it. . . If you want to. . . http://t.co/EQvPsIUR No real hero every blamed anyone...for ANYTHING. RT @playing4change: The PFC crew is on the road filming in Jamaica for PFC 3 with Courtney\"BAM\" Diedrick. The Music Never Stops. One Lov ... Best mistaken lyric of the day: \"now we drink champagne every Thursdayyyyyyy...\" NYC is hot as shit. It smells like melty garbage everywhere... RT @Enokiwins: @adamlevine I don't know that humanity has the capacity for world peace. But good moods &amp; smiles are contagious. Star ... If world peace was as important to people as getting tweeted back by their favorite celebrity, we'd live in a blissful Utopia. Working on music for #canasongsaveyourlife...love these tunes!!! So excited!!! Why does she want him to call her Maybe? Carly is a lovely name. @HartHanson you can never escape! Amazing news! Woo hoo!!! RT @JillBCS: Cancer check up today.. All is well!!! Can my favorite band RT to help me celebrate?? RT @iamwandasykes: On this 4th, can we declare that \"You're  welcome\" stinks?  We have the worst reply for \"thank you.\" I like \"UmmHmmph.\" WELCOME HOME STEVE NASH. #GOLAKERS RT @beverlyshane: \"Conquer the devils with a little thing called love!.\" -Bob Marley THE SELF-AWARE HAVE BECOME MACHINES...you're welcome James Cameron. Just give me 5 percent. Found myself attempting to use the  \"pinch to zoom\" feature on an actual magazine. What the FUCK? Drinking coffee and reading yet another article about Wall Street's despicable behavior. Worst part is, it doesn't even surprise me anymore RT @jordanrubin: \"Let's celebrate our independence by blowing off our fingers!\" -Teenagers Dont hate the player, but don't hate the game either. RT @ebertchicago: Global Warming: Scientists say it's \"I told you so time.\" http://t.co/oVZKgxWj Grizzly Man! http://t.co/TxftacGt @jtimberlake @JTBritney twitter angst. #disengage! @HSteinfeldcom shot my first scene this morning! I think I did well because nobody yelled at me. first day of shooting for the movie! http://t.co/cB9QS8fz Hurry up and wait... New York is like a sauna...and I LOVE saunas... RT @Ryuasiu: @alecbaldwin while I hate tabloids, I think regulating them is not the way to go. The best way is to educate people why the ... It's been real Miami. Brief, but real. Back to the NYC. Woo hoo!!! I only censored myself there because I felt like actually saying it would be truly awful. I'm in Miami _____! @angelaellatran or was it? Haha Photo from behind the stage at #Liveonletterman from Tuesday night http://t.co/rwzKdGB5 #Overexposed RT @MikeTyson: .@holyfield's ear would've been much better with his new BBQ sauce. check it out http://t.co/e5Gp3RUs #TGIF @justinbieber thanks buddy! We had a ton of screaming girls out there today. I thought I was at one of your shows! Apparently our Today Show crowd was one of their biggest EVER. People waiting since 4 am in the pouring rain. Wow. #BESTFANSEVEREVEREVER RT @SaraBareilles: My buds in @maroon5 are literally everywhere this week!! I just found @jamesbvalentine in my coffee. With no pants. # ... Who Watches the Throne when Kanye and Jay Z are abroad? Toasty and beautiful day in NY. People everywhere. The city is living and breathing! Long day. It's fan appreciation week! @coldplay's 'fix you' is really a fucking incredible song. A song that special is a true rarity. What a day!!! Falling in love with our fans all over again... At Letterman. Serious rock and roll debauchery.  http://t.co/XRQ3TpU0 Wow. Seeing this outpouring of support from friends and fans really made our day. We are so very blessed. Thank you all so much!!! Best tweet RT @stopslammertime: @sutterink I'm cool with @adamlevine and Maroon 5. They all have sex with some serious hotties @TheRealXtina @maroon5 why thank you miss Xtina!!!! :) :) :) #OVEREXPOSED is OUT!!! Get it!!! Getting ready to chat with @HowardStern...love being at @sternshow. Always a blast! RT @sternshow: Coming up, @AdamLevine and Maroon 5 will perform a cover version of \"Yesterday\" #H100 Everyone grab our record #OVEREXPOSED tonight at midnight!!!!!!!!!!!!! @iTunesMusic @JamesbValentine @stevennieves I personally am most excited about 'one more night.' a li'l reggae!!!!!!! @iTunesMusic my favorite thing about @maroon5 fans is their continued support and passionate dedication for over TEN YEARS!!!! @iTunesMusic @Maroon5 @JamesbValentine my favorite place to play was South Korea. Best fans EVER!!!!!!! @iTunesMusic @Maroon5 I think that for this particular moment in time, it just felt right to work with these amazing people. @iTunesMusic @Maroon5 it's hard to sum up in 140 characters. LIFE is always the best inspiration to draw upon. Ten years ago today we released our first album. It's been such an amazing adventure. Just wanted to thank all who made this life possible! RT @HibertLara: ONLY ONE MORE DAY FOR #OVEREXPOSED @maroon5 @adamlevine NYC here we come!!! Love talking with @MrGeneHong and @mrmailbox about whether or not we've ever shit our pants whilst listening to Wilson Phillips. Our first number one in the UK!!! Holy shit balls!!! #payphone @xhoneybeat I think it was a tie. So excited about the responses to #onemorenight!!! It's one of my favorites on the album!!! RT @DMacD0804: BOTH #ONEMORENIGHT AND #PAYPHONE ARE ON @iTunesMusic's TOP TEN!! @maroon5 @adamlevine #Overexposed http://t.co/0K6dXQ6C @justinbieber haha. The Dervishes will return! Congrats man. It was fun listening in the studio! Please help out my friend @justinbieber. He's got a new record out now! Hopefully he'll make it someday...#BELIEVE. My girl @VicciMartinez has an album coming out!!!!! Don't be foolish..git it!!!! @GippGoodie how dare you! Haha All young billionaires with tons of free time have NO excuse for not focusing ALL of their time and money on becoming a superhero. Our new album comes out in 9 days!!!!! Ahhhhhh!!!!!! #OVEREXPOSED @bugdog how about our everlasting love? The Day of the Father. We love you dudes. Thanks for making us and teaching us man things. RT @autumnbeaty: @adamlevine \"Go to Heaven for the climate, Hell for the company.\" MarkTwain If There is a Hell, and I wind up going, at least there will be some  AWESOME people there. What's HER problem?  http://t.co/CJ4Xnasl @ItsBennyBlanco @mrmailbox when are you two gonna make it official? @sutterink yes!!! I wish I could reveal what I am doing right now. It's certainly a first for me. You'll soon understand. @thaliatharifan I didn't My man. RT @Bill__Murray: Let's go Thunder!   BEAT THE HEAT!!!! Dear old dad is opening a new @MFredric at Fashion Island in Newport tonight! I'm on my way now. Are you? I'd like to one day meet the mothers who allow their daughters to be on 'toddlers and tiaras' so I can vomit in their faces. Don't be a dick...get our record @maroon5 #OVEREXPOSED on June 26th. Cool. thank you. :) I'm not really an artist, I'm just really competitive. #BROMETHIUS @CameronCrowe but it's the \"ouch\" that keeps us going! 'Say Anything' is so good. There's nothing like the first time you get your heart stomped on. Ouch. RT @Andy_Richter: I feel bad for scarf-wearing guys. Their necks get so cold they have to walk around looking all douchey! Even in 80 de ... Sour gummy coke bottles might be my favorite candy ever....yep. Favorite candy ever. Germans make breakfast almost as well as they make luxury automobiles. How is it that I LOVE tomato soup and absolutely hate tomato juice? Is it the subtle difference of temperature and utensil choice? @justinbieber @KennyHamilton we gettin the band back together? #WHIRLINGDERVISHES Just a friendly reminder...our new album #OVEREXPOSED comes out on June 26th!!! Get it!!! Farewell Paris...thanks for the butter. RT @TheRealXtina: No one on earth should go hungry.  Join me to help @WFP bring hope to families in the #Sahel. http://t.co/rn28fml3 A New wallet feels like the first day of school when you've just gotten a shiny new 3 ring binder that will soon be a disorganized mess. RT @MFredric: Dress Sale! 20% Off Dresses on http://t.co/BEwsI65p http://t.co/sobtDzRh #vr4smallbiz Anxiously awaiting my French coffee. Because French coffee reigns supreme. RT @thebearjew_: @adamlevine stop reading your mentions and not answering my tweets, shithead I too am uncomfortable with Details naming me the king of pop. I prefer \"EMPEROR.\" #relaxmoronsitsonlyamagazine RT @NicoleRita: @adamlevine Please RT- Donate to the All Children's Hospital Telethon today in St Pete, Florida! 1-800-270-8642 or http: ... Anyone feel like starting a Police cover band? I DO. Met a Parisian crow. David Crowie.  http://t.co/7paxW9H7 Touchdown Paris. And an added bonus, Jay Z and Kanye playing a show here tonight! Coffee...lunch...PARIS!!! Lisbon was incredible! Ridiculous  crowd! And an honor to share the stage with the wonderful @LennyKravitz. #ROCKINRIOLISBON!!! Hug Life.  http://t.co/55XK3BsY @RealWizKhalifa fact. In Portugal tonight for a huge show!!! #ROCKINRIOLISBON Ahhhhh London how I've missed you. @mrmailbox  peni? Peen Eye? Also think about the joy penises and vaginas have given each other over the years. Think about the joy the words \"penis\" and \"vagina\" have given us over the years. @kellyoxford you win. Nice work. The wise sage @milodecruz. I loved your work in \"The Bible\"  http://t.co/NtLikWxY hey dudes, check this out... #humblebrag #shamlessselfpromotion http://t.co/pmmsjoWQ Sitting across from @MrGeneHong as he tweets aimlessly. I must be a fascinating lunch date. RT @ItsBennyBlanco: A&amp;R: lets sign this dude is next Kanye!!! his music is blowing up online!!! Assistant: How does it sound? A&amp; ... I love haters. I'm a hater lover. I walk away from my computer for five minutes and @MrGeneHong just couldnt help himself. childish. I feel so violated. Layin down an intimate version of \"let's stay together\" with my dudes @PJMORTON and @jamesbvalentine. we won't let you down Mr. Green! The perfect man would be someone with the brains of @mrgenehong and the body of @mrgenehong. Guys, how can we ever feel sexy knowing there is someone as hot as @mrgenehong out there? I dare you to read all 106 tweets of @mrgenehong and not want to follow or marry him. RT @rolandsmartin: The refs just screwed the Lakers BIG TIME. That was NOT a flagrant foul on Ron Artest, and the 2 technicals were BS. Wow. Fuckin floppers. The refs should just put on OKC jerseys. You cant call a flagrant foul on @MettaWorldPeace unless its actually a flagrant foul. #bullshit Just realized that most music in commercials are in the key of A. 5 in a row! Marketing technique? Ok @lakers, do or die. Go time. Let's do this. Come on!!!!!!!!!! Dang. I love you Charles Barkley, but that suit is about as nasty as your golf swing. Have Kenny lend you some of his shit! Yoga. Bob Marley. Sun. Paradise. #LUCKY I think the Lakers might have cracked the code! Keep it up dudes! ANDREW BYNUM. LETS GO LAKERS!!!!!!!!!! @RealWizKhalifa right? We ate 2 full plates of 'em! Man. #Preakness was incredible! What a crowd! And always nice to share the stage with the amazing @RealWizKhalifa!!! Come on #LAKERS. Slow it down. @vinnawinna there we go! So good to have you back! RT @MFredric: It's Here!!!! @MFredric Newport @FashionIsland is officially OPEN!!! Come stop by today and celebrate with us! you're welcome...\nhttp://t.co/ZJWp5CYj James Harden travels every single time he picks up his dribble. So does everyone else, but he makes it really obvious. Its funny when athletes promote cars that they definitely DON'T drive. Let's go @Lakers!!! Goodnight NYC... Clearly the @Lakers are tired and losing. However, I HATE when refs just allow home teams to hack away with no consequences. I thrive on awkward moments... RT @sutterink: OUTLAW EMPIRES premiers tomorrow night MONDAY, 5/14 @10PM ON DISCOVERY. http://t.co/xBHMRFlS hope you dig it. Mothers. We love you. Thanks for making us. Today...is your day! Wow. San Diego gave me a shot of life tonight! DANG! RT @RealWizKhalifa: I'll Prolly Be A Bad Ass Forever My girl @katrinapmusic at the dodger game! So proud!!!  http://t.co/5SPG5W2o It used to be \"VEGAS BABY!!!\" but now it's just \"vegas...\" Ignorance has this unique way of making me want to both laugh AND cry simultaneously... thank you @BarackObama for reminding us all that true leadership is not dead. Congrats to @JermainePaul !!!!!!! A strong man with a strong voice!!!! Nice.  http://t.co/JegN1Dh3 I am totally ok with @Luccadoes passing #payphone on the iTunes chart. Make it happen! Get Tony that number 1!!! @blakeshelton hahahahahahahahahahahahahahahahahahahahahaahhaha Wow. @Luccadoes number 3 iTunes baby! Let's keep climbing! @justinbieber don't be nervous. I'll press my button for you. I think you could make it big someday! RT @Athba_YM: @Luccadoes 's single is #3 on iTunes and his duet with @adamlevine is #7  http://t.co/nSbMuXsj RT @maroon5: Watch @adamlevine and @Luccadoes perform #Yesterday last night on #TheVoice! http://t.co/RhLQjZps \nVote for Tony here: http ... RT @Luccadoes: Sprint customers can text 3 to 97979 to vote for @luccadoes! RT! #PartyLuccaRockStar I DID mention this but it wasn't used. Must give credit where credit is due. The version that inspired us...HUGO!\nhttp://t.co/BumargXe If my iTunes account could talk, it would say, \"really Adam? You really wanna purchase @Luccadoes single again?\" #YESPLEASE Am I annoying you all yet? GOOD :) What are you doing? Hopefully voting for @Luccadoes... Awww thanks katrina!!! RT @katrinapmusic: Go #TeamAdam tonight! @Luccadoes &amp;amp; @adamlevine! Kudos sirs! Kudos. :) Vote people!!! Vote  @Luccadoes!!! do it! NOW! .@Luccadoes killed it tonight! Congrats Tony. Go download and vote for him on @iTunesMusic http://t.co/EQTlNH3a RT @Luccadoes: Voting is open! Visit http://t.co/Z9v0q9cb for voting details. Everyone check out @Luccadoes version of \"99 problems\" on iTunes! Git it!!!!!!!! Ok everyone!!!! It's time!!! I know my man @Luccadoes is ready for battle!!! @NBCTheVoice!!!! RT @Luccadoes: remember y'all: only iTunes sales AFTER TONIGHT'S SHOW count as Votes! Be sure to buy/gift as many as 10 DOWNLOADS!! Everybody get ready to vote for @Luccadoes on @NBCTheVoice tonight!!!!!!!!! RT @GippGoodie: YO Look Whut @adamlevine Got GIPP for My Birthday!! WOW Love U Dude#Real Player ShYT!! Zagga http://t.co/PPBdYZto Damn. I love the Knicks taking game 4. Wear 'em out! Ouch. Seeing a lot of petty, negative, insensitive, and unintelligent behavior concerning @Luccadoes. Keep it up! It only makes us stronger #MCA Check out @Javstwtr's record and check out his latest Single, \"A Drop In The Ocean\" on @iTunesMusic http://t.co/dH03t4zy @justinbieber my man @Luccadoes has Something FIERCE up his sleeve. He will reign victorious!!! Thank you world for being so kind to me so far. Wow. RT @MrGeneHong: At the bank, looking at myself in the security monitor.  Why didn't you guys tell me my ass was this perfect? RT @MrGeneHong: WRITING TIP: Keep it simple and don't be repetitive or redundant or repeat yourself.  Just be concise and keep it really ... RT @Luccadoes: get it get it! http://t.co/Ts4j9iEw Tomorrow my dear friend @Javstwtr is coming back for a little reunion!!! Welcome back bud! Proud of @Luccadoes and @katrinapmusic for really delivering tonight. Love you both!!!!!! Tomorrow is gonna suck. My man @Luccadoes KILLED it tonight on @NBCTheVoice!!! Wow. This dude is the real deal!!! RT @JuddApatow: Twitter is such a bizarre combo of wonderful and awful. Just like everything else I guess RT @MrGeneHong: Just took my first spin class.  It was amazing, but I feel like we were all being tricked into generating power for some ... RT @MrGeneHong: I just got depressed -- Starting to think I'll never get back to my original weight. (6 lbs 8 oz) Twitter really helps you grasp that whole \"choose your battles\" concept. Next time you go anywhere or do anything, pretend you're in a Tarantino movie. It makes even the mundane trip to the super market fun. Best response EVER! RT @chrissyteigen: you are prob gonna die soon RT “@Jacalore: @chrissyteigen ... Ur beauty is store bought” @zachbraff come on. Dear America, if you don't re-elect @BarackObama, I'm gonna lose my shit. RT @jamesbvalentine: you know @iamrashidajones sang on our first two records and now she's on twitter... it's #BOBMARLEY kinda morning... RT @CeeLoGreen: Goodie Mob's new single \"Fight To Win\" on iTunes \nhttp://t.co/cE860leK RT @MFredric: M.Fredric Collection - 20% Off This Week! http://t.co/aAvwjUgA #vr4smallbiz Wow. Just. Wow.  http://t.co/9Ns2oGEL Sending love to @Luccadoes @mathaimusic and @katrinapmusic today. Whatever decision I make does NOT reflect my belief in your talent. RT @papermagazine: Our May cover star @AdamLevine talks @maroon5's new album, @NBCTheVoice and marriage http://t.co/3peRQMzz RT @T_mogoodie: It's Official on iTunes Now!! \nNew single Fight to Win by Goodie Mob Tonight was inspiring. Wow. Incredible job everyone and hats off to @CeeLoGreen and @GippGoodie for elevating things YET again!!! I'm on the cover of @papermagazine's May issue. Oddly, they didn't want @blakeshelton for the shoot. Weird http://t.co/sZVqbkyY @JesseCanella LOVE the troops. HATE @michaelianblack. So....Now what? RT @mrgenehong: Nothing is certain but death and taxes and Johnny Depp wearing white make-up in movies. @blakeshelton do you really want to hurt me? Do you really want to make me cry? RT @karladavismusic: NEW VIDEO!! Here's my acoustic cover of \"Payphone\" by @Maroon5 shout out to my team #teamadam @adamlevine big night ... @samuelsylvan come on man! We kept up with em. we pulled off a double OT victory against the youngest and arguably best team in the NBA. Kobe is still the best closer in the NBA. No question. #GOLAKERS #statementgame @MichaelRunion he didn't see him. He's tender and sensitive. And you are a clipper fan. Oh my dear lord...KOBE People need to back off of @MettaWorldPeace. Hes just a man doin man shit. His elbow didn't even see that dude's face! Don't talk shit just yet! #GOLAKERS!!! @GippGoodie HA! How's that blue and red doin? Haha Let's go lake show. Big one. #GOLAKERS From bank robberies to boxing matches. Using music videos to fulfill as many childhood fantasies as possible! Seeeee? RT @meikosoned: \"@heykim: #Dammit - Cursing is good for your health. Really! http://t.co/Z7Sl5h5C /via @HuffingtonPost\" @adamlevine @AndrewWK out of context that sounds really creepy. However because it's you it's not. It's totally awesome. Levon Helm. He was THE BEST. Music is gonna miss him. One of the humble gods of rock and roll. Rest in Peace. Rough morning... http://t.co/xRz82aoE Shot the video for #payphone today. More tomorrow. This shit is truly insane. In a great way. Crazy. @rozzicrane yeah. It gives me a headache even LOOKING at one of those... My day job.  http://t.co/KkCtwymK Big day today on @NBCTheVoice!!! Sparks flew...emotions ran high. (quote from dumb and dumber) #payphone is officially number one!!!!!!!!! Ahhhhhhhhhhhh!!!!!!!!! Thanks to all who made it happen!!!! #payphone is almost there!!! number 2 on iTunes!!!! lets bring it to number one!!!!!!!!! Not gonna lie, I'm shocked by the elimination choices tonight. However, I respect my fellow coaches and their decisions! Keeps it fresh! RT @maroon5: Excited for #Overexposed? You can pre-order the album at http://t.co/EW8fjFpX now! .@ChayonikaC inspiration is self-reflection and trying not to lose touch with who you are. Staying strong but having a tender side #Payphone .@angelaesseily didnt really want to have a collaboration on the album but we heard @RealWizKhalifa was interested He's the future #Payphone .@VickyCheng we love pop music, and I feel like on this record we fully embraced our pop side #Payphone .@JanetMarie333 My favorite song on the album is daylight... It feels like everyone in the world will be singing it #Payphone Yesssssssssssssir!!!!!!!!RT @RealWizKhalifa: “@hails0218: Pay phone!!!(: @adamlevine @maroon5 @RealWizKhalifa &lt;3” turn it up @justinbieber Yup. I'm gonna bring my earplugs. These girls are gonna scream their faces off. #beafraidbeveryafraid! @NBCTheVoice So...@maroon5 has a premiere today...@justinbieber has a premiere today...@blakeshelton? Oh yeah. You don't. #BOOM (I'm an idiot) RT @Theorossi: \"Reality is wrong. Dreams are for real.\"\n-Tupac #Pac @shawnbarton na. The opposite has always been more fun! RT @SarahKSilverman: Really you should only tell people who are tens what their number is. Only thing better than going to coachella? NOT going to coachella!!! One lead vocal away from being done with #OVEREXPOSED!!!!!!!! Ahhhhhhhhh!!!! RT @karladavismusic: New youtube! My cover of \"Part of Me\" by Katy Perry! RT if you like it!! :) #teamkarla\nhttp://t.co/N7ForZKn RT @NBCTheVoice: .@maroon5 performing their new single #Payphone Monday, AND we're premiering @justinbieber's #BOYFRIENDvideo Tuesday. L ... the creepiest part of Weekend at Bernie's is when Bernie is still alive. Ladies and gentlemen. I give you...MY COUSIN MOLLY. New to the amateur rap game.  And the funniest person I know.  http://t.co/NIcYGXwT RT @zuckermanstudio: when a plane comes between google and the earth http://t.co/FFpTDnQX RT @VanityFair: P. Diddy Intruder Totally Unimpressed with the P. Diddy Home He Broke Into: “It’s Just Like a Three Bedroom” http://t.co ... How can I possibly sleep when espn classic is showing all of @MikeTyson's fights all night? #thebest Hello Vegas! You haven't changed. One bit. @Mariobatali so proud of the lad! Miss you bastards! The dude that's pretending to be me isn't following me. #rude Busy day..lucky to be so busy! Band practice, @NBCTheVoice , sleep...repeat!!! RT @NBCTheVoice: Send some love to the incredible @karladavismusic, @kimyarbrough, @TonyTheVincent and @erinmartinmusic! These goodbyes  ... Hard decisions ahead on @NBCTheVoice...not looking forward to this. @mrgenehong shaved my dog. It's actually pretty damn cute!  http://t.co/3ST5AqSz Note to self: don't ever say BONER on television ever again. @pip_andrew sick job dude! It wouldn't be right to be dishonest. With a little work you will go far bud! @mathaimusic. Pure magic. @Luccadoes killed it! A tall order doing Peter Gabriel!!!! So proud of you @katrinapmusic! Wow. So much power and elegance! Ok @NBCTheVoice  @TeamAdaam... Let's do this! I'm nervous! And I don't get nervous! Shit! 2 million followers? What are you people thinking? :) #THANKYOU!!! I'm not a bully or anything, but these dudes on \"supernatural science\" are serious goobers. Sending my love to @karladavismusic @Luccadoes @katrinapmusic @mathaimusic @kimyarbrough and @pip_andrew..I'm already proud no matter what. RT @MFredric: Take 20% Off Any One Item on http://t.co/JtXj7yEY http://t.co/fBDMgeBu #vr4smallbiz Preach! RT @jtimberlake: Tony Lucca @luccadoes performs LIVE tonight on #TheVoice Tune in and vote for my boy!!! #realtalent Good morning people! Yoga. Sun. Music. Frankie. And tonight...@NBCTheVoice!!! @blakeshelton oh brother. Here we go again. If I had a nickel for every time I heard you say that...I'd have...five cents... Oh. And the trampoline. Shit how could I forget that? So crucial. (please see previous tweet) I REALLY want @tomhanks' loft from \"big.\" With the same stuff in it. Notably the Bball hoop, the bunk beds, and the soda machine. Thanks. High Def has hurt many, and helped few. It's just soooo...vivid. Working on a song that @jamesbvalentine wrote called \"tickets.\" it kicks ass. Well done jimmy. My car decided to automatically lock me out with the key in the ignition and the radio on. The machines have become self aware... Happy Easter! Jewish people just CAN'T stay away from a good Easter egg hunt! Popcorn tastes better while your watching movies. It just does. @Andy_Richter you'll have to try MUCH harder than that! Enough softballs. Man up, pussy! @Andy_Richter not today, no. Just finished in the studio. I seriously can't wait for you guys to hear these songs! RT @StephFarrar: Dudes: don't part your hair down the middle. Damn Tiger. Damn damn damn. Bloody Marys kinda make me wanna Vom. Listening to Pink Floyd instantly makes me feel like an insecure teenager who no one understands...all over again... @StephFarrar watch baby loves bob marley. It does! YouTube #bandpractice Wake up...Put on reggae music... I promise it will make your day better. Dear awesome rappers, please rhyme high heels with highlight reels and then name check me in the next line thanking me for the idea. Thanks I'd rather have rings than highlight reels...#golakers @GippGoodie I was gonna keep my mouth shut and be a good sport..but I can't help it. LAKE SHOW baby! SESSIONS!!! #and1 #GOLAKERS!!! I'm pretty sure Jeffrey Tambor has been the same age his entire life. I continue to be impressed by the amazing energy on @NBCTheVoice. Inspiring... happy __ birthday @milodecruz !!!! Love you bud! RT @jamesbvalentine: Hey! Wanna hear my favorite JJAMZ song??? Go to http://t.co/916hS6cI and get a free download of \"Heartbeat.\" it's sick. RT @jordanrubin: \"Why are old or clinically insane people the only ones who feed us?\" -Pigeons I'd just like to thank people who support us for this incredible dream life...holy shit! So impressed with @blakeshelton and @TheRealXtina's teams tonight! @CeeLoGreen and I have got work to do!!!!!!!! Sexual Chocolate  http://t.co/n8JcqNAX Congrats to @blakeshelton for SECOND best male vocalist of the year! Thank god for auto tune! RT @rozzicrane: woah my cover of \"Heartless\" is so close to 20,000 views. thank you so much for all the LOVE! http://t.co/h2D7NiHf Ditto! RT @NBCTheVoice: Excited. #LiveShows Anything for family!!!! RT @CarlyAnnCrafts: http://t.co/GMhMBuaf @adamlevine Kobe pulled a reverse LeBron! That's right Kobe. That's right. #golakers @rickygervais Ha. Life...So unpredictable. @rickygervais Ok. Day officially remade...such a roller coaster of emotions. If @rickygervais was in fact talking about the Voice UK, then I take back what I said. My day is officially \"un-made\" This made my day RT @rickygervais: Absolutely loving \"The Voice\"  There, I admit it. Oh shit. It's Saturday. Well. I like working on Saturday too. Makes you feel like you're getting the jump on Sunday? #oops I enjoy working on Sunday. Feels like your getting the jump on Monday. Words of wisdom for the new lottery winner: DON'T FUCK THIS UP. Awesome RT @pitchforkmedia: Read a Letter Fiona Apple Wrote to a Young Gay Fan in 2000 http://t.co/L7iTQODi @Andy_Richter so weird. I was literally about to direct message that to you. Sweet bag.  http://t.co/z035rFXm Hey...check out the sweet sounds of @JJAMZmusic!!!!! RT @sutterink: VOTE BITCHES! We are too close  cant lose to \"game groans\" http://t.co/OfxJhXAM #STUDIO!!!!!!!!!!!!!!! @Andy_Richter totally. I SO get it. Look at that face!  http://t.co/HkP4bQPu The coolest thing about Eddie Vedder's voice is that he's not TRYING to sound like Eddie Vedder...Everyone else is. @femailbox shit. That's not EVERY day? My bad. And fuck you if you don't like it! :) Buisiness as usual with @jamesbvalentine @samfarrar and @mrmailbox in the #BEATLABORATORY  http://t.co/VvCDtNT8 RT @kimyarbrough: If opportunity doesn’t knock, build a door. \n~ Milton Berle  #TheVoice RT @MichaelNLevine: Hey! Help a brother out!  Actually...help YOUR brother out? Haha http://t.co/I3ZdLLcV @mrgenehong you just blew my mind... I don't care how many times it happens...I will NEVER turn Back to the Future off when it comes on. Never. Never Ever. .@ONapiermusic this was tough. You're a talented dude with a bright future ahead of you. A true musician. Keep playin! #TheVoice does @PurrfectTheCat hold the record for the animal with the most followers? That shit is awesome. \"we're almost NOT young anymore.\"--@AUS10NICHOLS Come on Tiger... @fred_levine @MichaelNLevine oh lord...here we go!!! Costa Rica was on fire tonight! We love you!!!!!!!!!! @mrmailbox what a jerk. :) Ok. Is it sad that my FAVORITE travel activities are to watch movies and eat the entire mini bar? RT @Lakers: Lakers head into halftime leading 53-48. Bynum leads the way with 16pts &amp; 6rebs. Kobe adds 13pts. LA outrebounds POR 26-13. COSTA RICA!!!! Curtis Mayfield = GOD I shaved my head. Sometimes it's just necessary. like an emotional reboot. It'll grow back... We are working on a new song. Singing it in the studio gives me goosebumps. Never been more excited. When I drive, I carefully scan the streets. Kinda like the Terminator... @Andy_Richter that shit is bogus. Never trust a bottle with a bowtie. RT @Andy_Richter: @adamlevine You gotta get a toilet that pivots like that!  You will get so laid! Hey guys.  It ain't easy sitting in that chair. It breaks my heart sometimes. These are real people with real talent. RT @mrgenehong: why my wingman is better than yours:  http://t.co/f2hTBEWb Happy birthday @AnneV !!! This decision, in no way, determines your talent @Parrettnathan - You killed it tonight. I'm so so proud. Keep it up, man! #TheVoice @blakeshelton did Jeff Foxworthy steal your phone? RT @mrmailbox: I love playing the game Hasidic or Hipster when I drive through @feerods neighborhood. @jamesbvalentine bad ass!!!! Why does coca cola taste so much better out of a bottle? Overwhelmed and amazed by all of this incredible love and support. Thank you so much for the birthday well wishes. I LOVE YOU GUYS!!! My mom brought me a cake for my birthday... Which kicks ass. #momsrule @carsonjdaly the humble brag. I am fully clothed for this one. Gonna curb the nudity for a moment. Stay classy San Diego. RT @Jojosvoice: BAY AREA!!! @pjmorton in OAKLAND (1st time) on April 18th at yoshi's. Get your tickets now Flyer attached. http://t.co/o ... Shooting the cover of Details with the immensely talented and completely awesome Norman Jean Roy. Damn good day! Are you kidding me?  http://t.co/02GIqIXl Im almost 33. Yikes. Can't stop smiling. This new song is the icing on the cake. A John Hughs moment...ahhhhhhhhh!!!!!!!!!! @KennyHamilton boo. Sorry I've been so \"un-tweety\" lately...#MAKINARECORD!!! I'm pretty sure @blakeshelton and I managed to offend every single person on set today. We were even more immature than usual... @adamlevine @justinbieber @kennyhamilton the best part is that Kenny is the singer. #pitchy @justinbieber @kennyhamilton No one is beating me at NBA2K today. Nobody... @jamesbvalentine is sleeping over. We are gonna stay up all night eating ice cream and talking about our feelings. We are 33 years old. @CeeLoGreen im not sure what you did, but I could never be mad at you. Unconditional love my friend! Man this ain't easy. Talent cannot truly be judged. I see all of these amazing people as equals. Whitney, you killed it tonight! #TheVoice RT @SteveCarell: True Story: \nGuy in Store: \"Hey, are you Chris Carell?\"\nMe: \"Yes.\"\nGuy: \"I'm your biggest fan.\" Salmon Rushdie...Coffee Annan...#celebritydishes @guster there's no real \"right answer.\" it's more of a feel thing. Not sure how i feel about that one. You can do better. Salmon Rushdie? To this day I will never understand powdered wigs. What was the allure? #GOLAKERS!!! Tofu Grace #celebritydishes RT @mrgenehong: Reply or RT to help set the menu for my celeb-themed restaurant: Benecio Del Taco,  Jerk Chickenhaal... #celebritydishes @mrgenehong tuna turner...Banana Nicole Split...Quiche Richards...#celebritydishes Gonna find a great spot on the couch to watch one of my oldest buddies  @JonahHill host SNL. Life is surreal to say the least! Just landed in LA. Coming home never gets old. :) Do it!!!! RT VOTE for @AnneV here for the http://t.co/vBlrn970 Paris walk-off http://t.co/YbNY5D7i @mrgenehong there's something seriously wrong with you. @JBogamil @mrgenehong damn you Boze. Ok. Clearly that was not me. @mrgenehong highjacked my phone. Although I can really argue with his claim. I wish I could be as awesome as @mrgenehong. He's just better than me in every way possible. I love the title of our new album. Unfortunately I can't tell you what it is..but it's very... Self aware??? There's a way to do ANYTHING well. What's the word for this? I believe it's MAJOR! So proud of @AnneV killing it at #miumiu!!!!!!!!!!!!  http://t.co/MtfbEEyL I'm a relatively sane man, but The sound of high pitch Eric's voice drives me dangerously close to the brink of insanity. @sternshow @SarahKSilverman reflection in a car window. THE most flattering. @CarlyAnnCrafts you got it cuz! Let's welcome @mrgenehong to Twitter. Follow him. Don't be a bad person. Just watched an uplifting film called Wonderland. Definitely NOT a rom com. So proud of everyone on @NBCTheVoice... Excellent work people!!! RT @alecbaldwin: “@lizjaxe: @alecbaldwin Favorite scene you have ever done?”\nI don't give a s*** about my own movies. I like my sweater. Grandfather sweaters are badass. Get with the program. .@chriscauley those parting words were so kind. keep it up dude - you are so incredibly talented! #teamadam #TheVoice @Mariobatali THUNDERCATS What a day with @HankDHaney!!!! Inspiring times!!!! RT @SimplyNikE: I will be at my computer tomorrow at 9:59 am waiting to purchase my @PJMORTON tickets for his April 29th show @thebottom ... @galifianakisz so excited to definitely 100 percent play your wedding! Ok. The transformers ride at universal studios looks pretty KICK ASS... Tweets on a Plane. Golden Retriever puppies are stupid stupid cute. Stupid. I can't handle it. 3:30 am is annoying... Am I allowed to be a fan of @NBCTheVoice Eventhough I'm on it? Hey David Dunn's father. Don't be a dickhead. Support your son. Shame on you man. Love watching Whitney emote! Definitely making @aliciakeys proud! #teamadam Got a great gig last night. I'm paying @galifianakisz 1200 dollars to let us perform at his wedding. Well...I didn't win an Oscar. Which makes perfect sense considering I've never been in a movie and I wasn't nominated. So proud of @JonahHill. What a TRIP. Good luck brother! Whoah... There are like, 400 movies nominated for best picture this year. I like It. Shakin shit up! @AnneV...Prada show in Milan...no big deal....#HUGEDEAL!!!  http://t.co/7nXI90DV Have I mentioned how much I love music today??? @samfarrar @mrmailbox there's a little jagger in there too! Weird... RT @JeremySisto: Hey y'all! My album is finished and I'm giving it away for free on Timmytheterror.com. Here's the link: http://t.co/OOJ ... I feel bad for the GOP. They kinda remind me of the Clippers 3 years ago... Such a blast with @HowardStern. And thank you @rqui for checking out my ass... Maximum cuteness...  http://t.co/cCalRyRl Gotta take yet another moment to tell you all how much your support is genuinely appreciated. Im a lucky man in more ways than one... RT @RealWizKhalifa: Stoned :-) @carsonjdaly @tomhanks a name worth dropping if ya ask me!!! Just met @tomhanks. What a lovely fellow! RT @karladavismusic: CHECK IT OUT!!!! TEAM ADAM!!!\n\nhttp://t.co/bfzJ1tF9 RT @chriscauley: And Mathai is trending WORLD WIDE!!!  :)  @mathaimusic I'm pretty sure the country just fell in love with @mathaimusic...@NBCTheVoice Mathai is incredible! @blakeshelton will most likely cry himself to sleep tonight over this one. Let it all out big fella...#TheVoice If I see one more @NBCTheVoice billboard im gonna lose my shit.  What the hell am I pointing at anyway? RT @MFredric: Get 20% Off - President's Day! (and week) Only on http://t.co/s4nafUOq! http://t.co/gtryM3CU #vr4smallbiz Clinton is a Heat fan? What a travesty... NYC!!! How I've missed you! What a perfect day!!! #MARDI GRAS!!!!! Thanks for the memories...And the beads... My @Lakers gettin' it done...YES! New Orleans is such a soulful place. Excited to visit @HowardStern, @rqui  and the lovely people from the @sternshow this week in NYC! RT @robhuebel: Here's me at the gun show. Thanks, Jean Claude Van Damme (@jcvdonline) for making my arms look like vaginas.  http://t.co ... We found a Batphone on eBay. My life is complete... http://t.co/c63aKNq7 RT @jamesbvalentine: HAPPY VALENTINE'S DAY! Send me a Valentine in form of a donation to the Pablove Foundation (I'll be running the...  ... Every day should be Valentines day. We'd have no need for this holiday if people could be more romantic on a consistent basis. CUTE RT @tangomango68: Sophia Grace & Rosie have #MovesLikeJagger @ the Red Carpet w/ @maroon5 ♥ @TheEllenShow  http://t.co/ygkdQO2k This Jeremy Lin story is so inspiring! Wrong team though. #golakers Just saw the cover of Sports Illustrated. One major problem...@AnneV isn't on the cover. Arm wrestling Cee Lo wouldn't go well for me. However, I'm pretty sure I could take the cat. It's on @PurrfectTheCat My grandmother is very upset with Todd Martens of the LA Times. Be careful buddy. This is NOT a woman you want to piss off. Last night was truly incredible. Being on stage with one of my favorite bands of all time singing the songs I sang in the car when I was 5. I had almost forgotten how friggin bad ass Terminator 2 was. Shame on me. Tomorrow night at the Grammys, the only person on our minds will be Whitney Houston. @HartHanson No Shit? (puts on slippers and bathrobe...gingerly skips to the curb to retrieve the paper) RT @Andy_Richter: I specialize in blowing people's minds. For instance, last night I wore a corduroy jacket over a seersucker shirt. The ... Ok. Horrible feeling in my stomach is subsiding. #careerbackon Just ate a TON of mediocre Indian food. I'm regretting this decision. I can't even get off the couch to track vocals. #mycareerisover Damn right!!! RT @Luccadoes: gonna be on the @todayshow Monday. #WTF?? #TheVoice Or not? Who knows. All I know is that I'm surrounded by Swedish people and things are getting...Swedish. It's much more interesting to embrace who you really are rather than waste energy pretending to be someone else. SAVE THE MUPPETS!!! They should be performing at the Oscars!!! Help our fuzzy little icons get their due!!! RT @OneRepublic: \"You know, Adam-it's like that famous saying- 'until the fat cigar sings, or guy/lady sing whatever'\" - Max Martin Hahah RT @blakeshelton: Hey @adamlevine.. I forgot to tell you thanks for the great Maroon 5 tickets the other night!!! http://t.co/xOvC0F6c @sutterink @carsonjdaly @Kateylous nice! Hey...the kitty is a hard thing to figure out. just have to say congrats to EVERYONE who auditioned. regardless of chair turns, it was still a win. millions saw your talent! @NBCTheVoice .@blakeshelton calling me a liar on national television...Keep it classy Big Country! #TheVoice @HartHanson damn you. I miss Lucille...I wish I hadnt had to pay rent that month. RT @UncleBlazer: There is no problem that extremely loud music can't fix. RT @neontrees: Dear dude on The Voice, we heard you did Animal and we love you for it and totally would have turned our chairs around fo ... Sitting here as Indianapolis quiets down thinking about how insanely blessed I am. So much gratitude. #holyshitmoment Thanks to everyone who watched @NBCTheVoice tonight!!! Woo hoo!!! Pushing two buttons might be totally illegal. I'm sure the NBC lawyers aren't happy…oh well sue me. (Please do not sue me.) #TheVoice I fully support Liam Neeson's graceful  transition into a full blown action hero. my dude @CeeLoGreen KILLING up there at halftime! What a trip! What. Is. Happening. Ok that rope dancing shit was pretty sweet. I hope everyone in America watches @blakeshelton @CeeLoGreen @TheRealXtina and yours truly on @NBCTheVoice tonight...Too much to ask? Yikes. I'm not sure which made me more uncomfortable, the safety, or the Pepsi commercial... Ouch. Indy kicked my ass last night. Embrace the chaos baby!  http://t.co/uFmnC3FI @johnlegend your sarcasm is very much on point. It's GNARLY out here. @GippGoodie haha! You have a deal! @GippGoodie #GOLAKERS I keep forgetting to remove my do not disturb thingy when I leave. My hotel room looks like my bedroom when I was in highschool. #amess @bassicblack I'm in INDY! Its official. Every single person In Indianapolis is drunk. RT @shinyunicorn: Slamming your bedroom door and blasting the Dawson's Creek soundtrack is a lot less meaningful when you don't live wit ... RT @blakeshelton: “@erineriley: @blakeshelton @adamlevine #thevoice is trending!! and can a girl get a RT for her 30th bday??”\nHappy bir ... @PJMORTON come on down! What a blast this morning performing with @TravieMcCoy and the fabulous @GymClassHeroes on the Today Show!!! Great vibes all over the place! RT @blakeshelton: Cover of \"Rolling Stone\" bitches!!!! Yeeee hawwww!!! http://t.co/BpJyc4py RT @NBCTheVoice: Meet Purrfect! RT @Purrfectthecat I'll be the first new member of #RedZone with @ceelogreen (VIDEO) http://t.co/1tudbjX ... Amazing day with @HankDHaney today!!! There just might be hope for me yet! Also, big thanks to @TaylorMadeGolf for the INCREDIBLE clubs!!! Im sorry but I can't let this tweet slide. C'mon! RT @kingsthings: ...I hate it when I have to put in eye drops... RT @ConanOBrien: Project Runway star Tim Gunn said that he hasn’t had sex in 29 years. I had no idea he was married. Note to self: When attempting to make a scene from a movie or television show \"gritty and cool,\" insert snippet from a Black Keys song. My nick name is official...  http://t.co/TTf3jyfP Capitalizing on people's sadness  should be illegal. I feel like we barely realize the ugly trend that has seemingly taken over the planet. The Lakers look like the fucking LAKERS again baby! That's right.... #lakers I love @paugasol lighting up this dude!  What's his name again? I miss cassettes. Congrats to one of my favorite people and dearest friends @JonahHill on his OSCAR NOMINATION!!! AHHHHHHH! What a trip. Video games have gotten so entertaining that even watching them is fun. Wait a...Um...But..huh? RT @Ninja_Frog55: @adamlevine Good to know! I'll Tweet you when I give a shit. Don't hold your breath on that one... Newt is a Sith Lord. Straight up. I hope youre right RT @alecbaldwin: For a while, I was concerned. But I'm not seeing any GOP entry  in the race that can beat O... RT @iamwill: Showing respect appreciation and love for all the wonderful music and joy #ettajames brought to the world...#ettajamesforever Storage Wars is truly incredible. RT @zachbraff: Let me get this straight; the vampire impregnates the girl who always looks pissed and then the werewolf wants her baby?  ... The sound of the ocean isn't particularly soothing to me. It's a constant reminder of the overpowering potential of nature. #2012 Serious shit happening in the studio...RT @RealWizKhalifa: Me n Adam http://t.co/JCqOf1rl My date will be @jamesbvalentine. The guitar player with mystique. About to attend the Golden Globes for the first time. I'm nominated for best actor EVER. Slow your roll Clippers... #yourestilltheclippers @johnlegend I'm jumping around my living room and screaming \"LA is ours !\" RT @johnlegend: @adamlevine KOBE!! This is Laker Town baby!!!!! Wow. Once again the Lakers have to beat the refs AND the Clippers in order to win. .@1OAKLV was a blast! amazing night. thanks for coming out! The crowd @1OAKLV tonight is epic! So much energy! Thank you to everyone who came out! I can't wait to perform. #vegas Thanks to the people for choosing us !!!!!!!!! Gonna stop by @1OAKLV @TheMirageLV to play a few songs tmrw in VEGAS! dont be a dummy & come down! #shamelesscontractualplugmadepersonable Goodfellas again. Yes please. My dear dear friends in The Remainers have made a totally radical video for their awesome song \"House\"  http://t.co/PwspgqW3 @butchwalker throw your phone in the river. 48 for number 24 and three In a row. #golakers RT @FloydMayweather: Manny Pacquiao I'm calling you out let's fight May 5th and give the world what they want to see. Perdy.  http://t.co/JwCyoFBG Horrible Bosses is #SOFUCKINFUNNY First time being felt up by a TSA. #uncool My dear friend @matthewkfrost aka \"French Matthew\" made a cute/funny little short for Jalouse Magazine:  http://t.co/IEbQCzVX As excited as I am about a trip to outer space on Virgin Galactic, I'm gonna let them iron out the kinks for a few years before I hop on. Hands All Over just went platinum in America!!! Thank you to all of our incredibly loyal and amazing fans for making it happen!!! Woo hoo!!! RT @mollymcnearney: My brother is a doctor & delivered a baby named Y'all-Jealous Jones today. This is not a joke. Y'ALL JEALOUS JONES.  ... @blakeshelton the duck that got away... Dwight Howard needs to wear a laker jersey...he belongs in LA!!! Let's go T WOLVES!!! Miami Heat look scary i must admit. Hopefully this year they can defeat their biggest opponent...#EGO @JBogamil or ...just LA being awesome? @shawnbarton sunblock! Protect that soft skin!!! Haha 75 and sunny in the dead of winter. #LOSANGELES Holy goatee batman!!! RT @SaraBareilles: Uh oh! Old picture blackmail!! @adamlevine http://t.co/Mxl5ZQxH @piersmorgan haha. Next time I will do my circus act! @Lakers looking good. RT @samuelsylvan: Future Lakers!! RT @InsideHoops: Deron Williams and Dwight Howard grab dinner together: http://t.co/YSEZSUux Warrior is the best movie of the year. @GippGoodie that's cold. Too cold. I'll never abandon my purple and gold! #golakers Potential new years resolutions: take more hikes. Start smoking.  Communicate. Enjoy. Share. Kill my own food. Make friends with a Lion. Merry Xmas!!! Especially to all of the LA Jews that celebrate Xmas... RT @maroon5: Our own @PJMORTON just signed a new deal with Young Money Records! Congratulations PJ! No shit. RT @Slate: Statistical evidence that refs actually do show bias towards the home team: http://t.co/x3AScrfD #studies #sports @blakeshelton stay classy San Diego! @blakeshelton I had to take advantage of your drunken state. I think you Bowled a 56. Which is impressively bad. Good work. Happy birthday to @TheRealXtina! I'd also like to thank @blakeshelton for being a terrible bowler. So technically, these \"missions\" are clearly not \"impossible.\" besides, that's a very defeatist attitude for such a difficult job. RT @hellogiggles: The real deal @rozzicrane  http://t.co/z61tLWKS I'll take rings over highlight reels.... @golakers No one should doubt the @Lakers organization. Wise teams know that it's a marathon, not a sprint. Moves will be made. Rings will be won. Returning to social media...Plugging in... RT @Lakers: Kobe on a potential rivalry with @STAPLESCenterLA co-tenants @LAClippers, \"It's about time.\" http://t.co/HtR00eoC RT @OneRepublic: Looking to give a great holiday gift? #GiveAMeal by donating to @FeedingAmerica in the name of a loved one http://t.co/ ... RT @AnneV: Just another billboard... In TIMES SQUARE! Thats just a dream come true! Yay!!! http://t.co/wMoMXP54 Hey guys. I know this sucks. We will make it up to you I can promise that much. Again we are so sorry...gonna go get healthy. :) RT @Slate: Watch an 8-yr-old boy tell Bachmann: \"My mom is gay and she doesn't need fixing\" VIDEO: http://t.co/vmAFWliy via @Slatest RT @GippGoodie: 600 Light Years Away Scientist have found A Twin Planet Twice our size With a Average Temp Of 72 degrees With a Sun We N ... in highschool i always had a severe weakness for smokin' hot girls who drove ford broncos and listened to sublime. #GOLAKERS @PJMORTON smartest decision you've ever made...MYMAN! Just heard that the people behind the  \"don't steal movies\" commercial pirated a song for their ad. #COMEONGUYS @feerods thank god! Now you can STOP TALKING ABOUT HOW MUCH YOU HATE IT! Nice! RT @cscgal620: @adamlevine my a cappella group guacamole sang your song Never Gonna Leave this Bed! http://t.co/q7ejbK2x @carsonjdaly NOPE. @shawnbarton and the more you take... The more you gotta fork over in the end! Haha. Karma. The sweetest bitch of them all!!! 'back to the future' on demand in my hotel in berlin. #STRONG. Dear awesome bands:  It's OK to want to be successful. Don't  sabotage yourselves. Grow a pair and put yourselves out there. RT @edwardjolmos: 400 to go to hit 15,000 for @Waterkeeper The odds are against it, but I know we can do it for clean water! So says @Wa ... Meet the Press is AWESOME. RT @DiaFramps: Hey guys! You can pre order a physical copy of my new album RED, here at @NewburyComics http://t.co/T2o6ufQp. Check it out! RT @edwardjolmos: 13,990, @waterkeeper now were cooking with gas!  \nkeep it up! @sutterink haha... Neti Pot. Get one. It's weird and gross but really works. it's pretty awesome that @TheRealXtina @CeeLoGreen @blakeshelton and myself were all nominated for grammys this year. Go @NBCTheVoice! RT @Lakers: The  full 11-12 schedule will be unveiled Tue., Dec. 6 at 4pm PT on @NBATV RT @kiantech: when will the full schedule be rele ... @totally_tod wow bro. wow. im not sure whether to laugh, cry, or slap you after that joke. RT @Emily_Katz: @adamlevine you're great but the next time I hear stereo hearts or moves like jagger on the radio I might puke #nooffenc ... just started following @edwardjolmos. because what are you gonna do... NOT follow @edwardjolmos? sorry. not an option. #causeherules RT @ONECampaign: Today is World AIDS Day! Join ONE & @joinRED for our live #endofAIDS event w/Bono on @YouTube at 15GMT:\nhttp://t.co/GMN ... RT @yokoono: WAR IS OVER! (If You Want It): http://t.co/2zWZw4Va nominated for a grammy!!!!!!! ahhhhhhhhh!!!!! RT @IntriguingFacts: #IntriguingFacts The most flowers sold in one day in U.S. history was the day after Elvis Presley died in 1977. RT @sutterink: tonight, WEDNESDAY, the SOUP'S NEW NIGHT. GEMMA AND OTTO ON THE SOUP w/ @joelmchale. good clean fun. no cunting allowed. @sutterink @joelmchale please say both please say both please say both.... so proud of my friend @Javstwtr and the amazing journey he is on. so talented. i might have helped a little. but he did it on his own. belief system sweet spot: left of center. join me friends. the water is tepid. I'm categorically opposed to all forms of extremism...too extreme? note to followers: please look up the word \"tad\" in the dictionary before impulsively commenting on my last tweet. liberals would be more effective if they were just a tad more conservative. music brings us to yet another new location. tonight, my friends...we shall rock HELSINKI, FINLAND!!! @AnneV um. YES. First time in St. Petersburg! It's very old school. I like. Fashion.  http://t.co/GRn4C0Z6 @sutterink i too am consumed... geeking out taking photos in front of the clubhouse. You've really brought out the inner groupie in me. Our first official show in Moscow was a massive success! Thank you to all our Russian fans for supporting us! Better late than never!!! RT @MFredric: Support Small Businesses today! #smallbusinesssaturday I'm not sure what i would've done without basketball! I'm so passionate about the sport and I'm happy to see things working out. #golakers NBA!!!!!!!!! Frankfurt airport...Delirious.... RT @maroon5: #ChimesofFreedom salutes @amnesty's 50th Anniversary and life-saving human rights work featuring over 80 artists http://t.c ... I ain't no follow back girl. Yes it's real.  http://t.co/Mrev4HwS RT @rozzicrane: http://t.co/AOQmlRdr Everyone should start following @rozzicrane's career NOW so that they will be able to say they knew about her way back when. Ladies and gentlemen...a glimpse into the FUTURE. RT @rozzicrane: RC Rehearsal Vid: http://t.co/VXJh3hDB http://t.co/VVMwAtZu RT @NBCTheVoice: Don't miss @Javstwtr on @jayleno tonight at 11:35/10:35c. We predict talks of the new album, @adamlevine and life since ... RT @CMilianOfficial: #TheVoice's winner Javier Colon's album \"Come Through For You\" drops tomorrow! And is available for pre-order: http ... For those who know what this is...how AWESOME! I feel like a huge nerd.  http://t.co/7Dtn0Jwk @samuelsylvan @MichaelNLevine @maroon5 dumbasses! :) @MichaelNLevine thanks Mikey! @sutterink na. Car.  Runnin around all day. Boring I know... Wow! Just won our first AMA! What an incredible thing! Thank you AMA giver-outers!!! @OneRepublic I told you to keep that quiet! Shhhhhhhhh!!!!! When it rains in LA people just can't deal with it. It's funny to watch. Fuck you cold. I hate you cold. Get out of my nose cold. I know it doesn't need an endorsement being that it's the number one nasal decongestant and all. But the Neti Pot is miraculous. RT @BigBoi: ZAGGA! RT @GippGoodie: GOODIE MOB TV AIRS DEC 9TH N THE UK ON BBC..CATCH US BABY WE ON A WORLD TOUR...Zagga I've decided that deep down  @blakegriffin is a Laker. NOT a Clipper. RT @StephFarrar: SICK!!!!  RT @kimbramusic: Me & Gotye performing live for @kcrw! http://t.co/PokwtcHn Things are getting biblical on #sonsofanarchy right now. @sutterink is driving us all bat shit crazy. Guys. Im definitely NOT the #sexiestmanalive. Besides, I won't really be attractive until I'm 40. Then I'd like to submit my application. Does Paul Thomas Anderson only make movies with other dudes with 3 names? (John C. Reilly. William H. Macy. Phillip Seymour Hoffman.) Bigtime bugaboo: great movies that insist on using that tired indie  handheld zooming in and out unnecessarily shaky business. @PJMORTON we missed you Mr. Morton!!! RT @siskybusiness: I had a dream that I discovered Banksy's secret identity and it was @AndyMilonakis @jasonsegel that wasn't too lame was it? I didn't really workshop it I just kinda let it fly. Ladies and gents!!! Please welcome  a very talented and very tall friend of mine. @jasonsegel is finally on twitter!!! About effin time!!! @MrTommyLand yessir! RT @jordanrubin: \"We stopped making the style of jeans that fit you perfectly right after you bought your first pair.\" -Every store ever @mrmailbox @ItsBennyBlanco ass ass ass ass ass ass ass ass \"I'm comin' with ya\"  http://t.co/9dkghNzL Bad Boys 2 again. Can't ever turn this one off. #sogood RT @ItsBennyBlanco: @adamlevine @jamesbvalentine @mrmailbox ass asss asss asss asss @jamesbvalentine me too!!!!!! Why don't they make shows like the wonder years anymore? I loved that show. @robdelaney How did you know? #secrets... This man needs YOUR help.  http://t.co/hiSME5oP @JonahHill please tell me you have some kind of sick and twisted outtake animation of the sex tape. #iwannaseeit @carsonjdaly why thank you my friend!!! What an incredible weekend. Next up...#VSfashionshow!!! Trying to figure out which bra and panties to wear. Crazy... http://t.co/8apHrHaP SNL. Wow. Another \"pinch me\" moment. Thank you thank you thank you... Just saw a guy who Looks like the guy who played Webster's dad on Webster. Gotye. An incredible artist who has elevated things and raised the bar. If you don't know about this music yet, you will very soon. @AlecBaldwin for some, a long overdue assault on the greed that has crippled America. For others, an epic rager with lots of liberal chicks. Shooting #SNL is always so much fun!!!!! @ItsBennyBlanco is one of the best storytellers I know. He makes everyone laugh to the point of tears. RT @CeeLoGreen: \"Just cause I'm Paranoid doesn't mean that your not out to get me\" Young Americans Learning how to be #GreaterTogether: http://t.co/mAwQpCl2 #Obama2012 I think I have my Halloween costume for next year. Half ninja turtle, half fashionista. \"Donatello Versace\" eh? Eh? RT @springsteen: Make a difference in the life of ONE child! Join @WhyHunger @HARDROCK & @yokoono at ONE on 11/1/11 & #IMAGINENOHUNGER h ... Holy cow.  http://t.co/KX21Hf2E I love that it's been narrowed down to lance Armstrong or Axl Rose... RT @AlbertBrooks: Happy Halloween. This year I'm just going to hand out razor blades. Too lazy to hide in the candy. RT @richardbranson: Today we welcome #7billion people. What should we be doing to make the world more sustainable? Ideas please http://t ... A clue: My costume requires bike shorts. Some people are so...YUCK. Our Dear friend @JonahHill's hysterical and amazing new show #ALLENGREGORY premieres tonight at 8:30/7:30c on FOX After the Simpsons! Watch! Man. If you see yourself on America's Most Wanted you've gotta be like, \"FUUUUUCK\" Let's face it. \"Adam Levine\" sounds more like the name of a television producer than a dude in a band anyway. I've found my true calling. #Golakers @shawnbarton outer booty. @CeeLoGreen might be the funniest dude on planet earth...#LOVETHISMAN Help save @sutterink's show #SonsofAnarchy and other amazing shows. Check out http://t.co/hPTAPvk5 @shawnbarton jealous! Halloween is gonna rule this year. @AnneV and I have a pretty unbeatable costume. @tinapapa_ if my ego were imaginary, wouldn't that mean I don't actually have an ego? #thinkMcFlythink They've turned backstage at the voice into a trailer park disco! #CANYADIG? Here we go! @NBCTheVoice is almost underway. The circus is officially in town!!! RT @funnyordie: When in Rome, do as the Romans do. When in Joshua Tree, eat some mushrooms & communicate with blanket using your mind. RT @jimmyfallon: Neil Young, Eddie Vedder, Arcade Fire & more - streaming on You Tube in 10 mins. http://t.co/rG53b78k #supportbridgeschool @blakeshelton needs a broader selection on his iPod. You're killin us man! @CeeLoGreen almost made me pee my pants today with laughter... Culver City is cool. But it's geographically isolated from the rest of LA. Location location location. Quote of the day has gotta go to Billy Joel. \"I'd rather laugh with the sinners than cry with the saints...the sinners are much more fun...\" RT @LeoDiCaprio: #SaveTigersNow RT @World_Wildlife: Tragic images from #Zanesville Help\nby signing on to protect captive tigers: http:// ... RT @HuffPostGreen: Global leaders must adapt to climate change, report says http://t.co/7HurIfPR I miss basketball. I want the NBA to be friends again. MUSIC!!!!!!! Had an inspiring meeting with @blakeshelton @CeeLoGreen @TheRealXtina @carsonjdaly and the whole @NBCTheVoice team today. #AMAZIN' Dear Fox News, don't play our music on your evil fucking channel ever again. Thank you. Names that sound alike:  @kelseygrammar and @chelseahandler. On our way to Valencia...listening to early 90's hip hop. #goodshit Headed to dear old dad's new store opening. The new @MFredric...The Patios at Valencia Town Center. Come on down at 7pm!!! I will be there! Every Breath You Take is so good it pisses me off. Screw you Sting! :) Our dear friend Ryan Dusick (original M5 drummer) has produced debut album from a great band called Former Future. Check it out on iTunes! Making some music with the amazing Ryan Tedder of @onerepublic...DANG this stuff is sounding awesome!!! Just saw a plastic bag blowing in the wind...Pretty sure it's NOT the most beautiful thing I've ever seen. \"golf is a good walk spoiled.\" -Mark Twain RT @globalgreenusa: Electric vehicle biggest game changer since horse to gas engine - Henrik Fisker of @fiskerauto at @MilkenInstitute # ... Check this out! Vogue Russia November 2011 http://t.co/FW5kEVUb Even for as huge as Janet Jackson is. I stil feel like her records are underrated. #brilliant Miss You Much. Jimmy Jam. Terry Lewis. #BOOM RT @maroon5: We've been nominated as a Favorite Pop/Rock Band for the #AmericanMusicAwards!!! You can vote for us here: http://t.co/H7I61vsF If only the dorky pre-pubescent teenaged me could have told the future me that id someday play the #VSfashionshow  (P.S. Im still dorky) @Andy_Richter damn you Richter. Damn you... What an inspiring day in the studio. Things are rolling along. New music is coming sooooooooon!!!!!! I want to take all one million of you to Chuck E. Cheese or something... RT @seniorgwarn: @adamlevine 1 millionth follower right here I'm blown away by the fact that 1 MILLION people actually give a damn about what I have to say. Thanks guys!!!!!!!! This song tastes good. I feel like i might be from another planet. A very messy, disorganized planet. Just got some exciting and awesome news that I totally can't share with you all yet...but will very soon... Music music music sleep music music music sleep music... Touche' RT @Audiotist: @adamlevine that was because bridge sections were considered to be \"very '80s\" at the time... Guitar solos following the verse melody was very 90's. Those lazy alt rocker slackers were just too damn lazy to write a proper bridge. It's hard to appreciate being home unless you get a chance to miss it. I'm so happy to be back!!! #CALIFORNIALOVE Wow. That was one of the longest and most memorable tours yet. Once again made possible by your support for what we do. #thankYOU! Home home home!!! I had a dream that I got to sing purple rain with Phish in Vermont and we killed it. The dream was epic enough to be reality... RT @BeanieFeldstein: that awkward moment when the rabbi walks by you and you don't get to kiss the Torah #jewgirlproblems I've never seen anyone look more like Javier Bardem than the dude in this movie. He looks more like Javier Bardem than Javier Bardem does. Just have to chime in and thank everyone for being so sweet and positive on twitter. It lifts me up on a daily basis. :) Lycoming College! Damn what a night! We love you crazy kids! RT @MFredric: I posted a new photo to Facebook http://t.co/RBLgTODd Why hello there shady van parked next to our bus. I peed on it.  http://t.co/YNSrBBSw Damn Chesney leavin' his orange cups on our bus... http://t.co/9ihNj4zW Great talking to Mr. @RyanSeacrest today! Such a good dude and always so supportive of the band. RT @smokey_robinson: Cherish each day friends.  Love ~ Smokey RT @tomhanks: Steve Jobs changed this world. sent from my iPhone. Hanx RT @Kiva: You're invited to a global celebration in 10 cities in honor of @Kiva's 6th Birthday! http://ow.ly/6PrNf @MrbillyB that's fantastic because you can clothe, feed, and shelter people with it. Currently being bugged out by a Seriously trippy disaster movie about crazy shit that I can't entirely understand. RT @jamesbvalentine: Didn't get me a gift yet? Help me raise money for the Pablove foundation here: http://t.co/47MCgpyn everyone please wish our guitar player with mystique @jamesbvalentine a happy happy birthday!!! he's a good man...with GREAT hair. RT @AlexsLemonade: This is Lucy Littlefield. She beat cancer. RT to spread the word so more kids can #beatcancer. http://t.co/RXEkmW2S its pretty hard not to cry when you listen to some of @OfficialAdele's songs. she is overwhelming. @JRCarmichael cop out. I'm a huge fan of the afternoon. And of course night time. But the morning is just...too...I don't even know. The morning hours and I are just NOT friends. Ive never liked the morning. And the morning certainly doesn't like me. in your 20's, it's a hangover. once you hit your 30's it feels more like what it actually is. you are literally just poisoning yourself. system of a down is scary good. if you're not jack nicholson or bob dylan, please refrain from wearing sunglasses at night. thank you. What a lovely thing it is to wake up in Brazil! I just had a date with myself. Sadly, I'm not really interested. But the sex was great. @tatboyd @rozzicrane Mazel! Beg forgiveness...NOT permission... Stop eating cookies. But more importantly, stop talking to yourself via twitter. It's a slippery slope. @bootswallace I'm pretty sure the flight attendant wants to punch me. I keep stealing snacks. Sun chips and Twix for DAYS son! @bootswallace are you tweeting from the plane? Where are you trav? AWESOME RT @VH1: EXCLUSIVE: A Tribe Called Quest unite to reminisce the 20th Anniversary of 'The Low End Theory' http://t.co/Jalltukb RT @AlexsLemonade: #mayihaveyourattentionplease Let's find a cure for #childhoodcancer. Text \"Lemonade\" to 85944 to make a $10 donation. Ok world. You may not know who @rozzicrane is YET. But believe me...you will soon enough. #INCREDIBLE @rozzicrane yes it is. :) Earplugs are my new favorite invention. I like to wear them all the time... Everywhere...unless I'm listening to music. RT @thomaslennon: Eventful is having a contest called: \"A Month of Pinkberry.\" To me that sounded like the #worstchekhovplayever RT @AlexsLemonade: Excited to announce @jimmykimmel as our Master of Ceremonies for our @LALovesAlexs Lemonade on Nov 6! Join us for a d ... Off to Brazil in the morning to play a \"bucket list friendly\" concert. #ROCKINRIO RT @Nick_Giordano: @NikkiSixx  lets get #sonsofanarchy trending Sixx come on pass it on!!! This album is gonna be totally bananas... RT @alexdimitrov: \"We need to make books cool again. If you go home with somebody and they don't have books, don't fuck them.\" John Waters RT @SarahKSilverman: Fun fact:  Cowards aren't always bullies but bullies are always cowards. Watching #SonsofAnarchy season 4. @sutterink is a friggin maniac genius. Everyone needs to get into this show. What a tour. I'm almost shocked to be home. It feels strange. Good strange... Thank you @train @mattnathanson @GavinDeGraw and @PJMORTON for making this tour so incredible. I'm kinda sad it has to end! @HankDHaney headed to the range right now. You've created a MONSTER! RT @JerrySeinfeld: Wolf Blitzer beard.\nGrow it in. Shave it off.\nI don't care. Just do something. Can't take it anymore. RT @sutterink @NikkiSixx: Fucking cool how many people think i should do a guest part on \"Sons of Anarchy\" (cont) http://t.co/yQKsGZFq YES. RT @CeeLoGreen: Now playing: sex packets: digital underground I dont like that when Rapunzel's hair loses it's magical powers it turns from blond to brown. Brown is magical too dammit. Backstage @theellenshow...gettin all prettied up... RT @JillBCS: 6 months cancer free today! Can I get a RT from my all time fav band @adamlevine @JRCarmichael @PJMORTON @jamesbvalentine.. ... Watching my mother throw down at the blackjack table made me smile. Go MOM!!! @AndyMilonakis totally understandable. Vegas!!! RT @KellyR61: @michaelianblack Wow...before I unfollow you for your incredible immaturity, my condolences for the Karma you just bought... @thewhun2be  no. I know other words as well. Like...go fuck yourself... #internetcourage Also...I'd like to let @jtait8789 know that I read her letter...it was lovely. It's inspiring to know that we inspire you. Amazing Friday night concert in Reno. Bittersweet night as our hearts go out to anyone involved in the tragic accident at the air show. Our pre show song tonight is \"can you feel the Iove tonight.\" #LIONKING It's getting to the point where I can't sleep without the gentle rumbling of the bus. Silence has become too LOUD. Morning people piss me off. Shhhhhhhhh... RT @DannyDeVito: Eggplant parm glass vino vid Jon Stewart: even wit a vaca he seems a bit down prob da bullshit gov! it's hard work 2 ma ... RT @Mruff221: Text WATER to 877-877 to join the @WaterDefense mobile action network. Blessings! @starlet4jb amazing!!!!! Eating Oreos and drinking 2%. watching this crazy movie about assasins. Yeah, this might be the best day of my life. #TUPAC RT @VH1: Remembering the legendary Tupac Shakur, on the 15th anniversary of his death: http://t.co/IOunskW #RIP Tupac @Andy_Richter nope. I WISH. Nick Nolte is an inspiring human being. Just finished watching an incredible documentary. I think Tom Waits' biggest influence is Nick Nolte. RT @funnyordie: Life can be a complex & overwhelming experience, so here's a video of a puppy hugging a kitten to take the edge off: htt ... @SarahKSilverman ew. RT @maroon5: 1st annual PLAYING FOR CHANGE DAY is 9/17 http://t.co/geF5vmU \ntxt PLAY to 84465 to donate $10 to music education! @playing ... @PJMORTON POSSIBLE. Over the line m'man! Hahaha @PJMORTON uptempo soulful ballad. BOOM! RT @SarahKSilverman: I'm pretty much done watching actors & actresses pensively looking out windows I'm in a NY state of mind. But physically I'm in Vancouver. i sincerely hope that honoring this day helps us remember that we truly thrive when we set aside our differences and work together. Sending so much love to everyone on a sad but important day to remember. @Andy_Richter ahh I love cryptic, non specific passive aggressive shit talking!!! @rebeccaloebe never. I love that SOB. RT @SaraBareilles: Today I shall do nothing. Today is my bitch. @sutterink RT @lisalx: @adamlevine wow! U weren't kidding about SOA! Been watching since you posted.  The Godfather on bikes! @blakeshelton I hate you. @blakeshelton oh come on shelton. You can do better than that! I expect so much more of you... RT @SI_Swimsuit: What @jimmybuffett fan wouldn’t want to pose with Jimmy’s guitar like @AnneV @BrooklynDDecker and more did? http://t.co ... Finally!!! I thought it would never come!!! http://t.co/tCFnFol RT @bassicblack: I NEED ALL my @HONORSOCIETY fans & ALL my @Maroon5 Fans who support ME, 2go vote for my #BBE artist @AARONCamper NOW~&g ... @jamesbvalentine really flattering photo of me. Thanks buddy. Having a lovely little chat with @jamesbvalentine.  I'm the lead singer. He's the guitar player with mystique... Saskatoon was a shot of life tonight! Crazy energy! Our first time. We will be back! RT @CameronCrowe: Site News - Pearl Jam Twenty Clip: Come Together courtesy of PBS! http://t.co/GjShyMY You all know I don't do \"plugs\". But family always comes first. Im asking my lovely followers to support @Mfredric. Its the family bizz!!! Saskatoonage. RT @GreenBiz: Why Obama is Right on the Money with His (Green) Jobs Speech http://t.co/RFqvQQk @casey_weston watch your mouth kid. :) :) :) Maybe my minimal back pain is the tiny little tax I pay for my incredibly fortunate life? Yeah I will go with that. My back hurts. Am I old? Na. Maybe just exhausted. Shit. Maybe I'm kinda old. I prefer the bus. Planes scare the shit outta me to this day. This is pretty cool.  http://t.co/soxoSMJ Thank you Green Bay! Off to Saskatoon! (awesome name for any geographic location) RT @JRCarmichael: @SJSchampagne Champions have walked here... http://img.ly/8cs6 Write a song better than rich girl and I won't say shit. @JRCarmichael for-eh-vurr....for-eh-vurrr @HartHanson you're so tough. Please don't take my lunch money. RT @AlecBaldwin: Trending WORLDWIDE!!! Not my balls. SCHWEDDY BALLS!!\n\nhttp://t.co/NXox6An If you put cookies and doughnuts in the same room with me. Those poor suckers have no chance of survival. They will be EATEN. Hall and Oates is so great. I dare you to not be happy while listening to them. Winnipeg is one of those words that you're surprised you know how to spell without ever having tried to spell it. Did I spell it right? The problem with being on your \"high horse\" is that getting down off of it can be embarrassing and just plain ugly. Now following...@ddlovato...just saw your tweet. Better late than never! RT @SI_Swimsuit: Anne V is pretty in pink in this @LSPACEswim suit! http://t.co/o69S8Zq (request from @dodjie_d) @Jdphil07 Hahahahahahahahahahahahahahahahahhahahahahahahahahahahhaahahhahahahahahahhahahahahahahahahahahahahhahahahahahahahahhahahahahahahah @droidxi you're probably right. Don't you just hate these liberal left wing hollywood types that just run their mouths? Viable republican candidates must be waiting until 2016. What other explanation could there be for this current crop of serious douchers. RT @Andy_Richter: Why was James Brown so insecure about taking us to the bridge? RT @JennyJohnsonHi5: Sarah Palin said, \"Polls are for strippers.\" Cute. Guess what Grandma? Birth control pills are for teenagers. @SharynBrauns I don't disagree with that. It's totally possible. Stayed away from coffee for 6 weeks. I can't take it anymore. The bitch is back. Feels so good...once it hits your lips... @RedHourBen thank you for this. I too have started following @AlecBaldwin. Gonna try and work stereo hearts into the setlist somehow...very excited! I want to learn the five point palm exploding heart technique. Just so that I know it. Yknow, just in case... Fact: Prostitution is legal in Germany. Germany has recently decided that all prostitutes now need to pay taxes. #taxthatass Just wanna send some love to everyone dealing with an ugly hurricane season... @alessandraTsoto clearly you are insane. Piranha 3D has the courage to be Piranha 3D. This movie is blowing my mind...in the greatest way. Lawrence of Arabia... the Godfather... Piranha 3D... America needs to invent something revolutionary.Or at least lie about inventing something revolutionary and just take the credit. We're due. when a healthy percentage of your fans HATE your \"new direction,\" i can't help but think that must mean we are doing something right. I think that the term \"wife beater\" wins the award for most Widely acceptable unacceptable phrase. In Austin. I now understand where the phrase \"hot as hell\" was born. @jamesbvalentine @azizansari need I say it? The title that needs no explanation...The Wrath of Caan. Boom. #obviousbutstillboom? Hahaha. Wow. Direct message gone bad. And perhaps the shadiest sounding tweet ever. I assure you the contents of the package are legal. @GLockley it's true we've all made mistakes. He's just made much bigger mistakes. And more of them...and on tape. #areyouforreal? It's really too bad Mel Gibson is all \"Jew-Hatey\" because he sure made some kick ass movies. Atlanta was perfect tonight. Thanks to all who came! RT @LeoDiCaprio: This is our last shot. Please help. http://t.co/GPVilex #AB376 #stopsharkfinning #sharks RT @AndyMilonakis: I just willed all of the people who preach \"The Secret\" to go away forever. It really works! Who could eat just one cookie? @jasonjoel how did you know that? GET OUT OF MY HEAD. RT @maroon5: We answered 5 questions from @TheGRAMMYs!!! Watch it all here http://t.co/o64hvyk YESSSS!!! RT @ItsBennyBlanco: CONGRATS TO @jewboogs @Dsilb37 @itsthemaru @yarmovsky @adamlevine and shellback!!!! MANY MORE TO COME!!! RT @ItsBennyBlanco: CONGRATS TO @jewboogs @Dsilb37 @itsthemaru @yarmovsky @adamlevine and shellback!!!! MANY MORE TO COME!!! Wow. #moveslikejagger número UNO on the hot 100!!! WOW!!!! We have the best fans on earth! Thats a fine woman right there...RT @AnneV: I posted pictures of DKNY Fall 2012 campaign on Facebook http://t.co/H4IQGjr Mustard tastes great, but sadly is one of my least favorite colors. Off to Tampa...this is one of those days when rain is romantic. @TomArnold haha. I think @sutterink will keep you alive for a while... I highly recommend watching the first 3 seasons of #SonsofAnarchy so that you can be prepared for my friend @sutterink's sept 6th premiere. @TomArnold you lucky bastard. West Palm Beach...sweaty...hot...sexual... @kngsprincess We do everything we can to offset our carbon footprint and also use varying percentages of bio-diesel fuel for our busses. RT @LeoDiCaprio: Fact: #TarSands oil produces 3x as much carbon pollution as regular crude http://t.co/m7WbScq @mobli #KeystoneXL I remember playing here with @GavinDeGraw and @JasonMraz back in the day. We drank beer in a portable hot tub. #hottubtimemachine? @yutsai it gets better week two I promise. @ItsBennyBlanco unleash the fury!!! Why do all of these vicious hurricanes have such sweet, harmless names? Irene? How could Irene ever hurt anyone? I think I'm the opposite of a \"hoarder\". YES!!! RT @jkpolley: Check this video out -- Nirvana - Lithium (VMA 1992) http://t.co/G1hR1wg via @youtube #vma #rememberwhen? West Palm Beach. I love humidity. Does that make me a weirdo? Exciting news for hardcore #SonsofAnarchy fans. (best show on television) check this out. http://t.co/HYsAHTx RT @PJMORTON: RT @Maestro: Happy Birthday, MJ. RIP http://t.co/ujrDjud @JRCarmichael who are you and what have you done with my friend jesse? I'm so inspired right now. #lovemyjob thanks Kentucky for an incredible night!!! Taken this morning just outside my bedroom.  http://t.co/jtPLDEv Chocolate chip cookies WIN. RT @BastardMachine: L.A. people, you're not allowed to mock Irene panic. Nobody on Twitter has forgotten that Carmageddon bullshit. i may be a pop singer. but every once in a while the angsty teenager in me just blurts out some raw honesty.  it's a reflex. still waiting to have my \"jerry macguire mission statement moment of deep regret...\" not happening. phew! RT @globalgreenusa: RT @mikebloomberg: Video: My latest update on #Irene and what NY’ers should do now to prepare: http://t.co/4cYkxgp ( ... the VMA's. one day a year when MTV pretends to still care about music. I'm drawing a line in the sand. fuck you VMA's. I dreamt I was being chased by a bear through a fancy hotel. I was very ninja like. I got away unharmed. RT @salma_khan: \"A shark swimming in the street in Puerto Rico after #HurricaneIrene hit.\" http://t.co/J7yDR4f RT @JimGaffigan: \"I want to drink a lot of vodka but I also want to look pretentious.\" - Inventor of the Martini. Is the movie Wild things self-consciously campy? Or is it totally for real? Either way I love it. @bootswallace matt made me watch it. I'm in the fetal position sucking my thumb. @cacajuice good question... RT @maroon5: .@adamlevine pulls up to join @BBC_TopGear on Sunday night at 10/9c on the @HistoryChannel! http://t.co/aSpKPIs #moveslikejagger number 1? still? I meant what I said about @maroon5  having the best fans EVER!!! And #stereohearts number 3? INSANITY!!! I really think we have the greatest fans on earth. You guys have been so loyal for SO LONG. We appreciate you more than you know... Syracuse! You guys were epic and amazing and I love you all and holy shit and goodnight... @casey_weston NO. RT @Javstwtr: New England peeps! I'm performing at Mixfest in Boston on Sept 17th. Check below for info and artist lineup!! http://t.co/ ... @ItsBennyBlanco I'm an idiot. It's called \"closer.\"  I knew that. #brainfart @ItsBennyBlanco animal by nine inch nails... RT @mtvnews: Celebrating the legacy of #Oneinamillion singer Aalliyah 10 Years Later http://ow.ly/6cKHN Weather has been very aggressive this summer. I think it's trying to make a point. Maybe we should listen... Just found out we are gonna be a late addition to ROCKINRIO!!! Amazing!!! @mrmailbox now I have a machine gun. Ho...ho...ho... I'd rather laugh than panic. It's much healthier. There's something very \"Roland Emericky\" about all of this. (reference to DC earthquake) Looks like we brought our California earthquake mojo to DC. Oops. Ok. Even GOD is pissed off at Washington now. Happy to have been here for the most freakish earthquake Washington DC has ever seen. @mrmailbox cry me a river mr Whiney pants!!! It's a particularly beautiful day in our nation's capital. D.C.!!! RT @Sarahmbeltran: @adamlevine a 15 year old girl who has terminal cancer has made a bucket list.wish is to trend on Twitter #alicebucke ... RT @jordanrubin: \"Alright, enough with the tickling.\" -Elmo @JRCarmichael me. For sure me. RT @alisonhaislip: ZOMG!!! Almost crashed my car when @Javstwtr's \"Stitch by Stitch\" came on the radio. Huzzah, sir!!!! Detroit. Damn! You guys turned Sunday evening into saturday night! Woo hoo!!! @cindycrittenden aware. Not exempt. Im making observations. NOT judgments. No one's perfect. But apparently you are. Does anyone else feel like tacky behavior has been completely forgiven and almost encouraged by pop culture these days? people who say they are from \"Hollywood\" are CLEARLY not people who were born and raised in Los Angeles. Saw a girl in the crowd tonight who looked EXACTLY like my ex ex ex girlfriend...minus the nose piercing. Rock and Roll is in denial of it's own death. Which of course is extremely \"rock and roll\". So it all works out in the end. I can't understand why anyone would willingly go see a movie like Contagion. Movies like that make me panicky and neurotic. #purell I hope DES MOINES is ready for us. Tonight feels special. I'm all fired up! Yesterday a fan asked me if I used fabric softener. She then proceeded to smell me. It was awkward, but worth sharing... Everyone worked for free tonight in Indianapolis. We have already raised over $350,000 for those affected by the state fair tragedy. AMAZING mini voice reunion hangin with @JeffJenkins88 @casey_weston @blakeshelton and @Miranda_Lambert !!!!!!!! Love those dudes...and dudettes... Wow. Nashville was incredible! FIRE! Sweet dreams Tennessee! We are so thrilled to see #moveslikejagger doing so well! Thanks for the support everyone. Keep it up!!! RT @femailbox: dear work colleague, throw me under the bus and you'll be looking at axle grease so fast, your head will spin. Amateur. I still suck at golf. But at least I suck LESS than last time. #powerofpositivethinking/denial They are of course blowing my comments out of proportion once again. And, like always I stand behind every word I said 100 percent. Hershey, PA! Thank you for your love! And your delicious chocolate! thank you @yutsai for making me look WAY cooler than I actually am... NBA tv showing ALL of Jordan's close out games? Now this is a reason to watch television! What's the use in having a mind if you can't speak it? Watching classic NBA games. Jordan was a MONSTER. Nickelodeon is freaking me out right now. Is this healthy for kids? Make it stop. Please make it stop. Hershey, PA! Home of the massive Hershey's chocolate bar. Gimmee! Did I say I loved golf? I HATE golf. Boston was seriously insane energy! Wow! Thanks so much everyone! BOSTON. It's a gorgeous evening. Let's do this! I unfollowed the Dalai Lama. Just because I think it's funny to unfollow the Dalai Lama. Also he isn't following me. So whatever. RT @GymClassHeroes: Our new video for \"Stereo Hearts\" will be making its small screen debut on @VH1Top20 Countdown tomorrow at 9am! It's ... When I was eleven my dad took me to see Warrant at the Santa Monica Civic. You never forget your first concert. Rest in peace Jani Lane... NYC! Thanks guys! We saw tons of people wearing their #FRIDAYNIGHTWHITES! Which is totally awesome. Thanks! Here we go jones beach! http://t.co/Otnuv2k #FRIDAYNIGHTWHITES RT @maroon5: Famine in Africa has claimed 29,000 children's lives in the past three months. Help @ONECampaign make a difference http://t ... RT @sutterink: apparently speaking one's mind is outrageous, troublesome and self-indulgent. man, this is a town full of silent, terrifi ... NYC! Our home away from home. Jones Beach tomorrow! Woo hoo! Was just listening to the Voice season one highlights. It's amazing. I've grown so fond of all you guys. Congrats. What an incredible ride. Adult film star name: Martin Scores-Easy Debating tip: don't defend someone by slamming someone else. It doesn't work on smart people. #dreamclub: I had a a dream that @maroon5 was convicted of some random crime and sentenced to death by way of trash compactor. RT @TCOB4HumanRghts: I dream that @adamlevine would support the @SavetheChildren East Africa Appeal: bit.ly/nVt23n and donate to @WFP to ... RT @copmystyle: @adamlevine im glad we are on the same page. I dont associate her with politics, i associate her with stupidity Im merely a concerned citizen. I judge people by their character. NOT their politics. If you don't like what I have to say...then change the channel. The scariest thing about peoples responses to my Bachmann comment is that they associate her with politics. this message was endorsed by @MikePosner Hahahahahahahahha RT @PS_ItsMaddie: @adamlevine  That's preposterous! She has excellent views on politics and she has actual common sense. @MikePosner that's a terrifying visual. It will haunt my dreams for years to come. @RyanDWinn I'm crushed. Michelle Bachmann makes me want to throw up in my mouth a little. Saratoga Springs! Thank you for your hospitality...what a crowd! Starting to think that maybe the Mayans are right. Still kinda hoping they aren't. I definitely care about what people think...but only a little... Some might view my constant nudity as tacky...dare I say even douchey...I get it. But I just can't help it. Its a compulsion. Can't wait to go see rise of the...apes.. The planet of the...apes...rising...fuck. You know which one I mean. RT @globalgreenusa: RT @daphnezuniga...Ray Anderson, you were a hero, may more CEOs take environmental responsibility for their corporat ... Please send your love to @gavindegraw tonight.  We love you buddy. Get well and get back out here! Tuna melt. Probably the greatest invention. Makes pb and j look like a little bitch. RT @johnnypemberton: watching the prequel to Intervention, it's called Toddlers and Tiaras. Great show at Foxwoods tonight. Headed to Saratoga for a day off... RT @chaos107: @adamlevine  I have seen u2 28x and The police 10x tonight was the best concert I've ever been too! Seen you guys 10x toni ... @ItsBennyBlanco oh SHIT! @ItsBennyBlanco N64? Weren't you 6 when that shit came out? RT @nickkroll: I just tried to get into google+ but they told me that I was with too many dudes. Check out this menacingly beautiful steel mill... http://lockerz.com/s/127247312 It's nice to know that technically we can NEVER qualify as one hit wonders... Damn! What a night! I'm happy Philly and Jersey were able to get along!!! Thanks everyone! Lady Gaga has named her fans after an 80s movie starring fred savage and howie mandel. #FRIDAYNIGHTWHITES Here we go Jersey/Philly...(technically jersey but basically philly) #FRIDAYNIGHTWHITES tonight in Philly! Wear your Friday night best! Today show was awesome. One of our best television performances yet. Now off to Philly! Lemme get a cheesesteak!!! RT @jimmykimmel: I feel so dumb.  Did anyone else think they were called ice cream COMBS? Holy shit. #moveslikejagger number 3 on iTunes! Go baby go! VB! What a massive crowd! And thanks for sticking through the rain! How glorious it was watching the steam rise! Best night of the tour so far. Thanks for an incredible night Charlotte, NC!!! Man i sure do miss my buddy @CeeLoGreen... I'm an executive producer who likes golf. I'm officially my own worst enemy. I can't tell if I'm breaking the mold or fitting right into it. Either way...I love my life. That's right.  http://lockerz.com/s/125717801 What a show! Thank you Mt. Pleasant! RT @LonoBrazil: Oprah Makes: $315,000,000/yr. $26,000,000/mth. $6,000,000/wk. $850,000/day. $35,000/hr. $600/minute. $10/sec.\n\nSHE'S A B ... Wow RT @bassicblack: @JRCarmichael @jamesbvalentine @pjmorton http://t.co/jRgKaOJ #love is extremely complex and shouldn't be oversimplified...Unless you're in The Beatles. Is #LOVE really ALL you need? I can't help but think that this list of \"necessities\" must be at least a tiny bit longer. All you need is #love.........and food. RT @JRCarmichael: How quickly could #LOVE start to trend? RT @adamlevine RT @JRCarmichael: Just learned about @Emilykingmusic Check out her sick new EP http://emilyking.bandcamp.com/album/the-seven-ep Victor Maitlin is in 'The Tourist.' Clearly whoever made this movie has great taste in Villains. First 18 holes of golf = embarrassing score. RED ROCKS! Incredible epic-ness! Thank you guys so much. Freedom.  http://lockerz.com/s/124491403 Newt. I can't believe we have to hear from Newt again. REPUBLICANS don't even care about Newt. Our government is starting to remind of the record buisiness. Which is a very very bad sign. Could Boehner at least try to look less like a Villain from Robo Cop? I feel even worse for the poor vagina that would have to deal with a 4 hour boner. It just doesn't seem right. A 4 hour erection sounds painful and downright terrifying. I'm gonna try and stay away from Cialis until I'm about 90. RT @NBCTheVoice: What a night! Beverly rocking in a kilt, Nakia belting to the rafters, Javier making us all melt. Vegas, prepare to be  ... Thank you Albuquerque!!!! You kicked tons of ass and made it really special tonight... #sharkweek. My favorite week of the year. 'nuff said. RT @justinbieber: http://t.co/nF9Y9Ms - #proudday #showyourhearts RT @maroon5: .@adamlevine's interview with @piersmorgan will now air TONIGHT on @cnn at 9PM ET/6PM PT! http://t.co/goUmU4x New Mexico is OBSESSED with turquoise. Albuquerque? Is that really how you spell it? Wow. It's like I've never seen that word before. \"Meetings\" are for grownups. I truly appreciate Fabio's work ethic. Wow. What a night. I'm speechless. And Its hard to shut me up. RT @SoundGuySteve: legendary venue, legendary special guest... it's going to be a good night at the Hollywood Bowl RT @JRCarmichael: Hollywood Bowl 1926 http://img.ly/6DPC We have a couple of big suprises at the Hollywood Bowl tonight! Some seriously special guests... I've gotta admit, Id like to try an adult diaper just once. Yknow just hang out on the couch and just...let it go. Shit. I forgot metamucil! And depends! Just stocked up on Epsom Salts and Multi-vitamins. I feel like a 75 year old. #notrockandroll I can't believe that the next time we take the stage, it will be in front of a sold out crowd at the Hollywood Bowl. #dream RT @AnneV: @adamlevine things r getting freaky on the road  http://lockerz.com/s/123173516 @AnneV and @mrmailbox are looking me like I'm a crazy person as I recite my awful sounding vocal warmups. Amy Winehouse inspired me and millions of others. I can't believe she's gone. Not very indie for IFC to have commercials during their movies. Watching an Elvis movie. Definitely a few interesting wardrobe choices. But it's Elvis. That bastard could get away with anything. RT @JRCarmichael: Have u ever seen anything more comfortable looking? Here's @jamesbvalentine in his new @onepiece relaxation suit #want ... RT @bassicblack: AMAZING 1st show 2nite 4my dudes @Maroon5. Our HardWork pAid off! Tour is gonna b AwSome! Now Headed Out on redEye. U S ... Thank you San Diego! What an amazing first night! WOW! Friday nights on this tour will be called \"Friday Night Whites.\" we will be wearing all white and encourage @maroon5 fans to do the same! @alisonhaislip I want one! Tomorrow marks the beginning of an amazing summer tour with @train! Get ready AMERICA! Hey guys, #thevoicetour kicks off on Wed. Don’t miss @Javstwtr, @casey_weston and the other top finalists from the show LIVE in your town! Just got to chula vista. Seeing your new stage for the first time is like christmas morning! It makes me smile to see @blakeshelton's album debut at number one! Way to go big country! RT @AlfredoFlores: Sometimes I wish real world conversations had a 140 character limit. Just saw a rough cut of #moveslikejagger ! Such a fun video. Can't wait for you guys to see!!! Halloween is more about your commitment to the costume than the costume itself. I take this shit really seriously. Hung out with a charming Englishman named @piersmorgan the other day. It airs Monday, July 25th at 9 pm eastern. Pretty sweet! Carmageddon was intense. Lets all put our heads together so we can start picking up the pieces. #STUPID RT @mrmailbox: What. The fuck. Is juice? Somebody just farted. And by somebody I mean the guy next to me. And by the guy next to me I mean @feerods. @JRCarmichael nope. Yup. Everyone back off of my boy @joshgummersall . He had no intention of bludgeoning the poor rabbit with a golf ball. It was just his time. Golf was amazing. However we must say a prayer for the poor bunny rabbit that got in @joshgummersall 's way. RIP little buddy. :( Good times with @mrmailbox @feerods and @joshgummersall !!! An epic day and evening in the making. Starting with GOLF. Shit. @CeeLoGreen oh sheeeeeeit!!! The only time I support fear based propaganda is for things like y2k and Carmageddon. That shit works. @JimmieJohnson you got it! Singing lessons for driving lessons? Say the word! 50 piece Chicken McNuggets for 9.99? I'm gonna go ahead and file that under \"shit the world doesn't need...ever...under any circumstances\" I think I want to throw a tailgate party for Carmageddon. Meet me at the 405 tomorrow. Let's party. I've decided I'd like to become a racecar driver. Ok? @sutterink you DO deserve Emmys. You DO deserve to be included. And you most definitely ARE a cunt. @AnneV i AM! @blakeshelton Just sent me this photo. Because he is a sick, Childish human being...just like me.  http://lockerz.com/s/119919203 Only lame thing about golf is the fact that dressing like a goober is required at all times... Golfing with @mrmailbox @feerods and Te Te. It's basically yoga. @feerods I might be the next Jack Nicholson... Just tried golf. Not gonna lie. It's totally awesome. Good morning world. Waking up to Lauryn Hill is never a bad thing. Febreeze doesnt make shit smell good. It's makes shit smell like someone sprayed febreeze on shit. Watching the making of Steeley Dan's epic classic 'Aja.' remember when people were musicians? @bassicblack Yessir. What a gorgeous day in LA. Wow. RT @DalaiLama: Love, compassion and concern for others are real sources of happiness. And by dogs I mean my actual dogs. Not my \"dawgs.\" Watching 'Old School' with my dogs. I'm not sure I've ever had this much fun...EVER. @blakeshelton you've abandoned me Shelton. I had to move on. Lewis Black is my hero. @alicia_brooke happy birthday to our wonderful longtime fan! I just can't imagine @blakeshelton in The big apple. It feels like a real life version of Crocodile Dundee. Wow. @PJMORTON how crazy is this tour? #bananas And so it begins. Rehearsal for summer tour. I love my job! Actual conversation thread.  http://lockerz.com/s/118436562 Just wrapped #moveslikejagger video. Its outrageous and amazing! Video shoot is AWESOME so far. Androgyny all over the place! RT @NikkiSixx: I hate phoners. RT @Slate: We're approaching 200,000 followers. Help us get over the hump with a #FF if you can. Thanks!! @mrmailbox Dude don't ruin it! (just kidding not possible) So proud of @Javstwtr killing on the tonight show! Go Jav Go! Seriously, if I didnt have @HowardStern on heavy rotation in my car, I'd probably lose my mind. I LOVE traffic. Making a video for #moveslikejagger with @TheRealXtina tomorrow! And the legendary Jonas Akerlund is directing! A day in review: I was a cranky pain in the ass. #doover I said sometimes. Calm the F down. I still love music. Duh. Sometimes silence is so much better than music. RT @JRCarmichael: Mickey just asked me to tweet this... Let's donate now if we can http://www.unhcr.org/emergency/somalia/global_landing ... Happy birthday @beverlyshane ! One of the coolest ladies I know. RT @Nakia: Can we all wish my baby, @BeverlyShane a happy birthday?? I love you girl! See ya soon! When people complain about \"paparazzi\" I wanna slap them in the face. You signed up for this dipshits. Buck up. #caviarproblems Feeling...inadequate. I mean, who wouldn't?  http://lockerz.com/s/117623143 Tuesday with no @NBCTheVoice is like pb with no j. Does anyone have any fireworks? I'm fresh out. Happy 4th! Yeeeeeeee hawwwwwww!!!!! Again we are so sorry about this. Unfortunately it was completely out of our control. We owe you one St. Louis. @PJMORTON can i sing heavy? RT @jamesbvalentine: Sorry guys, the weather usually cooperates with us. We really feel for everyone who came out to try and see us toda ... @SoundGuySteve does hooters have a stage? apparently its next door. i know they at least have a roof. we could play there for free beer. just watched the local news report that fair st louis has been cancelled due to weather. im so sorry guys. this SUCKS. @SoundGuySteve that isnt a good sign. whats the deal over there? RT @JRCarmichael: My cousin's daughter posting love notes onto Adam's arm as we pray for clear skies in St. Louis! http://img.ly/5Pbk @jamesbvalentine yes! @jamesbvalentine James if you want to play naked twister with me, just ask. @SoundGuySteve is it on or off? Being royalty must be painfully boring. I bet they never do anything cool... like play naked twister. Not sure about the show yet. Just want to let you all know that it's not our call. :( we will keep you posted. Crazy thunder and lightning in St. Louis. Sounds like God is NOT in the mood to hear @maroon5 tonight. Wow. It's hot as shit in STL. Gonna be a sweaty one tonight. Bring water and as little clothing as possible! RT @ders808: Hey EVERYONE on Twitter, it's \"you're.\" Well. The bus Isnt moving anymore. Which probably means we are in St Louis... RT @nickkroll: Hey I think my standup special #ThankYouVeryCool is re-airing at 11am today on comedy central. RT @zaw08: @adamlevine do you believe with fairies? Wow. we have the most supportive and amazing fans. This whole touring band thing doesn't work without you! We love you More than you know! @ExoGeorgia DUH. @Nara4Peace boxer briefs @Martolinsss making a video next week!!! @MGuzman09 caution: I might be looking at you but not necessarily listening to you. @ChRiStInAlove24 that's all it would take? DONE! @miasara_ confusing. Amazing. @TheLilAmberC that has been a dream of mine since I was a kid. I'm beyond excited! @Sumzi \"As\" by Stevie Wonder. @Franklinmartee everything. @nicolee_94 best place to sing is in the shower. It makes everything sound like Motown. @HeatherAllStar ET @salenaphernelia don't like. I LOVE @thelonelyisland @jackwillshare19 usually the Beatles fixes me right up. @taylaaapee_ hopefully soon. I love me some @CeeLoGreen ! @LuvinKendallBTR im not a terrible drummer. @CacklingMelLee HOME RT @joanagracia: @adamlevine  Whats a Jagger? I've been singing the song like crazy, but I have NO IDEA what a Jagger is? @fuckyeahsmile goonies. again. @sheislov3 Vern Troyer. @adnilemeus I'd be a spy. For sure a spy. Or a pirate. @Sumzi I hate them all. (just kidding) @joshmtennis basketball. Hands down. @JRyanReichel usually when I can't sleep. When I'm alone and vulnerable. @Yotesgurl being a part of that show inspires me on a daily basis. @P0NDWATER I admire the courage it takes to wear a mustache. @just1kelli en route to St. Louis! @miss_popcouture I'd sing with @Javstwtr anytime. He is incredible and I think we sound good together! @YoGirlLilJ fruity pebbles. Ok. Late night bus ride q and a...ready? GO! @JRCarmichael best movie ever. Best crowd ever. Why am I tweeting you you're sitting right next to me. I hope you all had as much as we did at #summerfest! I will never forget this one. Seriously incredible experience...THANK YOU! @natmeshbesher tell em to pay up! @VicciMartinez hell yeah! Glad you dig! @alisonhaislip this explains SO much. Smurfette is kinda slutty. But I guess it's hard not to be when you're the only female smurf. @blakeshelton im having @NBCTheVoice withdrawals! this tweet is why I love @CeeLoGreen . Only he can say that. Ok Ravinia...time for round two! We are backstage preparing. And by preparing I mean drinking smoothies and being nerds. @mtvnews says that #moveslikejagger is their summer jam. I concur MTV. I concur. @sutterink thank you sir! Put your incredible show back on TV please. RT @SarahKSilverman: Saying something is douchey is now officially douchey.  \n\nAnd I \nam lost Played Ravinia tonight! Amazing crowd! Thank you guys so much! see you again tomorrow! Tonight @PJMORTON is opening for @maroon5 ! So, @PJMORTON is kinda opening for @PJMORTON That was the best highschool party I've ever been to. Oh wait...it was the awesome @NBCTheVoice afterparty... #EPIC I'm so overwhelmed. So much love to @Javstwtr ... congrats to @DiaFramps @beverlyshane and @VicciMartinez ! What a night. Here we go. #shit! My mind was just blown wide open. Tears everywhere... Wow. I'm nervous. And I don't get nervous. It warms my heart to see @DiaFramps and @Javstwtr occupying the top two slots on iTunes. Crazy. Yoga. RT @Nakia: Hell to the yes! @rebeccaloebe from @adamlevine's team on @NBCTheVoice has a new song on iTunes today! http://t.co/ywrhI5j #d ... Goodnight. Mentally exhausted. Vote for @Javstwtr !!! Sweet dreams people... RT @Javstwtr: You can still vote until 10amEST. By calling 855.864.2301,\nby voting online at http://t.co/7LCkON7 or download my song htt ... RT @JanetMarie333: @TeamAdaam @adamlevine @Javstwtr we have to get stitch by stitch to number 1 now!  Who's helping? @justinbieber thank you kind sir! @Javstwtr killed it! Vote America vote!!!! Check out @Javstwtr and @casey_weston on tour this summer!  #thevoicetour What are you doing? Hopefully voting for @Javstwtr !!! Do it! @blakeshelton What is this? The Voice? Or \"Boner Jamz?\" #theVoiceFinale is today!!! #teamjavier @Javstwtr !!! RT @XtinaTeam: Great that most of you are tweeting #TheVoiceFinale! Those of who aren't tweeting it, hop on board! We're attempting to t ... Two of my best friends convinced @milodecruz that there was a \"ninja store\" at the grove. He actually bought it. #sucker Everybody get ready to vote for my man @Javstwtr tomorrow on @NBCTheVoice !!! Its gonna be quite a day!!! @casey_weston I heard! I miss you Casey! I dont have anyone to argue with anymore! :) @chaarmaine it's a good sentiment. And he's a good kid. #pissoff @VicciMartinez attagirl! RT @justinbieber: #payitforward RT @LeoDiCaprio: RT @NRDC Live in LA? Call Sen. Padilla & ask him 2 support ban on #shark fins. He may be deciding vote on #AB376: 916-6 ... @scooterbraun LOVE IT!  Oh and Now that you're in my town it's time to hoop. @justinbieber when are we getting back on the basketball court? #saytheword Seeing #moveslikejagger at number 2 just doesn't make sense. Let's change that! It's so hard not to spoil the surprises for this up coming week on @NBCTheVoice ! It's gonna be insanity! Go @Javstwtr !!! @BrookeDulien third street promenade was my jam when I was 15. Back when it was shady and AWESOME. Sunday afternoon...#DIG Watching the beginning of the much music awards...this is some end of days shit... Working with the @ONLY1DARKCHILD and @Javstwtr on some amazingness! Nine years ago today we released our first record. What an incredible trip it's been. Wow. It feels like summer. Finally! #westcoast I wish I could have stayed lost in the mountains a bit longer. RT @jailynpr: 5 more days until @Javstwtr wins @NBCTheVoice !!!!! Can't wait!! @TeamAdaam @TeamJavier @adamlevine RT @JRCarmichael: Just visited our old childhood camp French Woods with @adamlevine. Best place ever. Jammed with the music kids... EPIC ... RT @CAguileraHUN: Moves Like Jagger just hit #1 on the OVERALL WORLD CHART! http://i54.tinypic.com/xl9mj7.jpg @AguileraOnline @XtinaNews Just visited my childhood summer camp. French Woods Festival of the Performing Arts. This place changed my life. Inspiring day. Just had epic pizza at a place called Little Italy In Hancock NY...if youre ever in the neighborhood. Check it out! Just watched black swan with no volume. It was a unique experience. Good evening NYC! @Baseball141414 I do sometimes. It just gets a little overwhelming so I've gotta pick my spots! @SoundGuySteve thanks buddy! @nickkroll oh and that really was so fun and awesome. @nickkroll  Follow me. Dick. :) totally kidding. (Not really kidding) @ConanOBrien was awesome! Thank you for having me kind sir. Everyone giving love to @Javstwtr ??? He will prevail! @TeamAdaam baby!!! #moveslikejagger is stuck in MY head. It's twistedly catchy. I apologize. Gonna be on @ConanOBrien tonight. Good times. (i lack the courage to spell timez with a z) @JonahHill pretty sure goody ain't got shit. RT @Just_a_Drop: Hey guys who wants a follow let's get #dirtywaterkills trending!! About to shoot a video for #stereohearts ! So excited about this song! @casey_weston casey you are so talented. I'm so proud of you darlin'! #moveslikejagger  number one baby! You guys are the greatest!!! Wow. That was an incredible show. I'm so overwhelmed I'm not sure what to say. Here we go...@NBCTheVoice . You all look lovely tonight! Cee Lo is \"vogue\"-ing  http://lockerz.com/s/113201230 @AlfredoFlores yeah!!! Thanks bud! #moveslikejagger so close to número UNO!!!!!! Come on people! I just bought it twice. Its all love all over the place here on @NBCTheVoice today! Watching @CeeLoGreen rehearse. There's nobody on planet earth quite like this man. #DIG No disrespect intended for @adamlambert ...I honesty had never heard the song before. I'm not one to take cheap shots like that. RT @maroon5: If you missed #moveslikejagger featuring @TheRealXtina last night on @NBCTheVoice you can watch here! http://t.co/ogjKXx0 I'm so proud to be part of a show that is actually impacting the music industry in a genuine way. #OVERWHELMED I promised @TheRealXtina that #moveslikejagger would go number one at iTunes. Help us do it so she doesn't punch me! Holy iTunes batman! #thevoice #moveslikejagger !!!! Ahhhhhh!!!! I had honestly never heard that song before. I thought that @nakia made me like a song that would have otherwise fallen flat. I'm NOT sorry. Wow. @NBCTheVoice was a LOT more intense than I thought it would be. RT @MarkBurnettTV: #TheVoice artists have grown so much. @TheRealXtina, @AdamLevine, @CeeLoGreen and @BlakeShelton have done a great job ... Man that was tough. I hope @JeffJenkins88 and @DcBarleyy know how special they are to me...I love you guys. hey @blakeshelton and @CeeLoGreen , what the hell are we doing here? RT @jamesbvalentine: Everyone look out for my new competing single, \"Riffs akin to Richards.\" #moveslikejagger RT @justinbieber: #MAKEACHANGE #SCHOOLS4ALL - http://t.co/DojsqXC It's the most beautiful day of the year so far. Taking one of those deep breaths and appreciating all that I have. #gratitude Everyone is feeling #moveslikejagger !!! This makes me extremely happy!!! @justinbieber haha. I like your competitive spirit! @PJMORTON and I are ready anytime! Just wanted to wish @casey_weston @JeffJenkins88 @Javstwtr and @DcBarleyy good luck tomorrow. Im so proud of everyone. I hate this part. Thank you @jimmykimmel for having me. You kick tons of ass. Just rehearsed with @TheRealXtina . Gonna be ridiculous!!! Stopping by @jimmykimmel tonight! excited for the rest of @maroon5 to check out @NBCTheVoice on tuesday! it feels almost like a second living room. Watching the most awkward movie I've ever seen in my life. The Disney Channel is freaking me out right now. Happy fathers day!!! Happy birthday @scooterbraun ...good times last night. I really really really really want this plane to take off now please. RT @questlove: RIP Clarence Clemons. A True Legend. Will be absolutely missed. Maybe not old. Just not that young. I hurt my back on stage for the first time. Wow. I guess that means I'm old now. @casey_weston they did. It was a big mess. I hope she finds it. Her husband or husband to be looks PISSED. San Fran. Dig it. A brief but exciting journey...a woman just waved to us  from her car and her wedding ring flew off into the street. I've gotta stop tweeting DM's as normal tweets. I feel like the grandfather who talks to the answering machine. Motley Crüe in Vegas tomorrow. How could I possibly justify not going? RT @TheRemainers: The Remainers are @kroq finalists!  Please click here and \"like\" our profile. You might even learn something. http://t ... RT @hypebeast: Moneyball Trailer featuring Brad Pitt & Jonah Hill http://bit.ly/luEjy4 has anyone realized that Westside Story basically invented \"breakdance fighting?\" Had a great day working with @TeamAdaam ...Once again everyone continues to amaze me! ET was cooler cause he was a chill hippie botanist. This guy was abused by the military and understandably PISSED off at \"humans.\" Super 8 was cool. A straight ET jack. But cool. And I like that kids are cussing in movies again. EPIC.  http://lockerz.com/s/110952759 Jealous...RT @CeeLoGreen: @NikkiSixx NIKKI thanks so much letting me rock with the crue!!!! A fan for life bro Did you catch my team tonight, vote for your favorite by downloading their songs @iTunesMusic #thevoice http://tw.itunes.com/fYL So proud of everyone! @casey_weston @Javstwtr @JeffJenkins88 and @DcBarleyy exceeded all expectations. Wow!!! Here we go @casey_weston !!! Kill it! RT @NBCTheVoice: Overheard: @Casey_Weston says to @TayTorThompson - \"that performance was so amazing, I haven't been as entertained, sin ... RT @GymClassHeroes: Our new single \"Stereo Hearts\" feat. @AdamLevine is out on @iTunesMusic today! Get it here: http://t.co/fHMxs5E #PCCII @casey_weston if you bring the same energy to the live performance you will be unstoppable! @casey_weston you were so good Casey. You have nothing to worry about. I'm so proud of you! At the dress rehearsals for @NBCTheVoice ...Insanity! Leno was great. Pulling up to rehearse with @TeamAdaam ! #thebestteam Congrats to the Dallas Mavericks. You guys deserved this one. #NOHEAT @HartHanson im pretty sure Russia. But who knows? I'm pretty jet lagged these days. Heard Fat Joe lost 88 pounds. Now he's more like,  \"Average\" Joe. Get it? Get it? #I'llbehereallweek Wow. So, I'm currently in Moscow, Vegas, AND Los Angeles simultaneously. Although technically I'm just in Moscow. It's complicated. Watching get him to the Greek. I LOVE this movie. And @iamdiddy is friggin' hysterical in it. Really excited about Stereo Hearts. And everyone seems to be loving it! @ItsBennyBlanco men who got them before they were deemed \"tramp stamps\"...poor bastards. Here we go Las Vegas. Be kind. Please be kind. #imscared It's funny when the losing team states the obvious. \"they scored more points. They made more baskets. They played better defense.\" #NOSHIT RT @Kurt_Vonnegut: Enjoy the little things in life, for one day you'll look back and realize they were big things. Great day hanging with @TeamAdaam ...I really love these guys! Go see @rozzicrane at the Hotel Cafe in Los Angeles. Tonight at 7pm. Just trust me... Actually. Now i kinda want to see the new Xmen movie. I mean. I love showtunes. But I'm not a tough mutant with metal claws and a dark past. That being said. Hugh Jackman. I mean...is there ANYTHING this guy can't do? Seriously folks. Kinda just dont care about Xmen anymore. I think it was more effective before we found out that Wolverine was SUUUUPER down with showtunes. Watching some terrible action movie with lots of gratuitous nudity, guns, and no discernible plot...in other words...it's AWESOME. @CeeLoGreen that looks like the DeathStar! @TeamAdaam is preparing for an incredible show! I'm lucky to be working with @JeffJenkins88 @Javstwtr @casey_weston and @DcBarleyy @1NatalieMaines I love that you love the show! RT @maroon5: You can help clean the oceans with one word: REFUSE.  #worldoceanday @plasticpollutes http://bit.ly/khZlji @AlfredoFlores as the great Miles Davis once said \"there are no mistakes\"... @NBCTheVoice don't worry @JeffJenkins88 ...we will... im so proud of everyone who performed on @NBCTheVoice tonight. all \"teams\" aside. you guys did an amazing job.  congrats! @Javstwtr @teamadaam you know this! I flubbed a note during the guitar solo. Who cares it was mostly awesome. What a night...wow. We have a lot of work to do...so inspired... @blakeshelton mimes? Mimes? Cmon man. Seriously. @TeamAdaam has a lot of work to do. These performances are definitely raising the bar... This is so much fun! The energy is really special!  http://lockerz.com/s/108677713 It's official...we are LIVE! @TeamAdaam is in the building! #fashionforward  http://lockerz.com/s/108619881 Big day today! Some exciting surprises tonight on @NBCTheVoice ...good things...very good things... RT @javierdunn: Happy 13, Katie! RT @Maroon5Lover222: Today is my 13th birthday and it would mean the world to me if you could at least  ... RT @milodecruz: Skylar Grey #dancewithoutyou Free Download @SkylarGrey http://t.co/qE9wnPR These clouds are bullshit. Press day. Morning shows across America will get to witness first hand how bitchy I am in the morning. Goonies. One of the best movies ever. Not an opinion. #FACT Shit. Go MAVS. No HEAT. Such a sweetheart ain't he?  http://lockerz.com/s/108053685 @NBCTheVoice or do you have a burning sensation when you urinate? Wow. Ive got some pretty amazing friends. I'm a lucky, lucky man... Home sweet home. Now it's time to focus on @TeamAdaam ! @NBCTheVoice here we come! http://twitvid.com/8PSKC - Venice!!! Even more beautiful than I had imagined!!! Gorgeouso...(made up Italian word)  http://lockerz.com/s/107023186 Awesome singer make out sesh tonight on @NBCTheVoice ! RT @bassicblack: WHat an @NBCTheVoice SHow 2nite! Everyone please Follow ALL of #TEAMADAM , our Advisor @bassicblack , and Super Coach @ ... one of my favorite songs. @caseydesmond & jeff jenkins did it justice. thanks for taking my guidance and singing (cont) http://tl.gd/aqjkkr @blakeshelton welcome to my town Big Country! Then off to Venice beach where I will resume my secret life as a public weight lifter and part time bike short wearing rollerblader. After a mini LA tease I'm off to Venice, Italy...where I shall resume the other half of my double life as a government spy. (I WISH) RT @SethMacFarlane: It's a sad comment on the sluggish pace of American technology that in 2011 we're keeping our convicts behind bars i ... my stomach is PISSED about something. it wont shut up. Only thing missing tonight was @AnneV ... Prince time. RT @NBCTheVoice: And here we have yet another teaser from the final battle round, airing Tuesday at 10/9c.  Pssst a \"crush\" is revealed. ... Gene Hong has been properly bombarded with Facebook requests following my speech in Korea... @NikkiSixx yup. Over the line. WAY over the line! @natashabrooks22 yup. @gahmer1 way better idea than suits... Good morning LA! I seriously love the shit outta you... @TomArnold Brentwood nightlife? sounds like an oxymoron!!! When I turn 60 I'm gonna start wearing suits every day... Today is perfect. Cursing is not a bad thing. It's a passionate way of expressing emotion...Sometimes there IS no substitute. Home sweet fuckin HOME!!!! @SoundGuySteve I dont like this kind of talk moustachio...knock it off I never thought I'd utter these words...but...go MAVS. They beat my @lakers but I can't support a Heat championship. #BESTCOAST #LOSANGELES @AlfredoFlores yeah man. I'm \"double featuring\" those two!!! What an incredible tour. 17 countries in 8 weeks! And some really incredible shows for some truly unforgettable fans. WE LOVE YOU!!! Thank you so much for a great tour and see everyone this summer! It's the last #ALvideooftheday http://www.twitvid.com/ONT4Z What?  http://lockerz.com/s/104882718 Last show of Asia tour tonight in Busan, South Korea ...thanks to all of our amazingly passionate fans in Asia. We will never forget you! @rozzicrane welcome to my world! @milodecruz and a whole lot nerdier... Mickey Madden = Marilyn Monroe?!? #ALvideooftheday http://www.twitvid.com/IYZYT I love seeing how @NBCTheVoice has brought people together and inspired new friendships. Coaches and contestants alike... #mymushyside RT @CLinehan21: @adamlevine please retweet for my fellow Missourians. Text REDCROSS to 90999 to make a $10 donation to Joplin tornado fund. watch @NBCTheVoice tonight! it was a tough one. the toughest for me yet... Proud of @rebeccaloebe & Devon for making it their own. rebecca don't stop. ur incredibly talented in a unique and beautiful way. #TheVoice sometimes the chairs on @NBCTheVoice make me feel a little bit like  @AlbertBrooks in 'Defending Your Life. ' RT @AlbertBrooks: Did you ever dream about insomnia? All night I dreamt about not being able to sleep.  Weird. @blakeshelton im comin home soon big country. i know its been difficult without me... @blakeshelton not sure. i think im in korea. i sincerely hope my citizenship hasnt been revoked as i am extremely excited for my return. @blakeshelton do i need to bother with the \"foxworthy-ness\" of this particular tweet? ive developed this weird habit of compulsively eating mini bar snacks. today its combos and gummy bears. YUCK/YUM. RT @LilButterfly35: @jamesbvalentine Not only Missouri but also Minnesota, they were hit too Our hearts go out to everyone suffering in Joplin. We will all do what we can to help... Headed to Seoul for our first Korea show! Korean BBQ for Matt's bday. Woo hoo! Dueling Guitars #ALvideooftheday http://www.twitvid.com/V7JMC Incredible show in Manila! #insanity! Suspect on the loose and considered extremely dangerous. if seen please alert the authorities immediately.  http://lockerz.com/s/104113892 it's a lovely day in Manila. Tonight is gonna be a big one. #EXCITED! hey @jimmykimmel i want another crack at ricardo. ive been under the tutelage of a pop-a-shot master whose identity i cannot reveal. if youre interested in dorking out on awesome motorcycle stuff, check out my buddy @milodecruz little blog on our up coming resto project! @ref_RIJA_rator WATER @StyleAfterDark jack sparrow..the lonely island boys.... @azihr77 action hero. the coolest. @Mindy_Martin red rocks is one of the best venues in america. we cant wait! @ScarfFaze rewarding. different. fun. a breathe of fresh air. @shemnavalta timshel by mumford and sons...that album is frighteningly good. @1712acadia_rd when my personal space is violated. @vbgirlie thats easy. aquafresh extreme clean. the BEST. @1outside im a one band man. @JonnyMaxx always tell the truth. be uncomfortably honest. @breeeasyy being on the cover of rolling stone was a serious \"pinch me\" moment. almost seems like a surreal dream. @Juliofath LA baby! @wafinamario hong kong was seriously incredible. amazing energy @mlh4 NOT COOL. @mars4004 ryan is great! he just produced a great band called @TheRemainers that you should all check out! @hnnhh being home is the best vacation i could ever imagine... @tati_yaaaa i sift through mentions occasionally @JoelD007 not yet. @Hyper_Ashley sweetest goodbye is my favorite song to play live. its so raw and i like how it builds... @chyannmarie im inspired by human beings and their complicated relationships. both positive and negative. @vichasasecret it always blows my mind when thousands of people sing your words back to you... lets do a little Q and A. its been too long and i like to stay connected to the lovely people that support us. ok. SHOOT! If we we're battling another band, I'm so glad @jamesbvalentine is on our team #ALvideooftheday http://www.twitvid.com/FXMEO great...now im compulsively eating cashews and wondering if maybe the rapture was a day late. in Manila... there was definitely just an earthquake. not my favorite thing before i fall asleep in an extremely tall building. RT @TheMarkTwain: I don't like to commit myself about heaven and hell - you see, I have friends in both places. wow. \"strawberry fields forever\" straight into \"fuck tha police.\" thats a bold move itunes. well played shuffle. well played. music is seriously the greatest thing on EARTH. Rainy and trafficky in Manila. But our incredible police escort is KILLING it. He's a bonafide traffic ninja...shake and bake! Hong Kong was one of the biggest and best crowds we have ever played for. Ok Manila..let's see what you've got!!! We just had too much fun with the bullet train in Japan #ALvideooftheday http://www.twitvid.com/L9QX8 @AnneV of course it is! lets be brutally honest... girls dont ACTUALLY run the world. but it would probably be better if they did. RT @AnneV: Here is the link... Epic! http://www.youtube.com/user/beyonceVEVO#p/u/0/VBmMU_iwe6U https://www.facebook.com/video/video.php?v=10150191778202207\ngo @AnneV go! .@JRCarmichael never ceases to amaze... http://www.twitvid.com/UQNP8 RT @MichaelNLevine: Life is BEAUTIFUL the sun is shining. john denver was right! sunshine on my shoulders definitely makes me happy!!! HONG KONG! this place is so unique and beautiful. #whatalife Up close and personal with @JRCarmichael #ALvideooftheday http://www.twitvid.com/EZYAA RT @SethMacFarlane: Someone should tell Palin that using the term \"lamestream media\" makes her sound like an '80's movie bully.  But may ... WOW. the crowd in Taipei was INSANE! one of the best. we are exhausted from a long tour. but you guys really woke us up tonight. #TAIPEI!!! Please, fasten your seatbelts...We're headed to Taipei #ALvideooftheday http://www.twitvid.com/ADP9C RT @mindykaling: Did you guys see the trailer for @jonahhill's new show Allen Gregory? I laughed 100 times and ITS ONLY A TRAILER! http: ... toothpaste exploded in my toiletry kit. now everything is all \"toothpastey\" .@angela_wolff your smile is infectious. You are the sweetest, happiest member of #teamadam #TheVoice @sutterink WOW. just WOW. RT @JRCarmichael: watching Road to Bali with Bing Crosby and Bob Hope... I mean... not with them... they're in the movie... http://tinyu ... everybody watch @NBCTheVoice tonight! woo hoo!!! thank you so much JAPAN!!! it was an honor to be here. your strength during these difficult times is beyond inspiring... we shall return! @justinbieber thats awesome man! im following 222 people. thats my lucky number. cant follow any more people. EVER. RT @maroon5: Check out the video premiere of \"Out of Goodbyes\" with @ladyantebellum  http://bit.ly/m7N3a9 RT @maroon5: We're donating a portion of the proceeds from tonight's show in Tokyo at Budokan to the Japanese Red Cross Society. See you ... there's no such thing as guilty pleasure. only pleasurable pleasure. @scooterbraun you are SOOOOO american! see you tonight buddy! I'll say it again...Japanese fans are amazing!!! #ALvideooftheday http://www.twitvid.com/LD48E liberal democrats now officially annoy me just as much as conservative republicans. ive had it.  #independent @KennyHamilton welcome my friend! its an inspiring time to be in japan. tokyo feels amazing right now. thank you budokan! see you again tomorrow! #roundtwo RT @SethMacFarlane: 'Nuff bullshitting: Guys who know every piece of sports trivia and guys who know every piece of Star Wars trivia are ... RT @PJMORTON: Top of the arena... Japanese flag has to be one of my favorite flags if not my favorite... So simple  http://lockerz.com/s ... @natalie_ahmad I do reply to fans. Because I love them. I retweeted myself by mistake. Not because I'm a self absorbed looney ego maniac who enjoys talking to himself. @SaraBareilles nice birds by the way!!!!!!! @SaraBareilles what!!!! Shut up. I mean...really? Samurai sword? #gettingmyhopesup @SaraBareilles nice! Oh my god youre such a copy cat. Lemme see!!! @sutterink asshole tax is being able to afford paying too much for something when you should know better. Thus making you an \"asshole\". @sutterink @harthanson well someone else found it first. i paid a minor asshole tax. but yes. restoring with a buddy. @HartHanson not yet. its a MESS. need a few months. sorry pumpkin. youre gonna have to wait. go lick your guzzi or somethin. hey @sutterink and @harthanson , just found a '47 knucklehead. 98 percent orginal. been in a barn for 40 years...let the resto begin!!! Headed backstage after the show in Japan #ALvideooftheday http://www.twitvid.com/SRHAA i actually just paid 8 dollars to watch the hangover... AGAIN. i think there is something wrong with me at this point. its TOO good. @ai611ueo_JP honestly? because i had to pee SO BADLY. its cool. james took the reins while i drained my bladder. fans in yokohama were awesome tonight! i felt a bit off. we also went on at 6pm...which is very odd. but kinda cool. Yes @jamesbvalentine, this is the #ALvideooftheday... http://www.twitvid.com/NHLNJ @yokoono when you ask us to imagine I still can't help but get chills...thanks yoko!!! TOKYO!!! how we have missed you... and your advanced fashion sense! How'd we get to Nagoya, Japan? @JRCarmichael explains... #ALvideooftheday http://www.twitvid.com/JFUMN john woo is bad ass. he makes death and destruction look like ballet. which i guess is better than making it look like death and destruciton RT @SoundGuySteve: I once had the good fortune to tour with this man. Happy Birthday Stevie Wonder! http://youtu.be/_ul7X5js1vE happy birthday stevie wonder. you are the absolute greatest. thank you nagoya! off to tokyo tomorrow. homesick but feeling loved here in japan. we had a blast tonight! Some more love for Australia... #ALvideooftheday http://www.twitvid.com/K8HJB I love the Japanese fans. They are so attentive and really listen to the music. One of the more unique crowds to perform to. Very soothing. @AprilHavens osaka was amazing! taking the bullet train tomorrow. best train EVER. hey @melsztorcxo , kevin really wants to take you to prom. if he hasnt already asked you...im askin for him. DO IT!!!! ;) @thelonelyisland  TURTLENECK AND CHAIN. NEW ALBUM. OUT NOW. GET IT. no seriously...get it. LA is so far away... #ALvideooftheday http://www.twitvid.com/UMMDW @samantharonson nerd alert. this is way too hard to call... gonna need more time... ferris drove a ferrari...marty drove a delorean. #pointferris ferris also got to do it with sloane petersen. marty basically made out with his mom. #notcoolatALL however ferris had the  highschool system LOCKED DOWN. which some would argue is actually more difficult than time travel. lets not forget , marty mcfly travelled through fucking TIME. that should seal the deal. but im still not sure. marty played guitar and sang the lights out. ferris had no proven musical skills. ferris was more hands on. marty constantly relied on doc. but i guess every batman needs a robin. shit i dunno. marty mcfly vs. ferris bueller.  #TOUGHCALL my belly is full of sushi...my heart is full of love. thanks to all who watched @NBCTheVoice last night. it wasnt easy sending people home. I'm so proud of these guys. This is NOT and easy song to do. @timmahoneymusic did an incredible job! #thevoice sadly i wont be watching @NBCTheVoice this evening because i am on tour in japan. i hope it kicks tons of sweet ass. have fun. RT @TeamBassicBlack: New advisors to join @NBCTheVoice cast tonight!! Including our very own @bassicblack Check out the article here!! h ... Wait, can we do that again? #ALvideooftheday http://www.twitvid.com/ND7Z6 RT @TheRock: Mornin' - being a true bad ass has no weight or gender requirement - just a 100% commitment to greatness. watching funny videos on youtube has taken over my life. at this point im never leaving my hotel room. EVER. i hope all you lovely people watch @NBCTheVoice tonight! i think its pretty awesome. but then again im completely biassed. @jamesbvalentine you just like the water tickling your butt. #admitit RT @jamesbvalentine: Man, I love Japan. How did the US fall so far behind in toilet technology?  http://moby.to/9yeprp japan is a unique and fascinating place...and shopping here makes skinny people feel fat. im an XL in everything. i feel HUGE! im getting sick of hearing music that makes me feel like im shopping at american apparel for a hoodie that someone else already has. How do you feel about Brisbane? #ALvideooftheday http://www.twitvid.com/B1S0T so happy to see our song #nevergonnaleavethisbed doing so well. the song means a lot to me and im just really happy that people like it! it would be so helpful if i could speak japanese. especially because i happen to be in japan at the moment. RT @x3alee: @samantharonson When you’re right, no one remembers. When you’re wrong, no one forgets. I think I'm in hong kong... Rough post season for the @Lakers . It's ok. Tomorrow is another day. And two in a row ain't bad. #NEXTYEAR Can't forget @PJMORTON!!! #ALvideooftheday http://www.twitvid.com/1HY44 By the way... @Lakers in 7...yeah I said it...#HISTORY Leaving the beautiful continent of Australia...Japan here we come! Leaving the beautiful continent of Australia...Japan here we come! This year I'm gonna buy my mother a tie and send my father flowers. gotta mix it up. Coffee kinda acts as a magical elixir that takes hold of your brain and just  shakes the shit out of it until things fall into place. Dear Cadbury, please send me a box of crunchies. Thanks. Your friend, Adam. @zsaghir09 a not so distant second... Crunchie... The undisputed heavyweight candy bar of the world...the cadbury crunchy... http://lockerz.com/s/99809070 @TeamAdaam . Final answer. @TeamAdaam ... Oops...everybody follow @TeamAdam ...I'm an idiot who can't type."}