{"tweets": "\"The way to get started is to quit talking and begin doing.\" -Walt Disney\n\nWhat is something you have been wanting to do but have been putting off that you can start doing this week? RT @foodandwine: This is the prettiest cheesecake. It is also the easiest cheesecake. https://t.co/KtzPIpkeDN Working hard or hardly working? Do these simple stretches daily!\nhttps://t.co/62uLvPsXro https://t.co/UkXpVdD21o What's your favorite thing about the place where you live? https://t.co/ptNDQjVhrX For your Monday, iced coffee with a simple flavor twist. https://t.co/al8smBVOfJ Summer vacation is cancelled for most of us but here are 5 National Parks you can visit virtually:\nhttps://t.co/FXNIhCjJRS A little nature for your day and an inspirational quote from MLK. So beautiful! https://t.co/8JQHnX2Xw2 What's on your agenda for this week? https://t.co/pL10QCgH9F RT @Oprah: We also have a list of organizations to use as resources to learn more about the ongoing fight for racial and social justice. Vi… “An individual has not started living until he can rise above the narrow confines of his individualistic concerns to the broader concerns of all humanity.”   - Martin Luther King Jr. Nine Rules for the Best Homemade Pizza of your life! https://t.co/VB3hg2mBRH @Bankole_Duyi That is such a great one- thanks! @ChelsIsRight Love it! @juliusmasey Great recommendation- thank you! What is the best book you have read recently?  We are taking recommendations! RT @nytimes: For today, May 18, here’s how to follow the latest on the coronavirus outbreak. \n\n🌎 Live updates from around the world: https:… Happy Friday! What are your weekend plans? Joe Rogan discusses emerging artificial intelligence technology with Elon Musk on his podcast and it's fascinating 🤯 https://t.co/B7odDPDaq0 Has anyone tried giving their dogs a fur cut for the first time during quarantine?  \nhttps://t.co/DYy5Qn4Rp9 RT @parksandrecnbc: Need we say more? #ParksAndRec ❤️ https://t.co/hKySuq7oUw What do you miss most about life before quarantine? Celebrating World Earth Day 2020 https://t.co/N839XRf7AT RT @BuzzFeed: Cate Blanchett Just Gave Us Six Film Recommendations For Lockdown So That's What I'll Be Doing This Weekend https://t.co/DrSN… What is your favorite at-home workout? https://t.co/yLN5wuDp0X And now a little good news to start your week: https://t.co/YFlHAUYZZb Comedy, as unnecessary as it may seem, can be a coping mechanism allowing us some stress relief during some of our darkest and scariest times.... \n\nThis one was funny :-) https://t.co/iee46KULLR @npanggagas They do :-) What is everyone up to today?  Be safe friends! @Farnoosh57 Hi, these are good questions, but actually we aren't associated with the share riding app Uber, but it's a very common mistake given our name :-). Just in case you needed some reassurance that social distancing is the right thing to do:\nhttps://t.co/Vw0c6GHGfi @motelacid @motelacid Thank you for the feedback.  We are working on an update, and are always open to feedback especially when it comes to an easier user experience. Staying home as much as possible and away from crowds is our plan for... well... awhile.  What are you doing to stay busy and keep your anxiety down? Foods that boost immunity: https://t.co/gBeDS2DJkm How to protect yourself from coronavirus: https://t.co/5SaX59GZli What makes a good life?  Lessons on the longest study on happiness. https://t.co/5Jn4AqLQ5h “Success isn’t about how much money you make, it’s about the difference you make in people’s lives.”\n\n- Michelle Obama Expand your mind and make your travel plans for 2020.  Here are some ideas: https://t.co/Hw9vyspvwE This is big news: https://t.co/eZfVEKWPqD 20 Ways to Make This Week the Most Productive Yet\nhttps://t.co/xCWx7QiVh8 \"The most important thing is to try and inspire people so that they can be great in whatever they want to do.\" \n- Kobe Bryant RT @nytimes: Now is the time to start planning your Super Bowl feast. Here are some of our best game-day recipes\nhttps://t.co/cZthztUv4I @Bone11_ That sounds perfect! What is your favorite thing to do on a cold winter Saturday? \"Darkness cannot drive out darkness; only light can do that. Hate cannot drive out hate; only love can do that.\"\n\n- Martin Luther King, Jr. Are you planning any big trips in 2020?  Kyoto is on the top of our list, and here are so many other great ideas.\nhttps://t.co/18BFlIMjwa Keep those New Year's resolutions.  We decided on a 30-day meditation challenge.  So far, so ohm... we mean good! https://t.co/jJ8WytQY3C Happy New Year everyone! We ate and drank so much this past week, but are feeling a bit sluggish.  Favorite way to get moving after the holidays?  Go! Winter solstice is the shortest day of the year and is happening this year on December 21st.  We like to get a little extra sleep in if possible. 😴\nhttps://t.co/rYVafKIHl7 RT @nytimes: Kumail Nanjiani, John Krasinski and Chris Pratt were all introduced to America as men of average musculature through office si… The holidays got us feeling like... well... I think Carlton says it best. https://t.co/6X9rjXkD33 Want to better understand what motivates you and the people around you?  Or better yet, how do you get people—including yourself—to do what you want?” We took\n@gretchenrubin's Four Tendencies Quiz and discovered how our team works best... Insightful!\n\nhttps://t.co/aA89Du2yeC If you could receive just one gift this holiday season, what would it be?  The answer for us is a new electric car.... or better yet maybe a Harry Potter wand. https://t.co/x9laxFcM7g https://t.co/budM81rQJV Rat chauffeur anyone? https://t.co/RcbPRhaGAW We are getting ready to settle in for some serious movie time this holiday season.  Check out this comprehensive guide to movies this November &amp; December:\nhttps://t.co/Mw6R6hrZxS Tesla's new Cybertruck was unveiled on Thursday with mixed reviews.  What do you think? \nhttps://t.co/Iny7QfGSPk We love you Will. https://t.co/RT6mJVpJpR It's cold out there friends!  But we want you to be healthy so here are top tips for staying motivated to work out this winter: \nhttps://t.co/RL6T5PWsAr A day without coffee is like.... just kidding.  We have no idea.  Working on our perfect home-brewed cup this week. https://t.co/TLVCGPfRbu Are you embracing Halloween with this much vigor? https://t.co/6G6thJ2N73 For the rest of your life, would you rather be unable to use search engines or unable to use social media? We'd nix search engines, but we're biased. We are back and feeling good!  Mr. Thoreau had something to say about it. “Our life is frittered away by detail… simplify, simplify.” Happy International Women's Day everyone!! #InternationalWomensDay A new Android beta is available now. Many fixes included in this version. Opt-in today to try it out: https://t.co/nbaFIec4F6 New UberSocial - Android beta is now available! This version includes a new feature that lets you add a custom signature to your Tweets. Opt-in to beta here and try it out today: https://t.co/nbaFIetFwE Happy Thanksgiving! Wishing you a wonderful holiday with your family and friends! https://t.co/fqZVtHFBHG @OhNoItsSteve We're sorry about this. We will look into options for adding a beta program for our Pro users as well. Thank you for your feedback! New UberSocial - Android beta is available now! This version includes new improvements for user profile screens, including a new media gallery section. Opt-in today to try it out: https://t.co/nbaFIec4F6 @Jess41978 We're sorry to hear you're having trouble with UberSocial. Please feel free to contact our support team with any issues you're experiencing. We'd be happy to investigate the issue further: https://t.co/FTVqE4h7oj @Tiya_Genelia Sorry to hear about this issue you're seeing with UberSocial. Can you possibly share more details or a screenshot with our support team: https://t.co/FTVqE4h7oj @wbaboy We're very sorry for the issues you're having with deleting DMs. Working to resolve this now and will release an update with a fix as soon as possible. Thank you for your feedback! @HilangJauh Unfortunately, we have no access to your Twitter password. You can find more info about how to reset your forgotten password here: https://t.co/VVeUkf8r6K A new UberSocial - Android beta is available now! This version includes new improvements for Android Pie and many other bug fixes. Opt-in today to try it out: https://t.co/nbaFIec4F6 @10Newme @chrisj_oreilly Yes, the free version must be uninstalled before the PRO version will install from the Play Store. Our apologies for any inconvenience New UberSocial Android beta is rolling out now! You can now share pictures &amp; videos in DMs. Try out this great new feature today and let us know what you think - https://t.co/nbaFIec4F6 New UberSocial - Android beta is available now! Opt-in today to give it a try: https://t.co/nbaFIec4F6 New UberSocial - Android Beta is now available! Many bug fixes and improvements included in this version. Click here to try it out: https://t.co/nbaFIec4F6 @LisaBrite Updating to the beta will overwrite the current version. It will not be shown as a separate app. Thanks New UberSocial - Android Beta available now! This version includes new improvements for DMs. To try it out click here: https://t.co/swZ5rVrq5K. Please let us know what you think! Looks like it may be time to update your Twitter password: https://t.co/c3likiUJzr New Android Beta is rolling out! Includes many improvements. To opt-in and try it out click here: https://t.co/V5GRLgTGRD HAPPY NEW YEAR!! Looking forward to a great 2018! https://t.co/ea36aVkUbj Merry Christmas from UberSocial! Wishing a wonderful holiday season to all of our users https://t.co/V87lRc7yes We are thankful for all of our users! Have a very Happy Thanksgiving!!!! https://t.co/tKL5N30pb1 New Android Beta is rolling out now! Includes many improvements. To opt-in and try it out click here: https://t.co/V5GRLhbigd RT @TechCrunch: Android O is officially called Android Oreo https://t.co/qb2ceqi0qp by @etherington https://t.co/rBwKgrxcqo UberSocial - Android update is rolling out now! Share your feedback with our team: https://t.co/PK3lWiS1Yb We'd love to hear what you think! New UberSocial - Android beta is out now! Click here to join our beta testing group and try it out: https://t.co/VehARfhjnr New UberSocial iOS beta available now. Let us know what you think. We'd love your feedback! https://t.co/FTVqE4h7oj New Android beta is now available! Join our beta testing group today and let us know what you think: https://t.co/1TkikaHboC HAPPY 4TH OF JULY!!!!!! https://t.co/xBqKAij3J7 Looking forward for what's to come in iOS11! #WWDC2017 https://t.co/EjO51Lltl8 @just_bein_Bee You can send a request to ubersocialbeta@ubermedia.com to be signed up for the beta. Thanks! A new iOS Beta is available now! Includes more improvements/fixes. Share your feedback with us at ubersocialbeta@ubermedia.com New iOS Beta is now available! Send a request to ubersocialbeta@ubermedia.com to sign up and try it out New iOS update is now available in the App Store. Includes fix for recent freezing issues. Download here: https://t.co/6hQS3shdmx New iOS Beta is available now! Interested in trying it out? Please send a request to ubersocialbeta@ubermedia.com to sign up today! Happy St. Patrick's Day! https://t.co/W93tgdanhV Have you tried our new iOS beta? We'd love to hear what you think. Please share your feedback with us at: ubersocialbeta@ubermedia.com New iOS Beta is now available! Send a request to: ubersocialbeta@ubermedia.com to join our beta group and test out the newest features We're currently having troubles with our support system. Please send all app feedback to: support@ubertwitter.zendesk.com for assistance New UberSocial - Android beta is coming! Opt-in to join our beta testing group today to be the first to try it: https://t.co/1TkikaHboC Happy Holidays from UberSocial!!!!!!!! https://t.co/B6mMbPyHFj @ihackmore We're sorry for this issue you're having. We'll look into getting this fixed as soon possible @joshua_tokura Supports iOS 9.0 or later. If you'd like to sign up for beta, please send a request to: ubersocialbeta@ubermedia.com @ukexpat Please send a request to ubersocialbeta@ubermedia.com to sign up for beta New iOS Beta is rolling out now! Let us know what you think. We'd love to hear your feedback New iOS Beta is almost ready! Join our beta group today to be the first to try it. To join, send a request to: ubersocialbeta@ubermedia.com New UberSocial - Android beta available now! Join our beta testing group today and let us know what you think: https://t.co/1TkikaYMNc Happy Thanksgiving! Wishing you a wonderful holiday with your family and friends! https://t.co/MApsgL1QuX New UberSocial for Android update is now fully rolled out. Adds support for longer tweets. Enjoy! https://t.co/KESlhMc7dN @CJBergeron Sorry for this issue. We're working to get it fixed completely. We appreciate the feedback. Thanks! RT @businessinsider: Google just unveiled the Pixel — its first smartphone #MadeByGoogle https://t.co/me3iChVuKk @Mr_JBz We already have a fix included in our new beta version. If interested, send a request to: ubersocialbeta@ubermedia.com to sign up! @Mr_JBz Sorry for this issue. A fix is coming in our next update. Thanks for sharing your feedback with us UberSocial - iOS is now available for beta testing! If interested in signing up, please send a request to: ubersocialbeta@ubermedia.com @kuspinasti1701 We're very sorry for this issue. We're working to get this fixed ASAP RT @verge: iOS 10 will be available on September 13th https://t.co/nXmfCJrBPH https://t.co/SDbsfrY8gD New UberSocial - Android beta available now! Join our beta testing group today and let us know what you think: https://t.co/VehARfhjnr Customize your columns. Here's how to add, remove, and reorder the columns in UberSocial - Android. https://t.co/B4mJoPsFPP Check out the redesigned Search tab in the latest beta! Join our beta testing group today: https://t.co/VehARfhjnr https://t.co/EwhEX89O6x @radix42 The button no longer shows in the app, but we still have the Pro version available in the Play Store: https://t.co/S8YnuVFW0x @CJBergeron Could you tell us which device/Android version you're using? Maybe send a screenshot of the issue? @CJBergeron Sorry to hear about this problem with the new update. Thanks for letting us know. We'll investigate this issue @huddie71 Thank you! We're looking into this now. We appreciate the feedback @huddie71 Could you tell us which device you are using? @huddie71 Sorry about that. We'll work on getting this fixed. Thanks for letting us know How do you like the latest Android update? Share your feedback &amp; any new features you'd like to see with us today - https://t.co/FqONZJIeY5 @daniel_thecuban Sorry for this issue. We're looking into this now. Can you advise which device/Android version you're using? @timpovich Sorry to hear about this issue. We'll look into it. Thank you for letting us know Happy Independence Day!!!! Share your best firework photos with us https://t.co/0oKaJxYTwy UberSocial - Android (4.0.0.0) is available now! Update today: https://t.co/KZEktg13H1. Let us know what you think! https://t.co/zk3a5036zf @ctt1wbw Glad you're liking the new look. We appreciate the feedback! Thank you!! @ABCHI_RedDeer Thanks! It's great to hear that you're liking the new look. We really appreciate the feedback @daniel_thecuban We're very sorry for the issues you've had with the Nearby Tweets. This is fixed in our new update that's rolling out now The latest UberSocial - Android update will begin rolling out next week! https://t.co/D3mqXdIeaH New Android beta now available. Opt-in today to become a tester and be first to check out the new design/themes: https://t.co/sT2oNxtQGN @paidlukkha It can take a few hours for the update to arrive to your device @paidlukkha To sign up, join our beta testing group: https://t.co/yJ43EUZ3u7 then click here to become a tester https://t.co/w3o190Enbt @paidlukkha No exact date yet, but it's almost ready. We do have a beta version ready now if you are interested in trying it out RT @CNET: Apple expands Siri to work with third-party apps #wwdc2016 #apple https://t.co/QZKSlj7E2Y https://t.co/FFiUFHxI90 New look coming to UberSocial - Android very soon! https://t.co/80RGV4MQcu New UberSocial - Android design Coming Soon... https://t.co/NsFB6S0kCY @fairuse Thank you for bringing to our attention. We'll investigate what caused this error. We're very sorry for the inconvenience Excited for the new features coming in Android N! https://t.co/myGhTiQvIP @dp57 We're very sorry for this issue. We are looking into this issue now. Could you advise which device/Android version you are using? @CJBergeron Thank you for providing this info and for bringing this issue to our attention. We really appreciate your feedback! @CJBergeron We've investigated the issue and appears to be affecting devices with older Android versions. Update with fix rolling out now @ThatConnArtist We apologize for this issue. Working on a fix now that we hope to have available ASAP! Very sorry for the inconvenience @CJBergeron Sorry for this issue. We're working to get this fixed ASAP. Can you advise which device/Android version you're using? The only run for a cause where the finish line catches you. https://t.co/6qMK1soTxB UberSocial - iPhone update available now! Includes a fix for recent Instagram photo issue. Download now: https://t.co/P71kNxOobj Cheers to a new year. Happy New Year!!!!!! https://t.co/vH1YvrTTeN Happy New Year’s Eve! Any big plans to ring in the new year? Happy Holidays! https://t.co/SRkK0BGKdJ Have a suggestion/feature you’d like to see in UberSocial? Let us know! iPhone: https://t.co/25WgTar1Im / Android: https://t.co/az5EMyTNtH We are thankful for all of you! Have a very happy Thanksgiving!!!! https://t.co/Y7gu5sv8Ri @Shieldwalled Sorry for the inconvenience. We're investigating this issue now and hope to find a fix asap! Thanks for the feedback! New UberSocial - Android update available today! New improvements and bug fixes for Android M. Download now: https://t.co/jhy00roboe UberSocial for iPhone update rolling out today with fix for recent keyboard overlapping issue. Download now: https://t.co/Up0BoNTxyl Happy Halloween from the UberMedia team! https://t.co/3XTWZwfv7V @IBLOGTOGLESGA We're very sorry for this issue. We have an update with a fix submitted to the App Store and hope to release ASAP! New Android update rolling out today with improvements for Android Marshmallow! @Moose_eBooks We're very sorry. We are working on a fix now but it's taken much longer than we expected. Thank you for your feedback. @_enomis @t_siko We're very sorry for this issue. Our developers are investigating a fix now. We appreciate the feedback! @Peders1 PRO version will be rolling out today The newest UberSocial - Android (Version 3.3.0.0) update allows you scroll between multiple photos in a tweet! http://t.co/ik6hUVkbYS Quote tweet support now available in UberSocial - Android. Download today: http://t.co/84E6mQsITf http://t.co/iGC8tgEeqo Happy Labor Day! New UberSocial Android update rolling out today - http://t.co/HE8DjVU9jv http://t.co/TRHnZOssAD @Guatiao Sorry for this inconvenience. We'll investigate ASAP @tranCendenZ We're very sorry for these issues you've had. We're investigating a fix for this now. Thank you for these screenshots. @huddie71 Thank you! We really appreciate you providing your feedback. We'll pass this on to our development team Having an issue with UberSocial? Our support team is here to help. Please send us your feedback here: http://t.co/UCupaosugF @ThisIsFury Very sorry for the inconvenience. We're investigating a fix for this issue now. Thank you for your feedback! Have you tried the new UberSocial Android beta? Join our community &amp; opt in today: http://t.co/yJ43EUZ3u7. Let us know what you think! New Android release coming soon! Interested in trying our newest beta version? Join our community &amp; sign up today: http://t.co/oxU6kfnWY5 Happy Independence Day! Share your best fireworks photos\nwith us. http://t.co/lTY3U2oQ7Y @Kreizi_Prince What's going on? *AM @dannfpe What's going on? *AM @Oupas_Montso Can you try uninstalling the app, turning your device off and on, and reinstalling it? *AM @Lebovine What's going on? *AM @em4o So sorry! What is the requester name? *AM @gemsong What's going on? *AM @Dollypizo What's going on? *AM @Diettomorrow1 What's being advertised? *AM @Kusain_SS_EP What type of device are you using? *AM @NiQue_Tii What type of device are you using? *AM @Kusain_SS_EP What's going on? *AM @LoKatdotCom What's going on? *AM @zeesoboois79 I'll report this to our developers for investigation *AM @zeesoboois79 Have you tried uninstalling, turning your device off and on, then reinstalling? *AM @zeesoboois79 Did you recently change your password? Are you able to log in via http://t.co/gwDPfNWfB1? *AM @zeesoboois79 What type of device are you using? *AM @em4o We're working on it! We've had an issue with our server, sorry! *AM @MnqobiKhabazela When did you last update? *AM @renysotillo What's going on? *AM @rowdygirl1851 Okay, please send us a screenshot when you've got one *AM @EZG_Necrotic What's going on? *AM @rowdygirl1851 And this is still happening? *AM @MoeTrain What's going on? *AM @rowdygirl1851 What's being advertised? *AM @KettleYarnCo What's being advertised? *AM @KettleYarnCo What type of device are you using? *AM @Sidumane What's going on? *AM @shortstack81 Great thanks *AM @shortstack81 Can you try uninstalling the app, turning your device off and on, and reinstalling it? *AM @shortstack81 What type of device are you using? *AM @AndyPok1 Can you try uninstalling the app, turning your device off and on, and reinstalling it? *AM @shortstack81 What's going on? *AM @AndyPok1 What type of device are you using? *AM @DjFirestarr Can you try uninstalling the app, turning your device off and on, and reinstalling it? *AM @JeffVT03 Can you try uninstalling the app, turning your device off and on, and reinstalling it? *AM @SpY_CarTer Can you try uninstalling the app, turning your device off and on, and reinstalling it? *AM @Pratap061061 Can you send us a screenshot? *AM @dryatiya Okay, i'll report this to the developers *AM @nkululeko_tau Can you try uninstalling the app, turning your device off and on, and reinstalling it? *AM @dryatiya What type of device are you using? *AM @dryatiya Can you try uninstalling the app, turning your device off and on, and reinstalling it? *AM @nkululeko_tau What type of device are you using? *AM @nkululeko_tau What's going on? *AM @Citysoamazing Great thanks *AM @Citysoamazing Can you try updating? Or uninstalling, turning your device off and on, then reinstalling? *AM @Citysoamazing Are you using the most recent version of Echofon? *AM @Citysoamazing What type of device are you using? *AM @Citysoamazing What's going on? *AM @paidlukkha Can you try uninstalling the app, turning your device off and on, and reinstalling it? *AM @javier_fazouro What type of device are you using? *AM @evansudarsky26 This isn't Uber the car service's twitter account *AM @LennonEnglish Can you send me a screenshot of where it's enabled in your settings? *AM @LennonEnglish What's going on? *AM @GOConnor Are you trying to reach the car service Uber the Twitter application Ubersocial? *AM @MohdSuffian3 Are you receiving an error code? *AM @Tambae What type of device are you using? *AM @iniobong_ You need to purchase Ubersocial Pro to turn off ads *AM @QueenCato_ What type of device are you using? *AM @DarkWhiteFreak Great *AM @pVVEN What type of device are you using? *AM @Desroches23 What's going on? *AM @BelladonnaIT http://t.co/n0aw3c00TS *AM @DarkWhiteFreak Can you try uninstalling the app, turning your device off and on, and reinstalling it? *AM @DarkWhiteFreak What type of device are you using? *AM @rowdygirl1851 Great! *AM @rowdygirl1851 What type of device are you using? *AM @BelladonnaIT What type of device are you using? *AM @DarkWhiteFreak What's going on? *AM @pdabbelt3sixty What's going on? *AM The only run for a cause where the finish line catches you. http://t.co/DOn6WDVRdM http://t.co/HzaEwk1HkT @LadytronFashion Great *AM @Amseunlawal Can you try uninstalling the app, turning your device off and on, and reinstalling it? *AM @Amseunlawal What type of device are you using? *AM @LadytronFashion Can you try uninstalling the app, turning your device off and on, and reinstalling it? *AM @Amseunlawal What? *AM @Shatherealest What type of device are you using? *AM @LadytronFashion What type of device are you using? *AM @oziggi19 What's going on? *AM @SolifikOfficial What? *AM @Shatherealest What's going on? *AM @Megan93Kim ...Uber, sorry! *AM 2/2 @Megan93Kim Hi, this is the Twitter account of Ubersocial, which is a Twitter application. We're not affiliated with the car service... 1/2 @MatthewToy It's been reported to the developers for investigation *AM @roseflowaz What's being advertised? *AM @osamaisis1 What type of device are you using? *AM @osamaisis1 What's going on? *AM @Matt_Gerlach I'll report this to the developers *AM @Matt_Gerlach When did you start seeing this ad? *AM @Matt_Gerlach No what location? *AM @Matt_Gerlach Where are you tweeting from? *AM @Matt_Gerlach What's being advertised? What type of device are you using? *AM @bgrice68 What's being advertised? Can you send us a screenshot? *AM @mr_omneo What's the Requester name associated with the ticket? *AM @bgrice68 What ad? *AM @KagisoReloaded Try this: on your BB go to Options&gt;Applications&gt;UberSocial, set permissions to Allow &amp; save. Remove &amp; reinsert battery *AM @KagisoReloaded What type of device are you using? *AM @Velda2014 Try this, on your device click UberMenu&gt;Settings&gt;About UberSocial, scroll to the bottom, click Clear Cache and click Yes *AM @Velda2014 What type of device are you using? *AM @mr_omneo You're using an Android, I'm assuming? *AM @mr_omneo What issue are you experiencing with the application? *AM @mr_omneo What's going on? *AM @TREnoY Can you try uninstalling the app, turning your device off and on, and reinstalling it? *AM @TREnoY What type of device are you using? *AM @ERRRskate151 Can you try uninstalling the app, turning your device off and on, and reinstalling it? *AM @ERRRskate151 What's going on? *AM @Sidumane What's going on? *AM @oluwamatti What's being advertised? *AM @jessadilla Can you send me a screenshot of your settings? *AM @1Hauck What type of device are you using? *AM @bindr Can you try uninstalling the app, turning your device off and on, and reinstalling it? *AM @jessadilla What type of device are you using? *AM @bindr What? *AM @nic225 What type of device are you using? *AM @RealVinylking Please try uninstalling, turning your device off and on, then reinstalling *AM @RealVinylking The issue should be fixed *AM @Panda333 I'll ask the developers about this and get back to you *AM @StephStradley Can you try uninstalling the app, turning your device off and on, and reinstalling it? *AM @StephStradley What type of device are you using? *AM @Panda333 I'm not sure what you mean - you can disable viewing DMs as a part of timeline in settings *AM @Panda333 Can you send us a screenshot? *AM @suntraa We don't currently offer an application for BB10 *AM @Panda333 What type of device are you using? *AM @suntraa What's going on? *AM @RealVinylking When did this start happening? *AM @RealVinylking So there are no grey boxes, only viable links to Instagram images? *AM @RealVinylking What do the Instagram images look like? *AM @RealVinylking Can you send us a screenshot? *AM @RealVinylking When did you last try uninstalling/reinstalling? *AM @RealVinylking Can you try uninstalling the app, turning your device off and on, and reinstalling it? *AM @the_naenae What's going on? *AM @BBoy46502845 Can you send us a screenshot of the ad? *AM @BBoy46502845 What type of device are you using, and what ads are you seeing? *AM @eflegara We're working on shutting them down! *AM @glenatron We're working on taking these down! *AM @jayceehoskins Are you seeing banners as well or just full screen ads? *AM @frostingswirls Are you seeing banners as well or just full screen ads? *AM @JohnSelf Are you only seeing full screen ads, or also banners? *AM @nclphotog We're working on shutting them down *AM @lazysecurity country *AM @DineHard We're working on shutting them down *AM @jayceehoskins We're working on shutting these ads down! *AM @penwing We're working on shutting them down! *AM @tek_junky We're trying to shut these ads down *AM @ssidders We're working on shutting them down! *AM @frostingswirls We're working on shutting them down *AM @MartinDDean We're working on shutting them down! *AM @lovelyjojo I've reported this to our developers - we're working on shutting it down *AM @toddhalfpenny I've reported this to our developers, we'll shut them down ASAP! *AM @lovelyjojo What's being advertised? *AM @frostingswirls And you're a Pro user? *AM @frostingswirls Where are you tweeting from? *AM @lazysecurity Where are you tweeting from? *AM @lovelyjojo What's going on? *AM @frostingswirls What type of device are you using? *AM @l0islane Can you send us a screenshot next time it happens? *AM @l0islane What's being advertised? *AM @l0islane What type of device are you using? *AM @toddhalfpenny Can you send us a screenshot? *AM @penwing What version of Ubersocial are you using? *AM @penwing What type of device are you using? *AM @penwing Can you send us a screenshot? *AM @LauCastiwhite Can you try uninstalling the app, turning your device off and on, and reinstalling it? *AM @LauCastiwhite What type of device are you using? *AM @LauCastiwhite What's going on? *AM @MAW3DO What's going on? *AM @TiiBii Yep *AM @TiiBii You might have been hacked *AM @Booyah86 What type of device are you using? *AM @officialdavies Are you using the Pro version? *AM @RSQViper Can you try uninstalling the app, turning your device off and on, and reinstalling it? *AM @AlisonOKeeffe I've reported this to our developers *AM @AlisonOKeeffe Are you a free or Pro user? *AM @AlisonOKeeffe Do you see this issue through http://t.co/gwDPfNWfB1 as well? *AM @AlisonOKeeffe When did this start happening? *AM @AlisonOKeeffe Can you send us a screenshot of what it looks like? *AM @AlisonOKeeffe Can you try uninstalling the app, turning your device off and on, and reinstalling it? *AM @AlisonOKeeffe What type of device are you using? *AM @mr_omneo We'll reply to your ticket about this ASAP! *AM @mr_omneo Sorry, what's going on? *AM @evonneforreal What type of device are you using? *AM @evonneforreal Can you send us a screenshot of the error message? *AM @Dudu_D What's going on? *AM @aagonzal What's going on? *AM @CARLOSALBERTOVZ What type of device are you using? *AM @evonneforreal Are you able to log in through http://t.co/gwDPfNWfB1? *AM @LeonardMasilela ...Yes *AM 2/2 @LeonardMasilela Try this, on your device click UberMenu&gt;Settings&gt;About UberSocial, scroll to the bottom, click Clear Cache and click... 1/2 @LeonardMasilela What type of device are you using? *AM @okitribeent Ubersocial doesn't support gifs, sorry! *AM @DonGalasso Try this, on your device click UberMenu&gt;Settings&gt;About UberSocial, scroll to the bottom, click Clear Cache and click Yes *AM @caz6277 Try this: on your BB go to Options&gt;Applications&gt;UberSocial, set permissions to Allow &amp; save. Remove &amp; reinsert battery *AM @caz6277 What's going on? *AM @KR3Wmatic Can you please try uninstalling/reinstalling? *AM @dead_presh Can you try uninstalling the app, turning your device off and on, and reinstalling it? *AM @KR3Wmatic Try this: on your BB go to Options&gt;Applications&gt;UberSocial, set permissions to Allow &amp; save. Remove &amp; reinsert battery *AM @dead_presh What type of device are you using? *AM @MzBeeezSoSassii ...Yes *AM 2/2 @MzBeeezSoSassii Try this, on your device click UberMenu&gt;Settings&gt;About UberSocial, scroll to the bottom, click Clear Cache and click... 1/2 @dead_presh What's going on? *AM @MzBeeezSoSassii What type of device are you using? *AM @oluwamatti :) *AM @Afika_N What's being advertised? Can you send us a screenshot? *AM @DebargeStorm What's going on? *AM @mr_omneo Can you please submit this to our customer service portal? *AM @Chili_m2 What's going on? *AM @PhuckLovee_ What type of device are you using? *AM @poison_ice45 I've asked the developers to look into this - they'll get back to me as soon as possible *AM @poison_ice45 When did this start happening? *AM @poison_ice45 And you have no problem logging in through Twitter? *AM @RealPrizeOkoli Try this: on your BB go to Options&gt;Applications&gt;UberSocial, set permissions to Allow &amp; save. Remove &amp; reinsert battery *AM @poison_ice45 You can't log in? Did you recently change your password? *AM @CyndyDavid What type of device are you using? *AM @RealPrizeOkoli What type of device are you using? *AM @CyndyDavid What's going on? *AM @poison_ice45 Are you able to access your mentions via http://t.co/gwDPfNWfB1? *AM @RealPrizeOkoli What's going on? *AM @TayeNicole What type of Android. *AM @TayeNicole And what version of Ubersocial? *AM @TayeNicole What type of Android are you using? *AM @TayeNicole Hmm. I'll report this to the developers *AM @TayeNicole When did you last try uninstalling/reinstalling? *AM @TayeNicole When did this start happening? *AM @TayeNicole Can you try uninstalling the app, turning your device off and on, and reinstalling it? *AM @TayeNicole What type of device are you using? *AM @poison_ice45 Have you tried uninstalling, turning your device off, turning it back on, then reinstalling? *AM @MightyKingCobra Can you try uninstalling the app, turning your device off and on, and reinstalling it? *AM @Baba_Ka_Percy What's going on? *AM @MightyKingCobra What type of device are you using? *AM @poison_ice45 Try this: on your BB go to Options&gt;Applications&gt;UberSocial, set permissions to Allow &amp; save. Remove &amp; reinsert battery *AM @MzAYC Can you try uninstalling the app, turning your device off and on, and reinstalling it? *AM @poison_ice45 What type of device are you using? *AM @TrademarkFile What? *AM @TrademarkFile You have to reset your password through Twitter directly, you can't do it through Ubersocial *AM @MzAYC What type of device are you using? *AM @MzAYC What's going on? *AM @TrademarkFile What's going on? *AM @LeviBluey Yeah, and I told you to go to Options etc. on your BLACKBERRY. *AM @LeviBluey Did my suggestion help? *AM @Lethal_Beaute What's going on? *AM @LeviBluey Try this: on your BB go to Options&gt;Applications&gt;UberSocial, set permissions to Allow &amp; save. Remove &amp; reinsert battery *AM @_IrisTinkerbell What type of device are you using? *AM @LeviBluey What version of Ubersocial are you using? *AM @_IrisTinkerbell What does the error say? *AM @LeviBluey This isn't a bot. *AM @_IrisTinkerbell What's wrong? *AM @LeviBluey What type of device are you using? *AM @Lady_Crunk What type of device are you using? *AM @MsNuroni Try this, on your device click UberMenu&gt;Settings&gt;About UberSocial, scroll to the bottom, click Clear Cache and click Yes *AM @ymjauthor What's going on? *AM @SardineTin Can you try uninstalling the app, turning your device off and on, and reinstalling it? *AM @SardineTin What type of device are you using? *AM @Matticus182 Can you try uninstalling the app, turning your device off and on, and reinstalling it? *AM @Droatest What's going on? *AM @Matticus182 What type of device are you using? *AM @stars__Cascade What's going on? *AM @tjrcuenca Can you try uninstalling the app, turning your device off and on, and reinstalling it? *AM @tjrcuenca What type of device are you using? *AM @George_Ruzv What's going on? *AM @PichPich07 Can you try uninstalling the app, turning your device off and on, and reinstalling it? *AM @PichPich07 Are you able to log in and access DMs successfully via http://t.co/gwDPfOdQJ5? *AM @courtnye What's going on? *AM @PichPich07 What type of device are you using? *AM @JeremyRiveraSEO What's going on? *AM @Hlonolo2K Are you able to log in via http://t.co/gwDPfOdQJ5? *AM @kinsan02 Can you try uninstalling the app, turning your device off and on, and reinstalling it? *AM @kinsan02 What type of device are you using? *AM @LANREWAJU_ Try this: on your BB go to Options&gt;Applications&gt;UberSocial, set permissions to Allow &amp; save. Remove &amp; reinsert battery *AM @LANREWAJU_ What type of device are you using? *AM @Minahsota What type of device are you using *AM @Minahsota Can you try uninstalling the app, turning your device off and on, and reinstalling it? *AM @Minahsota What version of Ubersocial are you using? *AM @henkjanversteeg I'll report this to the developers *AM @henkjanversteeg Are you a Pro user or are you using the free version? *AM @Babalwa__L Try this: on your BB go to Options&gt;Applications&gt;UberSocial, set permissions to Allow &amp; save. Remove &amp; reinsert battery *AM @henkjanversteeg Can you try uninstalling the app, turning your device off and on, and reinstalling it? *AM @Babalwa__L What type of device are you using? *AM @EffBarbie What's going on? *AM @El_Mastermind What's going on? *AM @1Hauck Can you try uninstalling the app, turning your device off and on, and reinstalling it? *AM @Applesauce08 Try this, on your device click UberMenu&gt;Settings&gt;About UberSocial, scroll to the bottom, click Clear Cache and click Yes *AM @Applesauce08 What type of device are you using? *AM @BlockBabe What type of device are you using? *AM @EmilyCorni1w :) *AM @Im_teaser What type of device are you using? *AM @DReckless1 What's going on? *AM @TimBeems Does your timeline look the same on http://t.co/gwDPfOdQJ5? *AM @TimBeems You don't follow any of these people? *AM @TimBeems Can you try uninstalling the app, turning your device off and on, and reinstalling it? *AM @TimBeems When did this start happening? *AM @TimBeems What do you mean? *AM @_AdamRosenbegr :) *AM @theZipboarde :) *AM @_enomis Great *AM @_enomis Try this: on your BB go to Options&gt;Applications&gt;UberSocial, set permissions to Allow &amp; save. Remove &amp; reinsert battery *AM @Thee_CaLeB Ubersocial Pro doesn't run ads *AM @_enomis What type of device are you using? *AM @Thee_CaLeB Is is a full screen ad? It looks like a banner *AM @Thee_CaLeB What's being advertised? Can you send us a screenshot? *AM @Thee_CaLeB Are they blocking your timeline? *AM @migraineboi Hmm, strange. I'm sorry for this issue! I'll report it to our developers for investigation *AM @migraineboi Are you able to view your timeline successfully through http://t.co/gwDPfOdQJ5? *AM @migraineboi Can you try uninstalling the app, turning your device off and on, and reinstalling it? *AM @migraineboi Try this, on your device click UberMenu&gt;Settings&gt;About UberSocial, scroll to the bottom, click Clear Cache and click Yes *AM @migraineboi What's going on? *AM @WVUGuy29 Can you try uninstalling the app, turning your device off and on, and reinstalling it? *AM @Candyce_Harutgn :) *AM @WVUGuy29 Try this: on your BB go to Options&gt;Applications&gt;UberSocial, set permissions to Allow &amp; save. Remove &amp; reinsert battery *AM @wukster What's going on? *AM @ToYonos What ad? Can you send us a screenshot? *AM @aaramz Are you using Echofon Pro? *AM @aaramz What type of device are you using? Can you send us a screenshot? *AM @aaramz What's being advertised? *AM @kaylaychy What's going on? *AM @daveek10 Try this: on your BB go to Options&gt;Applications&gt;UberSocial, set permissions to Allow &amp; save. Remove &amp; reinsert battery *AM @psixaba Can you try uninstalling the app, turning your device off and on, and reinstalling it? *AM @daveek10 What type of device are you using? *AM @psixaba Try this: on your BB go to Options&gt;Applications&gt;UberSocial, set permissions to Allow &amp; save. Remove &amp; reinsert battery *AM @psixaba What type of device are you using? *AM @daveek10 Try this: on your BB go to Options&gt;Applications&gt;UberSocial, set permissions to Allow &amp; save. Remove &amp; reinsert battery *AM @daveek10 What type of device are you using? *AM @_enomis When does this error notice come up? What are you trying to do within the application? *AM @_enomis What's going on? *AM @djmvt What's wrong? *AM Happy NYE, Ubersocial users! We had a great year with you, looking forward to 2015! http://t.co/984Pi473ey @wbaboy We're working on taking it down! When did this start happening? *AM @JamjarMc When did you start seeing it? *AM @MrStuy What's going on? *AM @sigs8 When did this start happening? *AM @msnhatesclaire When did this start happening? *AM @keithfriar What's being advertised? Can you send us a screenshot? *AM @PSFourU What's being advertised? Can you send us a screenshot? *AM @beefchipsmaster What's being advertised? When did the ads start? Can you send us a screenshot? *AM @matthew_hobbs Can you send us a screenshot? When did this start happening? *AM @Hivemeitner What is being advertised? *AM @falsezahra What type of device are you using? *AM Android users: we're sorry for the login/date issues - Twitter's working on fixing their servers! Here's an update: http://t.co/nfRNu0bee9 @MortChristenson When did this issue start? *AM @MortChristenson What type of device are you using? *AM @darren458854 What's going on? *AM Instagram your crew having fun to win a prize pack thanks to Axe and Walmart! Enter here: http://t.co/Zyb7x5wsOP @_enomis What type of device are you using? *AM @MUFC_Family01 What's going on? *AM @Cliff_Banks What's going on? *AM @thozamaN Are you a Pro user? *AM Show Axe &amp; Walmart how your crew has fun to win a Next-Gen Gaming Console! Enter here: http://t.co/FxTkJsEFlM @sigs8 What type of device are you using? *AM @Kim_Amoral What's going on? *AM @SueTheWriter Can you try uninstalling the app, turning your device off and on, and reinstalling it? *AM @SueTheWriter What type of device are you using? *AM @MpatiLuv What type of device are you using? *AM @MpatiLuv What's going on? *AM @Tambae What type of device are you using? *AM @Tambae What's going on? *AM @SMSharma Can you try uninstalling the app, turning your device off and on, and reinstalling it? *AM @_the2nd_ Is the app opening? *AM @_the2nd_ When did you last uninstall/reinstall? *AM @_the2nd_ What type of device are you using? *AM @_the2nd_ What's going on? *AM @MrHemperley When did this issue with editing your UberBar start? *AM @MrHemperley Are you currently using the most recent version of Ubersocial? *AM @MikeDahan10 Ah, then there may be an issue with the Twitter servers. Those usually work themselves out quickly. *AM @MikeDahan10 Try this: on your BB go to Options&gt;Applications&gt;UberSocial, set permissions to Allow &amp; save. Remove &amp; reinsert battery *AM @MikeDahan10 What's going on? *AM @RJPallavii What type of device are you using? *AM Let’s kick-start #BlackFriday by going to @ToysRUs to find the perfect present! @Nyeleti_X Still around, yep. *AM @TheFireTracker2 What type of device are you using? *AM @Its_kagiso Can you try uninstalling the app, turning your device off and on, and reinstalling it? *AM @Its_kagiso What type of device are you using? *AM @BramStreppel What type of device are you using? *AM The perfect holiday gift! Buy Disney’s Frozen Sing-Along on Digital HD today! http://t.co/RNm3nOgu4p @KR3Wmatic This may be a server issue with Twitter. When did this start happening? *AM @KR3Wmatic Try this: on your BB go to Options&gt;Applications&gt;UberSocial, set permissions to Allow &amp; save. Remove &amp; reinsert battery *AM @Its_kagiso Are you using the most recent version of Ubersocial? *AM @Its_kagiso Try this: on your BB go to Options&gt;Applications&gt;UberSocial, set permissions to Allow &amp; save. Remove &amp; reinsert battery *AM @Its_kagiso What type of device are you using? *AM @Carol_Semz What's going on? *AM With our latest version of UberSocial/Android, replying to tweets is easier than ever. Check it out! http://t.co/UGmEybGe1A With the latest version of UberSocial/Android, replying to tweets is easier than ever. Check it out! http://t.co/VnRbZkr6vR @cuterennny What's going on? *AM @Kennelia What type of device are you using? *AM @kjane626 What's going on? *AM @nickbeee What's going on? *AM @lulama_mm Try this: on your BB go to Options&gt;Applications&gt;UberSocial, set permissions to Allow &amp; save. Remove &amp; reinsert battery *AM @TrendyyNigga What type of device are you using? *AM @monkey_boyuk If it happens again, can you let us know what it is? We're looking into shutting it down. *AM @Triple_Bom21 What type of device are you using? *AM @monkey_boyuk What was the video advertising? *AM @monkey_boyuk What type of device are you using? What's being advertised? *AM @Triple_Bom21 What's going on? *AM @ForzaSunderland Is it working now? *AM @Everyday_Ian What type of device are you using? *AM @ForzaSunderland Can you try uninstalling the app, turning your device off and on, and reinstalling it? *AM @Naabz03 Try this, on your device click UberMenu&gt;Settings&gt;About UberSocial, scroll to the bottom, click Clear Cache and click Yes *AM @wbaboy Try this, on your device click UberMenu&gt;Settings&gt;About UberSocial, scroll to the bottom, click Clear Cache and click Yes *AM @ForzaSunderland What's going on? *AM @wbaboy What type of device are you using? *AM @Naabz03 What type of device are you using? *AM @banksybanks What type of device are you using? *AM @Late2thePartee Are you still experiencing this issue? *AM @ladyneat Are you still experiencing this issue? *AM @kwanfan1212 Are you still experiencing this issue? *AM @xredsexydevilx Great *AM @Hicksterette Are you still experiencing this issue? *AM @xredsexydevilx It's fixed? *AM @Hicksterette What type of Android are you using? *AM @xredsexydevilx What type of device are you using? *AM @kwanfan1212 What type of device are you using? *AM @Late2thePartee What type of device are you using? *AM @Ahmed_Kage Can you try uninstalling the app, turning your device off and on, and reinstalling it? *AM @Late2thePartee What's going on? *AM @Ahmed_Kage Try this: on your BB go to Options&gt;Applications&gt;UberSocial, set permissions to Allow &amp; save. Remove &amp; reinsert battery *AM @seyidoxa What's going on? *AM @Ahmed_Kage What type of device are you using? *AM Download Disney’s Planes: Fire and Rescue today! - http://t.co/gOjp1s9b1m RT @DannyEpperson: @UberSoc \"Fauxrrell\" Williams wishes you a \"Happy\" Halloween #Pharrell #UberHalloween http://t.co/niNZeWGHnL @heatherface85 SERIOUS effort. So cool! RT @heatherface85: @UberSoc #uberhalloween no masks allowed at school so I had to paint and cut his hair for the Bane look lol http://t.co/… @DeniseRolfs lolz this is great RT @DeniseRolfs: @UberSoc  colonel sanders and his chic ❤️🐔#UberHalloween http://t.co/LAT0Zvp6ku Got a great costume for Halloween this year? Tweet us pictures using #UberHalloween and we’ll retweet the best three! Tweet us your pictures of your Halloween costumes using #UberHalloween – we’ll retweet our favorite three photos! We want to see how great your Halloween costumes are! Tweet us pics using #UberHalloween, we’re retweeting the best three Going all out for Halloween this year? Tweet us photos of your costume using #UberHalloween - we’ll retweet the top three! @_Thundercleese Can you try uninstalling the app, turning your device off and on, and reinstalling it? *AM @_Thundercleese no? *AM @otradercino When did this start happening? *AM @Psycho_Thrills Can you try uninstalling the app, turning your device off and on, and reinstalling it? *AM @Nucreed_ Try this: on your BB go to Options&gt;Applications&gt;UberSocial, set permissions to Allow &amp; save. Remove &amp; reinsert battery *AM @Psycho_Thrills Try this: on your BB go to Options&gt;Applications&gt;UberSocial, set permissions to Allow &amp; save. Remove &amp; reinsert battery *AM @iamSANNY_M Are they taking you to the App Store? *AM @ItsNhlekzin Try this: on your BB go to Options&gt;Applications&gt;UberSocial, set permissions to Allow &amp; save. Remove &amp; reinsert battery *AM @Nucreed_ What type of device are you using? *AM @Nucreed_ What's going on? *AM @ItsNhlekzin What type of device are you using? *AM @Tenk_Blues What's going on? *AM @ItsNhlekzin What's going on? *AM @HansErikIken I'll report this to our developers. So sorry! *AM @HansErikIken Try this: on your BB go to Options&gt;Applications&gt;UberSocial, set permissions to Allow &amp; save. Remove &amp; reinsert battery *AM @HansErikIken Hahaha. Hmm, when does this error message come up? *AM @HansErikIken What's type of device are you using? *AM @Ahmed_Kage When did this start happening? *AM @HansErikIken What's going on? *AM @Ahmed_Kage What type of device are you using? *AM @janescuppatea Can you try uninstalling the app, turning your device off and on, and reinstalling it? *AM @janescuppatea What type of device are you using? *AM @janescuppatea What's going on? *AM @edenceballos What type of device are you using? *AM @thulani_zwane10 How can we help? *AM @metalsello What type of device are you using? *AM @Its_kagiso How can we help? *AM Get Disney's ultimate princess fairytale #SleepingBeauty today! For the first time on Digital HD!  http://t.co/23XHlMkGzo @newmovescrissy What type of device are you using? *AM @Jamithepianoguy When did this start happening? *AM @JlNWOOS :) *AM @Gregzy_ What type of device are you using? *AM @Gregzy_ How long has this been going on? *AM @JussZee What's going on? *AM @Flyin_Me What type of device are you using? *AM @aDarkskinChick What type of device are you using? *AM @IAmTwerk Can you try uninstalling the app, turning your device off and on, and reinstalling it? *AM @IAmTwerk When did this start happening? *AM @IAmTwerk What type of device are you using? *AM Something new, just in time for #Fall - the @PaneraBread Turkey Cranberry flatbread! http://t.co/PDgpUPiMMW @jojospencer What type of device are you using? *AM @Yanga_Odwa Try this: on your BB go to Options&gt;Applications&gt;UberSocial, set permissions to Allow &amp; save. Remove &amp; reinsert battery *AM @Yanga_Odwa What type of device are you using? *AM @FoxyJazzabelle What type of device are you using? *AM @OhSoPinkBaby When did this start happening? *AM @OhSoPinkBaby What type of device are you using? *AM @firintakarai :) *AM @OhSoPinkBaby How can we help? *AM @_iamraymonds What's going on? *AM @Late2thePartee What type of device are you using? *AM @DjFacts_FOE What type of device are you using? *AM @DjFacts_FOE How can we help? *AM @Le_Funky No *AM @DamnItsLucky Try this: on your BB go to Options&gt;Applications&gt;UberSocial, set permissions to Allow &amp; save. Remove &amp; reinsert battery *AM @DamnItsLucky What type of device are you using? *AM @DamnItsLucky Also, seriously, what's going on with the application on your phone? Is it not working? *AM @DamnItsLucky THAT'S WHAT LOVE IS *AM @Shony_So2be What type of device are you using? *AM @DamnItsLucky Incredibly emotionally fulfilling? :) *AM @ellyween How can we help? *AM @AvelaMajivolo Try this: on your BB go to Options&gt;Applications&gt;UberSocial, set permissions to Allow &amp; save. Remove &amp; reinsert battery *AM @DaveBoll We will forward you an alternative version to download *AM @Mumsy_ What type of device are you using? *AM @AvelaMajivolo What's going on? *AM @GaemGyuRee What type of device are you using? *AM @Iamkingswar Try this: on your BB go to Options&gt;Applications&gt;UberSocial, set permissions to Allow &amp; save. Remove &amp; reinsert battery *AM @Iamkingswar What type of device are you using? *AM @CYNIC_TRIPLE6 How can we help? *AM @NI_trev Great *AM @NI_trev Can you try uninstalling the app, turning your device off and on, and reinstalling it? *AM @Giandrii How can we help? *AM @bolastname Try this, on your device click UberMenu&gt;Settings&gt;About UberSocial, scroll to the bottom, click Clear Cache and click Yes *AM @bolastname Are you currently using the most recent version of Ubersocial? *AM @NI_trev Try this, on your device click UberMenu&gt;Settings&gt;About UberSocial, scroll to the bottom, click Clear Cache and click Yes *AM @bolastname What type of device are you using, and when did this start happening? *AM @macoww Upgrading to Pro :) *AM @NI_trev What type of device are you using, and when did this start? *AM @DaveBoll ...older version of the application to see if that version will allow us to remove ads for you? *AM 3/3 @DaveBoll ...very sorry for this unusual issue, and trying to figure out a solution. Would you be willing to try downloading an... 2/3 @DaveBoll I have checked in with the developers several times - they're not sure why adding your name hasn't been effective. We're... 1/3 @bobugzy What's wrong? *AM In 30 days the MyPict photo service will be shut down. Please download any pictures you want to save before Sept 29th by visiting mypict.me @Seun4mine How can we help? *AM @KingPoke_04 How can we help? *AM The MyPict photo service will be shut down in 30 days, please download any pictures you want to save before Sept 29th by visiting mypict.me! The MyPict photo service will be shut down in 30 days. Please download any pictures you want to save before Sept 29 by visiting mypict.me The MyPict photo service will be shut down in 30 days. Please download any pictures you want to save before Sept 29th by visiting mypict.me! The MyPict photo service will be shut down in 30 days, please download any pictures you want to save before Sept 29 by visiting mypict.me @thozamaN Are you being taken to the App Store? *AM @november17 What's wrong? *AM @november17 How can we help? *AM @KarmaTheCreole How can we help? *AM The MyPict photo service will be shut down in 30 days, please download any pictures you want to save before 9/29 by visiting mypict.me The MyPict photo service will be shut down in 30 days, please download any pictures you want to save before Sept 29th by visiting mypict.me @ronkizzle93 Try this: on your BB go to Options&gt;Applications&gt;UberSocial, set permissions to Allow &amp; save. Remove &amp; reinsert battery *AM @ronkizzle93 What type of device are you using? *AM @ronkizzle93 How can we help? *AM @_MissModise How can we help? *AM @Oupas_Montso Try this: on your BB go to Options&gt;Applications&gt;UberSocial, set permissions to Allow &amp; save. Remove &amp; reinsert battery *AM @Kasice How can we help? *AM @zmarv How can we help? *AM @Mj_The3rdPick How can we help? *AM @ChisomBullet How can we help? *AM @Itz_Omo Try this: on your BB go to Options&gt;Applications&gt;UberSocial, set permissions to Allow &amp; save. Remove &amp; reinsert battery *AM @Itz_Omo What type of device are you using? *AM @BuchiB How can we help? *AM @EvermoreDarkly_ What type of device are you using? *AM @purpleindica How can we help? *AM @EvermoreDarkly_ What's going on? *AM Our CTO/POTUM @gladyzzz does the Ice Bucket Challenge and challenges ALL our followers to take it! http://t.co/hkx9gXvrds via @YouTube Own #Marvel’s  #CaptainAmerica #WinterSoldier today on Digital HD &amp; get tons of bonus featurettes &amp; more! http://t.co/3LvrzH5CFh @Afika_N How can we help? *AM @GrimmyBootMan How can we help? *AM @ConnectWithChan Are they taking you to the Play Store? *AM @ConnectWithChan What's going on? *AM @Flyer_thanu2 How can we help? *AM Packed with Dozens of Guest Cameos, New Songs, and an unnecessarily extended cut. Download Muppets Most Wanted in Digital HD today! @the1datewonder How can we help? *AM @DaveBoll I've asked the devs how this is possible, I'll let you know what they say *AM @Lee_Mbhellzz Try this, on your device click UberMenu&gt;Settings&gt;About UberSocial, scroll to the bottom, click Clear Cache and click Yes *AM @DaveBoll Did you follow the instructions we sent you on August 7th? *AM @Lee_Mbhellzz What type of device are you using? *AM @DaveBoll ...reason why ads should still be showing on your device. *AM 2/2 @DaveBoll Are the instruction which we sent you last week not making any difference? You have been added to our registry, there is no... 1/2 @DamnItsLucky How can we help? *AM RT @Bill_Gross: For your Friday night enjoyment: Italy at Night from the International Space Station. Wow! http://t.co/DWlAvU0MKp @DaveBoll ...UberSocial\"\n5. Tap \"Update Registration\" *AM 2/2 @DaveBoll 1. Press your phone's menu button from your UberSocial timeline\n2. Tap \"More\"\n3. Tap \"Settings\"\n4. Tap \"About... 1/2 @DaveBoll Did you follow the ad-removal steps you were sent through our customer service portal? *AM @matthew_hobbs What type of device are you using? *AM @Mista_Butosh How can we help? *AM @DaveBoll Have you tried uninstalling and reinstalling? *AM @DaveBoll Your name was added to our Pro registry two weeks ago. You're still seeing ads? *AM @_Ceefour What type of device are you using? *AM @_Ceefour How can we help? *AM @khutso001 What type of device are you using? *AM @DjFacts_FOE How can we help? *AM @abhaymudele Great *AM @khutso001 How can we help? *AM @abhaymudele Try this: on your BB go to Options&gt;Applications&gt;UberSocial, set permissions to Allow &amp; save. Remove &amp; reinsert battery *AM @abhaymudele How can we help? *AM @halkkamalkka Did your lists disappear? *AM @halkkamalkka What type of device are you using? *AM @halkkamalkka How can we help? *AM @_Klaicedj What type of device are you using? *AM @SMARTMRTEE What type of device are you using? *AM @OfficialsMarc What type of device are you using? *AM @OfficialsMarc Does uploading the same image through http://t.co/xm9H9vwt7e similarly reduce the quality? *AM @OfficialsMarc How can we help? *AM @LOSGIDDY How can we help? *AM @CaLLmeA_Lady What type of device are you using? *AM @quidditchballs How can we help? *AM @TalentGumbi How can we help? *AM @karis_gaza What type of device are you using? *AM @ndy_Monroe207 What type of device are you using? *AM @Jydeskillz Try this: on your BB go to Options&gt;Applications&gt;UberSocial, set permissions to Allow &amp; save. Remove &amp; reinsert battery *AM @Jydeskillz What type of device are you using? *AM @Ayo_redDevil How can we help? *AM @LuValentino What type of device are you using? *AM @Le_ViXeN What type of device are you using? *AM @chrstllchtzgale What type of device are you using? *AM With moving performances and a storyline fit for the whole family, @HeavenIsForReal is out now on Blu-ray: http://t.co/LL6Av6GQOF @_K_element Try this, on your device click UberMenu&gt;Settings&gt;About UberSocial, scroll to the bottom, click Clear Cache and click Yes *AM @_K_element What is going on *AM @DaveBoll I have sent a followup email to our developer. *AM Sprint Customers – Get a $150 Reward Card with every LG G3 order. http://t.co/WlsoYrPYcp Offer ends 7/24. http://t.co/3cMUi17GXw @2KEEMdomCome What type of device are you using? *AM @pandamarc What type of device are you using? *AM @2KEEMdomCome How can we help? *AM @DaveBoll Your handle was passed along to a developer to be added to our Pro registry. *AM Don't miss out on amazing @Lowes 4th of July sales this weekend #IndependenceDay Wanna check out the newest features of UberSocial like instant notifications? Join our tester community. Here's how: http://t.co/hKMw9ejxnm @FLYnIMaBOY Try this: on your BB go to Options&gt;Applications&gt;UberSocial, set permissions to Allow &amp; save. Remove &amp; reinsert battery *AM @FLYnIMaBOY What type of device are you using? *AM @MyNameIsThando How can we help? *AM @Nerk_King What type of device are you using? *AM @DECIPHER_BKI Try this, on your device click UberMenu&gt;Settings&gt;About UberSocial, scroll to the bottom, click Clear Cache and click Yes *AM @HarkinOmy 3.0.115 *AM @HarkinOmy Are you using the latest version? *AM @HarkinOmy What type of device are you using? *AM Do you want to be the first to see new features? Become a tester of early unreleased versions of UberSocial. To join: http://t.co/G2zlAxmIWF @MzuaCares I can't see the image. What's going on? *AM Wanna check out the newest features of UberSocial like instant notifications? Join our tester community. Here's how: http://t.co/bOGkjFBYIs @DAMMIT88 Unusual. I'll forward this to our developers to see what they say *AM @DAMMIT88 Can you send us a screenshot? *AM @DAMMIT88 Try this, on your device click UberMenu&gt;Settings&gt;About UberSocial, scroll to the bottom, click Clear Cache and click Yes *AM @drue_just Try this, on your device click UberMenu&gt;Settings&gt;About UberSocial, scroll to the bottom, click Clear Cache and click Yes *AM @DAMMIT88 Do you have the most recent version on your iPhone? *AM @DAMMIT88 How can we help? *AM @WVUGuy29 Try this: on your BB go to Options&gt;Applications&gt;UberSocial, set permissions to Allow &amp; save. Remove &amp; reinsert battery *AM @drue_just What type of device are you using? *AM @WVUGuy29 What type of device are you using? *AM @TSpoon101 Are you on the latest version of Ubersocial? *AM @colourandlight This may be an issue the application has with your type of device - I'll let the developers know so they can fix it *AM @ChinyimbaJr What type of device are you using? *AM @colourandlight Try this, on your device click UberMenu&gt;Settings&gt;About UberSocial, scroll to the bottom, click Clear Cache and click Yes *AM Do you want to be the first to see new features? Become a tester of early unreleased versions of UberSocial. To join: http://t.co/XvKTFZAXxU @colourandlight What type of device are you using? *AM Wanna check out the newest features of UberSocial like instant notifications? Join our tester community. Here's how: http://t.co/MYvoyHV2h2 UberSocial beta testers needed! Help us improve UberSocial Android and join our tester community. Here's how to join: http://t.co/yF1Q7n7oDS @inpinitwuyun When did this start happening? *AM @NubianCeaser When did this start happening? *AM @abelardinelli Are you on the most recent version of Ubersocial? *AM @abelardinelli Try this: on your BB go to Options&gt;Applications&gt;UberSocial, set permissions to Allow &amp; save. Remove &amp; reinsert battery *AM @NubianCeaser What type of device are you using? *AM Do you want to be the first to see new features? Become a tester of early unreleased versions of UberSocial. To join: http://t.co/or8uJJRIgQ Do you want to get notifications instantly? Then join our beta testing group through Google+!  Here's how to join: http://t.co/aDOxpu7oIl Want to get notifications instantly? Join our beta testing group through Google+!  Here's how to join: http://t.co/HIot1F55aT @knowledgee4 How can we help? *AM Do you want to get notifications instantly? Join our beta testing group through Google+!  Here's how to join: http://t.co/sX4feDja6k Do you want to get notifications instantly? Then join our beta testing group through Google+!  Here's how to join: http://t.co/KPmjEUcrMz @MsAdlerIPresume Hmm. What type of device are you using? *AM @HashmiZahra Are you able to see it in Google Play? What happens when you click on it? *AM Want to get notifications instantly? Join our beta testing group through Google+!  Here's how to join: http://t.co/Ji67lFkUsM @HashmiZahra Are you receiving an error code? *AM @HashmiZahra Is it not listed in the App Store? *AM @HashmiZahra What type of device are you using? *AM @MsAdlerIPresume Our application doesn't unfollow users. If your account is unfollowing users, you have likely been hacked *AM @HashmiZahra What country are you in? *AM Do you want to get notifications instantly? Join our beta testing group through Google+!  Here's how to join: http://t.co/xlcfeRCJUQ @CoasterMatt How is it malfunctioning? *AM @CoasterMatt What type of device are you using? *AM @riaz1230 @hjsbaker ...click Yes *AM 2/2 @riaz1230 @hjsbaker Try this, on your device click UberMenu&gt;Settings&gt;About UberSocial, scroll to the bottom, click Clear Cache and... 1/2 @TheBrothaMan How can we help? *AM @Robertg79 Try this, on your device click UberMenu&gt;Settings&gt;About UberSocial, scroll to the bottom, click Clear Cache and click Yes *AM @frozenglibber What type of device are you using? *AM @Robertg79 What type of device are you using? *AM @JamesHartz Try this, on your device click UberMenu&gt;Settings&gt;About UberSocial, scroll to the bottom, click Clear Cache and click Yes *AM @RedNat91 Try this, on your device click UberMenu&gt;Settings&gt;About UberSocial, scroll to the bottom, click Clear Cache and click Yes *AM @RedNat91 What type of device are you using? *AM @JamesHartz What type of device are you using? *AM @lenorajoseph How can we help? *AM @msmariealex What type of device are you using? *AM @JackieMichele What type of device are you using? *AM @JmPalaz Let's try clearing data. On device go to Settings&gt;Applications&gt;Manage Applications&gt;find &amp; select USoc&gt;Clear Data *AM @AninaMelissa How can we help? *AM @odiodioemmanuel Did you pay for Ubersocial? *AM @odiodioemmanuel Are you using Ubersocial Pro? *AM @NayaCarlo How can we help? *AM @ZJHENO Can you please submit this to our customer service portal? Thanks! *AM @siya_siyengo How can we help? *AM @AmethystLily77 What happens when you try to DM someone? *AM @AmethystLily77 What type of device are you using, and are you on updated to the most recent version of Ubersocial? *AM @iAm_Ohgee How can we help? *AM @ob1gr81 Are you able to log in via http://t.co/xm9H9vwt7e? *AM @NayD_Red :) *AM @Mr_Mawande What type of device are you using? *AM The @New_Matter MOD-t #3DPrinter is available now on @Indiegogo. Hurry! Limited quantity at $249! http://t.co/kthX6XF8jI #NewMatter @Jamieonthisday Try this, on your device click UberMenu&gt;Settings&gt;About UberSocial, scroll to the bottom, click Clear Cache and click Yes *AM @Jamieonthisday What type of device are you using? *AM @ob1gr81 What type of device are you using? *AM @ob1gr81 Have you recently changed your password? *AM @ob1gr81 Can you try uninstalling the app, turning your device off and on, and reinstalling it? *AM @ob1gr81 Are you able to log in via http://t.co/xm9H9vwt7e? *AM The @New_Matter MOD-t #3DPrinter is now on @Indiegogo. Hurry, limited quantity available at $199! http://t.co/S38uzKiZX2 #NewMatter The @New_Matter MOD-t #3DPrinter is available now on @Indiegogo. Hurry, limited quantity at $149! http://t.co/mTJIDZqB8J #NewMatter @juniorsebopelo Try this, on your device click UberMenu&gt;Settings&gt;About UberSocial, scroll to the bottom, click Clear Cache and click Yes *AM @juniorsebopelo Try this: on your BB go to Options&gt;Applications&gt;UberSocial, set permissions to Allow &amp; save. Remove &amp; reinsert battery *AM @juniorsebopelo What type of device are you using? *AM @Howard_Norton Let's try clearing data. On device go to Settings&gt;Applications&gt;Manage Applications&gt;find &amp; select USoc&gt;Clear Data *AM @juniorsebopelo How can we help? *AM @Howard_Norton What type of device are you using? *AM We’re starting the weekend by heading over to @Lowes for some great #MemorialDay savings @Dr_LoveURight How can we help? *AM @zedlaV559 How can we help? *AM @EsotericSH @Sorry_Busy What type of device are you using? *AM @gingertwit Can you try uninstalling the app, turning your device off and on, and reinstalling it? *AM @gingertwit Are you on the most recent version of Ubersocial? *AM @gingertwit What type of device are you using? *AM @OlaAyobami What type of device are you using? *AM @EduCatEd_ICE How can we help? *AM @Dollypizo How can we help? *AM @__Damojo What type of device are you using? *AM @brendboh How can we help? *AM @AndyEaston85 It should work for you again if you've uninstalled and reinstalled. Sub-$300 @new_matter #3DPrinter is launching 5/28 on @indiegogo. Limited discounts available. http://t.co/xWbkgdrjz8 http://t.co/Ivy559anbs Sub-$300 @new_matter #3DPrinter launches 5/28 on @indiegogo. Limited discounts are available. http://t.co/vZ9aeUDgCG http://t.co/ZAWsdSQi7Y Sub-$300 @new_matter #3DPrinter launches 5/28 on @indiegogo. Limited discounts available. http://t.co/k1Mo6KjXqE http://t.co/238MhbC3qW @Tumzisto What type of device are you using? *AM @BongaDlulane What type of device are you using? *AM @Robyn_Bx :) *AM @Iam_daBANG Try this: on your BB go to Options&gt;Applications&gt;UberSocial, set permissions to Allow &amp; save. Remove &amp; reinsert battery *AM @mxolii How can we help? *AM @WVUGuy29 Try this: on your BB go to Options&gt;Applications&gt;UberSocial, set permissions to Allow &amp; save. Remove &amp; reinsert battery *AM @WVUGuy29 What type of device are you using? *AM @PoLycarpFM What type of device are you using? *AM @Iam_daBANG What type of device are you using? *AM @OnlySteveH Try this, on your device click UberMenu&gt;Settings&gt;About UberSocial, scroll to the bottom, click Clear Cache and click Yes *AM @OnlySteveH Are you on the most recent version of Ubersocial? *AM @novianaindah What type of device are you using? *AM @OnlySteveH What type of device are you using? *AM @Katrina_KWM Can you try uninstalling the app, turning your device off and on, and reinstalling it? *AM @More_should How can we help? *AM @N_Preshy_N What type of device are you using? *AM @Katrina_KWM Try this, on your device click UberMenu&gt;Settings&gt;About UberSocial, scroll to the bottom, click Clear Cache and click Yes *AM @TheEightFour What type of device are you using? *AM @DumazileNgwenya What type of device are you using? *AM @Katrina_KWM What type of device are you using? *AM @novianaindah How can we help? *AM @TeeeBeeeKaaaY What type of device are you using? *AM @funkyeah_ Are you able to log in through http://t.co/gwDPfNFcz1? *AM @funkyeah_ Did you change your password? *AM @TeeeBeeeKaaaY How can we help? *AM @PalesaMatima How can we help? *AM @pwettymoi What type of phone/tablet are you using? *AM @Howard_Norton We are currently working on this issue - we're trying to get rid of pop-ups, including these ones.  *AM @belujuanto I've forwarded this issue to our developers to investigate *AM @Howard_Norton What country are you tweeting from, what type of device are you using, and what does the pop-up advertise? *AM @nompilojali Are you seeing pop-up ads? *AM @Tambae How can we help? *AM @mxolii Try this: on your BB go to Options&gt;Applications&gt;UberSocial, set permissions to Allow &amp; save. Remove &amp; reinsert battery *AM @_tooLEGIT Can you try uninstalling the app, turning your device off and on, and reinstalling it? *AM @_tooLEGIT For how long has this been an issue? *AM @mxolii What type of device are you using? *AM @_tooLEGIT What type of device are you using? *AM @iam_tswagz If this doesn't work, please enable SSL in Settings *AM @iam_tswagz Try this: on your BB go to Options&gt;Applications&gt;UberSocial, set permissions to Allow &amp; save. Remove &amp; reinsert battery *AM @belujuanto Can you please send us the make and model of your device, as well as a screenshot of the error message? *AM @iam_tswagz How can we help? *AM @msnhatesclaire ...is the ad a banner? What is it advertising? Can you send us a screenshot? *AM 2/2 @msnhatesclaire We're sorry for this issue, we're currently trying to prevent these pop-ups. What country are you tweeting from, and... 1/2 @kevnajeram Try this, on your device click UberMenu&gt;Settings&gt;About UberSocial, scroll to the bottom, click Clear Cache and click Yes *AM @Jamieonthisday How can we help? *AM @kevnajeram How can we help? *AM @Auren__ How can we help? *AM @CalvinMall What type of device are you using? *AM @CalvinMall How can we help? *AM @danz_dane Try this: on your BB go to Options&gt;Applications&gt;UberSocial, set permissions to Allow &amp; save. Remove &amp; reinsert battery *AM @danz_dane What type of device are you using? *AM @ODD_iinary Are you using a BB? *AM @ODD_iinary @AbestarR How can we help? *AM @AbestarR What's going on? *AM @riaz1230 Try this, on your device click UberMenu&gt;Settings&gt;About UberSocial, scroll to the bottom, click Clear Cache and click Yes *AM @riaz1230 What type of device are you using? *AM @ruedee_shai Try this: on your BB go to Options&gt;Applications&gt;UberSocial, set permissions to Allow &amp; save. Remove &amp; reinsert battery *AM @ruedee_shai Also what type of device are you using? *AM @ruedee_shai Can you try uninstalling the app, turning your device off and on, and reinstalling it? *AM @ruedee_shai When did you create your Twitter account? *AM @ruedee_shai Did you recently change your password? *AM @ruedee_shai How can we help? *AM @dozi1 Great *AM @dozi1 Try this, on your device click UberMenu&gt;Settings&gt;About UberSocial, scroll to the bottom, click Clear Cache and click Yes *AM @kanobagroup @Gr8ight Unfortunately, this is an issue with Twitter servers: https://t.co/F55m8oCTLa. Hopefully they'll resolve it soon! *AM @dozi1 What type of device are you using? *AM @TwitterDev We submitted a ticket earlier today. *AM @WH33ZARD How can we help? *AM @dozi1 How can we help? *AM @LorD_WeeD Unfortunately, this is an issue with Twitter servers: https://t.co/F55m8oCTLa *AM @Meself4efah @LastDeeToor What type of device are you using? *AM @Nthabisheng @T_wandy_ What type of device are you using? *AM @Tiego_Milito Unfortunately, this is an issue with Twitter servers: https://t.co/F55m8oCTLa *AM @AndyGibsonTV Unfortunately, this is an issue with Twitter servers: https://t.co/F55m8oCTLa *AM @da_kabz Unfortunately, this is an issue with Twitter servers: https://t.co/F55m8oCTLa *AM @AninaMelissa Unfortunately, this is an issue with Twitter servers: https://t.co/F55m8oCTLa *AM @thakid_19 @Mophizo_Wazza Unfortunately, this is an issue with Twitter servers: https://t.co/F55m8oCTLa *AM @ragbonehair Unfortunately, this is an issue with Twitter servers: https://t.co/F55m8oCTLa *AM @FigoMou Unfortunately, this is an issue with Twitter servers: https://t.co/F55m8oCTLa *AM @DixxMadika Unfortunately, this is an issue with Twitter servers: https://t.co/F55m8oCTLa *AM @mbuso_nkabinde Unfortunately, this is an issue with Twitter servers: https://t.co/F55m8oCTLa *AM @Sir_franklyn Unfortunately, this is an issue with Twitter servers: https://t.co/F55m8oCTLa *AM @Lady_Crunk Unfortunately, this is an issue with Twitter servers: https://t.co/F55m8oCTLa *AM @Champ_tile Are you using a BB? *AM @dneilmckay Unfortunately, this is an issue with Twitter servers: https://t.co/F55m8oCTLa *AM @NubianCeaser Unfortunately, this is an issue with Twitter servers: https://t.co/F55m8oCTLa *AM @OyenaD How can we help? *AM @EbiIsQuiet Unfortunately, this is an issue with Twitter servers: https://t.co/F55m8oCTLa *AM @Tiego_Milito Are you using a Blackberry? *AM @FigoMou How can we help? *AM @LorD_WeeD Are you using a Blackberry? *AM @muhdzahari Unfortunately, this is an error with Twitter servers: https://t.co/F55m8oCTLa *AM @EbiIsQuiet How can we help? *AM @Sir_franklyn @EbiIsQuiet Are you using a Blackberry? *AM @DemiSemiGod Unfortunately, this is an issue with Twitter servers: https://t.co/F55m8oCTLa *AM @Athenkosi_Guntu Try this: on your BB go to Options&gt;Applications&gt;UberSocial, set permissions to Allow &amp; save. Remove &amp; reinsert battery *AM @liefieB How can we help? *AM @DemiSemiGod How can we help? *AM @RuffCuttzENT Try this: on your BB go to Options&gt;Applications&gt;UberSocial, set permissions to Allow &amp; save. Remove &amp; reinsert battery *AM @Narril_dihno What type of device are you using? *AM @Narril_dihno How can we help? *AM @Athenkosi_Guntu What type of BB are you using, where are you tweeting from, and when did this start? *AM @RuffCuttzENT What type of device are you using? *AM @AndyGibsonTV Try this: on your BB go to Options&gt;Applications&gt;UberSocial, set permissions to Allow &amp; save. Remove &amp; reinsert battery *AM @LastDeeToor What type of device are you using? *AM @LastDeeToor Are you receiving an error code? *AM @da_kabz How can we help? *AM @Nthabisheng @T_wandy_ How can we help? *AM @T_wandy_ Try this: on your BB go to Options&gt;Applications&gt;UberSocial, set permissions to Allow &amp; save. Remove &amp; reinsert battery *AM @KaraboZacharia What type of BB are you using, where are you tweeting from, and when did this start? *AM @ThzUglyNigga What type of BB are you using, where are you tweeting from, and when did this issue start? *AM @LastDeeToor How can we help? *AM @Sis_Maxine Try this: on your BB go to Options&gt;Applications&gt;UberSocial, set permissions to Allow &amp; save. Remove &amp; reinsert battery *AM @CoconutIce22 Try this, on your device click UberMenu&gt;Settings&gt;About UberSocial, scroll to the bottom, click Clear Cache and click Yes *AM @Lirah_Jones911 Try this: on your BB go to Options&gt;Applications&gt;UberSocial, set permissions to Allow &amp; save. Remove &amp; reinsert battery *AM @Lirah_Jones911 We're sorry for this issue! *AM @Lirah_Jones911 ...start? *AM 2/2 @Lirah_Jones911 Are you getting an error code? What type of BB are you using, where are you tweeting from, and when did this error... 1/2 @_Helios__ How can we help? *AM @AnasMallick Try this: on your BB go to Options&gt;Applications&gt;UberSocial, set permissions to Allow &amp; save. Remove &amp; reinsert battery *AM @AnasMallick Where are you tweeting from, and when did this issue start? *AM @Sis_Maxine What kind of BB are you using, where are you tweeting from, and when did this issue start? *AM @AnasMallick What type of device are you using? *AM @Lirah_Jones911 What type of device are you using? *AM @CoconutIce22 What type of device are you using? *AM @AndyGibsonTV Can you try uninstalling the app, turning your device off and on, and reinstalling it? *AM @dneilmckay Try this: on your BB go to Options&gt;Applications&gt;UberSocial, set permissions to Allow &amp; save. Remove &amp; reinsert battery *AM @pablo210 @shirleyyoung2 @bigaggiemac How can we help? *AM @Zealot_1 ...using? *AM 2/2 @Zealot_1 Can you please send me a screenshot of the error code you're seeing? When did this error start? What type of device are you... 1/2 @AndyGibsonTV Can you please let me know if this works? *AM @AndyGibsonTV Try this: on your BB go to Options&gt;Applications&gt;UberSocial, set permissions to Allow &amp; save. Remove &amp; reinsert battery *AM @mthunzikunene Can you please try uninstalling and reinstalling? *AM @AustinNtshanga Try this: on your BB go to Options&gt;Applications&gt;UberSocial, set permissions to Allow &amp; save. Remove &amp; reinsert battery *AM @Faroukfabulous Try this: on your BB go to Options&gt;Applications&gt;UberSocial, set permissions to Allow &amp; save. Remove &amp; reinsert battery *AM @Parinda001 The problem is fixed? *AM @Ryzzo_Tim @certified_AY Can you send us a screenshot? What prompts error 152? *AM @HireTayDaniel How can we help? *AM @mbuso_nkabinde What type of device are you using, where are you tweeting from, and when did this start? *AM @Faroukfabulous What type of device are you using? *AM @AustinNtshanga What type of device are you using? *AM @iObeyHisLips Try this: on your BB go to Options&gt;Applications&gt;UberSocial, set permissions to Allow &amp; save. Remove &amp; reinsert battery *AM @JAYKINGSON Also, are you receiving an error code? *AM @JAYKINGSON @certified_AY What type of BB are you using, and when did this start? Where are you tweeting from? *AM @Parinda001 Try this: on your BB go to Options&gt;Applications&gt;UberSocial, set permissions to Allow &amp; save. Remove &amp; reinsert battery *AM @MsTaboo Try this: on your BB go to Options&gt;Applications&gt;UberSocial, set permissions to Allow &amp; save. Remove &amp; reinsert battery *AM @Lethubuhle_d Did it start in the past few days or the past few hours? *AM @MsTaboo When did this issue start? *AM @iObeyHisLips What type of device are you using, where are tweeting from, and when did this issue start? *AM @ObrianAdiebuzz Are you getting an error code? *AM @iamthebe_m Also, are you getting an error code? *AM @iamthebe_m Where are you tweeting from? When did this issue start? *AM @Faroukfabulous How can we help? *AM @Champ_tile How can we help? *AM @iObeyHisLips @AustinNtshanga How can we help? *AM @ObrianAdiebuzz What type of device are you using? *AM @certified_AY How can we help? *AM @AndyGibsonTV What type of BB are you using, and where are you tweeting from? *AM @daveelcris What type of device are you using? *AM @mbuso_nkabinde How can we help? *AM @Lethubuhle_d What type of device are you using, where are you tweeting from, and when did this error start occurring? *AM @T_wandy_ Also, what is it preventing you from doing? Could you please send a screenshot? *AM @T_wandy_ What type of device are you using? Where are you tweeting from? When did this error start occurring? *AM @Belinda_Factor Try this: on your BB go to Options&gt;Applications&gt;UberSocial, set permissions to Allow &amp; save. Remove &amp; reinsert battery *AM @PKGM How can we help? *AM @Mawely_dj How can we help? *AM @Kgali_Tlh12 From where are you tweeting? *AM @miznformed How can we help? *AM @daveelcris How can we help? *AM @iamthebe_m What type of device are you using? *AM @manfresi What type of device are you using? *AM @Parinda001 What type of BB, and from where are you tweeting? When did this start? *AM @Lethubuhle_d How can we help? *AM @Belinda_Factor What type of BB are you using, and where are you tweeting from? *AM @Dudoo_D @MsTaboo Which words won't it post? What type of BB are you using, and where are you tweeting from? *AM @Kgali_Tlh12 What type of BB are you using? *AM @_uSphe What type of device are you using? *AM @dhat_Lue What type of device are you using? *AM @Dudoo_D @Viwejack ...battery *AM 2/2 @Dudoo_D @Viwejack Try this: on your BB go to Options&gt;Applications&gt;UberSocial, set permissions to Allow &amp; save. Remove &amp; reinsert... 1/2 @ValAbnormal Try this: on your BB go to Options&gt;Applications&gt;UberSocial, set permissions to Allow &amp; save. Remove &amp; reinsert battery *AM @PureSurpriseM What type of device are you using? *AM @Kgali_Tlh12 How can we help? *AM @Lirah_Jones911 How can we help? *AM @Belinda_Factor How can we help? *AM @AndyGibsonTV @BlackBerry How can we help? *AM @Boniei Try this: on your BB go to Options&gt;Applications&gt;UberSocial, set permissions to Allow &amp; save. Remove &amp; reinsert battery *AM @JeffDeep_SA How can we help? *AM @ObrianAdiebuzz How can we help? *AM @Boniei What type of device are you using? *AM @mr_adedeji Try this: on your BB go to Options&gt;Applications&gt;UberSocial, set permissions to Allow &amp; save. Remove &amp; reinsert battery *AM @TeAmo_Official What type of device are you using? *AM @mthunzikunene Try this: on your BB go to Options&gt;Applications&gt;UberSocial, set permissions to Allow &amp; save. Remove &amp; reinsert battery *AM @mthunzikunene What type of device are you using? *AM @Leloe_M How can we help? *AM @conish How can we help? *AM @ThaboBee How can we help? *AM @Thando_Tshawty How can we help? *AM @Boniei @twitter What's going on? *AM @Melancholys_War How can we help? *AM @mthunzikunene How can we help? *AM @Lil_Hlengz What issue are you encountering with the application? *AM @Lil_Hlengz How can we help? *AM @Robirobi1 What type of device are you using? *AM @Robirobi1 How recently did you make your twitter accounts? *AM @ErickaBrutas How can we help? *AM @LopezTheHopez How can we help? *AM @erikld Try this, on your device click UberMenu&gt;Settings&gt;About UberSocial, scroll to the bottom, click Clear Cache and click Yes *AM @xMiss_Fx Yes, please try uninstalling and reinstalling *AM @Iamthobie3 How can we help? *AM @xMiss_Fx Try this, on your device click UberMenu&gt;Settings&gt;About UberSocial, scroll to the bottom, click Clear Cache and click Yes *AM @xMiss_Fx What type of device are you using? *AM @BsquareK Do the ads appear without tapping and do they expand over more than the banner at the bottom? @prithebatol Do they stay in the banner at the bottom or pop out of that without tapping? Also, where are you located? Thanks. @BsquareK Does the ad take you to this website without clicking the banner? *AM @jax1369 Sorry about that. A banner ad? Can you send a screenshot if you see again? Thanks. @TheBurnageBlue What type of device are you using? *AM @Lutho_Kula How can we help? *AM @BsquareK Do the pop-ups take you to the Play Store? *AM @WearWeirdSocks @twitter How can we help? *AM @TheBurnageBlue @Nathski22 How can we help? *AM @BsquareK What type of device are you using? Are you seeing pop-up advertisements? *AM @Mr_SNC Try this: on your BB go to Options&gt;Applications&gt;UberSocial, set permissions to Allow &amp; save. Remove &amp; reinsert battery *AM @Mr_SNC Are you using a BB? *AM @SthembeleGumede ...Yes *AM 2/2 @SthembeleGumede Try this, on your device click UberMenu&gt;Settings&gt;About UberSocial, scroll to the bottom, click Clear Cache and click... 1/2 @PhoenixGiancola How can we help? *AM @SthembeleGumede How can we help? *AM @Mr_SNC How can we help? *AM @CrunchyDisneyMa Can you try uninstalling the app, turning your device off and on, and reinstalling it? *AM @CrunchyDisneyMa ...Yes *AM 2/2 @CrunchyDisneyMa Try this, on your device click UberMenu&gt;Settings&gt;About UberSocial, scroll to the bottom, click Clear Cache and click... 1/2 @CrunchyDisneyMa What type of device are you using? *AM @GhostOrchid71 Try this, on your device click UberMenu&gt;Settings&gt;About UberSocial, scroll to the bottom, click Clear Cache and click Yes *AM @GhostOrchid71 What type of device are you using? *AM @Thee__RockStar How can we help? *AM @Howard_Norton ...you! *AM 2/2 @Howard_Norton Yes, I believe we already have a correspondence going through our support portal. Could you please reply there? Thank... 1/2 @Gucci_Thandeka What issue are you encountering with the application? *AM @GhostOrchid71 What issue are you experiencing with the application? *AM @Howard_Norton Also what type of device are you using? *AM @Howard_Norton What country are you tweeting from? Is this a pop up? *AM @purple_n_orange ...Yes *AM 2/2 @purple_n_orange Try this, on your device click UberMenu&gt;Settings&gt;About UberSocial, scroll to the bottom, click Clear Cache and click... 1/2 @purple_n_orange What type of device are you using? *AM @DoubleDMusicSA How can we help? *AM @NoahLamar Try this, on your device click UberMenu&gt;Settings&gt;About UberSocial, scroll to the bottom, click Clear Cache and click Yes *AM @NoahLamar What type of device are you using? *AM @HaunteDeception Is this a pop-up advertisement? *AM @Robirobi1 Try this, on your device click UberMenu&gt;Settings&gt;About UberSocial, scroll to the bottom, click Clear Cache and click Yes *AM @tejirioghene What type of device are you using? *AM @djapplejac Try this, on your device click UberMenu&gt;Settings&gt;About UberSocial, scroll to the bottom, click Clear Cache and click Yes *AM @GiovaniPrakasa Try this: on your BB go to Options&gt;Applications&gt;UberSocial, set permissions to Allow &amp; save. Remove &amp; reinsert battery *AM @GiovaniPrakasa What type of device are you using? *AM @MIGYSMALLS Okay, we'll help you with this issue there *AM @MIGYSMALLS You submitted a ticket to our customer service portal, right? *AM @George_Ruzv Try this: on your BB go to Options&gt;Applications&gt;UberSocial, set permissions to Allow &amp; save. Remove &amp; reinsert battery *AM @MIGYSMALLS Try this, on your device click UberMenu&gt;Settings&gt;About UberSocial, scroll to the bottom, click Clear Cache and click Yes *AM @George_Ruzv What type of device are you using? *AM @greekdude How can we help? What type of device are you using? *AM @Jamieonthisday I'm sorry about this issue. I'll report it to the developers, and they'll release a fix. Thanks for reporting it *AM @BraceKeLenyora Try this: on your BB go to Options&gt;Applications&gt;UberSocial, set permissions to Allow &amp; save. Remove &amp; reinsert battery *AM @Sego_Mogane What type of device are you using? *AM @BraceKeLenyora What type of device are you using? *AM @nicolecarolish How can we help? *AM #MeetTheCubs in Disneynature’s Bears in theatres today. First week ticket sales support our national parks. http://t.co/IVd0G9Sz7p @Jamieonthisday Are you on the latest version of Ubersocial? *AM @FrankCatalano Have you tried uninstalling, turning your device off, turning it back on, and reinstalling? *AM @FrankCatalano Have you tried clearing cache? *AM @Sego_Mogane How can we help? *AM @Jamieonthisday What type of device are you using? *AM @elipriyanka What type of device are you using? *AM Android folks: Interested in testing our latest beta? Join our community: http://t.co/Wk7mfTHuc9 Details here: http://t.co/k4ogQjTB0o @kojoNINJA Try this: on your BB go to Options&gt;Applications&gt;UberSocial, set permissions to Allow &amp; save. Remove &amp; reinsert battery *AM @kojoNINJA What type of device are you on? *AM @kojoNINJA How can we help? *AM Interested in beta testing for @UberSoc Android? Join our\ncommunity: http://t.co/BHerV2tcgW Details here: http://t.co/a6NgziYfOv @Chef_La_Mini How can we help? *AM Exclusive to Sprint customers: LG G Flex now $0 down. Restrictions apply. Click to learn more http://t.co/enmUYIP76h http://t.co/FKLrX7loct @FaeDee Great *AM @longpre11 Great *AM @longpre11 Try this, on your device click UberMenu&gt;Settings&gt;About UberSocial, scroll to the bottom, click Clear Cache and click Yes *AM @longpre11 What type of device are you using? *AM @Koolkid_LeGitch @fashionRebel016 When did this start happening? *AM @Koolkid_LeGitch @fashionRebel016 What type of device are you using? *AM @FaeDee Try this: on your BB go to Options&gt;Applications&gt;UberSocial, set permissions to Allow &amp; save. Remove &amp; reinsert battery *AM @FaeDee What type of device are you using? *AM @ihveanaddiction ...and click Yes *AM 2/2 @ihveanaddiction Actually, try this, on your device click UberMenu&gt;Settings&gt;About UberSocial, scroll to the bottom, click Clear Cache... 1/2 @ihveanaddiction We're sorry for the delay! *AM @fashionRebel016 @Koolkid_LeGitch How can we help? *AM @FaeDee How can we help? *AM @Nolly_23 Try this: on your BB go to Options&gt;Applications&gt;UberSocial, set permissions to Allow &amp; save. Remove &amp; reinsert battery *AM @Nolly_23 Are you using a Blackberry? *AM @DaveDolfN Great! *AM @DaveDolfN Try this: on your BB go to Options&gt;Applications&gt;UberSocial, set permissions to Allow &amp; save. Remove &amp; reinsert battery *AM @DaveDolfN What type of device are you using? *AM @DaveDolfN How can we help? *AM @fhinksleem Try this: on your BB go to Options&gt;Applications&gt;UberSocial, set permissions to Allow &amp; save. Remove &amp; reinsert battery *AM @fhinksleem What type of device are you using? *AM @fhinksleem How can we help? *AM @Didi_Matshakela Yes *AM Exclusive to Sprint customers: LG G Flex now $0 down. Restrictions apply. Click to learn more http://t.co/HxeOb9cjYe http://t.co/NxBX82vjYZ @Shatherealest How can we help? *AM @George_Ruzv Try this: on your BB go to Options&gt;Applications&gt;UberSocial, set permissions to Allow &amp; save. Remove &amp; reinsert battery *AM @George_Ruzv What type of device are you using? *AM @iamurbanaira Are you using a touch screen device? *AM @sonnieBLAZE___ Try this, on your device click UberMenu&gt;Settings&gt;About UberSocial, scroll to the bottom, click Clear Cache and click Yes *AM @sonnieBLAZE___ How can we help you be great? *AM @Amseunlawal Let's try clearing data. On device go to Settings&gt;Applications&gt;Manage Applications&gt;find &amp; select USoc&gt;Clear Data *AM @Amseunlawal Try this, on your device click UberMenu&gt;Settings&gt;About UberSocial, scroll to the bottom, click Clear Cache and click Yes *AM @Amseunlawal What type of device are you using? *AM @muzamiel Try this: on your BB go to Options&gt;Applications&gt;UberSocial, set permissions to Allow &amp; save. Remove &amp; reinsert battery *AM @iamurbanaira Okay, thank you. We're sorry for this problem! *AM @iamurbanaira What type of phone are you using? *AM @Schmiggs :) *AM @iamurbanaira Also, what type of device are you using? *AM @iamurbanaira What country are you tweeting from? Can you please send us a screenshot? We're trying to get rid of these ads *AM @Angie_Edwards92 Can you try uninstalling the app, turning your device off and on, and reinstalling it? *AM @Angie_Edwards92 Try this: on your BB go to Options&gt;Applications&gt;UberSocial, set permissions to Allow &amp; save. Remove &amp; reinsert battery *AM @ihveanaddiction What type of device are you using? *AM @GamingCentrum Try this, on your device click UberMenu&gt;Settings&gt;About UberSocial, scroll to the bottom, click Clear Cache and click Yes *AM @Angie_Edwards92 @Twitvid What type of device are you using? *AM @GamingCentrum What type of device are you using? *AM @GamingCentrum How can we help? *AM @yasserdollie How can we help? *AM @ihveanaddiction How can we help? *AM @nixonapun I'm sorry to hear that. Which device are you using @UberSoc on? *KD @BolutifeLORDson Can you try uninstalling the app, turning your device off and on, and reinstalling it? *AM @FLYnIMaBOY Thanks! *AM @Proverse Ok, if you decide to that, please let us know and thanks. *KD @FLYnIMaBOY Ok, thanks. We'll keep trying to get rid of it. *KD @cranmer87 How can we help? *AM @Proverse Are you still seeing those ads you reported last week? Thanks. *KD @FLYnIMaBOY Are you still seeing the ads you mentioned last week? Thanks. *KD @jax1369 Ok, thanks. *KD @caz6277 Yes, it might. Please let us know if you start seeing it again when you return. Thanks and enjoy your holiday! *KD @johnpioq We're sorry for this issue! Is it advertising a website or just an image? Are you on the latest version of Ubersocial?  *AM @johnpioq Could you please forward us a screenshot? We're trying to eliminate these ads *AM @johnpioq What kind of device are you using? What country are you tweeting from? *AM @johnpioq Are you getting pop-up ads? What are the ads advertising? *AM @BolutifeLORDson What model BB are you using, who is your service provider, and what OS are you on? *AM @Thuso_Househead @Its_kagiso What type of device are you using/ *AM @ttpra ...receive another ad after doing this, but they should clear up relatively soon after. *AM 3/3 @ttpra ...you will receive the message \"Ad Free Paid Version\" and your ads will begin to go away shortly. Note that you may... 2/3 @ttpra Please go to the Timeline menu in UberSocial and select \"Check for Update\".  This should force the activation.  If successful,... 1/3 @pitsokl Try this: on your BB go to Options&gt;Applications&gt;UberSocial, set permissions to Allow &amp; save. Remove &amp; reinsert battery *AM @pitsokl What type of device are you using? *AM @ttpra Yes, try uninstalling and reinstalling *AM @iturboiihaypex How can we help? *AM @BolutifeLORDson Try this: on your BB go to Options&gt;Applications&gt;UberSocial, set permissions to Allow &amp; save. Remove &amp; reinsert battery *AM @BolutifeLORDson When did this issue start occurring? *AM @BolutifeLORDson What type of device are you using? *AM @ttpra Try this: on your BB go to Options&gt;Applications&gt;UberSocial, set permissions to Allow &amp; save. Remove &amp; reinsert battery *AM @ttpra What type of device are you using? *AM @Phab_Toolz How can we help? *AM @LDYPrefers2Save Hello! *AM @jax1369 Are you still seeing those ads? Thanks. *KD @caz6277 Are you still seeing that ad? *KD @CaroPelchat Try this, on your device click UberMenu&gt;Settings&gt;About UberSocial, scroll to the bottom, click Clear Cache and click Yes *AM @CaroPelchat What type of device are you using? *AM @TimBeems We're sorry for this issue, we've been working on getting these ads removed for weeks *AM @TimBeems Have you tried uninstalling and reinstalling? *AM @Ancia08 @Ystun @jcnieuwoudt How can we help? *AM @Iloveasunflower Can you try uninstalling the app, turning your device off and on, and reinstalling it? *AM @ReggySmallz Try this: on your BB go to Options&gt;Applications&gt;UberSocial, set permissions to Allow &amp; save. Remove &amp; reinsert battery *AM @Iloveasunflower What type of device are you using? *AM @ReggySmallz What type of devise are you using? *AM @cynthytks How often does this show up? *AM @ranggaaulia Try this: on your BB go to Options&gt;Applications&gt;UberSocial, set permissions to Allow &amp; save. Remove &amp; reinsert battery *AM @ranggaaulia And this issue is still occurring? *AM @djolder Can you try uninstalling the app, turning your device off and on, and reinstalling it? *AM @djolder Have you tried clearing data? *AM @ranggaaulia When did this issue start occurring? *AM @djolder Try this, on your device click UberMenu&gt;Settings&gt;About UberSocial, scroll to the bottom, click Clear Cache and click Yes *AM @djolder What type of device are you using? *AM @djolder How can we help? *AM @bobugzy @sallybee41 Are you still having this issue? *AM @Marcc_k Also, what type of device are you using? *AM @Marcc_k We're sorry for this issue! What is the pop up advertising? What country are you tweeting from? *AM @Germolution What type of device are you using? *AM @olameday How can we help? *AM @krespresso :) *AM @CoachStephanieA What type of device are you using? *AM @CoachStephanieA How can we help? *AM @lethabo741 If an ad like that comes back, can you please send us a screenshot? We're trying to track them down to get rid of them *AM @coonleigh What's going on ? *AM @lethabo741 We're sorry! What type of device are you using? What country are you in? Can you send us a screenshot? *AM @FLYnIMaBOY We're sorry for this issue. What country are you in, and what type of device are you using? Could you send us a screenshot? *AM @Jimbowh Are you able to open the app? At what point does it crash? *AM @MitchAkinyi What model BB are you using, who is your service provider, and what OS are you on? *AM @eiwezee How can we help? *AM @LadyMoWhite How can we help? *AM @MitchAkinyi Does it reboot when you try to tweet, or open a picture, or refresh timeline? *AM @stmllr What type of ads are they? Also, what country are you tweeting from? *AM @nanami_kamimura Can you please try uninstalling, turning your device off, turning it back on, and reinstalling? *AM @Proverse What! Are these pop-up ads of a banner? What country are you tweeting from? Can you send us a screenshot? *AM @Thuso_Househead What type of device are you using? *AM @maznininiiii Try this: on your BB go to Options&gt;Applications&gt;UberSocial, set permissions to Allow &amp; save. Remove &amp; reinsert battery *AM @MitchAkinyi Are you able to open the application at all? At what point does it reboot? *AM @KeyMG05 Are you able to open the application at all? At what point does it reboot? *AM @5hekar it's been resolved for many users *AM @Jimbowh Is SSL enabled? *AM @nanami_kamimura What type of device are you on? *AM @SlimVZ Since you've reinstalled, at exactly what point does the app reboot? *AM @maznininiiii Yes, let us know if you are still having this issue after 24 hours *AM @rds1220 How can we help *AM @maznininiiii Yes *AM @Tkmakhene The issue has been resolved for many users *AM @SlimVZ What model BB are you using, who is your service provider, and what OS are you on? *AM @maznininiiii Select \"Check for Update\" in your menu to restore your purchase *AM *AM @berendtooms Select \"Check for Update\" in your menu to restore your purchase *AM @3AASSHA How can we help/ *AM @PweshEEfwEsh How can we help? *AM @revinamonica How recently did you make this Twitter account? Have you recently changed your password? *AM @maznininiiii Did you purchase Ubersocial Pro? *AM @berendtooms How can we help? *AM @nanami_kamimura If I click the link you've sent, it says the page doesn't exist. Is that what you mean? *AM @maznininiiii What type of device are you using? Did you purchase Ubersocial Pro? *AM @adjiesyahputra  A lot of users have said the issue is fixed *AM @P_Stunner_ How can we help? *AM @Marcs_Banner To remove the ads please purchase the Subscription for our app by going to the Purchase option on your app's menu. Tks! @krespresso Here's the url for that: http://t.co/Y0PnBvSLT7 *KD @baical10 Can you try uninstalling the app, turning your device off and on, and reinstalling it? *AM @baical10 Can you try clearing data? *AM @baical10 Try this, on your device click UberMenu&gt;Settings&gt;About UberSocial, scroll to the bottom, click Clear Cache and click Yes *AM @baical10 What type of device are you using/ *AM @Amseunlawal How can we help? *AM @TimBeems  Ok, thanks so much for the screenshots. Hopefully we can resolve this ASAP. *KD @caz6277 What is the ad advertising? Can you please send a screenshot? *AM @caz6277 Yes, we replied twice. Was this a pop-up ad? Have you seen any others? *AM @caz6277 Also, may I ask where you're located so we can try and track it down. @TimBeems Are you still seeing this ad? If so, could you send a screenshot @rmotters Can you please send us a screenshot if you see it again? Or let us know what the website is? Thanks. @nanami_kamimura ...Yes *AM 2/2 @nanami_kamimura Try this, on your device click UberMenu&gt;Settings&gt;About UberSocial, scroll to the bottom, click Clear Cache and click... 1/2 @Soobad88 Try this: on your BB go to Options&gt;Applications&gt;UberSocial, set permissions to Allow &amp; save. Remove &amp; reinsert battery *AM @fajryno1897 What type of device are you using? *AM @bukanlaki2biasa Yes, but how recently? *AM @AllyBC_Belle Did that work? *AM @littlemsnattie Try clicking the 'Alternate Sign In' link below the sign in button or on older version click the 'Sign In Via Browser' *AM @littlemsnattie How recently did you create this Twitter account? *AM @littlemsnattie Have you changed your password recently? Are you able to log in on a computer with the same password? *AM @BbyHuLZ_SA What type of device are you using? *AM @BbyHuLZ_SA Try this, on your device click UberMenu&gt;Settings&gt;About UberSocial, scroll to the bottom, click Clear Cache and click Yes *AM @AllyBC_Belle Try this: on your BB go to Options&gt;Applications&gt;UberSocial, set permissions to Allow &amp; save. Remove &amp; reinsert battery *AM @bukanlaki2biasa How recently did you create your Twitter account? *AM @doncho How can we help? *AM @BbyHuLZ_SA How can we help? *AM @AllyBC_Belle Does it only reboot when you open a picture? Are you able to tweet and refresh your timeline? *AM @AllyBC_Belle What model are you using, who is your service provider, and what OS are you on? *AM @barbaraisperf How can we help? *AM @businessplumber Did it work? *AM @markchappelle Can you try uninstalling the app, turning your device off and on, and reinstalling it? *AM @T_JAZZIE How can we help? *AM @businessplumber The BB issue has been resolved for some users. Try reinstalling, it may be working for your device *AM @AllyBC_Belle What type of device are you using? *AM @jesusmhdz What version of Ubersocial are you using? *AM @bukanlaki2biasa Can you try uninstalling the app, turning your device off and on, and reinstalling it? *AM @bukanlaki2biasa Try this: on your BB go to Options&gt;Applications&gt;UberSocial, set permissions to Allow &amp; save. Remove &amp; reinsert battery *AM @krespresso Can you please submit this issue to our customer service portal? *AM @caz6277 What type of device are you using? Was this a pop-up ad? *AM @MountainDewey64 This is the Twitter application Ubersocial. We're not affiliated with the car service Uber. *AM @bukanlaki2biasa What model BB are you using, who is your service provider, and what OS are you on? *AM @EdgarBouchan Try this: on your BB go to Options&gt;Applications&gt;UberSocial, set permissions to Allow &amp; save. Remove &amp; reinsert battery *AM @braindino Try this: on your BB go to Options&gt;Applications&gt;UberSocial, set permissions to Allow &amp; save. Remove &amp; reinsert battery *AM @Fritinancy We are currently working on a fix for this issue, we appreciate your patience *AM @wl_65kemp We are currently working on a fix for this issue, we appreciate your patience *AM @sammy_pravesh We are currently working on a fix, we appreciate your patience *AM @Tebatjo_ How can we help? *AM @feyi_ibile What type of device are you using? *AM @raymondapples Try this: on your BB go to Options&gt;Applications&gt;UberSocial, set permissions to Allow &amp; save. Remove &amp; reinsert battery *AM @DineYo_M How can we help? *AM @raymondapples What type of device are you using? *AM @DroopyDroop_Lu What type of device are you using? *AM @braindino What type of device are you using? *AM @gilpornillos13 Are you using a BB? *AM @zanazulkefli What model BB are you using, who is your service provider, and what OS are you on? *AM @SAlbson  Does your phone now reboot the second you tap the @UberSoc icon or does it appear to open briefly first and then reboot? *KD @MaduchoLuchi What model BB are you using, who is your service provider, and what OS are you on? *AM @LatarshiaBailey Great *AM @adesyafriani What model BB are you on, who is your service provider, and what OS are you on? *AM @Darmilolah What model BB are you using, who is your service provider, and what OS are you on? *AM @frickys Can you try uninstalling the app, turning your device off and on, and reinstalling it? *AM @LatarshiaBailey ...Yes *AM 2/2 @LatarshiaBailey Try this, on your device click UberMenu&gt;Settings&gt;About UberSocial, scroll to the bottom, click Clear Cache and click... 1/2 @MrLewinOkotie We're working on a fix, we apologize for the delay *AM @frickys Try this: on your BB go to Options&gt;Applications&gt;UberSocial, set permissions to Allow &amp; save. Remove &amp; reinsert battery *AM @_michy1 When did it stop rebooting? *AM @adesyafriani Hi! Let me try to help you with this. What's going on? *AM @Psycho_Thrills We're working on a fix, we're sorry for the delay *AM @LatarshiaBailey What type of device are you using? *AM @iLike2Takeover Hi! Let me try to help you with this. What's going on? *AM @Sopzin We're working on a fix, we're sorry for the delay? *AM @oladodo88 @twitter We're working on a fix, we're sorry for the delay *AM @Psycho_Thrills Who is your service provider, and what OS are you on? *AM @D3_Tweets Try this, on your device click UberMenu&gt;Settings&gt;About UberSocial, scroll to the bottom, click Clear Cache and click Yes *AM @D3_Tweets Are you using a BB? *AM @Sue036 We're currently working on a fix. We apologize for the inconvenience!  *AM @tea_party Who is your service provider, and what OS are you on? *AM @corneliushanung What model BB are you using, who is your service provider, and what OS are you on? *AM @lacano7 What type of device are you using? *AM @ItsLayla_Adams ...didn't download Twichanger first? *AM 2/2 @ItsLayla_Adams This issue with BBs rebooting when opening Ubersocial started on Thursday night/Friday morning. Are you sure you... 1/2 @SadieDOT_90 Have you recently downloaded any applications which may be conflicting with Ubersocial? *AM @ItsLayla_Adams When did you download it? *AM @ItsLayla_Adams Have you recently downloaded any applications which may be conflicting with Ubersocial? *AM @TheBookOf_A ...then reinstalling? *AM 2/2 @TheBookOf_A Have you recently installed any other applications that might conflict with Ubersocial? Have you tried uninstalling and... 1/2 @SadieDOT_90 Have you uninstalled and then reinstalled? *AM @TheBookOf_A Have you cleared any memory on your phone, or updated your software, or done anything which might account for the change? *AM @bobugzy What model BB are you using, who is your service provider, and what OS are you on? *AM @ValAbnormal Try this: on your BB go to Options&gt;Applications&gt;UberSocial, set permissions to Allow &amp; save. Remove &amp; reinsert battery *AM @Favin_chris What model BB are you using, who is your service provider, and what OS are you on? *AM @Cazzlin Try this, on your device click UberMenu&gt;Settings&gt;About UberSocial, scroll to the bottom, click Clear Cache and click Yes *AM @fahmizackdaen What model BB are you using, who is your service provider, and what OS are you on? *AM @Reenit Did you clear any memory or update your software or do anything which might be responsible for the change? *AM @Cazzlin What type of device are you using? *AM @ItsLayla_Adams ...improvement? *AM 2/2 @ItsLayla_Adams Did you clear any memory on your phone, or update your software, or make any changes which might account for the... 1/2 @SirDJBank We're working on a fix, we're sorry for the inconvenience! *AM @SAlbson Can you try uninstalling the app, turning your device off and on, and reinstalling it? *AM @JahanAlom Great *AM @bobugzy Hi! Let me try to help you with this. What's going on? *AM @Adv_Jeff When did Ubersocial stop rebooting your BB? *AM @Favin_chris Are you using a BB? *AM @sholaybaba What model BB are you on, who is your service provider, and what OS are you on? *AM @MissGray_M What model BB are you using, who is your service provider, and what OS are you on? *AM @piyushpankaj We're currently working on a fix, we apologize for any inconvenience! *AM @ValAbnormal Try this, on your device click UberMenu&gt;Settings&gt;About UberSocial, scroll to the bottom, click Clear Cache and click Yes *AM @ItsLayla_Adams When did it stop rebooting? What model BB are you on? *AM @Cazzlin Hi! Let me try to help you with this. What's going on? *AM Looking for a cutting edge phone? Sprint is offering an LG G2 for FREE online. Offer ends 3/31 http://t.co/vEBFLouzNU http://t.co/j5gOpxZAPK @Megaslestari What model BB are you on, who is your service provider, and what OS are you on? *AM @JahanAlom Try this, on your device click UberMenu&gt;Settings&gt;About UberSocial, scroll to the bottom, click Clear Cache and click Yes *AM @TheBookOf_A Is Ubersocial working on your BB? *AM @DJLBCZambia @vinyl_2020 Ubersocial is working on your BB? *AM @DineYo_M Try this: on your BB go to Options&gt;Applications&gt;UberSocial, set permissions to Allow &amp; save. Remove &amp; reinsert battery *AM @Lil_Hlengz What software version are you on? *AM @HannesB1759 Try this, on your device click UberMenu&gt;Settings&gt;About UberSocial, scroll to the bottom, click Clear Cache and click Yes *AM @MartinZeelandt What model BB are you on, who is your service provider, and what OS are you on? *AM @MartinZeelandt We're currently working on a fix. We apologize for the inconvenience! *AM @SlimVZ Operating System *AM @PsyvilleMontana @Lil_Hlengz ...Cache and click Yes *AM 2/2 @PsyvilleMontana @Lil_Hlengz Try this, on your device click UberMenu&gt;Settings&gt;About UberSocial, scroll to the bottom, click Clear... 1/2 @DineYo_M What type of device are you using? *AM @DJARSENAL1886 We're currently working on a fix, we're sorry for the inconvenience! *AM @LungiStarr Who is your service provider, and what OS are you on? *AM @patawele What OS are you on? *AM @SlimVZ What model BB are you on, who is your service provider, and what OS are you on? *AM @piyushpankaj What model BB are you on, who is your service provider, and what OS are you on? *AM @Lil_Hlengz Who is your service provider, and what OS are you running? *AM @_e__l What model BB are you using, who is your service provider, and what OS are you running? *AM @Lil_Hlengz What type of device are you using? *AM @itsmewilliam86 What model BB are you using, who is your service provider, and what OS are you running? *AM @HannesB1759 We're sorry for this issue. What type of device are you using? *AM @KaliwaLubasi Are you using a BB? Did the rebooting issue stop on your device? *AM @SimoneAlicious What model BB are you using, who is your service provider, and what OS are you running? *AM @El_da_gal Hi! Let me try to help you with this. What's going on? *AM @Lil_Hlengz @Simply_Carl1 @El_da_gal Hi! Let me try to help you with this. What's going on? *AM @sholaybaba Hi! Let me try to help you with this. What's going on? *AM @patawele What model BB are you using, who is your service provider, and what OS are you running? *AM @DJARSENAL1886 What model BB are you on, who is your service provider, and what OS are you running? *AM @sergioac2 Ubersocial worked for a few hours and stopped working again? *AM @olameday Hi! Let me try to help you with this. What's going on? *AM @Mthoko_Mseleku Hi! Let me try to help you with this. What's going on? *AM @dwifazaP What type of device are you using? *AM @Sue036 @BlackBerryHelp What model BB are you using, who is your service provider, and what OS are you on? *AM @denzelwynter Hi! Let me try to help you with this. What's going on? *AM @NEZsalsabila What model BB are you using, who is your service provider, and what OS are you on? *AM @lacano7 ...responsible for the fix? *AM 2/2 @lacano7 What model BB are you using, who is your service provider, and what OS are you on? Did you make any changes which might be... 1/2 @My_Ndeeser So it just started working without any changes? *AM @Miss_twiggz What model BB are you on, who is your service provider, and what OS are you on? *AM @My_Ndeeser ...determining this problem, we appreciate it! *AM 2/2 @My_Ndeeser Also, what model BB are you using, who is your service provider, and what OS are you on? Your input is really valuable in... 1/2 @just_xolisa Also, what model BB are you using, who is your service provider, and what OS are you on? *AM @just_xolisa Great! What settings did you change to get it working? Your input is really valuable in helping us sort out this problem *AM @My_Ndeeser Great! Was it rebooting before? What settings did you change to get it working? *AM @Miss_twiggz Great! Do you have any idea why it started working? Did you reinstall or update anything? *AM @EyFresh So sorry, we are working on a fix! We appreciate your patience *AM @EyFresh What OS are you on? *AM @CDetective_SH Try this, on your device click UberMenu&gt;Settings&gt;About UberSocial, scroll to the bottom, click Clear Cache and click Yes *AM @CDetective_SH @ActualJW What type of device are you using? *AM @Dudoo_D What model BB are you using, who is your service provider, and what OS are you on? *AM @siyasandas What model BB are you using, who is your service provider, and what OS are you on? *AM @KamoElevated Can you check your OS in your phone settings? *AM @iambrionny What OS are you on? *AM @siyasandas @LwaZee_V Are you on a BB? *AM @Meekayla_Ray @LwaZee_V Are you on a BB? If so, what model, who is your service provider, and what OS are you using? *AM @LwaZee_V Are you using a BB? If so, what model, who is your service provider, and what OS are you on? *AM @NeeCee75 What type of device are you using? *AM @Spiceemman Who is your service provider, and what OS are you using? *AM @Nyckname Who is your service provider? *AM @MVZaGoGo Can you try uninstalling the app, turning your device off and on, and reinstalling it? *AM @Nyckname What OS are you on? *AM @AdaoTheTruth What OS are you using? *AM @MVZaGoGo Try this, on your device click UberMenu&gt;Settings&gt;About UberSocial, scroll to the bottom, click Clear Cache and click Yes *AM @twangstar What model BB are you using, and who is your service provider? *AM @Sboshylinks Who is your service provider, and what model BB are you using? *AM @iambrionny What model BB are you using, and who is your service provider? *AM @MOSICA_ID What model BB are you using, and who is your service provider? *AM @MsMookie We're working on fixing it. We're sorry for the inconvenience! *AM @Nyckname What type of device are you using? *AM @Spiceemman What type of device are you using? *AM @frickys Are you using a BB? If so, what model, and who is your service provider? *AM @SirDJBank @TheeChromez Are you using a BB? If so, what model and who is your service provider? *AM @MVZaGoGo Are you using a BB? If so, what model, and who is your service provider? *AM @akter8 Who is your service provider? *AM @Im_Her_man Hi! Let me try to help you with this. What's going on? *AM @olaayolanda What model BB are you on, and who is your service provider? *AM @Vanmonky What model BB are you on, and who is your service provider? *AM Blackberry folks: Sorry again for the crashing issue. We're continuing to look for a solution. Thanks for all your feedback! @DixxMadika What model BB are you using, and who is your service provider? *AM @BishopAde What model BB are you using, and who is your service provider? *AM @BlaineKidd86 What model BB are you using, and who is your service provider? *AM @Spiceemman Hi! Let me try to help you with this. What's going on? *AM @iTsMeToosiN What model BB are you using, and who is your service provider? *AM @EyFresh What model BB are you using, and who is your service provider? *AM @Frank_Magotlhe What model BB are you using, and who is your service provider? *AM @iamRenji What model BB are you on, and who is your service provider? *AM @xxxkidflashxx @FlashCWFans What model BB are you using, and who is your service provider? *AM @tsile_raset @ShottaZee What model BB are you using, and who is your service provider? *AM @Tee_knights How can we help? *AM @IamBriannePrad Is your BB crashing when you try to use Ubersocial? *AM @ZolekaMtila Who is your service provider? *AM @IamOrezi_RHM What model BB are you using, and who is your service provider? *AM @SAlbson What model BB are you using, and who is your service provider? *AM @Gcobs_N Some BB users are currently experiencing this issue. What model BB are you using, and who is your service provider? *AM @CorinneAM We're so sorry, we're working on it. Who is your BB service provider? And what model BB are you using? *AM @big_d333 Ubersocial Pro is ad-free! *AM @nonoshee @Native_B Hi! Let me try to help you with this. What's going on? *AM @Sanele_Dee  What model BB are you using, and who is your service provider? *AM @Thee_LadyN @NkanyeziKubheka What model BB are you using, and who is your service provider? *AM @WaleOhJoe What model BB are you using, and who is your service provider? *AM @TboMach @NkanyeziKubheka What model BB are you using, and who is your service provider? *AM @yayoalmanzar What model BB are you using, and who is your service provider? *AM @ShottaZee What model BB are you using, and who is your service provider? *AM @Lee_Maje Hi! Let me try to help you with this. What's going on? *AM @DeLURASoul Hi! Let me try to help you with this. What's going on? *AM @Sanele_Dee Hi! Let me try to help you with this. What's going on? *AM @OsasKeren @Gidi_Traffic What model BB are you using, and who is your service provider? *AM @_Kayloowcarmel @Thee_LadyN @NkanyeziKubheka What model BB are you using, and who is your service provider? *AM @folamanboy @OsasKeren What model BB are you using, and who is your service provider? *AM @JewishUpdate ...provider is? *AM 3/3 @JewishUpdate ...what the problem is. Could you please let us know what model Blackberry you're using, and who your service... 2/3 @JewishUpdate We are working on fixing it. Collecting information from the users who are experiencing this will help us determine... 1/3 @DJLBCZambia We're sorry, we're trying to fix this issue! What model BB are you using, and who is your service provider? *AM @LeratoFiniza What model BB are you using, and who is your service provider? *AM @JewishUpdate Not yet, still assessing the issue. What model BB are you using, and who is your service provider? *AM @oladodo88 What type of BB are you using? Who is your service provider? *AM @emaknyahazel Our developers are working on a fix, sorry! *AM @NatasjaAdema What type of device are you using? *AM @TimBeems Are you on the most recent version of Ubersocial? *AM @YeancahS Our developers are working on a fix, sorry! *AM @noticiasypunto Our developers are working on a fix, sorry! *AM @Da_Souljhboi Our developers are working on a fix, sorry! *AM @noticiasypunto Your Android is crashing when you open Ubersocial, or your Blackberry is? *AM @TimBeems We're sorry about this issue. What type of device are you using, and where are you tweeting from? *AM @Kos_ We're sorry about this issue. What type of device are you using? Also, from what country are you tweeting? *AM @Da_Souljhboi Are you on a BB? *AM @adjiesyahputra Our developers are working on a fix, sorry! *AM @noticiasypunto When did this start happening? What model phone are you using? *AM @NatasjaAdema What does the ad look like? Is it a banner? Does it just come out of nowhere? *AM @DJ_AWOL88 Our developers are working on a fix for this issue, sorry! *AM @LisaRemillard Our developers are working on a fix for this issue, sorry! *AM @TapFlow Our developers are working on a fix for this issue, sorry! *AM @kinguche65 Our developers are working on a fix for this issue, sorry! *AM @Leelee_an @NuclearNadal Our developers are working on a fix for this issue, sorry! *AM @DJ_AWOL88 What type of device are you using? *AM @NatasjaAdema Are you on the most recent version of Ubersocial? *AM @TshepoMangaka w/ubersocial open tap BB options/menu button and scroll to 'about'. select &amp; version number should be toward the top *AM @NatasjaAdema What is the ad for? *AM @NhantuOfficial Hi! Let me try to help you with this. What's going on? *AM @TshepoMangaka Would you mind checking? It may help us figure out why this is happening *AM @WeirdSid Our developers are currently working on the issue, sorry! *AM @anitaplum Our developers are working on a fix for this issue, sorry! *AM @TshepoMangaka Are you on the most recent version of Ubersocial? *AM @WeirdSid What type of device are you using? *AM @TshepoMangaka What model BB are you using? We're trying to figure out why some BBs are having issues and some aren't *AM @tragic_pizza Try this, on your device click UberMenu&gt;Settings&gt;About UberSocial, scroll to the bottom, click Clear Cache and click Yes *AM @NatasjaAdema Which country are you tweeting from? *AM @TeamKeriHungary Are you using a BB? *AM @MissFunkyNess What type of device are you using? *AM @MissMonaisa Are you using a BB? *AM @TshepoMangaka Are you on wifi or using a phone service provider? *AM @bigaggiemac @anitaplum Are you using a BB? *AM @JustBipz Are you on a BB? *AM @ItsMe_Ru What's going on with the application? *AM @tragic_pizza What is happening? Does your device reboot when you open Ubersocial, or is the application crashing? *AM @Tizziie @eyekandyy What type of device are you using? *AM @Zee_Mashiyane What type of device are you using? *AM @tragic_pizza What type of device are you using? When did this start happening? *AM @MonaliissaMee Our developers are working on a fix, sorry! *AM @BonesOfStone Our developers are working on a fix, sorry! *AM @AditOjess Our developers are working on a fix, sorry! *AM @Zilungile Our developers are working on a fix, sorry! *AM @robinferr Our developers are working on a fix, sorry! *AM @MrLewinOkotie Our developers are working on a fix, sorry! *AM @Tebatjo_ Our developers are working on a fix, sorry! *AM @sherifftom Our developers are working on a fix, sorry! *AM @OneikaM Our developers are working on a fix, sorry! *AM @vusa_1 Our developers are working on a fix, sorry! *AM @yanti_379 Our developers are working on a fix, sorry! *AM @DixxMadika We're aware of the issue, and our developers are working on a fix. Sorry! *AM We don’t have to be family to be #Framily.  Let’s join up!  Learn more today at http://t.co/Vi2JP5np8C Blackberry users: We're aware of the crashing issue &amp; working on a fix. Thanks for your patience! @PweshEEfwEsh Our developers are working on a fix for this issue, sorry! *AM @IM_Nizzy Our developers are working on a fix for this issue, sorry! *AM @MadamSophie88 Try this, on your device click UberMenu&gt;Settings&gt;About UberSocial, scroll to the bottom, click Clear Cache and click Yes *AM @Aditya_TheBilly Our developers are working on a fix for this issue, sorry! *AM @Nebyla28 Our developers are working on a fix for this issue, sorry! *AM @JewishUpdate Our developers are working on a fix for this issue, sorry! *AM @Nebyla28 Are you using a Blackberry? *AM @BrynVille Our developers are working on a fix for this issue, sorry! *AM @Didi_Matshakela Our developers are working on a fix for this issue, sorry! *AM @BrynVille Are you using a Blackberry? *AM @NtambisoJ Our developers are working on a fix for this issue, sorry! *AM @BrynVille Hi! Let me try to help you with this. What's going on? *AM @handjuna Our developers are working on a fix for this issue, sorry! *AM @Didi_Matshakela Are you using a Blackberry? *AM @cynthytks What type of device are you using? *AM @Vani_Stevanny Our developers are working on a fix for this issue, sorry! *AM @JewishUpdate What type of device are you using? *AM @sls_ontario Our developers are working on a fix for this issue, sorry! *AM @MadamSophie88 What type of device are you using? *AM @Q_putrianti Our developers are working on a fix for this issue, sorry! *AM @IM_Nizzy Are you using a Blackberry? *AM @MadamSophie88 Hi! Let me try to help you with this. What's going on? *AM @falahuddinriza Our developers are working on a fix for this issue, sorry! *AM @KneWKeeD Our developers are working on a fix for this issue, sorry! *AM @Blademale @MariMinx Our developers are working on a fix for this issue, sorry! *AM @handjuna Are you using a Blackberry? *AM @Nebyla28 Hi! Let me try to help you with this. What's going on? *AM @Miss_twiggz @ManD_Mph Our developers are working on a fix for this issue, sorry! *AM @MariMinx Our developers are working on a fix for this issue, sorry! *AM @Khanya_Gwini Our developers are working on a fix for this issue, sorry! *AM @septoarief Hi! Let me try to help you with this. What's going on? *AM @Just_Tinkies @Sentletse Hi! Let me try to help you with this. What's going on? *AM @bolamie19 Hi! Let me try to help you with this. What's going on? *AM @Vani_Stevanny Are you using a Blackberry? *AM @MariMinx @Blademale Are you using a Blackberry? *AM @Aditya_TheBilly Are you using a Blackberry? *AM @Totally_Sane Our developers are working on a fix for this issue, so sorry! *AM @NtambisoJ Are you using a Blackberry? *AM @PKGM Our developers are working on a fix for this issue, so sorry! *AM @ChitownHeiress Our developers are working on a fix for this issue, so sorry! *AM @jax1369 We replied to your tweet yesterday. Our developers are working on a fix for this BB issue, so sorry! *AM @Enzolingo @Dudoo_D Our developers are working on a fix for this issue, so sorry! *AM @ScoopDiante Our developers are working on a fix for this issue, so sorry! *AM @Malebza_Lee27 Our developers are working on a fix for this issue, so sorry! *AM @mvano23 Our developers are working on a fix for this issue, so sorry! *AM @chiyutosan Our developers are working on a fix for this issue, so sorry! *AM @ainslieann Our developers are working on a fix for this issue, so sorry! *AM @CorinneAM Our developers are working on a fix for this issue, so sorry! *AM @nefrando Our developers are working on a fix for this issue, so sorry! *AM @PrimoJamaiquino Our developers are working on a fix for this issue, so sorry! *AM @WeirdSid Our developers are working on a fix for this issue, so sorry! *AM @SlimVZ Our developers are working on a fix for this issue, so sorry! *AM @MsRachelAyn Our developers are working on a fix for this issue, so sorry! *AM @Oupas_Montso Our developers are working on a fix for this issue, so sorry! *AM @SocaLover77 Our developers are working on a fix for this issue, so sorry! *AM @Barney_BerniceM Our developers are working on a fix for this issue, so sorry! *AM @pinkknailss Our developers are working on a fix for this issue, so sorry! *AM @SfisoDlodlo Our developers are working on a fix for this issue, so sorry! *AM @Its_mtee Our developers are working on a fix for this issue, so sorry! *AM @DhirajPandhi Our developers are working on a fix for this issue, so sorry! *AM @slimjp Our developers are working on a fix for this issue, so sorry! *AM @NuclearNadal Our developers are working on a fix for this issue, so sorry! *AM @the_turtle Our developers are working on a fix for this issue, so sorry! *AM @TheBookOf_A Our developers are working on a fix for this issue, so sorry! *AM @TabSharp Our developers are working on a fix for this issue, so sorry! *AM @Dayshizzzle @SHIIII_2 Our developers are working on a fix for this issue, so sorry! *AM @dayanafw Our developers are working on a fix for this issue, so sorry! *AM @GregSimmons I've notified our developers of this issue, they're working on a fix. So sorry! *AM @TheAlexRos How can we help? *AM @chiyutosan Are you using a BB? *AM @SfisoDlodlo Are you using a BB? *AM @Empress_Skye Are you using a BB? *AM @keThaboM Are you using a BB? *AM @_Helios__ I've notified our developers of this issue, they're working on a fix. So sorry! *AM @jaznatsoc I've notified our developers of this issue, they're working on a fix. So sorry! *AM @SHIIII_2 I've notified our developers of this issue, they're working on a fix. So sorry! *AM @slimjp What type of device are you using? *AM @Oupas_Montso What type of device are you using? *AM @Barney_BerniceM Are you using a BB? *AM @MartinZeelandt What type of device are you using? *AM @_Helios__ Hi! Let me try to help you with this. What's going on? *AM @Its_kagiso I've notified our developers of this issue, they're working on a fix. So sorry! *AM @BlaineKidd86 I've notified our developers of this issue, they're working on a fix. So sorry! *AM @pinkknailss Are you on the most recent version of Ubersocial? *AM @faryor I've notified our developers of this issue, they're working on a fix. So sorry! *AM @jaznatsoc You must enable SSL to use Ubersocial *AM @SocaLover77 Are you on the latest version of Ubersocial? Is SSL enabled? *AM @faryor Are you using a BB? *AM @DhirajPandhi Try this: on your BB go to Options&gt;Applications&gt;UberSocial, set permissions to Allow &amp; save. Remove &amp; reinsert battery *AM @tshoki_m Try this: on your BB go to Options&gt;Applications&gt;UberSocial, set permissions to Allow &amp; save. Remove &amp; reinsert battery *AM @I_Am_Tshwarelo Are you using a BB? *AM @TheBookOf_A Are you on the latest version of Ubersocial? Is SSL enabled? *AM @TabSharp Try this: on your BB go to Options&gt;Applications&gt;UberSocial, set permissions to Allow &amp; save. Remove &amp; reinsert battery *AM @SHIIII_2 Are you using a BB? *AM @Its_mtee Are you using a BB? *AM @NubianCeaser I've notified our developers of this issue, they're working on a fix. So sorry! *AM @DjFudge What type of device are you using? *AM @SweetLove12 @sprintcare I've notified our developers of this issue, they're working on a fix. So sorry! *AM @EyFresh I've notified our developers of this issue, they're working on a fix. So sorry! *AM @giesencreative What type of device are you using? *AM @GlobalSkeptic Hi! Let me try to help you with this. What's going on? *AM @EyFresh Are you on the latest version of Ubersocial, and is SSL enabled? *AM @KJLR84 I've notified our developers of this issue, they're working on a fix. So sorry! *AM @khanyisaMvunelo Try this: on your BB go to Options&gt;Applications&gt;UberSocial, set permissions to Allow &amp; save. Remove &amp; reinsert battery *AM @TheBookOf_A Try this: on your BB go to Options&gt;Applications&gt;UberSocial, set permissions to Allow &amp; save. Remove &amp; reinsert battery *AM @TheeBilly Are you on the most recent version of Ubersocial, and is SSL enabled? *AM @KJLR84 Are you on the most recent version, and is SSL enabled? *AM @JaseKM Try this: on your BB go to Options&gt;Applications&gt;UberSocial, set permissions to Allow &amp; save. Remove &amp; reinsert battery *AM @SlimVZ Try this: on your BB go to Options&gt;Applications&gt;UberSocial, set permissions to Allow &amp; save. Remove &amp; reinsert battery *AM @TheeBilly Try this: on your BB go to Options&gt;Applications&gt;UberSocial, set permissions to Allow &amp; save. Remove &amp; reinsert battery *AM @SlimVZ What model device are you using? *AM @bharatthanvi Try this: on your BB go to Options&gt;Applications&gt;UberSocial, set permissions to Allow &amp; save. Remove &amp; reinsert battery *AM @Bat_For_Roman Try this: on your BB go to Options&gt;Applications&gt;UberSocial, set permissions to Allow &amp; save. Remove &amp; reinsert battery *AM @TheeBilly What model BB are you using? *AM @bharatthanvi What model BB are you using? *AM @KJLR84 Try this: on your BB go to Options&gt;Applications&gt;UberSocial, set permissions to Allow &amp; save. Remove &amp; reinsert battery *AM @Bat_For_Roman What model BB are you using? *AM @jax1369 What type of device are you using? *AM @SlimVZ Hi! Let me try to help you with this. What's going on? *AM @EyFresh Try this: on your BB go to Options&gt;Applications&gt;UberSocial, set permissions to Allow &amp; save. Remove &amp; reinsert battery *AM @NubianCeaser Try this: on your BB go to Options&gt;Applications&gt;UberSocial, set permissions to Allow &amp; save. Remove &amp; reinsert battery *AM @SweetLove12 @sprintcare ...reinsert battery *AM 2/2 @SweetLove12 @sprintcare Try this: on your BB go to Options&gt;Applications&gt;UberSocial, set permissions to Allow &amp; save. Remove &amp;... 1/2 @thrashsoundly And are you on the most recent version of Ubersocial? *AM @thrashsoundly Is SSL enabled? *AM @Iskaandar Try this: on your BB go to Options&gt;Applications&gt;UberSocial, set permissions to Allow &amp; save. Remove &amp; reinsert battery *AM @NubianCeaser What is the make and model of the device you're using? *AM @SimoneAlicious Try this: on your BB go to Options&gt;Applications&gt;UberSocial, set permissions to Allow &amp; save. Remove &amp; reinsert battery *AM @passfish Try this: on your BB go to Options&gt;Applications&gt;UberSocial, set permissions to Allow &amp; save. Remove &amp; reinsert battery *AM @thrashsoundly Try this: on your BB go to Options&gt;Applications&gt;UberSocial, set permissions to Allow &amp; save. Remove &amp; reinsert battery *AM @thrashsoundly What model BB are you using? *AM @passfish What model BB are you using? *AM @KimDhlomo Try this: on your BB go to Options&gt;Applications&gt;UberSocial, set permissions to Allow &amp; save. Remove &amp; reinsert battery *AM @TheBookOf_A What type of device are you using? *AM @MelchiorStGust Try this: on your BB go to Options&gt;Applications&gt;UberSocial, set permissions to Allow &amp; save. Remove &amp; reinsert battery *AM @MoArt_ The issue has stopped? *AM @Khum27 Try this: on your BB go to Options&gt;Applications&gt;UberSocial, set permissions to Allow &amp; save. Remove &amp; reinsert battery *AM @WeirdSid @anitaplum What type of device are you using? *AM @KimDhlomo What model BB are you using? *AM @Zipho_Hlomz What type of device are you using? *AM @MelchiorStGust What type of device are you using? *AM @udphilz Hi! Let me try to help you with this. What's going on? *AM @Khum27 What type of device are you using? *AM @dayanafw Hi! Let me try to help you with this. What's going on? *AM @JaseKM What type of device are you using? *AM @wahyusamadyo Yes *AM @TUMSTAR_USS The issue has stopped? *AM @Mighty_Midget69 Try this: on your BB go to Options&gt;Applications&gt;UberSocial, set permissions to Allow &amp; save. Remove &amp; reinsert battery *AM @wahyusamadyo Try this: on your BB go to Options&gt;Applications&gt;UberSocial, set permissions to Allow &amp; save. Remove &amp; reinsert battery *AM @L3onB3E Hi! Let me try to help you with this. What's going on? *AM @MoArt_ Try this: on your BB go to Options&gt;Applications&gt;UberSocial, set permissions to Allow &amp; save. Remove &amp; reinsert battery *AM @paisleyrae Try this: on your BB go to Options&gt;Applications&gt;UberSocial, set permissions to Allow &amp; save. Remove &amp; reinsert battery *AM @Mighty_Midget69 What model BB? *AM @Linleigh_Shaw Are you on the most recent version of Ubersocial? *AM @OnneWahyuniii_ Hi! Let me try to help you with this. What's going on? *AM @nefrando @BlackBerry What model BB? *AM @MatthewGrahovic Hi! Let me try to help you with this. What's going on? *AM @Linleigh_Shaw What is the make and model of your device? *AM @Iskaandar What is the model of your BB? *AM @TUMSTAR_USS Also, is your SSL enabled? *AM @TUMSTAR_USS Try this: on your BB go to Options&gt;Applications&gt;UberSocial, set permissions to Allow &amp; save. Remove &amp; reinsert battery *AM @Khum27 Hi! Let me try to help you with this. What's going on? *AM @Mighty_Midget69 @UberSocial Hi! Let me try to help you with this. What's going on? *AM @NubianCeaser Hi! Let me try to help you with this. What's going on? *AM @Linleigh_Shaw Hi! Let me try to help you with this. What's going on? *AM @Hayden_101_ Are you on the most recent version of Ubersocial? *AM @TUMSTAR_USS Are you on the most recent version of Ubersocial? *AM @Hayden_101_ What model BB are you using? *AM @DJ_AWOL88 Are you on the most recent version of Ubersocial? *AM @Corr_ Try this: on your BB go to Options&gt;Applications&gt;UberSocial, set permissions to Allow &amp; save. Remove &amp; reinsert battery *AM @MoArt_ Are you on the most recent version of Ubersocial? *AM @Corr_ Are you on the most recent version of Ubersocial? *AM @ravi_178 Yes, please download the most recent version and let me know if that helps. *AM @MoArt_ What type of device are you using? *AM @SmittenKitten4D Also, what is model BB are you using? *AM @SmittenKitten4D I've reported this issue to our developers, we'll tweet a fix once we sort it out. So sorry! *AM @Conzalife Try this: on your BB go to Options&gt;Applications&gt;UberSocial, set permissions to Allow &amp; save. Remove &amp; reinsert battery *AM @Corr_ What is the model of your BB? *AM @DJ_AWOL88 Try this: on your BB go to Options&gt;Applications&gt;UberSocial, set permissions to Allow &amp; save. Remove &amp; reinsert battery *AM @Lady_mcqueen Try this: on your BB go to Options&gt;Applications&gt;UberSocial, set permissions to Allow &amp; save. Remove &amp; reinsert battery *AM @Conzalife What is the make and model of your device? *AM @TUMSTAR_USS What is the make and model of your device? *AM @ravi_178 What is the make and model of your device? *AM @DJ_AWOL88 What model are you using? *AM @Lady_mcqueen What is the make and model of your device? *AM @anitaplum @WeirdSid Hi! Let me try to help you with this. What's going on? *AM @MoArt_ Hi! Let me try to help you with this. What's going on? *AM @SimoneAlicious What is the make and model of your device? *AM @EyFresh What is the make and model of your device? *AM @SmittenKitten4D Are you experiencing the crash issue? *AM @baked_CPT @rumtumtiggs What type of device are you using? *AM @sherifftom I've notified the developers about this issue, they'll create a fix ASAP. We're sorry for the inconvenience! *AM @KatliTee Is your SSL enabled? *AM @PKGM Try this: on your BB go to Options&gt;Applications&gt;UberSocial, set permissions to Allow &amp; save. Remove &amp; reinsert battery *AM @larajacyntha Hi! Let me try to help you with this. What's going on? *AM @SmittenKitten4D Is your SSL enabled? *AM @AshleighAnn_ Are you using a blackberry? *AM @SmittenKitten4D Thanks! We're seeing this issue with a couple users atm, please let us know if it makes a difference *AM @ChitownHeiress Try this: on your BB go to Options&gt;Applications&gt;UberSocial, set permissions to Allow &amp; save. Remove &amp; reinsert battery *AM @KatliTee Try this: on your BB go to Options&gt;Applications&gt;UberSocial, set permissions to Allow &amp; save. Remove &amp; reinsert battery *AM @SmittenKitten4D Try this: on your BB go to Options&gt;Applications&gt;UberSocial, set permissions to Allow &amp; save. Remove &amp; reinsert battery *AM @mynameisbrooke Try this: on your BB go to Options&gt;Applications&gt;UberSocial, set permissions to Allow &amp; save. Remove &amp; reinsert battery *AM @sherifftom Try this: on your BB go to Options&gt;Applications&gt;UberSocial, set permissions to Allow &amp; save. Remove &amp; reinsert battery *AM @mynameisbrooke Hi! Let me try to help you with this. What's going on? *AM @PKGM What type of device are you using? *AM @AureliaCotta What type of device are you using? *AM @TeguhMicro What type of device are you using? *AM @PrideMaterial What type of device are you using? *AM @gilpornillos13 Hi! Let me try to help you with this. What's going on? *AM @Kay_Walters_Gu What type of device are you using? *AM @Kay_Walters_Gu Try this, on your device click UberMenu&gt;Settings&gt;About UberSocial, scroll to the bottom, click Clear Cache and click Yes *AM @Kay_Walters_Gu Hi! Let me try to help you with this. What's going on? *AM @gracecookie This is the Twitter account for the app Ubersocial, not for the car service Uber *AM @Les_Mad Try this, on your device click UberMenu&gt;Settings&gt;About UberSocial, scroll to the bottom, click Clear Cache and click Yes *AM @Les_Mad What type of device are you using? *AM @Les_Mad Hi! Let me try to help you with this. What's going on? *AM We don’t have to be family to be #Framily.  Let’s join up!  Learn more at http://t.co/H0q61Dv7Kp @gbollybakare You need to go through Twitter directly to change your password *AM @Jasper_CH Try this, on your device click UberMenu&gt;Settings&gt;About UberSocial, scroll to the bottom, click Clear Cache and click Yes *AM @Jasper_CH What type of device are you using? *AM @Jasper_CH Hi! Let me try to help you with this. What's going on? *AM @SMARTMRTEE Try this: on your BB go to Options&gt;Applications&gt;UberSocial, set permissions to Allow &amp; save. Remove &amp; reinsert battery *AM @SMARTMRTEE What type of device are you using? *AM @GodfreyJeeBoii What type of device are you using? *AM @LifeisSavage What type of device are you using? *AM @princessgleek Let's try clearing data. On device go to Settings&gt;Applications&gt;Manage Applications&gt;find &amp; select USoc&gt;Clear Data *AM @princessgleek Try this, on your device click UberMenu&gt;Settings&gt;About UberSocial, scroll to the bottom, click Clear Cache and click Yes *AM @princessgleek What type of device are you using? *AM @princessgleek @JustCatchDemi Hi! Let me try to help you with this. What's going on? *AM @gnitaheath @TawnyPixie Hi! Let me try to help you with this. What's going on? *AM @eh_sher Try this, on your device click UberMenu&gt;Settings&gt;About UberSocial, scroll to the bottom, click Clear Cache and click Yes *AM @bindr Hi! Let me try to help you with this. What's going on? *AM @DaveKyleUK @zatytom Hi! Let me try to help you with this. What's going on? *AM @fairuse Hi! Let me try to help you with this. What's going on? *AM @eh_sher Hi! Let me try to help you with this. What's going on? *AM @aisyahisah What type of device are you using? *AM @AndyDavies What type of device are you using? *AM @opeadepoju_ That may be because there are some country limitations, unfortunately. Which country are you in? *AM @jax1369 @UberSocial I have forwarded your information to the developers to investigate the problem. We apologize for this issue. *AM @KwenaMeso Try this: on your BB go to Options&gt;Applications&gt;UberSocial, set permissions to Allow &amp; save. Remove &amp; reinsert battery *AM @Mfanelo Can you be more specific? Which feature do you dislike? *AM @KwenaMeso What type of device are you using? *AM @opeadepoju_ There is! Available through Google Play *AM @GeniusWelcome Hi! Let me try to help you with this. What's going on? *AM @TanelleRanice Hi! Let me try to help you with this. What's going on? *AM @jo_the_hat @UberSocial What type of device are you using? *AM @LahLee_M Hi! Let me try to help you with this. What's going on? *AM @D_Anda_ Hi! Let me try to help you with this. What's going on? *AM @jax1369 Please enable SSL, even though your phone doesn't recommend it. It will resolve the issue. *AM @martinpv12 Try this: on your BB go to Options&gt;Applications&gt;UberSocial, set permissions to Allow &amp; save. Remove &amp; reinsert battery *AM @martinpv12 Hi! Let me try to help you with this. What's going on? *AM @IAmQuebex Try this, on your device click UberMenu&gt;Settings&gt;About UberSocial, scroll to the bottom, click Clear Cache and click Yes *AM @Sameeryeldu Try this: on your BB go to Options&gt;Applications&gt;UberSocial, set permissions to Allow &amp; save. Remove &amp; reinsert battery *AM @shawty639 What version of iOS are you using? Can you please forward me a screenshot of this issue? *AM @Sameeryeldu What type of device are you using? *AM @IAmQuebex We're sorry for this issue. What type of device are you on? *AM @shawty639 Are you on the most recent version of Ubersocial? *AM @Hle99Hle Is the Twitter account you're using recently made? *AM @shawty639 What type of device are you using? *AM @sageofages Twitter was experiencing issues this morning. Are you still seeing problems? *AM @Mallissa @UberSocial Twitter was experiencing issues. Are you still seeing problems? *AM @rmanson15 Hi! Let me try to help you with this. What's going on? *AM @Sameeryeldu Hi! Let me try to help you with this. What's going on? *AM @mesuneet Hi! Let me try to help you with this. What's going on? *AM @jordankgirl Hi! Let me try to help you with this. What's going on? *AM @ThandoThandani Hi! Let me try to help you with this. What's going on? *AM @jax1369 ...of Ubersocial? *AM 2/2 @jax1369 I still need your device information. I know you're using a blackberry - what kind? Also, are you on the most recent version... 1/2 @Le_ViXeN Twitter was experiencing an issue earlier. Are you still seeing this problem? *AM @gilesbabbidge Hi! Let me try to help you with this. What's going on? *AM @jax1369 I'll forward this issue to the developers. Can you send me your device information and a screenshot? *AM @Sboh_Ngcobo Hi! Let me try to help you with this. What's going on? *AM Twitter Status - Service issue http://t.co/7a46ppMvSl via @twitter @shawty639 Hi! Let me try to help you with this. What's going on? *AM @MsAyudya What type of device are you using? *AM @MsAyudya Hi! Let me try to help you with this. What's going on? *AM @danosantano Try this, on your device click UberMenu&gt;Settings&gt;About UberSocial, scroll to the bottom, click Clear Cache and click Yes *AM @danosantano What type of device are you using? *AM @aktokwe What error code are you receiving? *AM @ALogannn @UberSocial Hi! Let me try to help you with this. What's going on? *AM @aktokwe Hi! Let me try to help you with this. What's going on? *AM @danosantano Hi! Let me try to help you with this. What's going on? *AM @SoyisoMaliti Please contact Twitter directly for this issue. Thanks! *AM @TrulyyBlessed22 Can you try uninstalling the app, turning your device off and on, and reinstalling it? *AM @Mr_Humorist We're sorry, Ubersocial is only available for free in limited countries. Ubersocial Pro is available for $4.99 *AM @TrulyyBlessed22 ...Yes *AM 2/2 @TrulyyBlessed22 Try this, on your device click UberMenu&gt;Settings&gt;About UberSocial, scroll to the bottom, click Clear Cache and click... 1/2 @Mr_Humorist What type of device are you using? *AM @TrulyyBlessed22 Are you on the most recent version of the application? *AM @TrulyyBlessed22 Hi! Let me try to help you with this. What's going on? *AM @Mr_Humorist What country are you in? *AM @_KittyGangKala Can you send me a screenshot of the Settings screen where the option to change fonts used to be? *AM @_KittyGangKala What type of device are you using? *AM @AndreaSeleanaa Hi! Let me try to help you with this. What's going on? *AM @firintakarai :) *AM @_KittyGangKala :) *AM @hackingdallas Hi! Let me try to help you with this. What's going on? *AM @iam_Blinks I said 'Scroll to \"Options\" and select.' Step 3: Press the Options button again and select \"Network Options\". *AM @Angeliyah20 Hi! Let me try to help you with this. What's going on? *AM @iam_Blinks ...*AM 3/3 @iam_Blinks ...options button (on your phone) again and select \"Network Options\"\n4. Select \"Use SSL\" and press 'Save' at the top. ... 2/3 @iam_Blinks 1. Press your Blackberry's option button which should bring up a menu. \n2. Scroll to \"Options\" and select. \n3. Press the... 1/3 @iam_Blinks Select 'Allow', save. Please remove and reinsert battery. Also, check that SSL is enabled. *AM @lkayishere Ubersocial is available from Google Play *AM @Forever_Tanha @sidmallya Hi! Let me try to help you with this. What's going on? *AM @iam_Blinks Try this: on your BB go to Options&gt;Applications&gt;UberSocial, set permissions to Allow &amp; save. Remove &amp; reinsert battery *AM @jax1369 Is your SSL checked? *AM @iam_Blinks What type of device are you using? *AM @iam_Blinks Hi! Let me try to help you with this. What's going on? *AM @Le_ViXeN Hi! Let me try to help you with this. What's going on? *AM @rulsphere :) *AM @jax1369 Can you try uninstalling the app, turning your device off and on, and reinstalling it? *AM @TherealLungsta Try this: on your BB go to Options&gt;Applications&gt;UberSocial, set permissions to Allow &amp; save. Remove &amp; reinsert battery *AM @jax1369 Try this: on your BB go to Options&gt;Applications&gt;UberSocial, set permissions to Allow &amp; save. Remove &amp; reinsert battery *AM @jax1369 We're sorry for this issue. What type of device are you using? *AM @KRS_313 What type of device are you using? *AM @TherealLungsta What type of device are you using? *AM @KRS_313 @Yanga_Odwa Hi! Let me try to help you with this. What's going on? *AM @sheila0381 :) *AM @TherealLungsta Hi! Let me try to help you with this. What's going on? *AM @TemboJr_ The \"Cancel\" button doesn't stop tweets from sending. It allows you to get out of that screen in case the app freezes *AM Android friends- Check out this free app just released on Google Play:  http://t.co/PcKI0vhj9l Video Tube for YouTube. Android folks: Check out the Video Tube (Free) app this weekend: http://t.co/NFmkkhSk24 It's just been released on Google Play. @MassyKay Hi! Let me try to help you with this. What's going on? *AM @Yanga_Odwa Hi! Let me try to help you with this. What's going on? *AM @MaswaModjadji Hi! Let me try to help you with this. What's going on? *AM @JmPalaz Sweet *AM @Bagasuxx Try this: on your BB go to Options&gt;Applications&gt;UberSocial, set permissions to Allow &amp; save. Remove &amp; reinsert battery *AM @Bagasuxx What type of device are you using? *AM @Adraf_ Unfortunately there is no option to save images *AM Attn: Android users, Video Tube (Free) for YouTube has just been released on Google Play: http://t.co/ihdxQOAHCy Enjoy! @JmPalaz Let's try clearing data. On device go to Settings&gt;Applications&gt;Manage Applications&gt;find &amp; select USoc&gt;Clear Data *AM @Adraf_ What type of device are you using? *AM @Wrightfully_Me Hi! Let me try to help you with this. What's going on? *AM @BNK_SEXY Hi! Let me try to help you with this. What's going on? *AM @emeka_692 Hi! Let me try to help you with this. What's going on? *AM @Adraf_ Hi! Let me try to help you with this. What's going on? *AM @silmarian Hi! Let me try to help you with this. What's going on? *AM @Sir_Kwesi Hi! Let me try to help you with this. What's going on? *AM @Sir_alfaris1 @Sir_Kwesi Hi! Let me try to help you with this. What's going on? *AM @KOKETSOLENNOX What type of device are you using? *AM @KOKETSOLENNOX Hi! Let me try to help you with this. What's going on? *AM @SammyQuaid Hi! Let me try to help you with this. What's going on? *AM @P_Da_Skippa ...Click More\n3. Click Accounts\n4. Select the account\n5. Click Delete your account.  *AM 3/3 @P_Da_Skippa ...works the same way as logging out from your account. To do so, please follow the steps below:\n\n1. Click Menu\n2.... 2/3 @P_Da_Skippa UberSocial for Android does not have a logout button but it does give an option for you to delete the account. This... 1/3 @P_Da_Skippa What type of device are you using? *AM @mynameisbrooke Try this: on your BB go to Options&gt;Applications&gt;UberSocial, set permissions to Allow &amp; save. Remove &amp; reinsert battery *AM @JmPalaz Try this, on your device click UberMenu&gt;Settings&gt;About UberSocial, scroll to the bottom, click Clear Cache and click Yes *AM @I_am_klev @UberFacts Ubersocial is available for Android *AM @FANA__M Ads run on the free version of Ubersocial. To get rid of them, please upgrade to Ubersocial Pro *AM @FANA__M Hi! Let me try to help you with this. What's going on? *AM @LittleEmm_Lamb Great, happy tweeting! *AM @LittleEmm_Lamb Can you try uninstalling the app, turning your device off and on, and reinstalling it? *AM @LittleEmm_Lamb Try this, on your device click UberMenu&gt;Settings&gt;About UberSocial, scroll to the bottom, click Clear Cache and click Yes *AM @LittleEmm_Lamb What type of device are you using? *AM @Thuso_Househead @Its_kagiso Hi! Let me try to help you with this. What's going on? *AM @Eyee_Kanddii Hi! Let me try to help you with this. What's going on? *AM @Rent_A_Tweep Hi! Let me try to help you with this. What's going on? *AM @LittleEmm_Lamb Hi! Let me try to help you with this. What's going on? *AM @_widdershins Can you try uninstalling the app, turning your device off and on, and reinstalling it? *AM @Ad_Rsyah Try this: on your BB go to Options&gt;Applications&gt;UberSocial, set permissions to Allow &amp; save. Remove &amp; reinsert battery *AM @Ad_Rsyah What kind of phone are you using?  *AM @Ad_Rsyah What kind of error are you experiencing with the application? *AM @_widdershins Try this, on your device click UberMenu&gt;Settings&gt;About UberSocial, scroll to the bottom, click Clear Cache and click Yes *AM @olamidecued @Ms_waleedah On your BB go to Options&gt;Applications&gt;UberSocial, set permissions to Allow &amp; save. Remove &amp; reinsert battery *AM @Ms_waleedah @olamidecued Hi! Let me try to help you with this. What's going on? *AM @olamidecued @Ms_waleedah What type of device are you using? *AM @olamidecued @Ms_waleedah Hi! Let me try to help you with this. What's going on? *AM @ma_nzi We apologize! Ubersocial Pro is ad-free, it's available for $4.99. *AM @Dvin_c We're sorry for this issue. What type of device are you using? *AM @SpazZle_ What type of device are you using? *AM @SpazZle_ Hi! Let me try to help you with this. What's going on? *AM @_widdershins Try this: on your BB go to Options&gt;Applications&gt;UberSocial, set permissions to Allow &amp; save. Remove &amp; reinsert battery *AM @sincerelyzulema Hi! Let me try to help you with this. What's going on? *AM @Giandrii I'm sorry. What issue are you experiencing with the application? *AM @winestains Try this: on your BB go to Options&gt;Applications&gt;UberSocial, set permissions to Allow &amp; save. Remove &amp; reinsert battery *AM @LordHavoc Try this: on your BB go to Options&gt;Applications&gt;UberSocial, set permissions to Allow &amp; save. Remove &amp; reinsert battery *AM @winestains We're sorry for this issue. What type of device are you on? *AM @Giandrii Hi! Let me try to help you with this. What's going on? *AM @Badman_Anda Hi! Let me try to help you with this. What's going on? *AM @Benny_Swagger Ubersocial doesn't offer push notifications, sorry! *AM @geeforestt We're sorry for this issue. What type of device are you using? *AM @Chockie_M Hi! Let me try to help you with this. What's going on? *AM @ChidimmaMolokw1 @UberSocial Hi! Let me try to help you with this. What's going on? *AM @ZansteRrR What type of device are you using? *AM @srslade Try this: on your BB go to Options&gt;Applications&gt;UberSocial, set permissions to Allow &amp; save. Remove &amp; reinsert battery *AM @srslade What type of device are you on? *AM @ZansteRrR Hi! Let me try to help you with this. What's going on? *AM @MikiJonz Try this: on your BB go to Options&gt;Applications&gt;UberSocial, set permissions to Allow &amp; save. Remove &amp; reinsert battery *AM @srslade @UberSocial Hi! Let me try to help you with this. What's going on? *AM @NtokozoM__ @ThatoM_xx Hi! Let me try to help you with this. What's going on? *AM @briskoner What type of device are you on? *AM @Eyee_Kanddii Hi! Let me try to help you with this. What's going on? *AM @MikiJonz Hi! Let me try to help you with this. What's going on? *AM @briskoner Hi! Let me try to help you with this. What's going on? *AM @SoMuch_Ash What type of device are you on? *AM @supazeez @Kbone__ Unfortunately, that was imposed by Twitter  *AM @supazeez @Kbone__ Hi! Let me try to help you with this. What's going on? *AM Katy Perry is the most followed on Twitter.  Here are 15 fun facts about Twitter:    http://t.co/9XDOjSFC4I Tax season is here!  Here are 5 of the best tax software programs.  http://t.co/meXlrLQTfq @mhayiseb Try this, on your device click UberMenu&gt;Settings&gt;About UberSocial, scroll to the bottom, click Clear Cache and click Yes *AM @mhayiseb What type of device are you using? *AM @mhayiseb Hi! Let me try to help you with this. What's going on? *AM Stats suggest most relationships break up around 3-5 months mark.  http://t.co/esSNdFE11C @TxSportFan99 This is an issue the developers are currently working on. We apologize for the inconvenience, it'll be resolved soon! *AM @LeLe_091 Try this: on your BB go to Options&gt;Applications&gt;UberSocial, set permissions to Allow &amp; save. Remove &amp; reinsert battery *AM @LeLe_091 What type of device are you using? *AM @TxSportFan99 What type of device are you using? *AM @j_kaey Hi! Let me try to help you with this. What's going on? *AM @ImiSto_N Try this: on your BB go to Options&gt;Applications&gt;UberSocial, set permissions to Allow &amp; save. Remove &amp; reinsert battery *AM @ImiSto_N What type of device are you on? *AM @the_turtle Try this, on your device click UberMenu&gt;Settings&gt;About UberSocial, scroll to the bottom, click Clear Cache and click Yes *AM @MiraRAWR Did you try what I suggested? It might help with the issue the application is having *AM @ntle_sStar Try this: on your BB go to Options&gt;Applications&gt;UberSocial, set permissions to Allow &amp; save. Remove &amp; reinsert battery *AM @ImiSto_N @DinisoRuth Hi! Let me try to help you with this. What's going on? *AM @ntle_sStar What type of device are you using? *AM @MiraRAWR Try this: on your BB go to Options&gt;Applications&gt;UberSocial, set permissions to Allow &amp; save. Remove &amp; reinsert battery *AM @MiraRAWR Hi! Let me try to help you with this. What's going on? *AM @FLYnIMaBOY Ads run on the free version, I'm sorry! *AM @GlamourTog Try this: on your BB go to Options&gt;Applications&gt;UberSocial, set permissions to Allow &amp; save. Remove &amp; reinsert battery *AM @ntle_sStar Hi! Let me try to help you with this. What's going on? *AM @FLYnIMaBOY What type of device are you on? Are you using UberSocial Pro? *AM @GlamourTog What kind of device are you on? *AM @GlamourTog @twitter Hi! Let me try to help you with this. What's going on? *AM @_uSphe Hi! Let me try to help you with this. What's going on? *AM @OlufemiA_ Hi! Let me try to help you with this. What's going on? *AM Did you know Robert De Niro owns Nobu restaurant? Successful companies started by celebrities:  http://t.co/uI7B7eg1QH Kissing fights cavities! 15 Health benefits of Kissing: http://t.co/6YKhCXqdwN @rudeboykweku @iAmGaucho_ What kind of device are you using? *AM @Slim_Dude_12 Hi! Let me try to help you with this. What's going on? *AM @iAmGaucho_ UberSocial Pro which is ad-free is available for $4.99 in the App Store *AM @iAmGaucho_ Hi! Let me try to help you with this. What's going on? *AM Mt. Gox closes down. $400 million worth of bitcoins stolen. http://t.co/qBXxrxZg3s @Kay_Walters_Gu Hi! Let me try to help you with this. What's going on?  *AM @TeXas_StaR12 Hi! Let me try to help you with this. What's going on? *AM @PrinceLeKnight Hi! Let me try to help you with this. What's going on? *AM @janexx04 Does the application ask you to 'authenticate' when accessing DMs? *AM @janexx04 What type of device are you on? *AM @janexx04 Hi! Let me try to help you with this. What's going on? *AM @kaykay_05 Hi! Let me try to help you with this. What's going on? *AM @iamthereallhud @Aloiye_ :) *AM @Wel_P Try this: on your BB go to Options&gt;Applications&gt;UberSocial, set permissions to Allow &amp; save. Remove &amp; reinsert battery *AM @Wel_P What type of device are you on? *AM @Wel_P Hi! Let me try to help you with this. What's going on? *AM @miaeliza_icha Hi! Let me try to help you with this. What's going on? *AM What’s your favorite Zombie app?  http://t.co/KIWDCMEkra @WVUGuy29 @excuseyou77 Hi! Let me try to help you with this. What's going on? *AM @JLoverLondon Try this: on your BB go to Options&gt;Applications&gt;UberSocial, set permissions to Allow &amp; save. Remove &amp; reinsert battery *AM @Tocine Hi! Let me try to help you with this. What's going on? *AM @MistaTolz Try this: on your BB go to Options&gt;Applications&gt;UberSocial, set permissions to Allow &amp; save. Remove &amp; reinsert battery *AM @moreki_m Hi! Let me try to help you with this. What's going on? *AM @TxSportFan99 2.6.104. What version of OS are you using? *AM @MistaTolz What type of device are you on? *AM @MistaTolz Hi! Let me try to help you with this. What's going on? *AM @_therealtravis Hi! Let me try to help you with this. What's going on? *AM @Fortlinks Hi! Let me try to help you with this. What's going on? *AM 15 Teen Movies Still Worth Watching Today: http://t.co/cqDVRILl2I @GirlyVGP Hmm. Could you please forward a screenshot of the issue for me to forward to the developers? *AM @TxSportFan99 Are you on the latest version of UberSocial? *AM @GirlyVGP Are you on the latest version of UberSocial? *AM Harold Ramis from Ghostbusters passed away at age 69.  R.I.P. Egon. You will be missed.  http://t.co/fk15SUP5YY @TxSportFan99 Let's try clearing data. On device go to Settings&gt;Applications&gt;Manage Applications&gt;find &amp; select USoc&gt;Clear Data *AM @TxSportFan99 Try this, on your device click UberMenu&gt;Settings&gt;About UberSocial, scroll to the bottom, click Clear Cache and click Yes *AM @TxSportFan99 What type of device are you using? *AM @GirlyVGP Can you try uninstalling the app, turning your device off and on, and reinstalling it? *AM @GirlyVGP Try this, on your device click UberMenu&gt;Settings&gt;About UberSocial, scroll to the bottom, click Clear Cache and click Yes *AM @GirlyVGP What type of device are you on? *AM @GirlyVGP Hi! Let me try to help you with this. What's going on? *AM Do these kids deserve to be suspended?  http://t.co/RVCUzKgEv6 @BurkiLimousine UberSocial is a Twitter application which is not affiliated with the car service Uber *AM The value of Bitcoins keeps fluctuating. Would you ever consider buying one?  http://t.co/rlgMhERVza @Wole_Mason Hi! Let me try to help you with this. What's going on? *AM @esqcapades Great, happy tweeting! *AM @seriyaaz @_Potz_ I'm sorry! When you sign up for UberSocial you need to uncheck the box if you don't want to follow us *AM @marsyafahrany Hi! Let me try to help you with this. What's going on? *AM @esqcapades Hi! Let me try to help you with this. What's going on? *AM Co-founder of Whatsapp was once turned down for jobs at Twitter &amp; Facebook...?  http://t.co/QDlPTzsuuR Which console game would you like to play on your phone?  http://t.co/lr6it3nwnL @FLYnIMaBOY I've reported this issue to the developers. They'll create a fix for this issue ASAP. We apologize for the inconvenience! *AM @farbav Yes, try that and see if it works. Our developers are currently looking into this issue, we apologize for the inconvenience *AM @farbav Can you try clearing cache? *AM @ZDN48 Try this: on your BB go to Options&gt;Applications&gt;UberSocial, set permissions to Allow &amp; save. Remove &amp; reinsert battery *AM @FLYnIMaBOY Are you getting 'Error 101'? Can you try clearing cache? *AM @ZDN48 Are you on a Blackberry? *AM @FLYnIMaBOY What type of device are you on? *AM @PearlPillay What type of device are you on? *AM @msfresh_ope Try this: on your BB go to Options&gt;Applications&gt;UberSocial, set permissions to Allow &amp; save. Remove &amp; reinsert battery *AM @ridgebarlow Try this: on your BB go to Options&gt;Applications&gt;UberSocial, set permissions to Allow &amp; save. Remove &amp; reinsert battery *AM @msfresh_ope What type of device are you on? *AM @ZDN48 Hi! Let me try to help you with this. What's going on? *AM @ridgebarlow What type of device are you on? Are you still having the issue? *AM @Corr_ With UberSocial open, press the menu button and scroll to \"Clear Cache\", then select it. *AM @mims_neshy Hi! Let me try to help you with this. What's going on? *AM @Nude_BabyGurl Hi! Let me try to help you with this. What's going on? *AM @msfresh_ope Hi! Let me try to help you with this. What's going on? *AM @PearlPillay Hi! Let me try to help you with this. What's going on? *AM @farbav Try this: on your BB go to Options&gt;Applications&gt;UberSocial, set permissions to Allow &amp; save. Remove &amp; reinsert battery *AM @zenkosintshoko What type of device are you on? *AM @Corr_ Try this: on your BB go to Options&gt;Applications&gt;UberSocial, set permissions to Allow &amp; save. Remove &amp; reinsert battery *AM @ridgebarlow Hi! Let me try to help you with this. What's going on? *AM @AfriliaFrdilla Hi! Let me try to help you with this. What's going on? *AM 10 Dumbest Celebrity Tweets.  Which is your favorite?  http://t.co/Az3LVLxDRx Facebook is buying WhatsApp for $19 Billion.  Did they overpay?  http://t.co/dEqZLXIcg5 Is an iPad skateboard a bad idea?  Here are some other crazy uses for an iPad: http://t.co/jTxwlaSNFt @yanz10 Try this, on your device click UberMenu&gt;Settings&gt;About UberSocial, scroll to the bottom, click Clear Cache and click Yes *AM @yanz10 I'm sorry! What type of device are you on? *AM @gburge Can you forward us a screenshot? Also, where are you located? *AM @gburge When do the ads pop up? *AM @chi_frances Try this: on your BB go to Options&gt;Applications&gt;UberSocial, set permissions to Allow &amp; save. Remove &amp; reinsert battery *AM @chi_frances Are you on the most recent version of the application? *AM @moDima_GoDDesS  Try this: on your BB go to Options&gt;Applications&gt;UberSocial, set permissions to Allow &amp; save. Remove &amp; reinsert battery *AM @moDima_GoDDesS Are you on the most recent version of the application? *AM @da_jauntylad Try this: on your BB go to Options&gt;Applications&gt;UberSocial, set permissions to Allow &amp; save. Remove &amp; reinsert battery *AM @gburge Are you on the free or Pro version? Also, what kind of device are you on? *AM @da_jauntylad What type of device are you using? *AM Jennifer Lawrence still lives with her parents.  Are you surprised?  http://t.co/Nb3OloTArL @chi_frances Have you recently changed your password? *AM @moDima_GoDDesS Have you recently changed your password? *AM @moDima_GoDDesS What type of device are you on? *AM @da_jauntylad Hi! Let me try to help you with this. What's going on? *AM @chi_frances What type of device are you on? *AM @DhirajPandhi Hi! Let me try to help you with this. What's going on? *AM @TARA_CR7 Hi! Let me try to help you with this. What's going on? *AM @chi_frances Hi! Let me try to help you with this. What's going on? *AM @yanz10 Hi! Let me try to help you with this. What's going on? *AM @Alffakmlnsrdn Hi! Let me try to help you with this. What's going on? *AM @moDima_GoDDesS Hi! Let me try to help you with this. What's going on? *AM Fun JT fact: Before Mickey Mouse Club, Justin Timberlake (Randall) competed on Star Search and lost.  http://t.co/cphTdwflds Splashy Fish has replaced Flappy Bird as the top Free App on Appstore.  Which app do you prefer?  http://t.co/kJ0t3AqETO @KingKimwah Hi! Let me try to help you with this. What's going on? *AM @house_district Have you recently changed your password? *AM @HydroStatiQ Hi! Let me try to help you with this. What's going on? *AM Strange American laws: In Arkansas, a man can legally beat his wife, but no more than once a month.  http://t.co/ERSK4G973R @house_district Try this: on your BB go to Options&gt;Applications&gt;UberSocial, set permissions to Allow &amp; save. Remove &amp; reinsert battery *AM @MarksSexySmile Hi! Let me try to help you with this. What's going on? *AM @p3arlie Hi! Let me try to help you with this. What's going on? *AM @SirKicksAlot24 Hi! Let me try to help you with this. What's going on? *AM @Steve_repNG Hi! Let me try to help you with this. What's going on? *AM @house_district What type of device are you on? *AM @house_district Hi! Let me try to help you with this. What's going on? *AM Engineering majors are one of the highest paid.  Surprised?  Here’s the 10 highest paying college majors: http://t.co/IqNVnEs49o Android folks: Wanna stop getting tweet notifications? Settings&gt; Notification Settings&gt; Check for “Tweet” &amp; click on checkbox. Interested in beta testing for @UberSoc Android? Join our\ncommunity: http://t.co/mwZzcQM0r6 Details here: http://t.co/7dyy9uuHHt Will putting your wet, broken iPhone in a bag of rice really fix it?  http://t.co/Dh9AHyhNai Avoid these Valentine’s Gifts. http://t.co/xR9APrhwbq They will likely get you slapped! There are notations to Bible passages on In-N-Out wrappers &amp; cups. True or False?  http://t.co/Gk6tZnMtyw Android friends: Interested in beta testing for @UberSoc? Join our community: http://t.co/W2hvkPRQNA Details here: http://t.co/yF0BTiCLo6 Did you know @DollyParton is godmother to @MileyCyrus?  http://t.co/Sy3ngtNYT7 Here are 15 Red Flags for Online Dating! http://t.co/CLAsY4sPgz @MrADunc Try this, on your device click UberMenu&gt;Settings&gt;About UberSocial, scroll to the bottom, click Clear Cache and click Yes *AM @patel_1 Hi! Let me try to help you with this. What's going on? *AM @The_Steven_Ho Can you try uninstalling the app, turning your device off and on, and reinstalling it? *AM @MrADunc I'm sorry for this issue, let me help you with it. What type of device are you using? *AM @The_Steven_Ho What type of device are you on? *AM @The_Steven_Ho Hi! Let me try to help you with this. What's going on? *AM @VyanYP To change this, please go to UberMenu&gt;Settings&gt;Notification Settings and remove the Tweets notification option *AM Android users: Interested in beta testing for @UberSoc? Join our community!: http://t.co/XO5wt835US Details here: http://t.co/AqBR8q4fEg President @BarackObama once worked at a Baskin-Robbins.  Here are 15 fun facts about Obama.  http://t.co/sRU5B9H2iL Twitter mistakes caused all these folks to get fired. Check out the Tweets they sent: http://t.co/4WGbG9amEc @ShuiL_ Can you try uninstalling the app, turning your device off and on, and reinstalling it? *AM @nightMairC I'm sorry! Can you try uninstalling the app, turning your device off and on, and reinstalling it? *AM @ShuiL_ Try this, on your device click UberMenu&gt;Settings&gt;About UberSocial, scroll to the bottom, click Clear Cache and click Yes *AM @Morenampya Try this: on your BB go to Options&gt;Applications&gt;UberSocial, set permissions to Allow &amp; save. Remove &amp; reinsert battery *AM @claireyelectric Can you try uninstalling the app, turning your device off and on, and reinstalling it? *AM @claireyelectric Your link is only a link to your account, I can't see the error! *AM @Morenampya What errors specifically are occurring with the application? Are you getting an error code? *AM @claireyelectric ...Yes *AM 2/2 @claireyelectric Try this, on your device click UberMenu&gt;Settings&gt;About UberSocial, scroll to the bottom, click Clear Cache and click... 1/2 @Morenampya What type of device are you on? *AM @GripperShanz Hi! Let me try to help you with this. What's going on? *AM @claireyelectric what type of device are you on? *AM @ibooy_ryu Hi! Let me try to help you with this. What's going on? *AM @Morenampya Hi! Let me try to help you with this. What's going on? *AM Not all college degrees lead to great careers. If you want a good job, stay away from these majors! http://t.co/OBUJB50cBH @Roscoe702 Hi! Let me try to help you with this. What's going on? *AM @Just_Lerato Hi! Let me try to help you with this. What's going on? *AM @Isdhani_07 What error is occurring on the device? And what kind of device are you on? *AM @moetapel_e Hi! Let me try to help you with this. What's going on? *AM @ShuiL_ What kind of device are you on? *AM @roybenzS350 What version of UberSocial are you on? *AM This celebrity appeared @ a premier with a bag over his head that said “I am not famous anymore”. Know who he is?  http://t.co/LjkiaZTG6W Your favorite bird game is back!  Join the fun at http://t.co/xGSN32gceY via @FlappyLives #FlappyBird #FlappyLives These cars are generally only driven by women: http://t.co/Nqxt3DZHW0 Guys, let's see if your car made the list! @ThatMissMercia Hi! Let me try to help you with this. What's going on? *AM @MirandaG1234 I think you may be trying to reach Uber the car service, not UberSocial the application. Sorry! *AM Did you know Hello Kitty’s full name is “Kitty White” &amp; she’s British? 10 things you didn’t know about Hello Kitty: http://t.co/gsrCRTzclj @Call_Me_K9 Hi! Let me try to help you with this. What's going on? *AM @silver081 @sassygeeee Hi! Let me try to help you with this. What's going on? *AM @FIFAcomINA What type of device are you on? *AM Snapchat could be hacked and crash your iPhone.  http://t.co/CJHCptS3kB Shirley Temple passed away last night at age 85. She died of natural causes. http://t.co/GFwuDIhIY0 @Simplyy_Jah Also are you on the most current version of UberSocial? *AM @Simplyy_Jah I'm sorry, I'll forward this issue to the developers. Could you send me the make/model of your device? *AM @Simplyy_Jah Are you getting an error code? *AM @Faroukfabulous Hi! Let me try to help you with this. What's going on? *AM @Kiesh_1 Try going to Control Center &gt; Twitter and entering your password *AM @homot Try this, on your device click UberMenu&gt;Settings&gt;About UberSocial, scroll to the bottom, click Clear Cache and click Yes *AM @Kiesh_1 Are you getting an error code? *AM @homot Hi! Let me try to help you with this. What's going on? *AM @tripur_wanto What error is occurring? *AM @tripur_wanto Hi! Let me try to help you with this. What's going on? *AM @Rinn_chii What type of device are you on? *AM @Kiesh_1 what type of device are you on? *AM @Kaylyn_Cedras_ Also what type of device are you on? *AM @Kaylyn_Cedras_ Try this, on your device click UberMenu&gt;Settings&gt;About UberSocial, scroll to the bottom, click Clear Cache and click Yes *AM @Simplyy_Jah What type of device are you on? *AM @abc4 :) *AM @Simplyy_Jah Hi! Let me try to help you with this. What's going on? *AM @Kaylyn_Cedras_ Hi! Let me try to help you with this. What's going on? *AM Demand &amp; salary for this job has soared across the nation, rising 9 times faster than inflation since the 80s:  http://t.co/n9UqlpIV7n @Isdhani_07 Hi! Let me try to help you with this. What's going on? *AM @iyon_yonatan ...want to delete\n4. Tap Remove\n5. Click Done *AM 2/2 @iyon_yonatan 1. Click on the settings tab  (gear icon) from your UberBar\n2. Tap Edit\n3. Tap the red circle next to the account you... 1/2 @MargarethEllen ...issue.  *AM 2/2 @MargarethEllen Please go to Options &gt; Networks and change the option to SSL. It will say 'Not Recommended', but it will resolve the... 1/2 Hit iPhone game ‘Flappy Bird’, was removed from the AppStore because its developer “cannot take this anymore”. http://t.co/d4yx3XMdFL @MargarethEllen Hi! Let me try to help you with this. What's going on? *AM @iamKimmieHo Hi! Let me try to help you with this. What's going on? *AM @BeingPozi Hi! Let me try to help you with this. What's going on? *AM @YhesminHassan Hi! Let me try to help you with this. What's going on? *AM @LordJesseGaga Hi! Let me try to help you with this. What's going on? *AM @heSPRINKLEdME To change this, please go to UberMenu&gt;Settings&gt;Notification Settings and remove the Tweets notification option *AM @FuckChudi_ Hi! Let me try to help you with this. What's going on? *AM Android folks: Wanna stop getting tweet notifications? Settings&gt; Notification Settings&gt; Check for “Tweet” &amp; click on checkbox. . @keenfacts tells us the sad reason why Marty’s girlfriend in Back To The Future was played by different actresses http://t.co/mr2d8UhWzS @Proverse Hi! Let me try to help you with this. What's going on? *AM @ICEDDN Hi! Let me try to help you with this. What's going on? *AM @JAH_Hef Hi! Let me try to help you with this. What's going on? *AM @sircarter2 Hi! Let me try to help you with this. What's going on? *AM The Mercedes-Benz logo has a secret meaning! Find out what it is here: http://t.co/DUtM51TADu via @keenfacts Our friends at LG are giving away over $1,000 worth of gift cards – follow @UnlimitYourLG for details! http://t.co/goGuN1HdGw Did you know there was once a TV channel which exclusively showed puppies playing?   http://t.co/XKSSh0Rn7j via @keenfacts . @keenfacts tells us flexible glass was invented around 20 AD. So why have we never seen it? Read more: http://t.co/k588NAUTAI @Vickerance Okay good. Happy tweeting! *AM @Vickerance Can you try uninstalling the app, turning your device off and on, and reinstalling it? *AM @Vickerance What kind of device are you on? *AM @IamStevii Unfortunately, UberSocial is only available for free download in some countries. I'm sorry *AM @IamStevii What country are you in? *AM @ThisKidsBlessed ...click Clear Cache and click Yes *AM 2/2 @ThisKidsBlessed Are you using SSL? Also, try this, on your device click UberMenu&gt;Settings&gt;About UberSocial, scroll to the bottom,... 1/2 @IamStevii UberSocial is available for free download for Android *AM @IamStevii UberSocial is available for Android :) *AM @GordonWright Also what kind of device are you on? *AM @GordonWright Try this, on your device click UberMenu&gt;Settings&gt;About UberSocial, scroll to the bottom, click Clear Cache and click Yes *AM @Vickerance Hi! Let me try to help you with this. What's going on? *AM @GordonWright Hi! Let me try to help you with this. What's going on? *AM @ThisKidsBlessed Try this: on your BB go to Options&gt;Applications&gt;UberSocial, set permissions to Allow &amp; save. Remove &amp; reinsert battery *AM @ThisKidsBlessed Are you getting an error code? *AM @KaitoTheYounger To change this, please go to UberMenu&gt;Settings&gt;Notification Settings and remove the Tweets notification option *AM @Obakeng_Motz Hi! Let me try to help you with this. What's going on? *AM @King_Lona Hi! Let me try to help you with this. What's going on? *AM @ThisKidsBlessed I'm sorry about this issue. What kind of device are you on? *AM @coastalcreature @ChltNikki Hi! Let me try to help you with this. What's going on? *AM @squidlydondada Hi! Let me try to help you with this. What's going on? *AM @Lil_Mxls I'm sorry. What kind of device are you on? *DD @FuckChudi_ Hi! Let me try to help you with this. What's going on? *DD @MFFresh What kind of device are you on? Also what errors are you experiencing? *DD @jessicasr23 @missblondie_xo Hi! Let me try to help you with this. What's going on? *DD @kokiE_maBee Try this: on your BB go to Options&gt;Applications&gt;UberSocial, set permissions to Allow &amp; save. Remove &amp; reinsert battery *DD @MarksSexySmile Can you send me a screenshot? *DD @BarimaPages Great, happy tweeting! *DD @kokiE_maBee What type of device are you on? And what type of error is occurring? *DD @Chili_m2 Hi! Let me try to help you with this. What's going on? *DD @MrADunc Hi! Let me try to help you with this. What's going on? *DD @kokiE_maBee Hi! Let me try to help you with this. What's going on? *DD @MarksSexySmile @UberSocial what kind of device are you on? *DD @TUMSTAR_USS ...account information and you're good to go!  *DD 4/4 @TUMSTAR_USS ...the account\n5. Click Delete your account. \nThis should automatically log you out. To log in, simply enter your... 3/4 @TUMSTAR_USS ...the same way as logging out from your account. To do it:\n1. Click Menu\n2. Click More\n3. Click Accounts\n4. Select... 2/4 @TUMSTAR_USS UberSocial for Android doesn't have a logout button but it does give an option for you to delete the account. This works... 1/4 @MarksSexySmile To change this, please go to UberMenu&gt;Settings&gt;Notification Settings and remove the Tweets notification option.  *DD @MFFresh Hi! Let me try to help you with this. What's going on? *DD @shahigha Hi! Let me try to help you with this. What's going on? *DD @Lil_Mxls Hi! Let me try to help you with this. What's going on? *DD @shortstack81 Great, happy tweeting! *DD @BarimaPages Try this: on your BB go to Options&gt;Applications&gt;UberSocial, set permissions to Allow &amp; save. Remove &amp; reinsert battery *DD @TUMSTAR_USS Hi! Let me try to help you with this. What's going on? *DD @BMtotoba Hi! Let me try to help you with this. What's going on? *DD @shortstack81 Hi! Let me try to help you with this. What's going on? *DD @Vallie_Da_Vixen @BrianM_96 Yes :) *DD @ImFehmidah what kind of device are you on? *DD @marslight1185 Try this: on your BB go to Options&gt;Applications&gt;UberSocial, set permissions to Allow &amp; save. Remove &amp; reinsert battery *DD @Dvin_c Hi! Let me try to help you with this. What's going on? *DD @nosiey_ ...permissions to Allow &amp; save. Remove &amp; reinsert battery *DD 2/2 @nosiey_ Sorry, your device information doesn't come up on our feed. Try this: on your BB go to Options&gt;Applications&gt;UberSocial, set... 1/2 @marslight1185 No problem. Happy tweeting! *DD @ReALfiifibiNEY what kind of device are you on? *DD @nosiey_ kind of device are you on? *DD @nosiey_ Try this, on your device click UberMenu&gt;Settings&gt;About UberSocial, scroll to the bottom, click Clear Cache and click Yes *DD @marslight1185 What kind of device are you on? *DD @marslight1185 Try this, on your device click UberMenu&gt;Settings&gt;About UberSocial, scroll to the bottom, click Clear Cache and click Yes *DD @Tosin_SA Please go to UberMenu&gt;Settings&gt;Notification Settings and modify the settings to your preferences *DD @nightMairC Try this: on your BB go to Options&gt;Applications&gt;UberSocial, set permissions to Allow &amp; save. Remove &amp; reinsert battery *DD @robson_zwane :) *DD @ImFehmidah Hi! Let me try to help you with this. What's going on? *DD @iamlouelaangela what type of device are you on? *DD @nightMairC Hi! Let me try to help you with this. What's going on? *DD Catch your favorite Super Bowl moments on Video Tube for YouTube (FREE) on iTunes: http://t.co/07V7N5KQRq Not able to watch the Super Bowl today? See what you missed on Video Tube for YouTube (FREE): http://t.co/NPMkJcXtV4 Catch your favorite Super Bowl moments on Video Tube for YouTube (FREE): http://t.co/HwZBbHkti0 Android folks: Wanna stop getting tweet notifications? Settings -&gt; Notification Settings -&gt; Check for “Tweet” &amp; click on checkbox. @lee_mba @_ Hi! Let me try to help you with this. What's going on? *DD @datigbogalJ Try this: on your BB go to Options&gt;Applications&gt;UberSocial, set permissions to Allow &amp; save. Remove &amp; reinsert battery *DD @Peter4099 :) *DD @datigbogalJ I'm sorry! What kind of device are you on? *DD @datigbogalJ Hi! Let me try to help you with this. What's going on? *DD @JuJuManbramble Hi! Let me try to help you with this. What's going on? *DD @s_kren Hi! Let me try to help you with this. What's going on? *DD @Hotpep6 Try this, on your device click UberMenu&gt;Settings&gt;About UberSocial, scroll to the bottom, click Clear Cache and click Yes *DD @Hotpep6 what type of device are you on? *DD @Hotpep6 Hi! Let me try to help you with this. What's going on? *DD @gburge :) *DD @MarksSexySmile @UberSocial Hi! Let me try to help you with this. What's going on? *DD @Iam_Ollyray Hi! Let me try to help you with this. What's going on? *DD @uuN_saKau Can you try uninstalling the app, turning your device off and on, and reinstalling it? *DD @uuN_saKau what kind of device are you on? *DD @uuN_saKau Hi! Let me try to help you with this. What's going on? *DD @AyoAshDGAF Hi! Let me try to help you with this. What's going on? *DD @blazindon Hi! Let me try to help you with this. What's going on? *DD @karenanna Can you try uninstalling the app, turning your device off and on, and reinstalling it? *DD @karenanna what kind of device are you on? *DD @Bittah1 Great, happy tweeting! *DD @CzArBGF Great, happy tweeting! *DD @Bittah1 Can you try uninstalling the app, turning your device off and on, and reinstalling it? *DD @Theachiever Hi! Let me try to help you with this. What's going on? *DD @CzArBGF Hi! Let me try to help you with this. What's going on? *DD @CFT1 what kind of device are you on? *DD @CFT1 Hi! Let me try to help you with this. What's going on? *DD @Bittah1 what kind of device are you on? *DD @DARIUSARENDSE @UberSocial Hi! Let me try to help you with this. What's going on? *DD @SnatchCracker Hi! Let me try to help you with this. What's going on? *DD @RandomHuskerFan To change this, please go to UberMenu&gt;Settings&gt;Notification Settings and remove the Tweets notification option.  *DD @alemujicabrain Try this: on your BB go to Options&gt;Applications&gt;UberSocial, set permissions to Allow &amp; save. Remove &amp; reinsert battery *DD @11PrincessAngel Phone *DD @11PrincessAngel Go to Options &gt; Networks and change the option to SSL. It will say 'Not Recommended', but it'll resolve the issue *DD @Simiglitz :) *DD @paleass Hi! Let me try to help you with this. What's going on? *DD @alemujicabrain what device are you on? *DD @Raja5hekar :) *DD @PrideMaterial Hi! Let me try to help you with this. What's going on? *DD @ddhamster Try this: on your BB go to Options&gt;Applications&gt;UberSocial, set permissions to Allow &amp; save. Remove &amp; reinsert battery *DD @valeryan24 I'm sorry, we don't support CyanogenMod-rooted devices :( *DD @ddhamster what device are you on? *DD @muliartawayan27 Hi! Let me try to help you with this. What's going on? *DD @PhilsnerDDI Try this: on your BB go to Options&gt;Applications&gt;UberSocial, set permissions to Allow &amp; save. Remove &amp; reinsert battery *DD @valeryan24 Try uninstalling CyanogenMod. Unfortunately we cannot test against rooted devices *DD @IamEbuka_ Hi! Let me try to help you with this. What's going on? *DD @iceboy_202 Hi! Let me try to help you with this. What's going on? *DD @Cve_TheProdigy Try this: on your BB go to Options&gt;Applications&gt;UberSocial, set permissions to Allow &amp; save. Remove &amp; reinsert battery *DD @BLuu_Mathibe Hi! Let me try to help you with this. What's going on? *DD @PhilsnerDDI what kind of device are you on? *DD @cleokommy @sagaysagay Hi! Let me try to help you with this. What's going on? *DD @valeryan24 what kind of device are you on? *DD @TheLifeOfBarth Hi! Let me try to help you with this. What's going on? *DD @mynameisbrooke Try this: on your BB go to Options&gt;Applications&gt;UberSocial, set permissions to Allow &amp; save. Remove &amp; reinsert battery *DD @Lhis26 what kind of device are you on? *DD @lisa_prettyeyes Can you try uninstalling the app, turning your device off and on, and reinstalling it? *DD @lisa_prettyeyes Hi! Let me try to help you with this. What's going on? *DD @DJ_AWOL88 Try this: on your BB go to Options&gt;Applications&gt;UberSocial, set permissions to Allow &amp; save. Remove &amp; reinsert battery *DD @plshin85 what kind of device are you on? *DD @overadea What kind of error are you getting? *DD @PiercetheSam To change this, please go to UberMenu&gt;Settings&gt;Notification Settings and remove the Tweets notification option. *DD @amarule_aceBMT Hi! Let me try to help you with this. What's going on? *DD @magicalntsa :) *DD @EkoWindianto g'morning! *DD @AceInMyHand Hi! Let me try to help you with this. What's going on? *DD @aurbeyheyres What kind of device are you on? *DD @MuFFiN_MaaN Hi! Let me try to help you with this. What's going on? *DD @LeratoBlossom Hi! Let me try to help you with this. What's going on? *DD @ThobzaQ Hi! Let me try to help you with this. What's going on? *DD @DJ_AWOL88 what kind of device are you on? *DD @DJ_AWOL88 Hi! Let me try to help you with this. What's going on? *DD @SandyMtolo Error 103 or error 403? *DD @lisa_prettyeyes Try this: on your BB go to Options&gt;Applications&gt;UberSocial, set permissions to Allow &amp; save. Remove &amp; reinsert battery *DD @ToxicCooper Hi! Let me try to help you with this. What's going on? *DD @lisa_prettyeyes what kind of device are you on? *DD @mynameisbrooke Try this, on your device click UberMenu&gt;Settings&gt;About UberSocial, scroll to the bottom, click Clear Cache and click Yes *DD @hergidire Hi! Let me try to help you with this. What's going on? *DD @xaxxangel what kind of device are you on? *DD @lisa_prettyeyes Hi! Let me try to help you with this. What's going on? *DD @xaxxangel @UberSocial Hi! Let me try to help you with this. What's going on? *DD @secretssountold Twitter is having some issues with their user stream, you can check out the status here: https://t.co/WoBciahGZu *DD @Souljah_Herb Cool. Happy tweeting! *DD @Cve_TheProdigy What kind of device are you on? *DD @CallmeJahmell Twitter is having some issues with their user stream, you can check out the status here: https://t.co/Ud8lTwj6RT *DD @CallmeJahmell Hi! Let me try to help you with this. What's going on? *DD @Souljah_Herb Try this: on your BB go to Options&gt;Applications&gt;UberSocial, set permissions to Allow &amp; save. Remove &amp; reinsert battery *DD @siyaofficial What device are you on? *DD @chantalalalalal To change this, please go to UberMenu&gt;Settings&gt;Notification Settings and remove the Tweets notification option *DD @Cve_TheProdigy Hi! Let me try to help you with this. What's going on? *DD @siyaofficial Hi! Let me try to help you with this. What's going on? *DD @secretssountold Hi! Let me try to help you with this. What's going on? *DD @PyxeLuiz4 What kind of device are you on? *DD @TheReal_Palzo Hi! Let me try to help you with this. What's going on? *DD @wanwanny20 Hi! Let me try to help you with this. What's going on? *DD @dion_pippo Unfortunately, it looks like twitter's API is overloaded - you can check the status here: https://t.co/Ud8lTwj6RT *DD @dion_pippo Hi! Let me try to help you with this. What's going on? *DD @arvingalicia1 :) *DD @BelajarItaliano What is going wrong with it? *DD @BelajarItaliano Hi! Let me try to help you with this. What's going on? *DD @mthokozeeesi Try going to UberMenu&gt;Settings&gt;Notification Settings and removing the Tweets notification option *DD @mthokozeeesi Hi! Let me try to help you with this. What's going on? *DD @holaayemmie :) *DD @Khebah_SHB :) *DD @holaayemmie Please go to Options &gt; Networks and change the option to SSL. It will say 'Not Recommended', but it will resolve the issue *DD @barbiecrayshizl Please go to Options &gt; Networks and change the option to SSL. It'll say 'Not Recommended' but it will resolve the issue *DD @Khebah_SHB Please go to Options &gt; Networks and change the option to SSL. It will say 'Not Recommended', but it will resolve the issue *DD @Khebah_SHB what kind of device are you on? *DD @holaayemmie what kind of device are you on? *DD @barbiecrayshizl what kind of device are you on? *DD @NguboZ Try this: on your BB go to Options&gt;Applications&gt;UberSocial, set permissions to Allow &amp; save. Remove &amp; reinsert battery *DD @kabijonas Hi! Let me try to help you with this. What's going on? *DD @barbiecrayshizl Hi! Let me try to help you with this. What's going on? *DD @holaayemmie Hi! Let me try to help you with this. What's going on? *DD @NguboZ Hi! Let me try to help you with this. What's going on? *DD @KarlienSoSocial Hi! Let me try to help you with this. What's going on? *DD @DeslynneSade :) *DD @olzeemale :) *DD @murjausman Hi! Let me try to help you with this. What's going on? *DD @Khebah_SHB Hi! Let me try to help you with this. What's going on? *DD @amos_sol Hi! Let me try to help you with this. What's going on? *DD @Refilwe_Mampa Hi! Let me try to help you with this. What's going on? *DD @Ken_Gunz Hi! Let me try to help you with this. What's going on? *DD @Phiddy_2Fwesh Hi! Let me try to help you with this. What's going on? *DD If you've updated to the newest Blackberry version (1.433) &amp; still see issues, make sure you have SSL checked under Options&gt;Network. Blackberry users: Please update to new version &amp; if you still see issues, make sure you have SSL checked under Options&gt;Network. Team Blackberry: If you've updated to new version &amp; still see issues, make sure you have SSL checked under Options&gt;Network. Thanks! @Suit_and_Violin Hi! Let me try to help you with this. What's going on? *DD @Chelseasaridin_ :) *DD @Justtice_ Hi! Let me try to help you with this. What's going on? *DD @IamTunia Hi! Let me try to help you with this. What's going on? *DD @SunnySpecialK Hi! Let me try to help you with this. What's going on? *DD @IamLuxolo_J Hi! Let me try to help you with this. What's going on? *DD @Its_Cella_MF Hi! Let me try to help you with this. What's going on? *DD @Desmond_Os :) *DD @QL2006 Try going to Settings &gt; Notification Settings &gt; Check for “Tweet” and click on the checkbox there. *DD @NonieZaskia Hi! Let me try to help you with this. What's going on? *DD @TokoTekay @SexNamaDrugs Hi! Let me try to help you with this. What's going on? *DD @__Pkay :) *DD @CuteeTourc Hi! Let me try to help you with this. What's going on? *DD @_Candi_lanD_ Twitter's API has been acting up for ages :( check out their status here: https://t.co/Ud8lTwj6RT *DD @AlexFitzbeck I'm sorry, what kind of device are you on? *DD @QL2006 I'm sorry, what kind of device are you on? *DD @lindakwenamore :) *DD @Awesome_Gugu :) *DD @iamspencez :) *DD @Desmond_Os Which version # of the app and what device do you have, UberSoc is it Bberry, iPhone or Android? *DD @Zubyzarata @Capt__DREW We're aliiiiiive *DD @DineYo_xoxo  :) *DD @Desmond_Os Hi! Let me try to help you with this. What's going on? *DD Blackberry Users: If you're still seeing errors please try Options&gt;Networks &amp; change to SSL. Thanks for your patience! We're working on a new BB version now. Please try Options&gt;Networks &amp; change to SSL, if you're still seeing issues. Thanks! If you're still seeing error messages please try Options&gt;Networks &amp; change to SSL. Working on new version now. @Lakesyde_  please try Options&gt;Networks &amp; change to SSL *DD @tony_suprapta To remove the ads please purchase the Subscription for our app by going to the Purchase option on your app's menu. Tks! *DD @VictorDanielHC  please try Options&gt;Networks &amp; change to SSL *DD @Miglblasqz  please try Options&gt;Networks &amp; change to SSL *DD @Lefitrialalova  please try Options&gt;Networks &amp; change to SSL *DD @azizibnsalam  please try Options&gt;Networks &amp; change to SSL *DD @aie_poenya do it anyway *DD @MolestMeRihanna  please try Options&gt;Networks &amp; change to SSL *DD @kehri_behri  please try Options&gt;Networks &amp; change to SSL *DD @Neyobar_  please try Options&gt;Networks &amp; change to SSL *DD @deathchoco  please try Options&gt;Networks &amp; change to SSL *DD @lela_edison  please try Options&gt;Networks &amp; change to SSL *DD @MrsGF25  please try Options&gt;Networks &amp; change to SSL *DD @DinomaniaPLC  please try Options&gt;Networks &amp; change to SSL *DD @Jeanette_Comas  please try Options&gt;Networks &amp; change to SSL *DD @bigaggiemac  please try Options&gt;Networks &amp; change to SSL *DD @asaretab  please try Options&gt;Networks &amp; change to SSL *DD @DiegoPhasha You have to change that to fix it *DD @oyekanolufemi  please try Options&gt;Networks &amp; change to SSL *DD @aviastari  please try Options&gt;Networks &amp; change to SSL *DD @COKE_BOY300  please try Options&gt;Networks &amp; change to SSL *DD @ochan__  please try Options&gt;Networks &amp; change to SSL *DD @Koyob  please try Options&gt;Networks &amp; change to SSL *DD @Parinda001  please try Options&gt;Networks &amp; change to SSL *DD @EpasoyJenni  please try Options&gt;Networks &amp; change to SSL *DD @Bayu_Adje did you follow the instructions? *DD @lela_manurung  please try Options&gt;Networks &amp; change to SSL *DD @AlvarezEuu  please try Options&gt;Networks &amp; change to SSL *DD @JadeWilliams Restart it *DD @prakash_doc please try Options&gt;Networks &amp; change to SSL. *DD @dy_wulandari please try Options&gt;Networks &amp; change to SSL. *DD @Duminguzjc please try Options&gt;Networks &amp; change to SSL. *DD @PattiMars please try Options&gt;Networks &amp; change to SSL. *DD @DiegoPhasha please try Options&gt;Networks &amp; change to SSL. *DD @fajryno1897 please try Options&gt;Networks &amp; change to SSL. *DD @JadeWilliams Clear the cache *DD @tengkorak66 please try Options&gt;Networks &amp; change to SSL. *DD @brandehhh please try Options&gt;Networks &amp; change to SSL. *DD @jaspiedad please try Options&gt;Networks &amp; change to SSL. *DD @JadeWilliams Did you change it? *DD @Truff_C please try Options&gt;Networks &amp; change to SSL. *DD @ricardograffe please try Options&gt;Networks &amp; change to SSL. *DD @mojizzzle did you follow the instructions? *DD @shuhadaashiqin do it anyway *DD @omeitya please try Options&gt;Networks &amp; change to SSL. *DD @rizuki_fauzi please try Options&gt;Networks &amp; change to SSL. *DD @aie_poenya please try Options&gt;Networks &amp; change to SSL. *DD @nitanserioo @JoseOchoaa please try Options&gt;Networks &amp; change to SSL. *DD @BaYou_RedSparda please try Options&gt;Networks &amp; change to SSL. *DD @JeffVT03 Yes we do *DD @Haxnach please try Options&gt;Networks &amp; change to SSL. *DD @TraceyChananie follow the instructions *DD @norita9 please try Options&gt;Networks &amp; change to SSL. *DD @AfanadorA please try Options&gt;Networks &amp; change to SSL. *DD @suciRamadini please try Options&gt;Networks &amp; change to SSL. *DD @upiiittt do it if you want it to work *DD @Spha_Dlamini please try Options&gt;Networks &amp; change to SSL. *DD @SirCoolOrNot please try Options&gt;Networks &amp; change to SSL. *DD @JohanJRV No plans *DD @TrevorSorrell That's for BB *DD @JadeWilliams again, please try Options&gt;Networks &amp; change to SSL. *DD @gehenna27 please try Options&gt;Networks &amp; change to SSL. *DD @boifwendsnatcha please try Options&gt;Networks &amp; change to SSL. *DD @CarlyTann please try Options&gt;Networks &amp; change to SSL. *DD @itsWAHYU please try Options&gt;Networks &amp; change to SSL. *DD @joharith permanent  *DD @JadeWilliams please try Options&gt;Networks &amp; change to SSL. *DD @lebron_griffin please try Options&gt;Networks &amp; change to SSL. *DD @ilovepandamuah please try Options&gt;Networks &amp; change to SSL. *DD @Arief_Budiyanto please try Options&gt;Networks &amp; change to SSL. *DD @danestojoachin Did you follow those steps you responded to? *DD @alessandrStella Go to Options&gt;Networks and change it to SSL *DD @belovedHaeY Go to Options&gt;Networks and change it to SSL *DD @Loreburne no plans *DD @Dinda_P Go to Options&gt;Networks and change it to SSL *DD @nathalifayragil Go to Options&gt;Networks and change it to SSL *DD @Roossyyyy Go to Options&gt;Networks and change it to SSL *DD @INFINITELKIMMIE Yes *DD We've resolved the issues with loading pics &amp; avatars. If you're seeing other errors please try Options&gt;Networks &amp; change to SSL. @JoseOchoaa Go to Options&gt;Networks and change it to SSL *DD @paulodee71 Go to Options&gt;Networks and change it to SSL *DD @Angkiie Go to Options&gt;Networks and change it to SSL *DD @nandya_eka Go to Options&gt;Networks and change it to SSL *DD @crissymorano Go to Settings&gt;Networks and change it to SSL *DD @nitanserioo Go to Settings&gt;Networks and change it to SSL *DD @marthaiswr Go to Settings&gt;Networks and change it to SSL *DD @ArdianyPutri2 Go to Settings&gt;Networks and change it to SSL *DD @Smartass_Queen @adesola4real Go to Settings&gt;Networks and change it to SSL *DD @SavannahBrandt Go to Settings&gt;Networks and change it to SSL *DD @simangile Go to Settings&gt;Networks and change it to SSL *DD @Iam_Ralphie clear the cache *DD @mojizzzle Go to Settings&gt;Networks and change it to SSL *DD If you're experiencing the 403 error, please try turning on SSL under options-&gt;network. Working on new version now that defaults to this. @KATSINAconnect try turning on SSL under options-&gt;network.  *DD @syndeybooty try turning on SSL under options-&gt;network.  *DD @SFRYN try turning on SSL under options-&gt;network.  *DD @meiichoco try turning on SSL under options-&gt;network.  *DD @XcellentBoy try turning on SSL under options-&gt;network *DD Experiencing the 403 error? Please try turning on SSL under options-&gt;network. Working on new version now that defaults to this. If you're experiencing the 403 error, please try turning on SSL under options-&gt;network. Thanks &amp; sorry about the inconvenience. @DYBILU Can you try turning on SSL under options-&gt;network and let us know if that makes a difference? Thanks. *KD @fidasaari Can you try turning on SSL under options-&gt;network and let us know if that makes a difference? Thanks. *KD @minie0326 Can you try turning on SSL under options-&gt;network and let us know if that makes a difference? Thanks. *KD @IsSaJG Awesome, thanks. *KD @Brular Thanks for the feedback! *KD @MarinaSelpiaN Is it working now? *KD @tevelady Can you try turning on SSL under options-&gt;network and let us know if that makes a difference? Thanks. *KD We're aware of the 403 error and looking into right now. Thanks for your patience as we sort this out. @VintageEdward Can you try turning on SSL under options-&gt;network and let us know if that makes a difference? Thanks. *KD @BLuu_Mathibe Can you try turning on SSL under options-&gt;network and let us know if that makes a difference? Thanks. *KD @IsSaJG Can you try turning on SSL under options-&gt;network and let us know if that makes a difference? Thanks. *KD @brianhewitt Can you try turning on SSL under options-&gt;network and let us know if that makes a difference? Thanks. *KD @merrcgos Can you try turning on SSL under options-&gt;network and let us know if that makes a difference? Thanks. *KD @yogiypw Can you try turning on SSL under options-&gt;network and let us know if that makes a difference? Thanks. *KD @MarinaSelpiaN Can you try turning on SSL under options-&gt;network and let us know if that makes a difference? Thanks. *KD @RennyFancha Can you try turning on SSL under options-&gt;network and let us know if that makes a difference? Thanks. *KD @subhaanilham Can you try turning on SSL under options-&gt;network and let us know if that makes a difference? Thanks. *KD @sisilia_go Can you try turning on SSL under options-&gt;network and let us know if that makes a difference? Thanks. *KD @tania_damayanti Can you try turning on SSL under options-&gt;network and let us know if that makes a difference? Thanks. *KD @TitoKaristo Can you try turning on SSL under options-&gt;network and let us know if that makes a difference? Thanks. *KD @arradeas Can you try turning on SSL under options-&gt;network and let us know if that makes a difference? Thanks. *KD @Aisha_Karina128 Can you try turning on SSL under options-&gt;network and let us know if that makes a difference? Thanks. *KD @AlbaSRomero Twitter issue. They're on it. Wait a bit. Follow us for future updates on this. *DD @roybenzS350 We hope so, and no *DD @Ramleey Twitter issue. They're on it. Wait a bit. Follow us for future updates on this. *DD @BLuu_Mathibe Twitter issue. They're on it. Wait a bit. Follow us for future updates on this. *DD @Ohafia_bOi Twitter issue. They're on it. Wait a bit. Follow us for future updates on this. *DD @Baphomat_ Twitter issue. They're on it. Wait a bit. Follow us for future updates on this. *DD @JoseMaAwesome Twitter issue. They're on it. Wait a bit. Follow us for future updates on this. *DD @NuclearNadal Twitter issue. They're on it. Wait a bit. Follow us for future updates on this. *DD @YoSoyTeyo Twitter issue. They're on it. Wait a bit. Follow us for future updates on this. *DD @DizzBGF Twitter issue. They're on it. Wait a bit. Follow us for future updates on this. *DD @Fakamatah Twitter issue. They're on it. Wait a bit. Follow us for future updates on this. *DD @Tambae Twitter issue. They're on it. Wait a bit. Follow us for future updates on this. *DD @yeya038 Twitter issue. They're on it. Wait a bit. Follow us for future updates on this. *DD @SucceedSooner Twitter issue. They're on it. Wait a bit. Follow us for future updates on this. *DD @GuyBehindBeer Twitter issue. They're on it. Wait a bit. Follow us for future updates on this. *DD @SnezziReloaded Twitter issue. They're on it. Wait a bit. Follow us for future updates on this. *DD @beejay978 So are we *DD @boynat Twitter issue. They're on it. Wait a bit. Follow us for future updates on this. *DD @Its_kagiso Twitter issue. They're on it. Wait a bit. Follow us for future updates on this. *DD @MaswaModjadji Twitter issue. They're on it. Wait a bit. Follow us for future updates on this. *DD @_Miss_Zoe @jozimental1 Twitter issue. They're on it. Wait a bit. Follow us for future updates on this. *DD @DJSmooth71 Twitter issue. They're on it. Wait a bit. Follow us for future updates on this. *DD @Sandile_D exactly. We don't know since its not our issue *DD @Ekitriyuda To remove the ads please purchase the Subscription for our app by going to the Purchase option on your app's menu. Tks! *DD @Peabss Twitter issue. They're on it. Wait a bit. Follow us for future updates on this. *DD @HaunteDeception Twitter issue. They're on it. Wait a bit. Follow us for future updates on this. *DD @Zealot_1 Twitter issue. They're on it. Wait a bit. Follow us for future updates on this. *DD @Sandile_D Let me ask my magic 8-ball *DD @Sandile_D Twitter issue. They're on it. Wait a bit. Follow us for future updates on this. *DD @Flirtelem Twitter issue. They're on it. Wait a bit. Follow us for future updates on this. *DD @AlbaValdz @UberSocial Twitter issue. They're on it. Wait a bit. Follow us for future updates on this. *DD @JohanQpeo classy *DD @WeirdSid Twitter issue. They're on it. Wait a bit. Follow us for future updates on this. *DD @BreatheInDeep Twitter issue. They're on it. Wait a bit. Follow us for future updates on this. *DD @JohanQpeo Twitter issue. They're on it. Wait a bit. Follow us for future updates on this. *DD @_Miss_Zoe @Mig_Mongezai Twitter issue. They're on it. Wait a bit. Follow us for future updates on this. *DD @MawetuMatyila Twitter issue. They're on it. Wait a bit. Follow us for future updates on this. *DD @Ayabonga_M Twitter issue. They're on it. Wait a bit. Follow us for future updates on this. *DD @PrinceLeKnight Twitter issue. They're on it. Wait a bit. Follow us for future updates on this. *DD @Yewinski Twitter issue. They're on it. Wait a bit. Follow us for future updates on this. *DD @Emveepee1 Twitter issue. They're on it. Wait a bit. Follow us for future updates on this. *DD @JuFromMars Twitter issue. They're on it. Wait a bit. Follow us for future updates on this. *DD @damnSlick Twitter issue. They're on it. Wait a bit. Follow us for future updates on this. *DD @ArepaZombie Twitter issue. They're on it. Wait a bit. Follow us for future updates on this. *DD @DYBILU Twitter issue. They're on it. Wait a bit. Follow us for future updates on this. *DD @Chockie_M Twitter issue. They're on it. Wait a bit. Follow us for future updates on this. *DD @TeeKay_Beja Twitter issue. They're on it. Wait a bit. Follow us for future updates on this. *DD @Kelly_Makolota Twitter issue. They're on it. Wait a bit. Follow us for future updates on this. *DD @StormxWind Twitter issue. They're on it. Wait a bit. Follow us for future updates on this. *DD @ONEKEPLER Twitter issue. They're on it. Wait a bit. Follow us for future updates on this. *DD @Infiniteoceans_ Twitter issue. They're on it. Wait a bit. Follow us for future updates on this. *DD @longpre11 yes *DD @iCabway We're very aware *DD @Ariani_cip That's just how they made it *DD @beejay978 Twitter issue. They're on it. Wait a bit. Follow us for future updates on this. *DD @Snow_Love22 Twitter issue. They're on it. Wait a bit. Follow us for future updates on this. *DD @HelloKim_Bum Twitter issue. They're on it. Wait a bit. Follow us for future updates on this. *DD @Iam_treasure @Burberry_Dude Its not up to us to fix, so there's no fixing we can do. Its up to Twitter, boss. *DD @pame16 Twitter issue. They're on it. Wait a bit. Follow us for future updates on this. *DD @Burberry_Dude Correct *DD @iCabway  sigh. We're not down, Twitter is. *DD @Lady_Crunk Twitter issue. They're on it. Wait a bit. Follow us for future updates on this. *DD @Ariani_cip Its not up to us *DD @King_Amarah Twitter issue. They're on it. Wait a bit. Follow us for future updates on this. *DD @ExtraCurricula Twitter issue. They're on it. Wait a bit. Follow us for future updates on this. *DD @Sisonke_Tee Twitter issue. They're on it. Wait a bit. Follow us for future updates on this. *DD @Burberry_Dude Its a Twitter issue. Nothing we can do *DD @temmy4olu Twitter issue. They're on it. Wait a bit. Follow us for future updates on this. *DD @JohanQpeo Twitter issue. They're on it. Wait a bit. Follow us for future updates on this. *DD @iCabway Twitter issue. They're on it. Wait a bit. Follow us for future updates on this. *DD @Ariani_cip We know  *DD @Njabsi Twitter issue. They're on it. Wait a bit. Follow us for future updates on this. *DD @Mcbenani No plans *DD @ObeyLeeAnne Nothing. Twitter issue. They're on it. Wait a bit. Follow us for future updates on this. *DD @JohnDuckworthFT @UberSocial Twitter issue. They're on it. Wait a bit. Follow us for future updates on this. *DD @Im_Her_man The Twitter app works in their own environment. Ours works off their API which is a different thing. #themoreyouknow *DD @mogentle @UberSocial @SOCIALLYGames Twitter issue. They're on it. Wait a bit. Follow us for future updates on this. *DD @Ariani_cip Twitter issue. They're on it. Wait a bit. Follow us for future updates on this. *DD @iashokraaj Wait til they fix it *DD @Ekitriyuda Twitter issue. They're on it. Wait a bit. Follow us for future updates on this. *DD @shnthariandja Twitter issue. They're on it. Wait a bit. Follow us for future updates on this. *DD @Im_Her_man Twitter issue. They're on it. Wait a bit. Follow us for future updates on this. *DD @mizz_bowss @Njabsi Twitter issue. They're on it. Wait a bit. Follow us for future updates on this. *DD @anotherapple Twitter issue. They're on it. Wait a bit. Follow us for future updates on this. *DD @beejay978 Twitter issue. They're on it. Wait a bit. Follow us for future updates on this. *DD @itsMorrisN Twitter issue. They're on it. Wait a bit. Follow us for future updates on this. *DD @iMalinger Twitter issue. They're on it. Wait a bit. Follow us for future updates on this. *DD @Burberry_Dude Twitter issue. They're on it. Wait a bit. Follow us for future updates on this. *DD @PolaniMagqira Twitter issue. They're on it. Wait a bit. Follow us for future updates on this. *DD @MuFFiN_MaaN Twitter issue. They're on it. Wait a bit. Follow us for future updates on this. *DD @TshoSir_Neo Nothing wrong with us. Twitter issue. They're on it. Wait a bit. Follow us for future updates on this. *DD @SiyandaRAPs Twitter issue. They're on it. Wait a bit *DD @THE_H0FF Click on a tweet of the user and select Direct Message *DD @Vixi_Elle_Tee Twitter issue. They're on it. Wait a bit *DD @iashokraaj Twitter issue. They're on it. Wait a bit *DD @riansatriaz Twitter issue. They're on it. Wait a bit *DD @NondumisoShinga Twitter issue. They're on it. Wait a bit *DD @auntynife Twitter issue. They're on it. Wait a bit *DD @MzoliN Twitter issue. They're on it. Wait a bit *DD @AlexOsaso513 Good thinking *DD @Yug_isaac Twitter issue. They're on it. Wait a bit *DD @AlexOsaso513 If it's not a problem with our code, how can we fix it? *DD @megan34951 Twitter issue. They're on it. Wait a bit *DD @franAdrianza Twitter issue. They're on it. Wait a bit *DD @I_am_Sammi @Camagu_Mayeye Twitter issue. They're on it. Wait a bit *DD @ferari90 Twitter issue. They're on it. Wait a bit *DD @Mastos_TM Twitter issue. They're on it. Wait a bit *DD Twitter's Home Timeline and UserStream APIs are still having issues causing our apps to not work correctly. We hope they solve it soon. @kojoNINJA The issues with Twitter continue  *DD @Clau_GarciaM Twitter issue. They're on it. Wait a bit *DD @Janelle_Mal Twitter issue. They're on it. Wait a bit *DD @lebron_griffin Twitter issue. They're on it. Wait a bit *DD @LadyAbiRay Twitter issue. They're on it. Wait a bit *DD @OnlySteveH The app is fine. It's a Twitter issue. They're on it. Wait a bit *DD @Kimckay Twitter issue. They're on it. Wait a bit *DD @AlistairPugin its' not you, its a Twitter issue. They're on it. Wait a bit *DD @bukhaii To remove the ads please purchase the Subscription for our app by going to the Purchase option on your app's menu. Tks! *DD @bukhaii You'll figure it out *DD @Im_Her_man @IngaPhillips We provide support on this account, and sometimes we provide the funny as well. *DD @IngaPhillips no buts chill! http://t.co/P7l21OZCtU *DD @IngaPhillips chillin *DD @bdonahueweedman Sorry, no plans *DD @cmapapillon Twitter issue. They're on it. Wait a bit *DD @jasonjnielsen @deweytimothy The problems you are experiencing are a Twitter issue. They're on it. Wait a bit *DD @oriisetz Twitter issue. They're on it. Wait a bit *DD @TophieKai https://t.co/JvQoGWIwKx *DD @AthenaManiar We're aware. We hope they fix it soon *DD @dutch123088 The limits are set by Twitter's new API, not us. Give it a couple of minutes and it will be ok again. *DD @MissDeola Twitter issue. They're on it. Wait a bit *DD @bluepoet21 Twitter issue. They're on it. Wait a bit *DD @erbie3 Twitter issue. They're on it. Wait a bit *DD @Gold_N_Goddess Are you on the latest version? *DD @shawen17 No plans *DD @MsAdlerIPresume Try clearing the cache *DD @MikeDWBerg Twitter issue. They're on it. Wait a bit *DD @Noty_Prof Twitter issue. They're on it. Wait a bit *DD @SpiceSpoon Twitter issue. They're on it. Wait a bit *DD @Miss_wanz The limits are set by Twitter's new API, not us. Give it a couple of minutes and it will be ok again. *DD @Gold_N_Goddess hmm it should. Which version # of the app and what device do you have, UberSoc is it Bberry, iPhone or Android? *DD @Miss_JenAnn @JosieGresko @mandyyeffmyendo Twitter issue. They're on it. Wait a bit *DD @DaMan68 Yeap, that's part of it *DD @VoxTomm No plans *DD @MrsZomDy We can't do anything about it. *DD @IamChershit We know :-( *DD @Tiibouy No plans *DD @LouieSupreme Glad that helped. The problem seems to be deeper than that https://t.co/Ud8lTwj6RT *DD @mandiebear So do we. Thanks! *DD @RHFreelancer https://t.co/Ud8lTwj6RT *DD @RHFreelancer The Twitter app works within their own environment, other apps do not #themoreyouknow *DD @fairuse :-) *DD @meladawn http://t.co/agVVGDBztM *DD @ipenky No plans *DD @meladawn Yes *DD @fairuse To remove the ads please purchase the Subscription for our app by going to the Purchase option on your app's menu. Tks! *DD @gilalulang Twitter issue. They're on it. Wait a bit *DD @Kelly_Makolota Not up to us https://t.co/Ud8lTwj6RT *DD @viskasw Yea, we're aware *DD @ChilldaLindstam http://t.co/GIKr9yw4l7 *DD @Tauri79 You can see for yourself here https://t.co/Ud8lTwj6RT *DD @Chizval We're sure they are working hard on it *DD @ChilldaLindstam !! *DD @ChilldaLindstam U *DD @opeyek No plans *DD Twitter is still having issues with their userstream which is causing our apps to be slow and/or crash. We hope they fix it soon. @boviet_halim Twitter issue. They're on it. Wait a bit *DD @DeeToor @LaniBlahnik @Melusi_MD ...case the app freezes *DD 2/2 @DeeToor @LaniBlahnik @Melusi_MD The \"Cancel\" button doesn't stop tweets from sending. It allows you to get out of that screen in... 1/2 @djolder @saratu Its not the apps, of all Twitter mobile apps are having issues due to slowness on their side *DD @AthenaManiar Twitter issue. They're on it. Wait a bit *DD @cynthytks Twitter issue. They're on it. Wait a bit *DD @Twomp_thaDJ It's not our app, its Twitter having issues. *DD LIMITED TIME OFFER! Our friends at LG are giving the #LGG2 for #FREE when you bring your number to Sprint! http://t.co/kYOW1L1Nu2 The #BCS game was held earlier this week near @UberSoc HQ. What were the fans here in Pasadena, CA interested in? http://t.co/jjf0XqByli Which celebrity do Auburn fans engage with most? What about FSU fans? Let's just say @Oprah made the list: http://t.co/5bnFYfh5dP #BCS @ncumissah_ Twitter issue. They're on it. Wait a bit *DD @boynat Not us, Twitter *DD @siouxhockeyfan1 Twitter issue. They're on it. Wait a bit *DD @siphojanuary :-) *DD @Swaggy10 Twitter issue. They're on it. Wait a bit *DD @_Hennessy01 Great! *DD @Eurasialove -____________- indeed *DD @hadeeza_song Twitter issue. They're on it. Wait a bit *DD @umuode Twitter issue. They're on it. Wait a bit *DD @Khanya_Gwini Twitter issue. They're on it. Wait a bit *DD Twitter is working on the slowness issue. Please stand by. Here are some puppies to pass the time http://t.co/blhjB5S7Ab @AseMahle_ Twitter issue. They're on it. Wait a bit *DD @ManD_Mph Twitter issue. They're on it. Wait a bit *DD @Mrkelvyn Twitter issue. They're on it. Wait a bit *DD @holuwahfemi Twitter issue. They're on it. Wait a bit *DD @_MissModise Twitter issue. They're on it. Wait a bit *DD @Da_bomb89 Twitter issue. They're on it. Wait a bit *DD @DaMan68 Twitter issue. They're on it. Wait a bit *DD @sageofages Twitter issue. They're on it. Wait a bit *DD @roybenzS350 This could be a cause of that, yes *DD @Chris_Househead Twitter issue. They're on it. Wait a bit *DD @LyneeseF Twitter issue. They're on it. Wait a bit *DD @JayR_12 No plans *DD @sncura @siphojanuary Twitter issue. They're on it. Wait a bit *DD Twitter is having some issues with their stream at this time which are causing apps to behave erratically. We hope they solve it soon @CarolineBobo Twitter issue. They're on it. Wait a bit *DD @TiDOManando @LwaZee_V @Miss_Moloquain Hi! Let me try to help you with this. What's going on? *DD @iTWEET_ANALYSIS Twitter issue. They're on it. Wait a bit *DD @Tweenie_F Twitter issue. They're on it. Wait a bit *DD @Effizzy_ Nothing we can do. It's a Twitter issue. *DD @kojoNINJA Twitter issue. They're on it. Wait a bit *DD @Thehoopscoops Twitter issue. They're on it. Wait a bit *DD @Sunshine_Cazz @jax1369 Are you getting an error? *DD @MissNtombi What does it say? *DD @Effizzy_ \"unknown response from twitter services,likely they are over capacity\" There's the problem *DD @mawedoenape What does it say? *DD @Se7enPsychos Twitter issue. They're on it. Wait a bit *DD @_MadHatt3r Hi! Let me try to help you with this. What's going on? *DD @MissNtombi Can you send us a screenshot? *DD @Effizzy_ @OluwaSwizzhits Send us a screenshot *DD @Effizzy_ @OluwaSwizzhits What does that mean? *DD @MissNtombi Hi! Let me try to help you with this. What's going on? *DD @OluwaSwizzhits Hi! Let me try to help you with this. What's going on? *DD @Lindadlamini10 Hi! Let me try to help you with this. What's going on? *DD @Djranx Lower the Notification Time Interval in the Settings *DD @wamhl Hi! Let me try to help you with this. What's going on? *DD @AdvisorDes Twitter issue. They're on it. Wait a bit *DD @Slim_Dude_12 Hi! Let me try to help you with this. What's going on? *DD @NotoriousSIG_ Which version # of the app and what device do you have, UberSoc is it Bberry, iPhone or Android? *DD @sjthomas_ Sorry about that. We'll investigate. *DD @sjthomas_ Can you try uninstalling the app, turning your device off and on, and reinstalling it? *DD @sjthomas_ Hi! Let me try to help you with this. What's going on? *DD See Keanu Reeves in #47Ronin - Now playing in Real-D 3D. Get tix: http://t.co/iejwp0lfeG #los47 @Sensei_Muna #Ifitaintbrokedontfixit *DD @Sensei_Muna Hi! Let me try to help you with this. What's going on? *DD @Thandi_Ndapz Hi! Let me try to help you with this. What's going on? *DD @fivga Twitter limitations *DD @mlungisi_prince To remove the ads please purchase the Subscription for our app by going to the Purchase option on your app's menu. Tks! *DD @DatLankyDude update to the latest *DD @DatLankyDude Which version # of the app and what device do you have, UberSoc is it Bberry, iPhone or Android? *DD @Aryordeygie Hi! Let me try to help you with this. What's going on? *DD @Duwop70 Sorry about that. Please submit that here: http://t.co/Y0PnBvACEZ *DD @CeeRoyale Twitter issue. They're on it. Wait a bit *DD @Kimmico_la Which version # of the app and what device do you have, UberSoc is it Bberry, iPhone or Android? *DD @CeeRoyale Which version # of the app and what device do you have, UberSoc is it Bberry, iPhone or Android? *DD @CeeRoyale Hi! Let me try to help you with this. What's going on? *DD @teebimbs Hi! Let me try to help you with this. What's going on? *DD @MarcusLovesBey The limits are set by Twitter's new API, not us. Give it a couple of minutes and it will be ok again. *DD @lovatosraise The limits are set by Twitter's new API, not us. Give it a couple of minutes and it will be ok again. *DD @Dat_limah Hi! Let me tri 2 help u wyt dis. What's going on? *DD @Ikay__ you should *DD @George_ZA No plans *DD @CrazeeFistaz This is due to the API limits set by Twitter, not us. Give it a couple of minutes and it will be ok again. *DD @CrazeeFistaz Hi! Let me try to help you with this. What's going on? *DD @HauteDona Hi! Let me try to help you with this. What's going on? *DD @Khebah_SHB Clear the cache *DD @i2know Twitter issue. They're on it. Wait a bit *DD @J0shWest Unfortunately, no *DD @ZIDH0 To remove the ads please purchase the Subscription for our app by going to the Purchase option on your app's menu. Tks! *DD @sparkybakewell We will. This is a partner issue. We'll reprimand  *DD @sparkybakewell We'll look into it *DD @sparkybakewell What's going on? *DD @Khanz13x You'll remember :-) *DD @NeeCee75 Twitter issue. They're on it. Wait a bit *DD @Aphiwe_Matyila Probably the network *DD @Aphiwe_Matyila Hi! Let me try to help you with this. What's going on? *DD @NeeCee75 Which version # of the app and what device do you have, UberSoc is it Bberry, iPhone or Android? *DD @uttailgaters ...the issue will help *DD 2/2 @uttailgaters Which version # of the app and what device do you have, UberSoc is it Bberry, iPhone or Android? and more detail about... 1/2 @macabelee Correct *DD @macabelee The limits are set by Twitter's new API, not us. Give it a couple of minutes and it will be ok again. *DD @_Ms_Milly Which version # of the app and what device do you have, UberSoc is it Bberry, iPhone or Android? *DD @WilliamsXL version of the application *DD @WilliamsXL Version #? *DD @WilliamsXL Which version # of the app and what device do you have, UberSoc is it Bberry, iPhone or Android? *DD @WilliamsXL Hi! Let me try to help you with this. What's going on? *DD @Still_Ntsiki Which version # of the app and what device do you have, UberSoc is it Bberry, iPhone or Android? *DD @killa_kamy :-) *DD @killa_kamy Is it working ok now? *DD @Still_Ntsiki Hi! Let me try to help you with this. What's going on? *DD @killa_kamy Hi! Let me try to help you with this. What's going on? *DD @I_AM_2Mii You pressed the wrong option *DD @vpaige No plans. *DD @I_AM_2Mii @SlevinMZ DMs don't leak *DD @iMaurice_ Are we a frog this morning? *DD @Beautifu1bliss Hi! Let me try to help you with this. What's going on? *DD @tref :-) *DD @duck_isitik The limits are set by Twitter's new API, not us. Give it a couple of minutes and it will be ok again. *DD @RealistBlacka Try this: on your BB go to Options&gt;Applications&gt;UberSocial, set permissions to Allow &amp; save. Remove &amp; reinsert battery *DD @RealistBlacka Which version # of the app and what device do you have, UberSoc is it Bberry, iPhone or Android? *DD @shawty639 Can you try uninstalling the app, turning your device off and on, and reinstalling it? *DD @General_fvlly Hi! Let me try to help you with this. What's going on? *DD @aaronjalexander Working on it *DD @RealistBlacka Did you reach the Twitter API limit? *DD @S_Nombebe Your mentions are public to everyone &amp; are able to be seen using any app, unless your account is set private #howtwitterworks *DD @RealistBlacka Hi! Let me try to help you with this. What's going on? *DD @Tshepnificent Clear the cache, yo *DD @supa_dad16 If you got it using your account and from the approved marketplace, yes *DD @supa_dad16 Can you try uninstalling the app, turning your device off and on, and reinstalling it? *DD @supa_dad16 Try removing Ubersocial from Facebook and reconnecting. Facebook&gt;Settings&gt;Apps&gt; Remove Ubersocial *DD @kay__van Hi! Let me try to help you with this. What's going on? *DD @SweetLovePeach_ You'll figure it :-) *DD @Nerk_King DMs don't leak *DD @Vinnie_John @kay__van Hi! Let me try to help you with this. What's going on? *DD @ankgeehaqi To remove the ads please purchase the Subscription for our app by going to the Purchase option on your app's menu. Tks! *DD @queenammilada Twitter limitations *DD @WendiWrites If that doesn't work please submit that issue: http://t.co/Y0PnBvACEZ *DD @WendiWrites I'm sorry. Can you try uninstalling the app, turning your device off and on, and reinstalling it? *DD @preyetito http://t.co/agVVGDBztM *DD @preyetito Hi! Let me try to help you with this. What's going on? *DD @WendiWrites so strange. Can you try clearing the app's data? Go to your device's settings&gt;Apps&gt;UberSocial&gt;Remove Data *DD @WendiWrites ...click Yes *DD 2/2 @WendiWrites gotcha. Try this, on your device click UberMenu&gt;Settings&gt;About UberSocial, scroll to the bottom, click Clear Cache and... 1/2 @WendiWrites Is it giving you any type of error message? *DD @WendiWrites When are you experiencing the issue? Be specific *DD @WendiWrites Are you on the latest version? *DD @iHunnyBear Working on it *DD @PakoMpitse Its not a problem, its a limitation *DD @PakoMpitse Twitter limits us from showing you that *DD @Lalaykan No plans *DD @CeeXTwo No plans for that *DD @PakoMpitse Twitter limitations *DD @ashhyde83 No plans *DD @LuthfyImam We do not support those themes anymore *DD @ViananimoeTZ @TheHobbitMovie Yeap :-) *DD Who's excited for #TheHobbit tonight?  We are! @TheHobbitMovie @bindr Which version # of the app and what device do you have, UberSoc is it Bberry, iPhone or Android? *DD @IAmQuebex The limits are set by Twitter's new API, not us. Give it a couple of minutes and it will be ok again. *DD @an0nthoughts Can you try uninstalling the app, turning your device off and on, and reinstalling it? *DD @an0nthoughts Which version # of the app and what device do you have, UberSoc is it Bberry, iPhone or Android? *DD @an0nthoughts Hi! Let me try to help you with this. What's going on? *DD @carTooN_ugly Which version # of the app and what device do you have, UberSoc is it Bberry, iPhone or Android? *DD @DickLewis13 @aThumper @Macksal @myalec @MarlenaJones21 @NatalyinAK @PhilEchols @Greatvine32 @roboform @GuyGilchrist @stephanpastis  :-) *DD @ESPNSteinLine We currently do not have plans for that *DD @anniefertiti Your tweets seem to be spelled correctly :-) *DD @carTooN_ugly Refreshing what? Is it hitting the Twitter rate limit? *DD @Vixi_Elle_Tee To remove the ads please purchase the Subscription for our app by going to the Purchase option on your app's menu. Tks! *DD @Huli_Presh Lower the Notification Time Interval in the Settings *DD @Huli_Presh @carTooN_ugly Can you be more specific? *DD @anniefertiti Are you sure? *DD @carTooN_ugly @Huli_Presh What's slow about it? *DD @YourLoveIsaLiee Can you try uninstalling the app, turning your device off and on, and reinstalling it? *DD @ARHLscreamo What error is it giving you? *DD @YourLoveIsaLiee Try this: on your BB go to Options&gt;Applications&gt;UberSocial, set permissions to Allow &amp; save. Remove &amp; reinsert battery *DD @YourLoveIsaLiee version #? *DD @DefineTwink_ Hi! Let me try to help you with this. What's going on? *DD @chantipuss Which version # of the app and what device do you have, UberSoc is it Bberry, iPhone or Android? *DD @chantipuss Hi! Let me try to help you with this. What's going on? *DD @Sidnezy Can you try uninstalling the app, turning your device off and on, and reinstalling it? *DD @YourLoveIsaLiee Which version # of the app and what device do you have, UberSoc is it Bberry, iPhone or Android? *DD @Sidnezy In the settings. *DD @Ms_KooLz Hi! Let me try to help you with this. What's going on? *DD @Pudinki Lower the Notification Time Interval in the Settings *DD @Pudinki Hi! Let me try to help you with this. What's going on? *DD @DonSerote_ Which version # of the app and what device do you have, UberSoc is it Bberry, iPhone or Android? *DD @rebellesavi Hi! Let me try to help you with this. What's going on? *DD @DonSerote_ Hi! Let me try to help you with this. What's going on? *DD @ARHLscreamo is the account new? *DD @MadBoutRobsten You'll figure it out *DD @dead_presh Hi! Let me try to help you with this. What's going on? *DD @EyeEmLazD @Itumelengest_ Lower the Notification Time Interval in the Settings *DD @Crown_siyan What's up? *DD @ARHLscreamo Can you try uninstalling the app, turning your device off and on, and reinstalling it? *DD @Deelas Hi! Let me try to help you with this. What's going on? *DD @pitar1111 The limits are set by Twitter's new API, not us. Give it a couple of minutes and it will be ok again. *DD @ayOreohead @I_Mike_LaaarEEE Lower the Notification Time Interval in the Settings *DD @ARHLscreamo Hi! Let me try to help you with this. What's going on? *DD @tweet2em :-) *DD @tweet2em \"Good idea\" http://t.co/rkEJJiZpjg *DD @hxkimthegreat Hello :-) *DD @Greg_Lereng What takes forever to refresh? *DD @Scheetoofresh Hi! Let me try to help you with this. What's going on? *DD @Toxiie_T Which version # of the app and what device do you have, UberSoc is it Bberry, iPhone or Android? *DD @Toxiie_T Hi! Let me try to help you with this. What's going on? *DD @wiilkilz What version #? *DD @wiilkilz The application *DD @wiilkilz version #? *DD @hotrodngold let me know if that works *DD @Richpikin @wiilkilz That should work *DD @wiilkilz Which version # of the app and what device do you have, UberSoc is it Bberry, iPhone or Android? *DD @hotrodngold Can you try uninstalling the app, turning your device off and on, and reinstalling it? *DD @ergyona :-) *DD @Out_Lived @PatFlynn :-) *DD @Met2Moz @ConstableChaos :-) *DD @hotrodngold Which version # of the app and what device do you have, UberSoc is it Bberry, iPhone or Android? *DD @catahstrophic Unfortunately no *DD @DanParmesan Try reconnecting Facebook. Go to http://t.co/r8DJWVNwUV&gt;settings&gt;apps, remove Ubersocial and then reconnect on your device *DD @valencivalencia AppWorld *DD @Loop_Us Lower the Notification Time Interval in the Settings *DD @valencivalencia Update to the latest *DD @DanParmesan :-) *DD @valencivalencia Which version # of the app and what device do you have, UberSoc is it Bberry, iPhone or Android? *DD @siZizi Hi! Let me try to help you with this. What's going on? *DD @imstephaniex Hi! Let me try to help you with this. What's going on? *DD @Forever_Tanha Is that a feature that Twitter allows? *DD @thommie08 Update then *DD @thommie08 version #? *DD @thommie08 Which version # of the app and what device do you have, UberSoc is it Bberry, iPhone or Android? *DD @thommie08 Hi! Let me try to help you with this. What's going on? *DD @MavusoT Hi! Let me try to help you with this. What's going on? *DD @Dharmeelowlah Which version # of the app and what device do you have, UberSoc is it Bberry, iPhone or Android? *DD @Dharmeelowlah Hi! Let me try to help you with this. What's going on? *DD @LOARDOFTHESKYS :-) *DD @arieldb We're fixing that  *DD @Asha10 Sorry about that. Please submit that here: http://t.co/Y0PnBvACEZ *DD @sparkybakewell Don't do that. It won't help *DD @Asha10 Can you try uninstalling the app, turning your device off and on, and reinstalling it? *DD @Asha10 Try clearing the cache in the settings *DD @_TheL0neW0lf Because we receive thousands of tweets and day and we need to track and catalog them to help you better *DD @Asha10 Which version # of the app and what device do you have, UberSoc is it Bberry, iPhone or Android? *DD @chantalalalalal Hi! Let me try to help you with this. What's going on? *DD @sparkybakewell We're looking into it *DD @odewabrata Hi! Let me try to help you with this. What's going on? *DD @_TheL0neW0lf Hi! Let me try to help you with this. What's going on? *DD @almazsithole @P_Stunner_ Upgrades can be in the background *DD @DjVaughn1876 Yes we do *DD @Its_kagiso @Gawdly_Innoh ...app's menu. Tks! *DD 2/2 @Its_kagiso @Gawdly_Innoh To remove the ads please purchase the Subscription for our app by going to the Purchase option on your... 1/2 @bamboeroentjing Which version # of the app and what device do you have, UberSoc is it Bberry, iPhone or Android? *DD @bamboeroentjing Hi! Let me try to help you with this. What's going on? *DD @_holls__ What's going on? *DD @Lutho_Kula Hi! Let me try to help you with this. What's going on? *DD @Chester_ZA They're not very good at answering tweets. Better to contact their support site http://t.co/yUvYWcFNY1 *DD @Chester_ZA :-( Please contact Twitter support *DD @coconicco You too! *DD @coconicco If it happens again submit that here: http://t.co/Y0PnBvACEZ *DD @brechild you can submit that here: http://t.co/Y0PnBvACEZ *DD @coconicco We'll be here *DD @coconicco Can you try uninstalling the app, turning your device off and on, and reinstalling it? *DD @coconicco Try this: on your BB go to Options&gt;Applications&gt;UberSocial, set permissions to Allow &amp; save. Remove &amp; reinsert battery *DD @Chester_ZA @twitter Most likely *DD @Kiyax88 Which version # of the app and what device do you have, UberSoc is it Bberry, iPhone or Android? *DD @Aycbox You should *DD @Chester_ZA Yes *DD @coconicco What does it say? *DD @Chester_ZA Delete and reinstall our application *DD @Aycbox Which version # of the app and what device do you have, UberSoc is it Bberry, iPhone or Android? *DD @Kiyax88 What's slow? *DD @Chester_ZA Give that a try and lets see what happens *DD @Kiyax88 @_tshegoxo Hi! Let me try to help you with this. What's going on? *DD @Biggysmallz01 Hi! Let me try to help you with this. What's going on? *DD @Chester_ZA Its the Hail Mary :-) *DD @Chester_ZA Can you try uninstalling the app, turning your device off and on, and reinstalling it? *DD @Aycbox Hi! Let me try to help you with this. What's going on? *DD @Chester_ZA This after allowing all permissions? *DD @Mad_EnglishGirl The limits are set by Twitter's new API, not us. Give it a couple of minutes and it will be ok again. *DD @Delaan_K :-) *DD @lolklaine Use the delete feature if its your own tweet *DD @Chester_ZA Try this: on your BB go to Options&gt;Applications&gt;UberSocial, set permissions to Allow &amp; save. Remove &amp; reinsert battery *DD @Chester_ZA Is it happening on any other app, or web? *DD @Chester_ZA Is it happening on both devices? *DD @seeked Spam doesn't have to do with our application *DD @Chester_ZA Which version # of the app and what device do you have, UberSoc is it Bberry, iPhone or Android? *DD @Chester_ZA There is no limit on how many people you can follow *DD @sonihots What's slow about it? *DD @ArcShades Go to Compose Tweet, press button on top right *DD @Adain_Soshanah You can turn that off *DD @Adain_Soshanah What hashtag? *DD @msThobie To remove the ads please purchase the Subscription for our app by going to the Purchase option on your app's menu. Tks! *DD @RealBurberryAmE To remove the ads please purchase the Subscription for our app by going to the Purchase option on your app's menu. Tks! *DD @ArcShades Which version # of the app and what device do you have, UberSoc is it Bberry, iPhone or Android? *DD @JuniorLie http://t.co/GIKr9yw4l7 *DD @JuniorLie Make sure the time zone in your device is the same as your physical time zone *DD @JuniorLie Hi! Let me try to help you with this. What's going on? *DD @mzmetal Hi! Let me try to help you with this. What's going on? *DD @stewiepeanutj @GrimmyBootMan ...app's menu. Tks! *DD 2/2 @stewiepeanutj @GrimmyBootMan To remove the ads please purchase the Subscription for our app by going to the Purchase option on your... 1/2 @ThaboBee Lower the Notification Time Interval in the Settings *DD @yeolchanparks To remove the ads please purchase the Subscription for our app by going to the Purchase option on your app's menu. Tks! *DD @Mfenana_Jr Try this, on your device click UberMenu&gt;Settings&gt;About UberSocial, scroll to the bottom, click Clear Cache and click Yes *DD @GLENDA_G_ No plans *DD @AnxiousDaydream Can you try uninstalling the app, turning your device off and on, and reinstalling it? *DD @AnxiousDaydream @mwilliamsthomas Which version # of the app and what device do you have, UberSoc is it Bberry, iPhone or Android? *DD @PolaniMagqira Lower the Notification Time Interval in the Settings *DD @THABZ_07 What's slow? *DD @Morakerak To remove the ads please purchase the Subscription for our app by going to the Purchase option on your app's menu. Tks! *DD Today only: Our friends at LG are giving $200 off the #LGG2 when you bring your number to Sprint. http://t.co/WUPq3RLHgf Limited Offer: Our friends at LG are giving $150 off the #LGG2 at Sprint. Ends Monday!  http://t.co/Pp4qnt6nty @Dani_Zeros You can send a ticket here: http://t.co/Y0PnBvACEZ *DD @iceboy_202 Also, did you reach the Twitter API limit? *DD @iceboy_202 Which version # of the app and what device do you have, UberSoc is it Bberry, iPhone or Android? *DD @iceboy_202 How? *DD @iceboy_202 Hi! Let me try to help you with this. What's going on? *DD @Dani_Zeros Hi! Let me try to help you with this. What's going on? *DD @mrkmalinowski @UberSocial ...reinsert battery *DD 2/2 @mrkmalinowski @UberSocial Try this: on your BB go to Options&gt;Applications&gt;UberSocial, set permissions to Allow &amp; save. Remove &amp;... 1/2 @KgDaDonKid http://t.co/VSECRPPGPG *DD @BamaBenz2000 Hi! Let me try to help you with this. What's going on? *DD @KgDaDonKid What does that mean? *DD @Ms_Dolche Which version # of the app and what device do you have, UberSoc is it Bberry, iPhone or Android? *DD @lanre_lag Really *DD @lanre_lag We've changed things in the background. Not all changes are UI related *DD @WickYYolo @fyn_boyy ...freezes *DD 2/2 @WickYYolo @fyn_boyy The \"Cancel\" button doesn't stop tweets from sending. It allows you to get out of that screen in case the app... 1/2 @sani_atk @WickYYolo Hi! Let me try to help you with this. What's going on? *DD @terfaelrifaie The limits are set by Twitter's new API, not us. Give it a couple of minutes and it will be ok again. *DD @HEAD_MASTA Try clearing the cache *DD @_twerkinforari Hi! Let me try to help you with this. What's going on? *DD @NenoID Are you still seeing the Samsung ads as often as you mentioned? *DD @LaxMyrical Sorry about that. Please submit that here: http://t.co/NrEbUebbHN *DD @AMOGELA_LESEGO @Simply_KayGeO Lower the Notification Time Interval in the Settings *DD @swweetkatley Hi! Let me try to help you with this. What's going on? *DD @LaxMyrical Can you try uninstalling the app, turning your device off and on, and reinstalling it? *DD @LaxMyrical In the Settings *DD @LaxMyrical Check the version # and let me know *DD @LaxMyrical Which version # of the app and what device do you have, UberSoc is it Bberry, iPhone or Android? *DD @De_Imperial If you want me to help, please tell me what the issue is *DD @De_Imperial Google Translate doesn't give me a meaning to that :-/ *DD @De_Imperial What does that mean? *DD @De_Imperial Hi! Let me try to help you with this. What's going on? *DD @__dOuGh :-P *DD @__dOuGh :-) *DD @TheFirstJayEver This is me http://t.co/P5XQGxWfNJ *DD @SophieBaby217 Try this, on your device click UberMenu&gt;Settings&gt;About UberSocial, scroll to the bottom, click Clear Cache and click Yes *DD @SophieBaby217 Which version # of the app and what device do you have, UberSoc is it Bberry, iPhone or Android? *DD @Nerdy_P @vickymonn Hi! Let me try to help you with this. What's going on? *DD @Voluptuous_Lae :-) *DD @Voluptuous_Lae You'll figure it out *DD @Diie_Mondez Try disconnecting UberSocial from Facebook in the Facebook Setting on a PC and then reconnecting *DD @TymGrady  Please submit that here: http://t.co/Y0PnBvACEZ *DD @TymGrady Thanks *DD @Afika_N Try this: on your BB go to Options&gt;Applications&gt;UberSocial, set permissions to Allow &amp; save. Remove &amp; reinsert battery *DD @Goddy_101 What kind of stunts? #EvelKnievel *DD @CaNCeR2184 To remove the ads please purchase the Subscription for our app by going to the Purchase option on your app's menu. Tks! *DD @Diie_Mondez Hi! Let me try to help you with this. What's going on? *DD @TymGrady Can you send us a screenshot of that ad? *DD @Afika_N Which version # of the app and what device do you have, UberSoc is it Bberry, iPhone or Android? *DD @longlivedube To remove the ads please purchase the Subscription for our app by going to the Purchase option on your app's menu. Tks! *DD @Afika_N Hi! Let me try to help you with this. What's going on? *DD @LoveMikita The limits are set by Twitter's new API, not us. Give it a couple of minutes and it will be ok again. *DD @lakedime @Questionnier :-) *DD @chitellaaa_ Hi! Let me try to help you with this. What's going on? *DD @collinsterol Lower the Notification Time Interval in the Settings *DD @here_s_niki Try this, on your device click UberMenu&gt;Settings&gt;About UberSocial, scroll to the bottom, click Clear Cache and click Yes *DD @here_s_niki Version #? *DD @here_s_niki Which version # of the app and what device do you have, UberSoc is it Bberry, iPhone or Android? *DD @here_s_niki That's because it has to go far back. It's mostly a Twitter issue *DD @keBENJI What section is slow? *DD @here_s_niki Hi! Let me try to help you with this. What's going on? *DD @Simply_KayGeO You can jump to top *DD @IyMcJAMES String does not compute *DD @thimmyt Try this: on your BB go to Options&gt;Applications&gt;UberSocial, set permissions to Allow &amp; save. Remove &amp; reinsert battery *DD @thimmyt Which version # of the app and what device do you have, UberSoc is it Bberry, iPhone or Android? *DD @IyMcJAMES I am real. Here's a pic http://t.co/4UlilMUQMI *DD @thimmyt Lower the Notification Time Interval in the Settings *DD @IyMcJAMES @thimmyt Hi! Let me try to help you with this. What's going on? *DD @DvApriyanti Hi! Let me try to help you with this. What's going on? *DD @SarahP_official @dewilvb An update should be out soon *DD @dewilvb @SarahP_official Can you try uninstalling the app, turning your device off and on, and reinstalling it? *DD @dewilvb @SarahP_official Which version # of the app and what device do you have, UberSoc is it Bberry, iPhone or Android? *DD @SarahP_official @dewilvb Hi! Let me try to help you with this. What's going on? *DD @_ayomitide Hi! Let me try to help you with this. What's going on? *DD @Most__handsome Lower the Notification Time Interval in the Settings *DD @LiliYochana :-) *DD @LiliYochana ...&amp; reinsert battery *DD 2/2 @LiliYochana hmmmmmm interesting. Try this: on your BB go to Options&gt;Applications&gt;UberSocial, set permissions to Allow &amp; save. Remove... 1/2 @LiliYochana Try closing those apps. What happens? *DD @LiliYochana Try restarting the device and only running UberSocial. Do you get the same warning? *DD @LiliYochana There is a finite amount of memory of your device. If there are too many apps running the memory runs out. *DD @LiliYochana Remove some apps that you might not be using *DD @shortstack81 The limits are set by Twitter's new API, not us. Give it a couple of minutes and it will be ok again. *DD @Abita_SS Hi! Let me try to help you with this. What's going on? *DD @mondliwes The limits are set by Twitter's new API, not us. Give it a couple of minutes and it will be ok again. *DD @asknact Go to UberMenu&gt;Columns, Is the Lists column turned on? *DD @shortstack81 Which version # of the app and what device do you have, UberSoc is it Bberry, iPhone or Android? *DD @asknact Go to the Lists Column. Press the device's Menu Button for Jump to top *DD @FoxyJazzabelle Can you try uninstalling the app, turning your device off and on, and reinstalling it? *DD @FoxyJazzabelle Try this, on your device click UberMenu&gt;Settings&gt;About UberSocial, scroll to the bottom, click Clear Cache and click Yes *DD @P0rsch Hi! Let me try to help you with this. What's going on? *DD @Rakishaw6mThado Hi! Let me try to help you with this. What's going on? *DD @sfreynolds :-) *DD @Eugene_012 Lower the Notification Time Interval in the Settings *DD @Eugene_012 Hi! Let me try to help you with this. What's going on? *DD @itz_chaelly :-) *DD @tatu_punk :-) *DD @Chomey_V Lower the Notification Time Interval in the Settings *DD @TeguhDark_48 version #? *DD @DialSquare_1886 Can you try uninstalling the app, turning your device off and on, and reinstalling it? *DD @TShaeD That's the latest. Is it working correctly? *DD @DialSquare_1886 Which version # of the app and what device do you have, UberSoc is it Bberry, iPhone or Android? *DD @TShaeD 1.414 is not the latest and does not work anymore. Update to the latest *DD @RoundDumplin No. They're set by tWitter *DD @RoundDumplin The limits are set by Twitter's new API, not us. Give it a couple of minutes and it will be ok again. *DD @Bhaaaby_Brown :-) *DD @TShaeD Update to the latest on the AppWrold *DD @St3phen_MUFC Unfortunately not at this time. Thanks! *DD @TShaeD Which version # of the app and what device do you have, UberSoc is it Bberry, iPhone or Android? *DD @TShaeD Hi! Let me try to help you with this. What's going on? *DD @TeguhDark_48 Which version # of the app and what device do you have, UberSoc is it Bberry, iPhone or Android? *DD @Alley_za :-) *DD @St3phen_MUFC You can mute users by going to their profile, pressing the option button on the to pright and selecting Mute *DD @St3phen_MUFC Which version # of the app and what device do you have, UberSoc is it Bberry, iPhone or Android? *DD @St3phen_MUFC Yeap :-) *DD @St3phen_MUFC :-) *DD @Lala_Bangs @Delta Good Guy Delta :-) *DD @SheylaRFans :-) *DD @yudum_kIzal Hi! Let me try to help you with this. What's going on? *DD @layobooty @kokomaster200 http://t.co/h7Zy8Pu07s *DD @Olabode23 Hi! Let me try to help you with this. What's going on? *DD @layobooty http://t.co/VhRIumne6d *DD @fresh_baba Which version # of the app and what device do you have, UberSoc is it Bberry, iPhone or Android? *DD @remybfg10k @Cornerman_1 :-) *DD @Lala_GoonerLUV Can you try uninstalling the app, turning your device off and on, and reinstalling it? *DD @Lala_GoonerLUV Hi! Let me try to help you with this. What's going on? *DD @Petite_Penny We're dancing http://t.co/h7Zy8Pu07s *DD @penwing Next release fixes it. Stay tune *DD @penwing Which version # of the app and what device do you have, UberSoc is it Bberry, iPhone or Android? *DD @Ranirinrin Try this, on your device click UberMenu&gt;Settings&gt;About UberSocial, scroll to the bottom, click Clear Cache and click Yes *DD @Ranirinrin Its probably the Twitter limit. Give it a few minutes *DD @Lexus_Robles The limits are set by Twitter's new API, not us. Give it a couple of minutes and it will be ok again. *DD @Ranirinrin Version # of the app  *DD @Ranirinrin version #? *DD @Ranirinrin Which version # of the app and what device do you have, UberSoc is it Bberry, iPhone or Android? *DD @THELIP1957 ahhh. Right. Here it is: https://t.co/JvQoGWIwKx *DD @THELIP1957 The link should take you to Google Play. If not, you can always search for UberSocial on it *DD @mr_omneo Try this, on your device click UberMenu&gt;Settings&gt;About UberSocial, scroll to the bottom, click Clear Cache and click Yes *DD @harlveen @olatostar @_Michy_G Updates can be in the background *DD @MaadiHotti LOLZZ *DD See all your friend's videos in one click with the new version of Video Gallery on UberSocial Android: http://t.co/yWTrHI0U3Y @jason_fenty Thanks for the feedback! *DD @jason_fenty Which version # of the app and what device do you have, UberSoc is it Bberry, iPhone or Android? *DD @jason_fenty such as....? *DD @NuSKOOL_RAYMND The \"Cancel\" button doesn't stop tweets from sending. It allows you to get out of that screen in case the app freezes *DD @JunkieeFreaak https://t.co/JvQoGWIwKx *DD @bindr No time to explain. Get in the car http://t.co/tafwfVACB8 *DD @bindr I think we broke time *DD @E_GotPull Hi! Let me try to help you with this. What's going on? *DD @JunkieeFreaak YES!!!! *DD @bindr it was pushed yesterday *DD @bindr Update to 2.5.4.2 *DD @2FweshNino Hi! Let me try to help you with this. What's going on? *DD @bindr Which version # of the app and what device do you have, UberSoc is it Bberry, iPhone or Android? *DD @SuperLhaze Try downloading it again *DD @SuperLhaze Are you sure the application is installed? Try again *DD @SuperLhaze What disappeared?  *DD @SuperLhaze Hi! Let me try to help you with this. What's going on? *DD @MosunmolaRaji Hi! Let me try to help you with this. What's going on? *DD @SymplySimi Hi! Let me try to help you with this. What's going on? *DD @paigesade SparkCentral is a great tool to keep track of the thousands of tweets we receive a day. Try updating to the latest. *DD @paigesade Go to the AppWorld *DD @paigesade That's not the latest. *DD @paigesade what version #? *DD @paigesade Which version # of the app and what device do you have, UberSoc is it Bberry, iPhone or Android? *DD @paigesade Hi! Let me try to help you with this. What's going on? *DD @LOARDOFTHESKYS :-) *DD @Louisa_Leo Hi! Let me try to help you with this. What's going on? *DD @kkamjoung Hi! Let me try to help you with this. What's going on? *DD @NURHAKIM21 No plans *DD Introducing Photofon HD, a FREE iPhone app http://t.co/SVgFPPTBXo for superb photo viewing, from the makers of @UberSoc &amp; @Echofon. @Ittaasdfghjkl Hi! Let me try to help you with this. What's going on? *DD @Scheetoofresh Lower the Notification Time Interval in the Settings *DD @Tshada_M try it *DD @Tshada_M Did you change the settings? *DD @Naija_breed Lower the Notification Time Interval in the Settings *DD @StaceyHappel :-) *DD @Tshada_M Hi! Let me try to help you with this. What's going on? *DD @prajyotm @_myopic :-) *DD @IvelisseArroyo :-) *DD @ItsChenny22 @Qu33n_Amby Its called Customer Support :-) *DD"}