{"tweets": "Bout to show up at your party @ACMawards 😺 https://t.co/ekNJfv4hci @VancityReynolds @jessetyler @blakelively not trying to be The Loudest Woman This Town Has Ever Seen™️ but... I LOVE THIS The third album theme I put together is called “folklore: the saltbox house chapter” 🌾  Listen here: https://t.co/YmqMGWYdY9 https://t.co/2g9ZYuALG2 @vitoriamariox Vitoria!! Your video just made my day. You worked so hard to get those incredible grades and it was an honor to have some part in your journey. Let’s find a way to meet when it’s safe to! So proud of you 💕 The next thematic composition that I put together from the album is out now 🌙 Listen to “folklore: the sleepless nights chapter” here: https://t.co/QFbi6rH5JJ https://t.co/X62Gb3KkjQ In my head, the songs on folklore fit together in different groups and “chapters” - based on how they fit together thematically. I want to share the first one today. Here’s “folklore: the escapism chapter” ♥️ https://t.co/UVZGvIpyRf https://t.co/quRt2iNFUK folklore deluxe edition featuring bonus song “the lakes” is now available to stream/download 🌊\nhttps://t.co/OTi6HJH2ir\n\n📷: Beth Garrabrant https://t.co/C65Ekj31sU RT @Vevo: Wrap yourself up in all the details of @taylorswift13's \"cardigan.\" 🧚‍♀️ From her painting skills to taking inspiration from isol… Donald Trump’s ineffective leadership gravely worsened the crisis that we are in and he is now taking advantage of it to subvert and destroy our right to vote and vote safely. Request a ballot early. Vote early. Trump’s calculated dismantling of USPS proves one thing clearly: He is WELL AWARE that we do not want him as our president. He’s chosen to blatantly cheat and put millions of Americans’ lives at risk in an effort to hold on to power. YES https://t.co/FuxljfhgZP @jpcleds WOW this is incredible!! Thank you so much for making this. 🎂 I also saw your Instagram and your art is phenomenal!👏👏👏😘😘😘 https://t.co/frGE46P5vD https://t.co/xz1AqHMWWN @thechicks https://t.co/uaNE7N2N7x @seeitinmymind Welcome back from your trip! We are all somber woodland fairies now. Feel free to grab a wicker basket and join us! 🧚‍♀️ 🧚‍♂️😄 @AmiraRasool Amira, I admire the work you’re doing and I’m happy to make a contribution to your company and to support the Black in Fashion Council (launching on 8/3) with a donation 💗@thefolklore @amirarasool @bifcglobal  #blackinfashioncouncil The video for cardigan “cabin in candlelight” version is out now using new behind-the-scenes footage from the album photoshoot. You can watch it here: https://t.co/rsSvCRO6P3 https://t.co/7lAbxpLybG cardigan “cabin in candlelight” version is out now 🕯https://t.co/pBbcZW4kqc https://t.co/pxzIfLi0OQ @kenziecoffman When I tell you I nearly choked on my wine laughing at this 😂😂😂😂 Thank you for keeping the secret til now 🙏🙏😂😂 https://t.co/r6ny2yasMw RT @aaron_dessner: Looking back at @taylorswift13 's text with her original voice memo of Cardigan...still surreal...a special edition of t… @maisiehpeters My ears have been blessed on this fine Tuesday 🙏🙏🙏 The limited edition “cardigan” single collection is available now, which has the original voice memo I sent Aaron for the song on April 27, 2020 (alternate lyrics included.) The song + voice memo are available on 7” &amp; 12” vinyl editions and CD through 7/30 https://t.co/zSHpnhUlLb https://t.co/uPiK0cZP4i RT @RollingStone: Some of us have spent years dreaming Taylor Swift would do a whole album like #Folklore, but nobody really dreamed it wou… RT @ZooeyDeschanel: Saturday plans: wine and folklore https://t.co/cgy4rpn6I8 @joshvisser Omg did you just call me “daddy” @KaileySteward The whole album mood board was actually just ‘life of inner forest witch’ written in quill and ink on a scroll made of tree bark so this tracks @stephenszczerba yep just trying to do my part over here 😷🕯😺 RT @guardianculture: Taylor Swift: Folklore review – bombastic pop makes way for emotional acuity https://t.co/zboiSJd531 RT @TheNational: #folklore is out now! https://t.co/mkk86vYw3C https://t.co/R9XtCtct4S RT @boniver: Very very honored to be a part of @taylorswift13’s album ‘Folklore’. Shout out to @aaron_dessner for always being the great co… You can get the bonus song “the lakes” on the 8 deluxe CD editions, 8 deluxe vinyl editions, and the cassette edition of folklore that are available at https://t.co/zSHpnhUlLb 🌊 \n\n📷: Beth Garrabrant https://t.co/ZpecT2hLD0 I knew you tried to change the ending, Peter losing Wendy. The #cardiganMusicVideo is out now.\n\nhttps://t.co/Yu1UmTNnJI https://t.co/gDgNhkDUuq In isolation my imagination has run wild and this album is the result. I’ve told these stories to the best of my ability with all the love, wonder, and whimsy they deserve. Now it’s up to you to pass them down. folklore is out now: https://t.co/xdcEDfithq  \n\n📷: Beth Garrabrant https://t.co/vSDo9Se0fp 30 minutes until the #cardiganMusicVideo! 🎹✨ https://t.co/DOnxNQEnfU Editor Chancler Haynes, special effects wizards David Lebensfeld &amp; Grant Miller and set designer Ethan Tobman. The entire shoot was overseen by a medical inspector, everyone wore masks, stayed away from each other, and I even did my own hair, makeup, and styling 😂 The music video for “cardigan” will premiere tonight, which I wrote/directed. A million thank you’s to my brilliant, bad ass video team - Cinematographer Rodrigo Prieto, producer Jil Hardin, executive producer Rebecca Skinner, AD Joe ‘Oz’ Osbourne https://t.co/2hNXnzFbwY folklore will have 16 songs on the standard edition, but the physical deluxe editions will include a bonus track “the lakes.” Because this is my 8th studio album, I made 8 deluxe CDs &amp; 8 deluxe vinyls available for 1 week😄 Each has unique covers &amp; photos https://t.co/zSHpnhUlLb https://t.co/tG34e0MpgJ Surprise 🤗 Tonight at midnight I’ll be releasing my 8th studio album, folklore; an entire brand new album of songs I’ve poured all of my whims, dreams, fears, and musings into. Pre-order at https://t.co/zSHpnhUlLb https://t.co/4ZVGy4l23b Love her!! \n👏💕💐🥇🙏💕💐👏 https://t.co/fq8crQpbsh Can’t wait to watch @Disclosure_Doc on @netflix today!! Executive produced by @Lavernecox who is extraordinary 💕💕💕 Who else is gonna watch?! https://t.co/tYnZXfYzk5 For my family, everything that has transpired recently gives us an opportunity to reflect, listen, and reprogram any part of our lives that hasn’t been loudly and ferociously anti-racist, and to never let privilege lie dormant when it could be used to stand up for what’s right. Personally, I’ve made the decision to give all of my employees June 19th off in honor of Freedom Day from now on, and to continue to educate myself on the history that brought us to this present moment. Happy Juneteenth! I want to thank @TheRoot and @RhapsoDani for allowing me to post this video about the significance of today, June 19th, and why it should be celebrated as a National holiday. https://t.co/7yjwh4Lddg YES!! Thank you to the Supreme Court Justices who voted in favor and all the advocates who have fought so hard for this! We still have a long way to go to reach equality, but this is a beautiful step forward. 🌈❤️🧡💛💚💙💜🌈 https://t.co/zTd3i5P2TL When you fight to honor racists, you show black Tennesseans and all of their allies where you stand, and you continue this cycle of hurt. You can’t change history, but you can change this. 🙏 I’m asking the Capitol Commission and the Tennessee Historical Commission to please consider the implications of how hurtful it would be to continue fighting for these monuments. We need to retroactively change the status of people who perpetuated hideous patterns of racism from ‘heroes’ to ‘villains.’ And villains don’t deserve statues. Taking down statues isn’t going to fix centuries of systemic oppression, violence and hatred that black people have had to endure but it might bring us one small step closer to making ALL Tennesseans and visitors to our state feel safe - not just the white ones. His statue is still standing and July 13th is ‘Nathan Bedford Forrest Day.’ Due to social pressure, the state is trying to overrule this, and Tennesseans might no longer have to stomach it. Fingers crossed. Then we get to this monstrosity. Nathan Bedford Forrest was a brutal slave trader and the first grand wizard of the Ku Klux Klan who, during the Civil War, massacred dozens of black Union soldiers in Memphis. https://t.co/n2DiEt9F3P Replacing his statue is a waste of state funds and a waste of an opportunity to do the right thing. FYI, he was a white supremacist newspaper editor who published pro-lynching editorials and incited the arson of the office of Ida B. Wells (who actually deserves a hero’s statue for her pioneering work in journalism and civil rights). Edward Carmack’s statue was sitting in the state Capitol until it was torn down last week in the protests. The state of Tennessee has vowed to replace it. As a Tennessean, it makes me sick that there are monuments standing in our state that celebrate racist historical figures who did evil things. Edward Carmack and Nathan Bedford Forrest were DESPICABLE figures in our state history and should be treated as such. We need to fight for mail-in voting for the 2020 election. No one should have to choose between their health and having their voice heard. https://t.co/4ImsKW1fQN This article written by @BarackObama is a fascinating read about changing policy at the state and local levels. https://t.co/kwwFjaXCuC Racial injustice has been ingrained deeply into local and state governments, and changes MUST be made there. In order for policies to change, we need to elect people who will fight against police brutality and racism of any kind. #BlackLivesMatter After stoking the fires of white supremacy and racism your entire presidency, you have the nerve to feign moral superiority before threatening violence? ‘When the looting starts the shooting starts’??? We will vote you out in November. @realdonaldtrump VERY STOKED about this cover of lwymmd on @KillingEve by Jack leopards &amp; the dolphin club!! https://t.co/fhkLfOssfm @etnow I personally really relate to this tweet. 😎 The City Of Lover concert is streaming on @Hulu + @DisneyPlus! And the live songs are available now 💕 https://t.co/KZNhsi9o3Y\n\n#TaylorSwiftCityOfLover https://t.co/LTTkqliMWY @TheAddyMiller Addy I had to google YGG but a) now I know what it means b) YGG back! c) tell your mom hi she seems cool 😎 @tracesofswift @winestainedtay MY HEART ❤️ @nathansrep_ THIS PIC IS SO AWW 🥰 🥺💕 @LOLbridg Thank you so much for everything you do and how hard you’re working to keep us safe 🙏🙏🙏 @Ru_ReAdy_FoR_IT I’m so sorry it’s been hard and I’m so touched and flattered that the show is making you smile 😊 @13yearsoftay Aww thanks bud 🥺🥺🥺🏹💗 @loverlauren13 @taylornation13 Cute cute cute 🎆🎆🎆 @CaleighAMiller YAY! Glad you’re watching 💕 Stoked to relive our Paris show tonight when the City of Lover concert airs at 10pm ET/9pm CT on @ABCNetwork - then tomorrow on @hulu and @disneyplus 💕 It was the best album release party I could’ve wished for 😆✨💐🎆🕶 love you guys 💋 https://t.co/G9Dm3nYrgv City Of Lover Concert 💕 Airing this Sunday at 10p ET on @ABCNetwork and streaming the next day on @hulu  and @disneyplus! \n#TaylorSwiftCityOfLover\n\n📸: Dave Hogan https://t.co/cYAu74UCut when you’re proud of your buns so you post them on the internet https://t.co/4wPIi8mb5F PS for those of you who are separated from your loved ones or struggling with this day, my heart is with you 💗 My conversations with my mom have always been and will always be some of my favorite memories - from when I was 10 months old in this video from Oct. 1990 to now talking every day on the phone. Our talks are everything to me. Myyyyyy goodness I love you Mom. Happy Mother’s Day 💐 https://t.co/Okav6gEt2R Excited to announce the City of Lover Concert! We filmed my show in Paris in September and thought it’d be fun to share it with you 😄May 17 at 10p ET on @abcnetwork and available the next day on @hulu and @disneyplus! #TaylorSwiftCityOfLover https://t.co/7B3ky0rO5B I’m absolutely devastated and horrified by the senseless, cold blooded, racially motivated killing of Ahmaud Arbery. #JusticeForAhmaud 🍷 🐍 biiig isolation 🐍 🍷 https://t.co/MJbhD8Bau1 @rhodesmusic Oh I love this so much ☺️☺️☺️ Not a lot going on at the moment https://t.co/NaRCqgCH4Y Captain Olivia Benson off duty like - https://t.co/JJ5ff8syMU @maisiehpeters 🎆🌸✨heavenly✨🌸🎆 RT @taylornation13: TONIGHT!! 💕 @glblctzn and @WHO are putting on an amazing event to help fight against #COVID19. Find out how you can wat… I'm so sad I won't be able to see you guys in concert this year, but I know this is the right decision. Please, please stay healthy and safe. I’ll see you on stage as soon as I can but right now what’s important is committing to this quarantine, for the sake of all of us. https://t.co/qeiMk2Tgon @RyanHurd Love this so much 🙏 It’s National Siblings Day! My brother @austinswift7 is one of my best pals, and I’m really proud of him because he’s in a film that came out today called We Summon The Darkness (which he co-produced). Photo by Gigi. My facial expression by 3 glasses of wine. #nationalsiblingsday https://t.co/1SXUtIxaiP My Women’s History Month playlist is nostalgic comfort vibes by women I adore 💛 @Spotify \nhttps://t.co/q47iu4Vc7L https://t.co/I5jQCZy8G1 While we’re looking for things to do at home, I thought it’d be fun to share behind the scenes of my dad’s acting debut. 🎾 https://t.co/1WIBE8jdfb For Meredith, self quarantining is a way of life. Be like Meredith. #QuarantineCats https://t.co/yEHJ5c5oFi No one:\n\nAbsolutely no one:\n\nMe: here’s more footage of behind the scenes of me directing The Man video with a female voice and demeanor/ dude body and face! Just to make your day weirder! \n\nhttps://t.co/5vRMcFYhWz https://t.co/iCvBjThn0d In honor of International Women’s Day, I changed out my @AppleMusic playlist to songs I’m loving right now by female artists and bands. 💕 Let’s all celebrate together by honoring the women in our lives and the women out there pushing things forward 😘 https://t.co/YSUOgCUqIa The Man Behind The Scenes - Becoming The Man is out now! Only took 5 hours in the makeup chair + a little sprinkle of privilege dust ✨✨✨➡️👨🏻 https://t.co/9tG8uYDFGz https://t.co/ptVjh4xQCZ My heart is with everyone in Tennessee who has been affected by the tornados. Sending you my love and prayers. Shout out to Rebecca Skinner for being the best executive producer a (wo)man could ask for. \nI can’t believe I get to work with these legends. Having a little moment over here 🥺💓 More thank you’s... Chancler Haynes is an editing extraordinaire. Stephen Galloway and Spenser Theberge were my movement coaches and taught me how to smoke, slouch, walk and act like a toxic bro. David Lebensfeld and Grant Miller aced that VFX magic. https://t.co/I8rf5D3xwE Rodrigo Prieto, our DP/cinematographer, is absolutely brilliant and down to earth and hilarious. Ethan Tobman created all those sets. Like, that wasn’t a real yacht. That’s how good he is. 🤯👏 I want to say a massive thank you to my main team in putting this whole thing together: Jil Hardin, our producer, worked tirelessly and truly made me feel like I could do this. Joe ‘Oz’ Osborne, our excellent AD, and I have worked together for years and he’s the coolest. https://t.co/c7hLxu4Keq Between 4-6 hours in the make up chair every day with these geniuses. Thank you Bill Corso and all who worked so hard on this transformation 🙏🙏🙏 Alongside every great (the) man is a team of hardworking creatives who made this thing happen. Bill Corso &amp; his incredible team and I have worked together before, turning me into a zombie.. but convincing a significant amount of people I was a dude is our crowning achievement. https://t.co/Rn7FmIDz55 @Dominic_Toliver @tiktok_us Dominic your reactions were SO good, when you were all ‘you got this!!’ And jayden’s all ‘😍❤️💗’. I cackle every time I see it. Thanks so much for spending the day with me! @iamlorengray This post 🥺🥰 I appreciate you saying this so much. I had the best time hanging out &amp; talking on the tennis court with you! Pennsylvania girls represent 🥳 Gonna be cheering you on for everything you do! @jaydenbartels Every time I see you in the video I just GRIN because you were so good and so awesome to be around. Thank you SO much for being a part of it!!! My dad making his acting debut as ‘unimpressed umpire’ is a memory I’ll always cherish. Thank you to the entire cast and crew for helping me become the man I always knew I could be 😂 it’s so cool to have you be a part of this!! Thank you @jaydenbartels and @dominic_toliver for your amazing and hilarious reactions- and @iamlorengray your eye roll really was aStOnIsHiNg 🥰😘💗 Just sitting here pondering how happy I am that The Man music video is OUT. I want to say thank you to so many people- Gotta thank @TheRock for voicing The Man and for being so supportive of my music for years (and now my directorial debut!)- https://t.co/6G9G21Lw8J Man down. After a massive mantrum. 🎾 #TheManMusicVideo is out now! https://t.co/9pGiwD8ZWa https://t.co/mcn1CE7LMI One small step for the man, one giant leap for #TheManMusicVideo...1.5 hours to go! I’m counting down with you on the premiere page: https://t.co/HnovGRN82i https://t.co/rYrxqzNYwF Oh man...music video tomorrow at 7 A.M. EST! And I’m going to be chatting/answering your questions/mansplaining the video on YouTube starting an hour before at 6 A.M. EST https://t.co/OJmaYDbsOo There are 19 hands in the hallway \n\n... but only 2 days until The Man Music Video https://t.co/pePLcEwxtQ The Man - Live From Paris is out now! https://t.co/QZofz2CNxF https://t.co/8lFwIRI79U The Man - Live From Paris  ✨ \nSong/video tonight at Midnight ET https://t.co/Mr579hZtZe @billybragg It was excellent meeting you and this is so nice of you to say.  💗 See you at Glasto, new friend! 🎶I enjoy nights in Brixton🎶 but especially when they’re like last night @NME! Met @clairo @beabad00bee &amp; @fkatwigs who are amazing. Got to tell @robynkonichiwa she’s the melody queen of my musical heart &amp; got to take another middle finger trophy home to the felines. 🇬🇧🍾🥂 https://t.co/JN3fjyKQ5v RT @NetflixFilm: Taylor Swift and MISS AMERICANA director Lana Wilson discuss the magic of capturing her songwriting sessions on film. http… #TheManLyricVideo is out now! https://t.co/AuS7exiv4n https://t.co/3aMvdBve17 #TheManLyricVideo out tomorrow at Noon EST https://t.co/a7D6ZTONGn It’s an honor to get to work with such an incredible team, especially when it comes to my favorite thing in the world: songwriting. 🎶😄 &amp; swipe photos to see one of my other fav things: a fluffy floofy cat. Jody is an advocate for women’s empowerment and one of the most-respected and accomplished industry leaders. Troy Tomlinson has been an amazing part of my team for over half my life and a passionate torchbearer for songwriters. I’m proud to extend my partnership with Lucian Grainge and the Universal Music family by signing with Universal Music Publishing Group, and for the opportunity to work with Jody Gerson, the first woman to run a major music publishing company. https://t.co/DJJRd9BQIx #MissAmericana is on @NetflixFilm! I’m excited for you to see it. I want to thank Lana Wilson for her curiosity &amp; for wanting to make this film. It’s wild to be sharing so much of my life because it’s scary to be vulnerable! (understatement of the century) https://t.co/Ot56y6jnCs https://t.co/U40wFv82JL For a limited time #MissAmericana will be playing in select theaters - tickets available at https://t.co/I4b7yZZZss 🎉 And stream it globally on @NetflixFilm January 31! https://t.co/AzWG6WYkST ☃️❄️Sundance was as snowy and fun as this photo shoot foreshadowed❄️☃️ Thank you so much @Variety @ChrisWillman @shirleyhalperin for this cover/interview and Mary Ellen Matthews for taking these pics. Can’t wait for Jan 31 when #MissAmericana comes out on @NetflixFilm! https://t.co/Pq4U6l5nKs My heart is in pieces hearing the news of this unimaginable tragedy. I can’t fathom what the families are going through. Kobe meant so much to me and to us all. Sending my prayers, love, and endless condolences to Vanessa and the family and anyone who lost someone on that flight. Miss Americana - Official Trailer · It’s been a long time coming ✨ Out in select theaters and on @NetflixFilm January 31\nhttps://t.co/Ot56y6jnCs https://t.co/lGp1mDvBJI Miss Americana 🎬 January 31 on @NetflixFilm\n\nhttps://t.co/Ot56y6jnCs https://t.co/hrnxN5IxuY Absolutely loved reliving the making of Lover - Diary of a Song with @joecoscarelli @nytimes 💘\nhttps://t.co/1MMc6MLTub https://t.co/kovFAhhOZH The Making of #ChristmasTreeFarm • 24 hours and a lot of xmas spirit 🎄 https://t.co/hY0VvyVp4Q Walked into the studio to a surprise birthday party from these two @jackantonoff &amp; Laura Sisk - it’s equally wild and cozy to think it was the three of us in a room making a song called Lover here last year. ♥️ https://t.co/C9Q05p75S6 Claws out, kitties. 🐈 https://t.co/jnC1rjs2h8 How To Be A Cat • Go see #CatsMovie in theaters December 20 (if you’re feline up for it 😻) https://t.co/1T08VbFzKf RT @GlastoFest: \"She’s one of the biggest stars in the world and her songs are absolutely amazing. We’re so delighted.” \n\nTaylor Swift. Sun… I’m ecstatic to tell you that I’ll be headlining Glastonbury on its 50th anniversary - See you there! 💋 https://t.co/2gJ40mEiDH Honestly spending my 30th with the fans who have made my life what it is at jingle ball, then throwing the most aggressive holiday party known to womankind... I just.. seriously feel so lucky and will spend forever trying to find ways to say thank you. *cries in Christmas tree* https://t.co/40RSnRGcPm Happy birthday but make it santa 🎅 https://t.co/kozpqXMEyi Fur real guys this was my cake 🎂 https://t.co/txakhqkaMv RT @jamesblake: Oh and @taylorswift13 made a great speech about the gender imbalance in the industry and everybody should see it WHO’S GONNA TELL HER SHE’S THIRTAY NOW 🧁 https://t.co/PChgBjOxwB When you’re pretttttty sure that if you were a man, you’d be the man 💅\n📷: Sami Drasin https://t.co/rjJesldpEQ If it don’t fits I still sits - small wooden box edition 💋\n📷: Sami Drasin https://t.co/3w9TTzqmSS HEY THANKS @BILLBOARD 🙏 it was a whole entire party chatting with @jasonlipshutz and Sami Drasin killed it with these photos!! Thank you so much for this honor. 😸 https://t.co/jdZcDhDqsF ✨✨✨✨✨✨✨✨✨✨✨✨✨ @people 📸 Miller Mobley\n\nhttps://t.co/Byai8sFql1 https://t.co/hP8EEP9Jbf Throwback to my first day on the set of @catsmovie. Basically, Bombalurina is one of those really mischievous cats you see in internet videos who has figured out how to open human doors 🚪 https://t.co/pBo11uCN40 I ended up spending many days on set watching the other performers do their scenes. Watching the character Victoria, played by Frankie Hayward inspired me so much and Beautiful Ghosts was the result. Congrats to my co-writer and buddy 4 life @OfficialALW. This is just purrfect 😸 I woke up today to the news that Beautiful Ghosts is nominated for a Golden Globe - it’s so cool that one of the most fun, fulfilling creative experiences I’ve ever had is being honored in this way by the HFPA. https://t.co/f8Ypo3b9VW Here we are on said Xmas tree farm. And I just want to say that my parents are the real 90’s fashion icons. I have spoken. https://t.co/jtXGXb7raq Time to get Spoti-festive! 🌲🎄♥️ https://t.co/wzh258CMY2 Yes. Indeed. Every time you add this song, somewhere a cat wearing a Santa hat smiles. 🎅😸🎄 https://t.co/qjZKKJaIGH All I want 4 Christmas is to be that voice you hear faintly in the distance in the mall engulfed in jingly jingle bells 🙏 https://t.co/2r3wBZayGU It’s rumored that if you say “Alexa, play the new Taylor Swift on @amazonmusic” out loud, it will make Santa like you more. 🤷‍♀️✨🎅📜 https://t.co/SsNfcgZX3R I actually did grow up on a Christmas tree farm. In a gingerbread house, deep within the yummy gummy gumdrop forest. Where, funnily enough, this song is their national anthem. #ChristmasTreeFarm song and video out now 🎄https://t.co/p9Hk8blYpS https://t.co/rTdGd1wIhK When in doubt, ask the itty bitty pretty kitty committee. When they shun you with silence, ambivalence, and judgmental brush offs... just put the song out anyway. NEW XMAS SONG AND VIDEO (made from home videos 👨‍👩‍👧‍👦) OUT TONIGHT #ChristmasTreeFarm 🌲🎄🌲🎄🌲🎄🌲🎄🌲🎄🌲🎄🌲 https://t.co/GdlnCAKDLF Sock Appreciation Post 🧦 https://t.co/xCAxNKKHei Thank you @people, @chiumelo, @danwakeford, and 📸 Miller Mobley 😃 https://t.co/Byai8sFql1 https://t.co/jObmAHcuuS This is the one face I made that day https://t.co/fHtArFIxXZ Bored girl at the holiday party. https://t.co/RUgz1CmaiJ HEY @britishvogue! It’s always a dreamscape of creativity &amp; hilarity working with @Edward_Enninful but putting him together with @patmcgrathreal = the funniest wildest shoot I’ve been on 😹 Love this team, so grateful for everyone involved Craig McDean, @GuidoPalau, @JillDemling https://t.co/AOUTCid4fG So excited to release the new version of Lover, the First Dance Remix - based on the arrangement of the AMAs performance! https://t.co/EnaBoNK2OT https://t.co/9avGusDmy0 I was up there because of you and I know that every minute of every day ❤️ photo by 📸 Kevin Winter https://t.co/k9RW2qWdMo Hi guys have I told you lately that I LOVE YOU https://t.co/Up8XXD1XvJ @paginaskinner @reidoburrito95 @TeenVogue This just made me SO emotional. @reidoburrito95 I can’t tell you how honored I am that my song has been even a small part in your journey. You did the brave thing and stood up for your truth 👏👏👏👏👏👏👏👏👏👏👏👏👏 The lyric video for the Lover remix is here and she’s wintery cute check her out 🌨❄️☃️ @ShawnMendes \n\nhttps://t.co/YoswDVz4U3 https://t.co/k7dzL7CY3v Don’t know what else to do https://t.co/1uBrXwviTS “Beautiful Ghosts” out tomorrow at 12:01 a.m. EST 😺 @catsmovie https://t.co/nZ5ncd3yki Well guys it finally happened: WE DID A COLLABORASHAWN. Sending out a whole entire THANKS BUDDY to @ShawnMendes rn -\nI’m so stoked that our remix of Lover is out NOW!\n\nhttps://t.co/BOxfgBKv1a https://t.co/0dFyd1Lk5O According to my jet lag it is one hundred o clock celsius. https://t.co/F4rNMwFkNl Dressing room is lit https://t.co/dYCmiCWNLe If it don’t fits, I still sits. https://t.co/7HwaEGWrT5 🍬💕pretty city 🍭🌸 https://t.co/mBIBfrbFMm RT @taylornation13: The Taylor Swift Eras Collection is available NOW until Monday at Noon EST! 💗 Shop here: https://t.co/EojDc5P99d https:… Earring said SMILE but I stay smirking. 😏 https://t.co/g0R19uKl1t Ya could I get these to go? @ntv_sukkiri https://t.co/tNCS9pJTCp CONGRATULATIONS!!!! 💗💗💗💗💗💗💗💗💗💗💗💗💗 https://t.co/laPfuMRkaH 💗 Tokyo is for Lovers 💗\n\n📷: Kayoko Yamamoto https://t.co/VVDqh1uAI5 S/O to all the moms whose adult daughters ask them to take a pic in a hotel hallway bc they’re feeling their outfit - you’re the real mvps 🏅 https://t.co/ksdwvN58tL Have arrived in the land of cat cafes and eternal cuteness TOKYO HI 💕🌸🍭🍬🎆 I’m off to stare into pastel aquariums and hug all the people CAN’T WAIT TO SEE YOU GUYS LATER! https://t.co/M2uvgIHe4i You heard it here first 👽 😇 🎶 Watch us on @NBCTheVoice at 8/7c tonight! @kellyclarkson https://t.co/s1P8ywYsXB RT @KellyClarksonTV: 🎶 Is it too soon to do this yet? 🎶 To celebrate #TaylorOnTheVoice, giving you an early look at tomorrow's @TaylorSwift… Playing with filters and yelling with the Legend himself. Tune in to @NBCTheVoice tonight at 8/7c! @johnlegend https://t.co/OG5AZ8XCjr 💘💘💘💘💘💘💘💘💘💘💘💘💘 https://t.co/niz0c7cJPS 🎃🎃🎃🎃🎃🎃🎃🎃🎃🎃🎃🎃🎃 https://t.co/6uEwLV6Q1t 👏👏👏👏👏👏👏👏👏👏👏👏👏 https://t.co/YiN24V0Js6 💗💗💗💗💗💗💗💗💗💗💗💗💗 https://t.co/eATA5z9DVG We talked emo bands, favorite lyricists (hey @petewentz &amp; @LanaDelRey), zingers, and soooo much more. Full interview with @zanelowe is live on @Beats1 @AppleMusic! 💕 https://t.co/iUYnqqsfum https://t.co/thzhTnRZcS Catch us on @NBCTheVoice tonight at 8/7c! @gwenstefani 💗 https://t.co/Njhql62zDf Hug your cat today. Or don’t, if your cat hates hugs. But anyway. Happy #NationalCatDay from me, Olivia, Meredith, and Benjamin. 😸😸😸👱🏻‍♀️ https://t.co/hCaiDJwF6Y I was promised Lively 🤷🏼‍♀️ But Shelton is cool too. SO excited to be on @NBCTheVoice with @blakeshelton tonight at 8/7c! https://t.co/haSdVflANG Talked with @zanelowe about @catsmovie + my original song for the film \"Beautiful Ghosts\" 🌟 Watch the clip now - but we talked about a lot more than that so listen to our full conversation coming next Wednesday on @AppleMusic @Beats1! https://t.co/DQfrgHDvNa https://t.co/iTbxGVXVPR I was so excited when @OfficialALW asked me to write an original song with him for @catsmovie. “Beautiful Ghosts” is performed in the film by the extraordinary Francesca Hayward who plays “Victoria” &amp; reprised by Dame Judi Dench (!!!!!) who plays “Old Deuteronomy” 😺 Coming soon! https://t.co/97Hjk2nlfR @GiphyPop Because it is. 💁‍♀️ https://t.co/mMjEra8o8y Because of you, there was a 2nd 3rd 4th 5th 6th and 7th album. You guys made me into a headliner because you wanted to see me play. And your support all these years is what’s helped me stay true to that kid I was when I started out. #13YearsOfTaylor I said in an interview 13 years ago \"I'm just hoping that I have a second album that does as well as the first &amp; someday get to be a headliner, &amp; always be the same person that I started out as.” Scrolling through your posts has me feeling all the feelings &amp; I want to thank you. https://t.co/nlnjqQgmIL Be sure to watch next week! 💗😺💗 https://t.co/pMrjKbisN9 Tiny desk, BIG mood. Thank you @NPR for that awesome experience, I can’t wait to relive it when #tinydesk comes out! 📷 @BobBoilen https://t.co/P3LdI2wXXU 🤗💗👍 https://t.co/yU5eZ2GeVl 💛💚💜💗💜💚💛\n\n📷: Mary Ellen Matthews https://t.co/AoH0UEPM0k Had the best time playing Lover on @nbcsnl exactly the way I wrote it, on piano in a quiet moment. A huge thank you to Lenny Pickett for playing on False God🎷! Phoebe was excellent as host &amp; Mary Ellen Matthews is always awesome to work with. Make sure to watch Camila next week! https://t.co/zQ22GdFvDI RT @taylornation13: The #Lover 2-Disc Color Vinyl Set is available for pre-order now 💘 \n\nPre-order here: https://t.co/8A28vNRUXo https://t.… Threw out our cloaks and our daggers because it’s morning now.. 💜 \n\n📷: Erik Madigan Heck https://t.co/woz8zpzjtw It’s blue, the feeling I got 💙\n\n📷: Erik Madigan Heck https://t.co/vlHis2SMIU It’s golden, like daylight 💛\n\n📷: Erik Madigan Heck https://t.co/TKjINyd9KZ I hadn’t done a @RollingStone cover in 5 years, and hadn’t seen @hiattb since I got in 2 car crashes while driving him around during our interview in 2012. 🤦‍♀️ There were no cars driven this time, but we had a lot to catch up on. \n📷: Erik Madigan Heck\nhttps://t.co/NAFBh0pUgI https://t.co/fwbRYouo8r The Lover album is open fields, sunsets, + SUMMER. I want to perform it in a way that feels authentic. I want to go to some places I haven’t been and play festivals. Where we didn’t have festivals, we made some. Introducing, Lover Fest East + West! https://t.co/xw6YMN38WE https://t.co/IhVPQ8DMUG 💘💘💘💘💘💘💘💘💘💘💘💘💘 https://t.co/TCPqUFxk1J Got to play some new songs from Lover acoustic tonight, this was such an awesome way to celebrate this album finally being out in the world 🥰\n📷: @HogieDave // @GettyVIP https://t.co/P2ZQW9rWJQ Tonight in Paris!!! Thank you to everyone who flew from all over the world to be at the City of Lover Concert! 💗💗💗\n📷: @HogieDave // @GettyVIP https://t.co/rXoCPKfIwb 🙏😭💗😘💕🎉😆 https://t.co/4GqZ8w7oJK MY HEART EXPLODED INTO CONFETTI HEARTS THANK YOU 🙏 💕💕💕😭 https://t.co/N7fUelR7cU 💗💗💗💗💗💗💗💗💗💗💗💗💗 https://t.co/uDkjW8uOzI Listen to “Lover” on the @AppleMusic #AListPop playlist 💕 https://t.co/raS8IuBy9P https://t.co/TvrBJrFKIH Been sleeping so long in a twenty year dark night, but now I see daylight. 🌸 https://t.co/8Hpvt5AoEE It’s nice to have a friend 🥰 https://t.co/QBPkP1fXnY I could never look away ✨ https://t.co/IZD2EVmOL2 Meet me in the afterglow 💘 https://t.co/cdxp07JAH4 I counted days, I counted miles...to see you there. 💗 https://t.co/20FPwtfa3T And I’ll never let you GO cause I know this is a FIGHT that someday we’re gonna WIN 💗 https://t.co/iODaImf5iy Like a Tennessee Stella McCartney 💘 The full #StellaxTaylorSwift line is available until midnight eastern tonight! \n\nhttps://t.co/Dsog51BDP6 https://t.co/PQIoilR7H1 RT @taylornation13: The full #StellaxTaylorSwift line is BACK for 24 hours! Don’t miss out 💞 \nShop here: https://t.co/tUrS5DOWPr https://t.… I can still see it all in my mind 💗 https://t.co/9rMzqSzkEi I look through the windows of this love 💕 https://t.co/0YHKbnwAnt This love is worth the fight ❤️ https://t.co/TTJ6N1Ilkw We were a fresh page on the desk, filling in the blanks as we go 💗 https://t.co/9wGs81eyV4 It’s been a long time coming but... 💘 https://t.co/n1WHYajSz3 Things will never be the same 💗 https://t.co/UlMMLw2b5y Thank you!!! It’s the nicest feeling when someone sees your intention, so glad you like the journals 💘 https://t.co/eMiYRvqlgz “Taylor Swift’s diary entries are a must-read companion to Lover” was a thing The New York Times said so here’s where you can get them, I mean they literally said you must read them so... https://t.co/whgqEZMAlq https://t.co/GeCicGvqyC Thank you 💕💕💕💕💕💕💕💕💕💕💕💕💕 https://t.co/5GbaKdjyzT Thank you 💘💘💘💘💘💘💘💘💘💘💘💘💘 https://t.co/4uwNJohsUE Thank you 💗💗💗💗💗💗💗💗💗💗💗💗💗 https://t.co/2KEv4XhadQ RT @Deezer: A celebration of love 💕 🦋 @taylorswift13's new album #Lover is finally out 😍 Stream it here ▶️ https://t.co/PGxVkOI8QB https://… There’s a dazzling haze, a mysterious way about you dear...\n📷: @ShearerPhoto @GettyVIP https://t.co/Xl63m45BJp It’s you and me, there’s nothing like this 💘 https://t.co/JKS1O4rnzY I once believed love would be burning red, but it’s golden 💛 https://t.co/09hzwQAVeu Threw out our cloaks and our daggers because it’s morning now. 💗 https://t.co/u1LqbgCKKd They say the road gets hard and you get lost when you’re led by blind faith..But we might just get away with it 💗 https://t.co/W3aKhXThA7 We bless the rains on Cornelia Street, memorize the creaks in the floor 💗 https://t.co/s3Uze1fJtb Thank you to the fans who voted, our excellent cast, @todrick , @drewkirsch and everyone who worked so hard on the You Need to Calm Down video. @vmas Video of the Year 🤯 I MEAN JUST WOW GUYS YOU DID THAT HUH 🙏🙏🎉\n📷: @KevinMazur // @GettyVIP https://t.co/WjD6muE3nv I’ll tell you the truth, but never goodbye 💗 https://t.co/xpgFpLHKtv And I hope I never lose you, hope it never ends 💗 https://t.co/7BhkCdssqB Lost my gloves, you give me one. Wanna hang out? Yeah, sounds like fun 🌸 https://t.co/byJsAuDcHT This ultraviolet morning light below tells me this love is worth the fight 💗 https://t.co/fo8M7j5h6e Just wanna lift you up and not let you go 💘 https://t.co/A3UPmodaU1 Barefoot in the kitchen, sacred new beginnings that became my religion. Listen. 💘 https://t.co/AojqFASa3A Ever since I saw Fleabag, I’ve been all ‘I can’t wait to see this woman host @nbcsnl’ and it’s happening now + I get to be there too = I am in shambles. 😭🙏 Oct 5th 🥳🎉 https://t.co/VcZeuXWKuc I think we *all* know how I feel about sequins ✨ @StellaMcCartney\n\nNew pieces are being added to the online store every day so keep checking back: https://t.co/zSHpnhUlLb https://t.co/SsLhOIcHPY I get mystified by how this city screams your name.💘 https://t.co/l2d5C1vLMX I’m crazier for you than I was at sixteen. 💗 https://t.co/VAGsMMUmcW I want to drive away with you, I want your complications too 💗 https://t.co/dnL2iBHZhW I’m with you even if it makes me blue 💙 https://t.co/RuLE1qOlWt Honey without all the exes fights and flaws, we wouldn’t be standing here so tall. 💘 https://t.co/S75cgE07A0 You know I adore you 💗 https://t.co/YWgZM20Dco RT @pandoramusic: An album full of love 💘 Listen to @taylorswift13’s #Lover now: https://t.co/KZfzPDrQ9s ✨ #TaylorSwift https://t.co/xsM1o8… Stopped by the NYC pop up shop to celebrate Lover with the people who have made this week so insanely fun. Shout out to @CapitalOne for making the shop so NICE 💖 Love you guys so much! EVERYONE LOOKS SO CUTE IN THEIR STELLAxTS MERCH https://t.co/6aGjEkydTB I scream “For whatever it’s worth, I LOVE YOU AINT THAT THE WORST THING YOU EVER HEARD?” 💗 https://t.co/EWUGqWsTsM Shiny toy with a price, you know that I bought it 🥳💗😂 https://t.co/4QRHUx7Ob0 We could follow the sparks, I’ll drive 💗 https://t.co/4JMwl9Ae0K Good ones never wait 💗 https://t.co/cnAiFk687j Who could stay? You could stay. 💗 https://t.co/vkeCfulS8Q This is our place, we make the rules. 💗 https://t.co/qz2DjfJwXe Fever dream high in the quiet of the night, you know that I caught it... 💗 https://t.co/sOqXgcz6v5 I think the fishbowl scene is my favorite metaphor in the Lover video. And guys.. I’ve performed on stage with Christian Owens for years. He’s unbelievably talented and it was so amazing to have him in the Lover music video! https://t.co/ZDddeb9Ech https://t.co/5Jg3EvANPQ Had to go see the mural in person and it turns out she’s GLORIOUS. Thank you @spotify, it’s been an honor revealing new lyrics with you all week 🥰\n📷: @KevinMazur @gettyimages https://t.co/jbC2Ddqi6H @halsey CONFIRMED.  🤝 WHAT IS LIFE EVEN https://t.co/ir7XDx4eSl And I snuck in through the garden gate, every night that summer just to seal my fate // Stream Lover on @youtubemusic! https://t.co/hM1b1jljTG Listen to “The Man” on @AppleMusic’s #NewMusicDaily playlist ✨ https://t.co/LORdO60cDw https://t.co/Nao53qS2jK This album is very much a celebration of love, in all its complexity, coziness, and chaos. It’s the first album of mine that I’ve ever owned, and I couldn’t be more proud. I’m so excited that #Lover is out NOW: https://t.co/t7jK7XmEqa https://t.co/NMgE7LTdGZ #Lover out in 30 minutes! https://t.co/uxzMjfmhfG RT @iHeartRadio: Starting at midnight, listen to a brand new @taylorswift13 song every hour on select iHeartRadio stations! Tomorrow, tune… And so it goes, you two are dancing in a snow globe round and round... The Lover music video is out now! https://t.co/wTViSunbi3 https://t.co/mV0BXZ92QY A fun thing is happening! Learn how to remix You Need to Calm Down in select Apple Stores at the #todayatapple Music Lab. 🎶\nhttps://t.co/sMdfHHXtrD @AppleMusic https://t.co/c7zEOSJEMp RT @GMA: RT if you’re as excited as we are for #TaylorSwiftOnGMA TOMORROW! 🦋💘 \n\n@TaylorSwift13\nhttps://t.co/TTaJsnyitK https://t.co/eJZ52Go… 3 days until Lover!!! ❤️❤️❤️ \n\nPre-add it on @AppleMusic \nhttps://t.co/Xsi1jZGa3O #StellaxTaylorSwift 💘 It’s been SO fun to dream up cute stuff with @StellaMcCartney to create a line inspired by my new album. Can’t wait to show you what we've been working on at the @YouTube Live on 8/22 at 5p ET! More info at https://t.co/zv4KOzZAvB + https://t.co/JdABzXWRu0 https://t.co/OWbMRrGglx Sharing some never-before-heard lyrics from the new album every day + some of my favorite love songs on the Lover Enhanced Album playlist on @Spotify 😻 https://t.co/p0v6FBhyHk https://t.co/QXbUt1lMPC - @amazonmusic: what color lips would you like for this commercial?\n\n- Me: yes https://t.co/U636ofm97w Okay NOW there are five holes in the fence 😬😺💋 https://t.co/I5093bDJaF Grinning at this tweet!! And always in awe of your music 💗💗💗💗💗💗💗💗💗💗💗💗💗 https://t.co/0w8uOHSOYm ARE YOU KIDDING ME THIS IS THE NICEST THING ANYONE HAS EVER SAID - you’re just the best and so kind to say this 😭💕🙏😻 https://t.co/y3z1JzSejX Lover💕 Friday, August 23. \n\nPre-add, pre-save, pre-order: https://t.co/AdsErGvGS1 https://t.co/PbxN49rYEh There’s a dazzling haze... https://t.co/elbgJ1r948 Have I known you 20 seconds or 20 years?\n\nhttps://t.co/4grpRXSh7G https://t.co/EBoZXIbORm New song “Lover” is out tonight at midnight eastern! 💘 The music video will premiere after a very exciting @YouTube Live situation on August 22 at 5pm eastern! https://t.co/QynoYgkqQ7 💗💗💗💗💗💗💗💗💗💗 https://t.co/dMxVzYGxgG The thirteens really jumped out. 💗@alexmorgan13 \n\n 📸 @KevinMazur https://t.co/lmBydAQRyp Threw a party to celebrate with the people who made the ME! &amp; YNTCD videos with me- and we had so much fun that ‘Drunk Taylor’ is trending on Twitter. CHEERS. 😆🍾👍👏 https://t.co/HPvQlSDSBM 🌴🌴🌴🌴🌴🌴🌴🌴🌴🌴🌴🌴🌴 https://t.co/atH7d2Xk94 Can’t stop won’t stop twinning with Paddington. 🐻 https://t.co/ES9ufw8ZD8 I’d be a fearless leader. I’d be an alpha type. https://t.co/bzIchKUtJB 💘 https://t.co/levuCpqV94 Wanted to thank @abby_aguirre for writing such a thoughtful piece and for diving into my pastel cryptic world of hints, Easter eggs, and numerology. We also talked about sexism, equality, and all things Lover. I ate an entire cheese plate by myself. On stands soon-ish. https://t.co/n9vP3Vbpql My heart’s been borrowed and yours has been blue. All’s well that ends well, to end up with you. 💙 https://t.co/CECesxb8do WELL SO THIS IS A THING THAT’S HAPPENING. September issue of @voguemagazine and I’m so so so grateful to Anna, Tonne Goodman, Sergio Kletnoy and basically anyone who was like ‘yeah she can be on the Sept issue cover’. What an amazing experience shooting with @inezandvinoodh. https://t.co/Aj7ocN6VLg 💕 https://t.co/XVgtNCXWmT 💕 https://t.co/OubigHdps6 💕 https://t.co/zQ4DUaRCD7 What if I’m alright right here? https://t.co/nHWcaSVPAM RT @taylornation13: 10 @vmas nominations! Vote for @taylorswift13 10 times a day per category at https://t.co/2crRvoRwdU 💞 #VMAs https://t.… So excited to show you the deluxe versions of Lover! \n\nYou can get it at @Target in the US or on my website! Cheers! https://t.co/tY7Fw1lC9r https://t.co/Qi8IqmcDlB I’ve been the archer\nI’ve been the prey\nWho could ever leave me darling...\nBut who could stay?\n\nhttps://t.co/9q09bUXJlX https://t.co/b2hZ2cHfkf I’m going live on Instagram tomorrow, July 23 at 5pm ET! I have some stuff I’m reeeeeally excited to tell you about, including some info on this Easter egg right here. 🏹🎯👀⬆️ https://t.co/uxNYCgZ0Tz I am a cat now and somehow that was everything #CatsMovie https://t.co/80gZHpvzMW Behind the scenes with my 💕YNTCD Taylor Park neighbors 💕\n@adaripp @harto @dex_rated @todrick\n\n🎥: https://t.co/GNo2MxC3hV https://t.co/uacbRcLXbd Here’s a first look inside #CatsMovie. Trailer FRIDAY! 😺\nhttps://t.co/VTa6qO1g9h https://t.co/1NHqKrKcMJ RT @taylornation13: Two NEW Lover album bundles are available on @amazon for #PrimeDay ❤️ Available until July 16 at 11:59pm PDT! @amazonmu… ✨🐱✨ Friday\n@catsmovie https://t.co/h1SJfmA5ol Cat lady thirst trap https://t.co/hZ7e9bCaa7 Tune in to @PrimeVideo tonight 9pm ET! @amazonmusic #PrimeDay\nhttps://t.co/Eg8DkJFj6n https://t.co/TcYEk0S10P RT @halsey: 🦋 @taylorswift13 https://t.co/1iI2tCr8my RT @KamalaHarris: The USWNT scored more goals in their first World Cup match against Thailand than the U.S. men’s team scored in the 2010 a… ✌️Friday calmness✌️ https://t.co/jEq4ZLjtME RT @amazonmusic: Mark your calendars for the #PrimeDay Concert featuring @taylorswift13, with @DUALIPA, @iambeckyg, &amp; @sza on July 10th onl… Go behind the scenes of the 💗YNTCD Taylor Park💗 with the amazing @HayleyKiyoko @Lavernecox @katyperry @antoni @Karamo @jvn @bobbyberk @harto @DexStar84 @Adaripp @todrick @chesterlockhart @QueenJadeJolie @drewkirsch https://t.co/MSz3UNjUQH Some of us had champagne on set and it shows 🥂 https://t.co/Kxq7AcY8TL When you have a song about being calm and the video has a Cher quote in it and she posts it so henceforth you are not able to be calm anymore 😆 https://t.co/YGG0LyY4Kw Just like my life, this video was co-executive produced by @todrick 😸 https://t.co/AObdtkYl0w Stan/Follow/Support! @rileyknoxx @RuPaul @VancityReynolds @tanfrance @TATIANNANOW @todrick @trinitykbonet @TrinityTheTuck #YNTCDmusicvideo Stan/Follow/Support @A_doubleC_D @adamlambert @Adaripp @AdoreDelano @antoni @theebillyporter @bobbyberk @chesterlockhart @ciara #DeltaWork @DexStar84 @TheEllenShow @harto @HayleyKiyoko @QueenJadeJolie @jessetyler @JustinMikita @jvn @Karamo @katyperry @Lavernecox #YNTCDmusicvideo A happy meal 🍔 🍟 💗 https://t.co/hPAbOZEsKF Stan/Follow/Support! @A_doubleC_D @adamlambert @Adaripp @AdoreDelano @antoni @theebillyporter @bobbyberk @chesterlockhart @ciara #DeltaWork @DexStar84 @TheEllenShow @harto @HayleyKiyoko @QueenJadeJolie @jessetyler @JustinMikita @jvn @Karamo @katyperry @Lavernecox #YNTCDmusicvideo The #YNTCDmusicvideo is out! First, I want to say that my co-stars in this video are AMAZING. Please celebrate by supporting their work, following them, and going to see them perform. I’m SO grateful and SO EXCITED I ACTUALLY DO NEED TO CALM DOWN.🍹 https://t.co/787ksrnpBY https://t.co/Oj7GtQ7fxa The #YNTCDmusicvideo premieres in 1 hour 💞 \n\nPremiere watch page: https://t.co/gqUZ9FnKU1 \n\n@YouTube @youtubemusic https://t.co/Ek972t3hkE RT @TheEllenShow: My friend @TaylorSwift13 asked me to be in her new music video, “You Need To Calm Down.” It premieres tomorrow! Now I nee… Asked a few friends to be in the You Need To Calm Down video 😄 Out tomorrow at 8:15am ET https://t.co/QFp2Ni4Lb0 Tea time! Monday morning! 💕 https://t.co/YLt8UD9dNC We all got crowns 👑 💕 https://t.co/vI2rXQQMTl Can you just not step on our gowns? 💃 https://t.co/A8QPkZicqS RT @Target: We promise that you'll never find another like this! #PreorderLover @taylorswift13's new album - 4 exclusive deluxe versions. O… Alexa, play Today in Music 💗\n@amazonmusic https://t.co/XNpxSYrPpG A delicious new video comes out Monday morning...💗🎂💗 https://t.co/fnZMz6P5dg Gxgjxkhdkdkydkhdkhfjvjfj \n\nhttps://t.co/XjL0jBb4i0 https://t.co/8J6Bc89NQx There were five posts in the fence. https://t.co/dHgwKbd1Q5 Lover, album out August 23. Cover shot by the artistic genius that is @valheria123 💗 Pre-add, pre-save, pre-order (all the pre stuff you feel like doing) Can’t wait for you to hear this. https://t.co/SGjcCUYZdM https://t.co/IPy54raQUF Going live tomorrow on Instagram at 5pm ET 😁 https://t.co/l4tnhj84tG RT @TheEllenShow: .@TaylorSwift13, you make me so proud. #PrideMonth https://t.co/nbVZoKOzub RT @PetermanAudrey: Today I wrote to my senator, Ted Cruz, for the first time. Thanks to the awe inspiring words of Taylor Swift and the ex… RT @heartsandhalo: “The most common way people give up their power is by thinking they don’t have any.” 🌈 #lettertomysenator https://t.co/J… RT @HayleyGeronimo: It’s way past my bedtime, but I was so moved by Taylor’s letter to her senator that I had to pick up my own pen too!!🖊📃… 📷: @ashleyophoto, @jeffkravitz // Getty Entertainment https://t.co/mijbu6cV5E 🌈Like a rainbow with all of the colors🌈 \n\nThank you to everyone who came to Wango Tango! That was FUN 🥳 Ps a huge thank you to @brendonurie for surprising the crowd!!\n\n📸: Rich Fury, Kevin Mazur, Jeff Kravitz, Wes and Alex // Getty Entertainment https://t.co/dXWewgIUPv #lettertomysenator \nhttps://t.co/EKYMXZw5U9 https://t.co/Ym0mGeOHgc I love seeing what you’re listening to on your own playlists that you’ve created on @AppleMusic. Keep sharing them with me with the hashtag #PlaylistbyME https://t.co/ivvkvt6V9g https://t.co/9XfMvCNxia 😻 https://t.co/Lyr0vtXO69 🧡 au revoir 🧡 https://t.co/D1OhFPHPFU @heidiklum @TaylorSwift I love you too! Thank you for having me! Thank you @TheGNShow for having me and the band!! It airs tonight. Feeling lucky that I got to be on with @sophiet, Michael Fassbender, @jes_chastain and James McAvoy - They were all so sweet, now I want to just walk around yelling GO SEE DARK PHOENIX.\n📸: So Television / BBC https://t.co/vbY7UMBLaz I made a #PlaylistbyME! of songs I’m loving right now- check it out and make your own on @applemusic https://t.co/ivvkvt6V9g https://t.co/wVvHlg4wPc Had the best time performing with @brendonurie on @nbcthevoice finale - thank you to the fans there for being so welcoming! And a huge congratulations to @MaelynMusic!! Meeting you made my day 🥰\n\n📸: Trae Patton / NBC https://t.co/YdKLjda5jt Oh my God this is SO CUTE I LOVE IT. Thanks for putting all that effort into this you guys. Also Cassey I actually just finished the 30 day @blogilates ab challenge!! 🤗🤗🤗💕💕💕 Sending all of you a hug, thanks again! https://t.co/cXUELNktny I know I never think before I jump... https://t.co/LXqqrGdpmX RT @EW: .@TaylorSwift13 divulges the secrets to her album Easter eggs https://t.co/e39zwRIMSi Thank you for such a wonderful experience @EW - I loved getting to talk with @AlexJSuskind (yep I said it, I did an actual interview with a human journalist!! 🎉) Wanted to rep as many things/people I love on the jacket 💗 and more in the interview. https://t.co/C6dtAPFgfF https://t.co/zp0IiEPTn2 RT @amazonmusic: .@taylorswift13's ME! continues to CRUSH records on Amazon Music! \nMost first day streams ✔️\nMost first day on-demand voic… THIS WAS THE MAXIMUM AMOUNT OF FUN POSSIBLE. And for the first time ever I’m releasing the live rehearsal audio from this performance on vinyl and CD from @BBMAs on my site. Thank you to every performer up there with us tonight!!! 💗💗💗💗💗 https://t.co/MBHGP99Zxz RT @BuzzFeed: Taylor Swift And Brendon Urie's Billboard Music Awards Performance Is The Most Fun Thing I've Ever Seen https://t.co/TIIiUYPh… RT @taylornation13: Never before heard LIVE Rehearsal ME! Audio on CD + Vinyl are available only on the merch store until tomorrow!!! ✨🌈💕  … I’m trying to give them a normal upbringing but when the little ones and I ran into the flawless @PaulaAbdul on the way to red carpet we STRAIGHT UP had to get a pic. https://t.co/qf6iTLCUvV Omg spelling is fun but especially in this lyric video cause we also have GLITTER: https://t.co/PT2IwYqNTH https://t.co/g1XJOaVVmI Ah, French... the language of love. A new video is out on @youtube going behind the scenes of THAT scene: https://t.co/rIlX75blVN https://t.co/KFsKMFx6Ps Before I take the stage at the #BBMAs, I’m catching up with @zanelowe on @applemusic's @beats1official. Listen Wednesday:\n9:30AM PT / 12:30PM ET / 5:30PM GMT https://t.co/LCbq2ZrJus https://t.co/BKNb0dgUst Brendon and I shot our @Spotify vertical video at rehearsals in Vegas to give you a sneak peak of our @BBMAs performance 😀\nhttps://t.co/kV2fKymzXW https://t.co/lXH6bTjU50 You. Are. The. Best. 😻  #taylurking #fromMEtoYOU \nhttps://t.co/oc7funLCvT https://t.co/RZG7KFg1OT LOVE 💗💗💗💗💗 #taylurking #fromMEtoYOU \nhttps://t.co/oc7funLCvT https://t.co/aU1iFTh2gJ YOU ARE MAKING MY DAY! #taylurking #fromMEtoYOU \nhttps://t.co/T91mVWiVXN https://t.co/mvkhaab2Hb I LOVE YOU GUYS 💗 #taylurking #fromMEtoYOU\nhttps://t.co/oc7funLCvT https://t.co/ko2GAY71Jn RT @taylornation13: WE all want ME! \n\n1. Gift the song to ONE friend on iTunes\n2. Post a selfie here holding up your gift receipt using #fr… Tonight we lurk on twitter. 👀 RT @taylornation13: Which one is your favorite?? These are available until May 2 🌺 \n\nShop at https://t.co/ZSGtuHSAkb https://t.co/3hL2qGDLeG The first time I met Benji. 😻Check out the behind the scenes video on @YouTube. https://t.co/VRHIGzJ5A0 RT @AppleMusic: IT'S ALL HAPPENING. @taylorswift13's ME! featuring @brendonurie of @PanicAtTheDisco is here. \nListen now: https://t.co/GBIj… This is AWESOME 🌸 @youtubemusic @YouTube \nhttps://t.co/YYKCilSb9n https://t.co/Hhvn1AAtyg SO. COOL. 😻@amazonmusic #alexaplay ME! \nhttps://t.co/0B1VOPvbmV https://t.co/pv0ubUQp5T Thank you @Spotify 💗\nhttps://t.co/HOqy9VPDv5 https://t.co/pmgDh8dy1s Because of you guys, this video broke the @vevo record and WE ARE NOT CALM. https://t.co/4tXuFRtTyb This is INCREDIBLE!! https://t.co/TH9bXLeqgD GUYS!! YOU DID THIS!!!! CANNOT STOP SMILING 💗💗💗💗💗\nAnd I’m not trying to be loud but 65.2 million views... ?? and 6+5+2=............. https://t.co/PBXGyEaqDj 💕💗 A huge thank you to the incredible dancers for making the video so magical and for keeping the secret for so long!!💕💗\n\nhttps://t.co/1f7Iqonrec https://t.co/kTEti96aZH RT @selenagomez: So proud @taylorswift13 https://t.co/vDIMtEBiki RT @blakelively: When I die, please bury me here...    ❤️🧡💛💚💙💜💖💜💙💚💛🧡❤️\nhttps://t.co/G5Bkntttwa RT @Camila_Cabello: I am HERE for this new era, and I am HERE for TS7 and I am HERE for this song and video and Meredith, Olivia, and Benja… RT @taylornation13: The vertical loop of “ME!” on @Spotify was just updated 💞 Check back today and throughout the week to find some more 😉… Think about the place where you first met ME! #MEmusicvideo \nhttps://t.co/wImFeZ6kO2 https://t.co/uhiQzzQV4i So... the new album title is actually revealed somewhere in the video AND so is the title of the second single, but I haven’t seen people finding them yet...\n🕵️‍♂️🕵️‍♀️ #MEmusicvideo\n\nhttps://t.co/cdxQ6dFiar This is Benjamin Button. He’s a good boy. https://t.co/Ou40WXL8hH https://t.co/6aM19kYq5K This is how he prefers to travel. https://t.co/poYAH52vPl RT @pandoramusic: The wait is over! @taylorswift13’s brand new single “ME!” featuring @brendonurie has arrived. Listen now: https://t.co/lj… RT @amazonmusic: “ME!\" FOR YOU. NEW @taylorswift13 music DROPS NOW, featuring @brendonurie of @PanicAtTheDisco! #AskAlexa “Play the new Tay… RT @AppleMusic: We ❤️you @taylorswift13.\nListen to ME! featuring @brendonurie of @PanicAtTheDisco: https://t.co/GBIjqlBb41 https://t.co/tW2… RT @Spotify: It's all about ME! \n@TaylorSwift13’s new track feat. @brendonurie of Panic! At The Disco is streaming now. \nhttps://t.co/PwWmL… RT @youtubemusic: .@taylorswift13 has returned. Play ME! (feat. @brendonurie of @PanicAtTheDisco) now on YouTube Music → https://t.co/yY6Gk… And then there were three… https://t.co/v8DyjdL1ec RT @KeithUrban: .@taylorswift13.... HELL YESSSSS!\nYou rise up- you do it ALL THE TIME!  CONGRATS!!!!!!!!! - KU @dixiechicks Chicks stans never unstan. RT @zainubamir: @taylorswift13 I just wanna say real quick thank you!! this song is exactly what I needed and honestly makes me feel so hap… RT @DaniMaguina: OUR REACTION GJSBFKWJSIQ WE CANT KEEP OUR CHILL EVER @kaileeheller @taylorswift13 #TaylorSwiftTonight https://t.co/QX6WbcH… RT @ginaswift13: Hey kids! Spelling is fun! \n@taylorswift13 @taylornation13 #MeOutNow #TaylorSwiftTONIGHT #taylorswift https://t.co/GqA9dqU… RT @brendonurie: Wait. This really happened?! Like for real?!?! Well I can’t begin to describe how incredible it has been to work on this s… ME! Out now! Made this song with @brendonurie and @iamjoellittle. Dave Meyers and I co-directed the video. And everyone knows you can’t spell awesome without DAVIDBRENDONJOEL. Oh wait... https://t.co/xFsUDfSRSJ https://t.co/0FgYZqMeOP RT @taylornation13: PREMIERING NOW: https://t.co/9PauiR3z0k On @YouTube answering questions. Send help. \n\nhttps://t.co/vljvOeYo6R https://t.co/jleC5nRXca WELL GUYS it's almost midnight and my new song “ME!” featuring @brendonurie of @panicatthedisco will be out. In other news, the VIDEO will be out too and I can’t wait to watch live with you (and answer some questions) as it premieres on @YouTube 🎥😺 https://t.co/YImpUXvEVQ https://t.co/lOy7biUgbA 🦋 https://t.co/stM1H4tNzm ME! by the one and only @valheria123 💗💗💗💗💗💗💗💗💗💗💗💗💗 https://t.co/66k86qu8kr So... @kelsmontagueart helped me pull off the best surprise clue reveal today in Nashville! Thank you to everyone who showed up, I’ve never been more proud of your FBI level detective skills. Next clue: I’ll be joining the magnificent @robinroberts for a chat tonight on ABC 💕 https://t.co/TGmvbiWJWV 4.26 https://t.co/bFOWK3O3G1 It’s TIME. #time100 https://t.co/sC9zu13CVm 4.26 https://t.co/TiHQCGqUlE 4.26 https://t.co/7eYGsVjQg0 4.26 https://t.co/mQejq2QXbZ 4.26 https://t.co/yYSZFZZLvF 4.26 https://t.co/DNVKNGXDPG Well this is AWESOME. Thank you @TIME 💗 Thank you Pari Dukovic and thank you for your unbelievably kind words @ShawnMendes (I had no idea you were writing this and just found out when I saw this!!) https://t.co/4MIBw20FxQ 4.26 https://t.co/IJaSFQoeVC 4.26 https://t.co/L1DEOSo2LC 4.26 https://t.co/Q3el3sRDDf 4.26 https://t.co/IhwxXJyfvD 4.26 https://t.co/E5cecDmo5f @halsey @ELLEmagazine Grinning and blushing over here. Thank you so much for reading it!! 💗 Out now. https://t.co/UZGcmTqhtV https://t.co/DqqZwwFfZZ “All Too Well” was never a single, and it always blows my mind that it is consistently one of the loudest songs the crowd sings when I play it. Moments like this defined the Reputation Stadium Tour for me, and I can’t wait for you to see it in full starting at 12:01 AM 12/31 PST https://t.co/wgcV3oumje Netflix marketing team: So for the poster, we were thinking-\n\nMe: CAN YOU MAKE ME LOOK LIKE A ZOMBIE HUNTER https://t.co/JxBCEdMCd4 Thanks so much for all the birthday wishes! Today I finally get to show you something we’ve been working on for a while... the trailer for the Reputation Stadium Tour! The entire concert film will premiere on @Netflix at 12:01AM PT December 31. https://t.co/ZL3Kx2OUx8 Angels 😇 \n@RobbieWilliams\nhttps://t.co/A6rx5WA0ie Amazing @JamesBayMusic! 👏👏👏👏👏👏👏👏👏👏👏👏👏 https://t.co/9RDrCEbKBc Thanks @vmagazine ❤️ See you tonight Seattle!! https://t.co/VB78rGXO7C RT @Variety: Taylor Swift Dazzles on Opening Night of 'Reputation' Tour @taylorswfit13 https://t.co/lGp9dgDYSr RT @RollingStone: Taylor Swift kicked off her 'Reputation' tour last night in Arizona. Rob Sheffield on why this trek is her finest yet htt… RT @mercnews: Review: Taylor Swift delivers near-perfect pop show in Bay Area https://t.co/aOoOAMGCGV https://t.co/EQa5YuTRO9 RT @charli_xcx: 💕CHARLI💕CAMILA💕TAYLOR💕 SEE U 2NIGHT SANTA CLARA !!!!!! https://t.co/dCaEIaFmRR RT @Camila_Cabello: ALSO \"10 SONGS FROM PAST ALBUMS\" MY HEAD IS SPINNING?!! WILL A HEY STEPHEN, OR CHANGE BE THROWN IN? ENCHANTED?! LONG LI… RT @Camila_Cabello: THERE’S FOUR DAYS TILL THE REPUTATION TOUR HOLD MY WIG It's National Siblings Day! Check out Austin's movie 😁 https://t.co/Zqx5hLj6of Vertical video for #Delicate out now. Only on @Spotify ✨ https://t.co/ZHvrH7k1PN https://t.co/nhcfIv97gR New video for #Delicate at midnight EST tonight. Only on @spotify  ✨ https://t.co/AHEY6LOSTz I know that it’s delicate... https://t.co/0H5EpgcFtd DELICATE VIDEO WORLD PREMIERE ON @iHeartRadio MUSIC AWARDS ON @TBSNetwork!!! ✨💃✨ https://t.co/hhILI7bwn9 ✨✨✨✨✨✨✨✨✨✨✨✨✨ https://t.co/KHNRCaKfU0 I have a very exciting update to share... @Camila_Cabello and @charli_xcx will be the opening acts on the #reputationStadiumTour!!! https://t.co/LAjmecVOrJ Songs I’m loving right now 🎶\nhttps://t.co/K62TYfJht6 #EndGameMusicVideo out now. @edsheeran @1future https://t.co/z6EiFsLniY Tonight at midnight eastern. #EndGameMusicVideo\n@1future @edsheeran https://t.co/XHRS02IXfY RT @taylornation13: #TheSwiftLife is now available for Android! Get it on Google Play now: https://t.co/qguJHJ3qPL https://t.co/93evBchcNl RT @AppStore: .@taylorswift13's first app has arrived—and it’s only on the App Store. (Early reviews are in: Meredith and Olivia give it tw… North American dates on sale now! https://t.co/o8bU3G9HMl https://t.co/4ZV2mczOPt RT @RIAA: Congratulations @taylorswift13. #reputation is 3X Platinum + RIAA’s top certified 2017 album to date! @BigMachine https://t.co/D1… RT @RIAA: There’s more! Look What You Made Me Do is 3X Platinum + ... Ready For It? is Platinum @taylorswift13! @BigMachine https://t.co/St… RT @RIAA: #Fearless joins the RIAA 10X Diamond club! @taylorswift13! @BigMachine https://t.co/DSnfIt2Nmc RT @taylornation13: 🚗❤️🚨 The perfect road trip song! Watch @taylorswift13 find her “Getaway Car” breakthrough on #TaylorSwiftNOW, only from… \"...Ready For It?\" (@BloodPop ® Remix) out now - https://t.co/BhnUlUqUD7 https://t.co/rsKdAQzd2q Thank you @Edward_Enninful, Mert Alas and Marcus Piggott for your passion, spirit and contagious laughter on set. @BritishVogue #NewVogue https://t.co/cQiufPKkDS Absolutely stunning. https://t.co/6itJC1bk6W RT @taylornation13: https://t.co/WWpP1tpRmU This week has been unforgettable. I love you guys. Thanks a million 😉 https://t.co/qjspCA7NJ7 The Making of #Delicate ✨ #reputation #TaylorSwiftNow https://t.co/tn78pMCoVV #reputaylurking #reputation  ❤️ https://t.co/CbTqn2F6Xs #reputaylurking #reputation  ❤️ https://t.co/JhZNUZ7MxK #reputaylurking #reputation  ❤️ https://t.co/f4135JnNhM #reputaylurking #reputation  ❤️ https://t.co/JtblVbBa5u #reputaylurking #reputation  ❤️ https://t.co/sAtTLVzfw3 #reputaylurking #reputation  ❤️ https://t.co/pOEpn6Dk5p #reputaylurking #reputation ❤️ https://t.co/2OV2DvvIyN RT @jimmyfallon: Taylor Swift performs 'New Year's Day' from her new album Reputation #FallonTonight https://t.co/20GPtmFWzf RT @etnow: Taylor Swift defends her 'reputation' as a great 'SNL' musical guest with 2 epic performances. https://t.co/BGvqX6H1Sn https://t… RT @people: Taylor Swift Takes SNL Stage with Snake-Shaped Mic In Hand — then Goes Acoustic https://t.co/cnH2ESn93x RT @Metro_Ents: Taylor Swift slays the first live performances of the Reputation era on #SNL https://t.co/gYKn3UjLBW RT @usweekly: Taylor Swift slays on 'SNL' and Tiffany Haddish makes history: see the best moments https://t.co/ZdWzK8e3Qj RT @InStyle: Watch Taylor Swift crush her performances from last night's SNL. https://t.co/7zSCBEerxB THANK YOU SO MUCH!! AHHHH!!! PS, I ADORED your CMA performance 👏👏👏 https://t.co/RGEvOTYEhd Tonight.\n\n📷: Mary Ellen Matthews https://t.co/mbQdDHz5Dn My cousins in St. Louis sent this to me. I LOVE YOU @LauraKHettiger\nhttps://t.co/OvC349nq8y #reputaylurking #reputation ❤️ https://t.co/WPWiwPodY1 #reputaylurking #reputation ❤️ https://t.co/hEGz0GQFqc #reputaylurking #reputation ❤️ https://t.co/PRkjzCmoAc #reputaylurking #reputation ❤️ https://t.co/NPcA5WsgVL #reputaylurking #reputation ❤️ https://t.co/hxD5n2KrxW #reputaylurking #reputation ❤️ https://t.co/9n2rvbzXph #reputaylurking #reputation ❤️ https://t.co/K3tUWVvmpd #reputaylurking #reputation ❤️ https://t.co/18sg97Oshp #reputaylurking #reputation ❤️ https://t.co/3p2sIX7WGU #reputaylurking #reputation ❤️ https://t.co/z5HoBkxUQy #reputaylurking #reputation ❤️ https://t.co/O8sznXy3vX #reputaylurking #reputation ❤️ https://t.co/sygCHKoJvu #reputaylurking #reputation ❤️ https://t.co/tDWpcN4MGx #reputaylurking #reputation ❤️ https://t.co/eS6JDjsWuF #reputaylurking #reputation ❤️ https://t.co/rOXGOsBDae RT @latimes: Taylor Swift's talent remains intact on \"Reputation,\" her most focused, most cohesive album yet https://t.co/9OWWyhLppb https:… RT @robsheff: good lord I love this album https://t.co/pUVZtUg4t5 #reputation is out now. Let the games begin. https://t.co/oExj2XFGvH https://t.co/GzA6cTEwjf RT @taylornation13: Get an exclusive first listen of ‘New Year’s Day’ at 9:29p ET tonight on @ABC and hang with us as we countdown to #repu… Waiting for #reputation like...\n\nhttps://t.co/oExj2XFGvH https://t.co/LCCRtKnQXz ABC tonight during Scandal #reputation #TGIT https://t.co/kOhx1vAXoV In NYC for SNL rehearsals. I️ LOVE YOU @littlebigtown and CMAs. https://t.co/3QT7bX6yOe RT @GMA: CMA Awards Song of the Year: \"Better Man\" - @taylorswift13 \n\n@CountryMusic #cmaawards2017 #CMAawards https://t.co/QJlUQXHh64 Two days until #reputation. \nhttps://t.co/oExj2XFGvH https://t.co/z4bk0thC5c Three new behind-the-scenes videos available now.\n\nOnly on @AppleMusic: https://t.co/nNtHaYzZrp https://t.co/a4E6cNaD3B RT @courtneyforce: Let the games begin! Running a @taylorswift13 FunnyCar w/ @AdvanceAuto &amp; @BigMachine at @NHRA Finals! Taylors #reputatio… Forgot to show the back of the Target magazines 😂 on Friday you can get your hands on this quality reading material. https://t.co/fPhRA1Ocvf https://t.co/w8q9R752vR 3 days until #reputation. \n\nhttps://t.co/oExj2XFGvH https://t.co/sjr8hMqPxV Two unique magazines. Poetry, paintings, lyrics &amp; polaroids.\nAvailable Friday: https://t.co/fPhRA1wB6F https://t.co/frFIILyrqa Inside the reputation Secret Sessions - https://t.co/aotQtPBzer The #CallItWhatYouWant lyric video is out now! Watch it here: https://t.co/FKYJ3dADib “Call It What You Want” available now. @applemusic\nPre-order #reputation: https://t.co/oExj2XFGvH https://t.co/EWxoTpSzIT Call It What You Want. Midnight Eastern. https://t.co/nTmlQUzmFN RT @ATT: ⏰ The Making of a Song premieres 11/13 on @DIRECTVNOW, only from AT&amp;T! https://t.co/emXplX8gjo #TaylorSwiftNOW https://t.co/VIXXYd… #ReadyForItMusicVideo https://t.co/HYBhBqNVo3 There are no words to express the helplessness and sorrow my broken heart feels for the victims in Vegas and their families. https://t.co/EIXRjnE9Gw RT @RollingStone: All 115 of Taylor Swift's songs, ranked https://t.co/mdD4f04rQ8 https://t.co/Bm317v6fib RT @TheEllenShow: #LookWhatYouMadeMeDo @TaylorSwift13 https://t.co/8rUDDtwbdH 😍😍😍 https://t.co/oIAruxj8ZH Some real tough questions I had for Olivia. https://t.co/VeLIN3iYRY Such a taxing day when they're like 'eat some cookie dough' and you're like 'ok I'll make this sacrifice for my art' https://t.co/0D8LfJA49q https://t.co/Yia4NqDjYR A second glance into #reputation...ready for it? https://t.co/e495xJi3M8 https://t.co/HF35pISj2N The #LWYMMDvideo is out now - https://t.co/6ajIH45CnX Official #LWYMMDvideo world premiere. \nSunday 8/27 at the @vmas https://t.co/tjAxr8qdsY New single #LookWhatYouMadeMeDo out now. Pre-order #reputation: https://t.co/oExj2XFGvH \n\nMerch &amp; ticket info at https://t.co/AbDQqnCntC https://t.co/Tcni9yIgs2 https://t.co/xMBBukfZPs https://t.co/xqhhDZ0y7c https://t.co/12Rfi8bso4 https://t.co/p2DyY0e2M3"}