{"tweets": "The president of a major teacher's union is raising concerns about recent CDC guidance that loosens social distancing requirements in classrooms. https://t.co/TqaXPPS36R Jersey City to provide \"health buses\" for people who are homeless to shower, do laundry. https://t.co/g5mEYWkiN1 Deadlock in the 120-seat parliament was a real possibility a day after the election, which had been dominated by Netanyahu’s polarizing leadership. https://t.co/ocBFrLG4Rw A crane being used during a film shoot fell onto a home in Pasadena, California, injuring one person.\n\nWhile no serious injuries were reported, three people were displaced, officials said. https://t.co/snGcov4AyC https://t.co/G6i4eBBe64 WATCH LIVE: Our @ABC News team breaks down what you need to know about the fatal Boulder shooting. Plus, we have an update on the COVID-19 pandemic. https://t.co/0W5Gx9Jn7w Prince Harry, the Duke of Sussex, has landed a new job title at a Silicon Valley startup. https://t.co/entaFsUyAa Kim Janey was sworn in as mayor of Boston, becoming the first Black person and first woman to hold the office.\n\nJaney became acting mayor earlier this week when former mayor Marty Walsh was confirmed as Pres. Joe Biden's Secretary of Labor. https://t.co/jmQR1NT9Ea https://t.co/NHsCjPooZ4 NEW: Pres. Biden taps Vice Pres. Kamala Harris to lead his administration's effort to stem migration from Central America. https://t.co/oLxNEhPnSs In a historic first, NASA will attempt to launch a helicopter into flight on Mars next month. https://t.co/u8sMz1bf7W Students of color more likely to be stuck in virtual learning during the COVID-19 pandemic compared with their white counterparts, according to new data released by the Biden administration. https://t.co/WeETrTWvvI Hang on to that COVID-19 vaccination card -- it’s important. https://t.co/EbKiYChgx5 Oscar-nominated actor George Segal died Tuesday, his rep confirmed to @ABC News. He was 87. https://t.co/4qzDhUHQKV Prince Harry, the Duke of Sussex, has landed a new job title at a Silicon Valley startup. https://t.co/OJL3MCJPgA An Indiana man is accused of inciting a riot in Miami Beach amid a surge of tourists in the city, according to authorities. https://t.co/x4HbYMfmU8 #CynthiaErivo to @janai on what Black joy means to her: \"Even in our pain we somehow find light.\"\n\nThe newest episode of @SoulofaNation now streaming on @hulu. https://t.co/l9npIC6P5H\n\n#SoulOfANation https://t.co/za8s04iHEf \"Today is a new day. I stand before you as the first woman and the first Black mayor of Boston, the city that I love. I come to this day with life experience that is different from the men who came before me,\" @Kim_Janey says. https://t.co/IiZ18HiXoZ https://t.co/ziSkv9ZzP9 Federal prosecutors reveal a previously undisclosed message from a member of the Oath Keepers, in which they discussed an \"alliance\" between three separate far-right groups that planned to travel to Washington on Jan. 6. https://t.co/x2buSXodQ5 A large container ship ran aground in Egypt's Suez Canal early on Tuesday, blocking navigation in the vital waterway for more than 24 hours, officials have said. https://t.co/iiW3P3mLRJ https://t.co/LD9ijdjFzm EXCLUSIVE: How suicide prevention is getting a boost from artificial intelligence. https://t.co/dvKTKXFydk NEW: Kim Janey makes history as she is sworn in as Boston's first Black and female mayor. https://t.co/IiZ18HiXoZ https://t.co/yHrrUBh8qD \"It is incredible to consider just how far we have come,\" Rep. @AyannaPressley says, about Kim Janey becoming the first Black person and first woman to be sworn in as mayor of Boston. https://t.co/IiZ18HiXoZ https://t.co/BOxJFErfB2 A rhino enjoyed a temporary pool created by torrential rain at Mogo Wildlife Park in New South Wales. https://t.co/q0lVrZ88BL https://t.co/GMCTxbS9xJ SpaceX deployed 60 Starlink satellites, which will provide additional support for its internet satellite constellation system, into orbit from Cape Canaveral, Florida. https://t.co/7V3ieCBx4N https://t.co/GCC7gj9swv India's lockdown, among the strictest anywhere, lasted for 68 days, and some form of it remained in force for months before it eventually was lifted. Since the pandemic began, India has had 11.6 million cases and more than 160,000 people have died. https://t.co/nHY7157qVV Senate Majority Leader Chuck Schumer: \"If one political party believes that when you lose an election, the answer isn't to win more votes but rather to try and prevent the other side from voting, we have an existential threat to democracy on our hands.\" https://t.co/xY8G8YiI04 https://t.co/qYSYlXcM9t GLIDING ON ICE: Ice yachters brave the Siberian cold to glide across the world's deepest frozen lake in Irkutsk, Russia. https://t.co/BWgONXs1Ut https://t.co/EjTihVMLLx Senate Majority Leader Chuck Schumer slams GOP over Georgia voting rights bill, drawing comparisons to Jim Crow laws: \"Why are you so afraid of democracy?\" https://t.co/HBDJIYWgqh https://t.co/FWTKhM5vss AFTER THE FLOOD - SPIDERS: Experts in Australia are warning that recent floods have created conditions likely to lead to a plague of deadly funnel web spiders. https://t.co/s94bIIwkK5 https://t.co/6pSZbmumtH Senate Majority Leader Chuck Schumer on proposal from Arizona lawmaker to require absentee ballots to be notarized: \"How are poor people going to pay for a notary?...It's one of the most despicable things I have seen in all my years. Shame!\" https://t.co/xY8G8YiI04 https://t.co/Ky5bik9Ibt \"The accident is mainly due to the lack of visibility resulting from bad weather conditions as the country passes through a dust storm, with wind speed reaching 40 knots,\" Suez Canal Authority Chairman Osama Rabie said in a statement. https://t.co/DXMQGcQeFn Migrants are being released from custody in Texas before they have court dates, a practice Republicans say is the latest example of the Biden administration's struggle to handle the surge at the border. https://t.co/lEfSjlGHUj Senate Majority Leader Schumer at hearing on voting rights: \"Instead of doing what you should be doing when you lose an election in a democracy—attempting to win over those voters in the next election—Republicans instead are trying to disenfranchise those voters. Shame on them.\" https://t.co/Io83FgBl8N The Chicago suburb of Evanston has approved the first phase of a landmark $10 million reparations program that will give housing grants to Black residents targeted by discriminatory policies. https://t.co/kZ43BShMNO Kim Janey being sworn in as first Black, first woman mayor of Boston. https://t.co/ruRFzOeutY Thein Zaw was one of nine media workers taken into custody during the Feb. 27 street protest in Yangon, the country’s largest city, and had been held without bail. About 40 journalists have been detained or charged since the Feb. 1 coup. https://t.co/7ALWdqOQQN DOWNTOWN DESTROYED: Strong winds brought down buildings and caused roof damage over two blocks in Bertram, Texas. https://t.co/cbBquzWFml https://t.co/XQcQDUupn3 \"Only God knows what will happen next.\" https://t.co/M4LWhuC9mb REEL RESCUE: A Ukrainian man used his fishing rod to pull a boy to safety after the child got stranded on a floating block of ice in the middle of a river. https://t.co/mYmm7gwwX1 https://t.co/DMCCLGQpPS @ABCPolitics MORE: Committee Chair Carolyn Maloney says the hearing will focus on disparities that have been exacerbated by the coronavirus pandemic. https://t.co/w7drLeIFeK\n\nWatch live: https://t.co/6LuwRDSqEE RT @ABCPolitics: WATCH LIVE: Congress holds hearing on gender pay gap; soccer star Megan Rapinoe to testify. https://t.co/F0lmukHl4o Plagues, fires, war — London has survived them all. But it has never had a year like this. The coronavirus has killed more than 15,000 Londoners and shaken the foundations of one of the world’s great cities. https://t.co/WMLaugLnQo 25-year-old Rikki Old's uncle told @ABC News that his niece was a \"strong, independent\" woman who had worked as a manager at the grocery store for six years. \n\n\"She was so loved, and she will be so missed. We are heartbroken and saddened and devastated.\" https://t.co/UD1OdXKjnv “Let’s-a go!”\n\nMario leaps into the real world as Super Nintendo World opens in Japan. https://t.co/5RDWEm3vIJ https://t.co/gmQuJ2avrz To make getting a shot even sweeter, Krispy Kreme is offering a free original glazed doughnut to anyone who shows their COVID-19 vaccination card. https://t.co/8HnsNXQYxS BURIED: Days of heavy rain have brought deadly floods to Australia and also caused a landslide which swamped this mountain road, trapping one vehicle. https://t.co/jumK6pkmXi https://t.co/OepcyZpGJW The Pacific Beach Coalition recently noticed a dramatic increase in discarded PPE on beaches in and around the city of Pacifica, south of San Francisco, where it's been doing monthly cleanups for nearly 25 years. https://t.co/jzMxN95e1Y \"I asked her to come and leave in an Uber,\" Angela Right, owner of Azura Jewelry said, \"and when she gets home, she needs to text me.\" https://t.co/1LajjURpym Adults under lockdown orders gained more than half a pound every 10 days, according to a study published in JAMA (Journal of the American Medical Association) Network Open. https://t.co/X2IlcIAQ1x \"I still have what I feel like is a 48-hour memory.\" https://t.co/2skjijte8D \"There is a piece of my heart that's gone. It's just unimaginable, I can't even explain to you,\" 20-year-old Stone Foltz's mother, Shari, said in an exclusive interview airing Wednesday on @GMA https://t.co/gTUYmJYv3l WEATHER: Major severe weather outbreak expected in South, tornadoes possible. https://t.co/FiQO67OeR4 Scandal-plagued former Missouri Gov. Eric Greitens announced he's planning to run for Missouri's open Senate seat after Sen. Roy Blunt said he would not run for reelection. https://t.co/oexVHoFNC8 Those who lost their lives at the King Soopers store in Boulder ranged from 20 years old to 65. They included a magazine photographer, a Medicare agent with a passion for theater and others going about their days at a busy shopping plaza. https://t.co/dklE3JZBLj STARTING NOW: @ABC News has the latest headlines from across the globe. Diane Macedo anchors: https://t.co/0C07CgRqg4 📸 An aerial view shows a burial at the Vila Formosa cemetery in Sao Paulo, Brazil during the coronavirus pandemic. Brazil's daily COVID-19 death toll soared past 3,000 for the first time this week as the country struggled to contain a surge in cases. https://t.co/zTtKdDz7Kd https://t.co/C0vM0fJN4W “We celebrate his life and legacy every day at Paisley Park, a place that Prince wanted to share with the world,” Paisley Park Executive Director Alan Seiffert said. “We acknowledge the incredible force and inspiration Prince is in people’s lives.\" https://t.co/EDKBKc6bbm DEEP SEA TRAGEDY: Devastating underwater footage show how Rio's sea life is under threat as trash and pollution swamps the ocean. https://t.co/Ks4Vo26cZp https://t.co/5dUPwxBlMr First lady Jill Biden on Boulder mass shooting: “Ten more lives have been stolen by gun violence.”\n\n“The grief we feel is heartbreakingly familiar, but we cannot become numb to it. We must act now.” https://t.co/LMN3TJhDxr https://t.co/cNOf8sa76L \"They were like, 'Well you haven't seen him or what he looks like.' And I'm like, I really don't care what he looks like. As long as he's a pit bull, I'll take him.\" https://t.co/YXtWLdB9AZ \"It's going to be a case the likes of which none of us have seen before,\" David Weinstein, a former federal and state prosecutor in Florida, told @ABC \"It's a case that's so important on so many levels to so many people.\" https://t.co/gcqHciBBGg “When there’s something about the case that resonates with you and that you identify with, it’s going to have a pretty significant impact.\" https://t.co/ZeeFMj7TNi March 24 marks Equal Pay Day for women, the day that women have to work into 2021 to make what white, non-Hispanic men earned in 2020 alone. https://t.co/Y04FPzl4KI The decision not to require public disclosures from those officials comes as the Biden administration has publicly released financial disclosure forms for dozens of other White House aides. https://t.co/cIL8CFq7JB “This is an extraordinarily difficult time for the fire services,” Clarkstown Supervisor George Hoehmann said. “Our thoughts and prayers are with the bravest and the fellow firefighters of Spring Valley who lost a brother.” https://t.co/TJ2sLTIgcm Not including suicides, 19,380 people died by gun violence in 2020, up from 15,440 in 2019, according to Gun Violence Archive, a nonprofit research group. In the five years prior, non-suicide gun deaths fluctuated between 12,000 and 15,500 annually. https://t.co/wYulIfErUT Deadlock in the 120-seat parliament was a real possibility a day after the election, which had been dominated by Netanyahu’s polarizing leadership. https://t.co/lR97AKeQ5a CITY LIFE: Pod of dolphins spotted swimming in New York City's East River. https://t.co/YORPxYmhgx https://t.co/vi7yz0Wzco REEL RESCUE: A Ukrainian man used his fishing rod to pull a boy to safety after the child got stranded on a floating block of ice in the middle of a river. https://t.co/alJZBhwK5r https://t.co/l7HQWBLsnZ ROCK BLOCK: Australia's famous Uluru, also known as Ayers Rock, is submerged in water as the effects of the worst flooding in half a century are seen across parts of the country. https://t.co/hv0Mizc3Jk https://t.co/dNvAG9PRTc People placed flowers on the police vehicle of Officer Eric Talley, who was one of 10 people killed at a grocery store in Boulder, Colorado. https://t.co/LZv6zxd2uE https://t.co/ULB1kyWIsW Witnesses outside Insein Prison in Yangon saw busloads of mostly young people, looking happy with some flashing the three-finger gesture of defiance adopted by the protest movement. State-run TV said a total of 628 were freed. https://t.co/6lsahNc35h The president of a major teacher's union is raising concerns about recent CDC guidance that loosens social distancing requirements in classrooms. https://t.co/ynUxpLqtfU Two COVID-19 PCR test collection kits are officially available for on-demand delivery through DoorDash. https://t.co/2wXL8ozbPg Prime Minister Scott Morrison expressed the Parliament’s condolences to the family of the man who died at Glenorie. Morrison said his own policeman father had taken their family camping near Glenorie every Easter. https://t.co/7Qrb0iUD2Q LIGHT SHOW: Timelapse footage captured an aurora borealis displaying green and purple lights above Chippewa County, Wisconsin. https://t.co/5Min7kRagf https://t.co/kVM96Q5lRK Hang on to that COVID-19 vaccination card -- it’s important. https://t.co/wNv0Co76FD SHADOW PLAY: Grand Canyon ravens swoop and dive in soaring courtship display. https://t.co/Ehs5x9Dbso https://t.co/TGo7Pc7iF3 Dolphins were spotted in a Venice canal close to St. Mark's Square, as coastguard members and wildlife specialists searched for the animals.\n\nCoronavirus restrictions has brought fewer boat traffic and cleaner waters. https://t.co/MaApBKFGXN https://t.co/kAESVfpCgp SURFIN' SAFARI: A Californian surf instructor has been nicknamed 'The Goatfather' as he takes his pet goats to the waves in a bid to help children gain confidence in the water. https://t.co/tM5ZMa1tar https://t.co/g8oVR2VaRC Authorities in Southern California are investigating a possible hate crime after a man recklessly drove through a red light into a crosswalk where protesters were marching in a \"Stop Asian Hate\" rally. https://t.co/nIQSMyk3BQ Dr. Anthony FaucI criticized what he described as \"outdated\" information in AstraZeneca’s U.S. vaccine trial as \"unfortunate\" and acknowledged concerns with accuracy could lead to problems getting more Americans to take the vaccine. https://t.co/C0C9K7gNxL Prince Harry, the Duke of Sussex, has landed a new job title at a Silicon Valley startup. https://t.co/EkGrL09IB9 Although vaccine studies are still ongoing, the vaccine brand and lot number listen on your card could be relevant when the time comes for a booster dose. https://t.co/QKuz1qv9Px For the first time in six months, Cineworld's Regal Cinemas chain will reopen, following shutdowns related to the COVID-19 pandemic. https://t.co/aRnfiT5J8L Colorado's tragic and prolific history of mass shootings from Columbine to King Soopers: https://t.co/XVvB54PMuw Staff at the Bradford Royal Infirmary took part in a moment of silence held in the U.K. to mark one year since the country's first lockdown due to the coronavirus. https://t.co/42jrk8eTua https://t.co/M326VytUPQ While some suggest that relaxed mitigation measures could be to blame, others are pointing to the emergence of more contagious variants. https://t.co/nax7OEXX1z Pres. Biden: \"We can ban assault weapons and high capacity magazines in this country once again. I got that done when I was a senator...and it brought down these mass killings. We should do it again.\" https://t.co/SU3APWdrmL https://t.co/8DB3ILRs3M This past weekend's tests are the first to occur during the Biden administration, which has acknowledged reaching out to Kim Jong Un's regime. https://t.co/45Av25ydPm Amid legal battle, NFL and counsel representing former players in league's concussion settlement program appear to agree race should no longer be a factor in determining eligibility for head injury compensation. https://t.co/TWigsO515l This mom's lesson for her kids on anti-Asian violence and the #StopAsianHate movement has gone viral. https://t.co/OYEar7vfHR https://t.co/SaYEerDvRZ Prince William and Kate, the Duke and Duchess of Cambridge, visit a COVID-19 vaccination site at the same location where they wed nearly 10 years ago. https://t.co/DFBiFtKpAS https://t.co/RbpNbibjjb Presidential approval ratings in recent years have been a decent indicator of what will happen in the midterms. https://t.co/b0PIy4WKoR Former Pres. Obama: \"A once-in-a-century pandemic cannot be the only thing that slows mass shootings in this country.\" https://t.co/6W9Go5isdV https://t.co/troZ85GUJe Hillary Clinton: \"Getting back to normal in America cannot mean getting back to regular mass shootings.\" https://t.co/LAIITjJLl1 https://t.co/uvs7xcF1qE As the nation reels from two mass shootings in less than a week, Democratic senators have committed to passing gun control legislation, including an expansion of background check laws. https://t.co/8Z2hY5ilO4 ROO CAN DO IT: Kangaroo cheered on by onlookers as it swims through floodwater to dry land in New South Wales, Australia. https://t.co/HjBuQBjgzV https://t.co/1S01l5nwKN The White House has over the past month increasingly found itself on the defensive as it balances its message that the border is \"closed\" with its stated desire to find safe places for the minors who keep crossing the border unaccompanied by their parents. https://t.co/fAuS00wid0 More than 200 businesses sent a letter to congressional leaders urging action on a federal paid family leave program in any future infrastructure and recovery legislation. https://t.co/FIQdhfzYdp “Black joy is ours, a freedom.” \n\nCulture columnist @SincerelyJenee breaks it down as she proclaims: “Be in the pursuit of happiness, Black people. Share your joy. Take your joy. It’s yours.” #SoulOfANation https://t.co/7uV3UezQMJ \"We couldn't tell exactly where the shooter was—we knew he was getting closer to us.\" https://t.co/ejn1Y3T2wK .@sunny asks @MichelleButeau and @EJthecomic \"what was the moment you knew you were Black?\" on #SoulOfANation's #InTheKitchen https://t.co/z1VHagrOtP #CynthiaErivo to @janai on what Black joy means to her: \"Even in our pain we somehow find light.\" #SoulOfANation https://t.co/MoTVPTT5NB Gun control advocates are making a new attempt to force the gun industry to comply with a California law requiring individual identifiers on all bullet casings. https://t.co/EkwClOFOav The Chicago suburb of Evanston has approved the first phase of a landmark $10 million reparations program that will give housing grants to Black residents targeted by discriminatory policies. https://t.co/NEDO7ILoth RT @ABCNetwork: .@SoulOfANation starts right NOW! We're talking Black Joy with tonight's host @tarajiphenson! #SoulOfANation https://t.co/2… RT @SoulofaNation: HAPPENING RIGHT NOW! With QUEEN @tarajiphenson as tonight's host. Welcome to #SoulOfANation #BlackJoy Watch here: https:… RT @ABCWorldNews: CRISIS AT THE BORDER: New video released by the Biden administration shows close to 4,000 people, many of them children,… CITY LIFE: Pod of dolphins spotted swimming in New York City's East River. https://t.co/sR1GcU44s1 https://t.co/ZRPtZKWgHv Actor George Segal, who was nominated for an Oscar for his role in 1966's “Who’s Afraid of Virginia Woolf?” and starred in the ABC series “The Goldbergs,” has died at the age of 87. https://t.co/N00GT1dyOY https://t.co/axVT7xMgdh Prince Harry, the Duke of Sussex, has landed a new job title at a Silicon Valley startup. https://t.co/JplPUs2n7Z Olivia Munn, Simu Liu and others are denouncing hate against their community. https://t.co/jGIda3iVCo An investigation has determined that last year's deadly Zogg Fire in Northern California was caused by a tree hitting electrical lines owned and operated by PG&amp;E, officials say. The blaze left four people dead and scorched 56,338 acres. https://t.co/UGp7qdR7Zx When asked about threats from Duckworth and Hirono to block nominees until there are more AAPI appointments, Biden said: \"We have the most diverse Cabinet in history. We have a lot of Asian Americans that are in the Cabinet and in sub-Cabinet levels.\" https://t.co/ezD6mkEyAy Sen. Mazie Hirono joined her fellow Asian American colleague in voicing concerns and said that she planned to support Sen. Duckworth in her objection to non-diverse nominees. https://t.co/7MP1HXPkDy \"There's no AAPI representation in the Cabinet. There's not a single AAPI in a Cabinet position. That's not acceptable,\" Sen. Duckworth told reporters, offering a rare criticism of the administration by a Democrat. https://t.co/hHPSHRX0FO Sen. Tammy Duckworth told White House officials that the lack of representation of Asian American Pacific Islanders in Pres. Biden's Cabinet is \"unacceptable,\" saying she will oppose all future non-diverse Biden nominees until the issue is rectified. https://t.co/bbdhOyGOZK Suzanne Fountain is being remembered by friends from Boulder's theater community as a talented, caring person.\n\n\"Just know that she was extremely talented, kind and wise.\" https://t.co/BgkHUsyFUb REEL RESCUE: A Ukrainian man used his fishing rod to pull a boy to safety after the child got stranded on a floating block of ice in the middle of a river. https://t.co/txbQy1tW5q https://t.co/ekwPQXqySS LIVE NOW: @MattGutmanABC is on the ground in Boulder, CO, with the latest on the investigation into yesterday's mass shooting that left 10 dead—and a city grieving. https://t.co/dZQIOUG6Ew https://t.co/lIViAxeluI Postmaster General Louis DeJoy announced plans to slow mail delivery standards and reduce hours at some post offices as part of a 10-year strategy to stabilize the struggling agency. https://t.co/Z0ArW5FeKX The Biden administration released its first official images from inside two Texas migrant detention centers, with @ABC News receiving an exclusive first look at videos and photos produced in recent days by the U.S. government. https://t.co/LnAlNMTuxb Senior Biden administration officials downplayed the launches as \"normal activity\" that was on the low end of the spectrum of provocations from North Korea. https://t.co/dsL70uH9Ql \"Only God knows what will happen next.\" https://t.co/fJlapzy4ZH WATCH LIVE: Our @ABC News team has the latest on the Colorado shooting that left 10 people dead. https://t.co/jYWMvsaaqx 📸: Significant storm damage in Bertram, Texas, after a microburst with straight-line winds up 75 mph hit parts of the city. https://t.co/WbjHFtwbTW https://t.co/uonNpedGYk First lady Jill Biden on Boulder mass shooting: “Ten more lives have been stolen by gun violence.”\n\n“The grief we feel is heartbreakingly familiar, but we cannot become numb to it. We must act now.” https://t.co/cZNVpzAVcJ https://t.co/QumSOExXi3 It’s Republicans under the age of 45 who are really concerned about “cancel culture.” @FiveThirtyEight has more: https://t.co/UiW98kiK1S The president of a major teacher's union is raising concerns about recent CDC guidance that loosens social distancing requirements in classrooms. https://t.co/xmSfhWVwoC Dolphins were spotted in a Venice canal close to St. Mark's Square, as coastguard members and wildlife specialists searched for the animals.\n\nCoronavirus restrictions has brought fewer boat traffic and cleaner waters. https://t.co/Jpp9Hb64Fx https://t.co/MVFyRGaj91 \"This Senate will be different,\" Senate Majority Leader Chuck Schumer says.\n\nhttps://t.co/4a2n5Hxtoo WATCH LIVE: President Joe Biden delivers remarks in Columbus, Ohio. https://t.co/SSxsMXhuo2 Scandal-plagued former Missouri Gov. Eric Greitens announced he's planning to run for Missouri's open Senate seat after Sen. Roy Blunt said he would not run for reelection. https://t.co/cpQM4kutJC RT @SoulofaNation: Watch the full story tonight at 10|9 on #SoulOfANation https://t.co/IWyUdrwNzE \"I would have never imagined that turning on the music and playing would bring so many people together.\"\n \nDJ D-Nice is one of many Black entertainers who connected people virtually during COVID-19—continuing a history of rescuing joy from perilous times. https://t.co/xhBP0C3IAW https://t.co/xmEMusheHl RT @ABCNetwork: Don't miss @tarajiphenson as the host of @SoulOfANation! Plus a performance by the one and only Cynthia Erivo TONIGHT at 10… People placed flowers on the police vehicle of Officer Eric Talley, who was one of 10 people killed at a grocery store in Boulder, Colorado. https://t.co/sIzEjaq8ZW https://t.co/ahgfcdllEk 25-year-old Rikki Old's uncle told @ABC News that his niece was a \"strong, independent\" woman who had worked as a manager at the grocery store for six years. \n\n\"She was so loved, and she will be so missed. We are heartbroken and saddened and devastated.\" https://t.co/2mn37XqR70 A Polish writer is facing up to three years of imprisonment for calling the nation's president a “moron” on social media. https://t.co/GTc3T2lV51 Dr. Anthony FaucI criticized what he described as \"outdated\" information in AstraZeneca’s U.S. vaccine trial as \"unfortunate\" and acknowledged concerns with accuracy could lead to problems getting more Americans to take the vaccine. https://t.co/o2U5MzvGTx Gracie the golden retriever has been busy spreading love and cuddles to nursing home residents in Ohio. https://t.co/j3wfBlXrSx NEW: U.S. official confirms that North Korea fired two short-range missiles sometime over this past weekend. https://t.co/mzMSvT1tdr LIGHT SHOW: Timelapse footage captured an aurora borealis displaying green and purple lights above Chippewa County, Wisconsin. https://t.co/COclhun9rF https://t.co/LRHqzS56pD Stunning aerial footage captures close-up views of lava flowing from Icelandic volcano after rare eruption. https://t.co/wKOJ2CU1Nj https://t.co/klv5vOY54s Authorities in Southern California are investigating a possible hate crime after a man recklessly drove through a red light into a crosswalk where protesters were marching in a \"Stop Asian Hate\" rally. https://t.co/U6NN3F8pDw Atlanta spa shootings revive calls for gun reform: 'This moment has to be different.' https://t.co/D5vzsA6YSg A Korean-American mother's viral lesson has more than 1 million views and counting. https://t.co/GkDkixxLje Proof of vaccination may allow us to begin resuming our normal activities in the near future. https://t.co/sXsOPZXFuG Pres. Biden: \"We can ban assault weapons and high capacity magazines in this country once again. I got that done when I was a senator...and it brought down these mass killings. We should do it again.\" https://t.co/Bce3UYuoCV https://t.co/kPQDzamZFX Pres. Biden on slain officer Eric Talley: \"When he pinned on that badge yesterday morning he didn't know what the day would bring...But when the moment to act came, officer Talley did not hesitate.\" \n\n\"That's the definition of an American hero.\" https://t.co/kW6qN5uKKi https://t.co/59uYG0jwrj The victims of the Boulder mass shooting have been identified. Here are their names.\n\nhttps://t.co/4kmw3PFPcd https://t.co/gzFyWAU7xZ Pres. Biden: \"I don't need to wait another minute, let alone an hour...to urge my colleagues in the House and Senate to act\" on gun reform measures. https://t.co/kW6qN5uKKi https://t.co/FX82NgU7Zg \"We've all been justifiably focused on the pandemic, but this phenomenon of mass shootings has quietly gotten much, much worse, even as the pandemic unfolded,\" @PierreTABC reports after Colorado grocery store shooting. https://t.co/kW6qN5uKKi https://t.co/9EEoFjtYWV Prince William and Kate, the Duke and Duchess of Cambridge, visit a COVID-19 vaccination site at the same location where they wed nearly 10 years ago. https://t.co/gvxpyHZXn4 https://t.co/NtbbHOvSbM NEW: Pres. Biden: \"We can ban assault weapons and high capacity magazines in this country once again. I got that done when I was a senator...and it brought down these mass killings. We should do it again.\" https://t.co/YnJgFCnfWJ https://t.co/R7A08jx2ky JUST IN: Pres. Biden: \"I don't need to wait another minute, let alone an hour...to urge my colleagues in the House and Senate to act\" on gun reform measures. https://t.co/YnJgFCnfWJ https://t.co/BbMhfNLHS4 THE NOTE: The White House was able to count on party unity to carry its first big legislative item forward. But as plans round out for what comes next, concerns are growing about what such unity might cost them from here. https://t.co/WbSSMzxHIi Pres. Biden on slain officer Eric Talley: \"When he pinned on that badge yesterday morning he didn't know what the day would bring...But when the moment to act came, officer Talley did not hesitate.\" \n\n\"That's the definition of an American hero.\" https://t.co/YnJgFCnfWJ https://t.co/Z7JAAew6Y6 Pres. Biden on Boulder mass shooting: \"I even hate to say it, because we're saying it so often: my heart goes out. Our hearts go out for the survivors.\" https://t.co/YnJgFCnfWJ https://t.co/gYH4dZ5gSf Pres. Biden: \"Less than a week after the horrific murders of eight people and the assault on the AAPI community in Georgia, while the flag was still flying half staff for the tragedy, another American city has been scarred by gun violence.\" https://t.co/YnJgFCnfWJ https://t.co/kpigEDGLAm .@ABC News SPECIAL REPORT: Pres. Biden delivers remarks on Colorado grocery store shooting that left 10 people dead. https://t.co/SkErCtQlj3 JUST IN: A full jury has been seated in the murder trial of former Minneapolis police officer Derek Chauvin, who is charged in the death of George Floyd. https://t.co/ojWDi7JkHe \"His life was cut far too short.\"\n\nA procession took place to honor police officer Eric Talley, who was one of ten people killed when a gunman opened fire at a grocery store in Boulder, Colorado on Monday. https://t.co/7zO1TFnB02 https://t.co/Kh4oI29pNc Authorities read names of victims of yesterday's mass shooting in Boulder, CO.\n\n\"Our hearts go out to all the victims killed during this senseless act of violence.\" https://t.co/5xHoVsR59x https://t.co/3JgqMTBP9E Former Pres. Barack Obama: \"A once-in-a-century pandemic cannot be the only thing that slows mass shootings in this country.\" https://t.co/Ghj4CVoBm8 https://t.co/cht4zoxmBF JUST IN: Former Pres. Barack Obama: \"It is long past time for those with the power to fight this epidemic of gun violence to do so.\" https://t.co/HU4DTbUWWk https://t.co/CxHmVEVZZ9 JUST IN: Former Pres. Barack Obama on Boulder mass shooting: \"We should be able to live our lives without wondering if the next trip outside our home could be our last. We should. But in America, we can’t.\" https://t.co/yQia9YodvG https://t.co/3G2meLZIW1 NEW: Pres. Biden orders flags flown at half-staff at the White House in honor of Boulder shooting victims.\n\nLast week, the president ordered flags to fly at half-staff in honor of the Georgia spa shooting victims, an order that expired at sunset Monday. https://t.co/AWMj7o7aF5 Their pleas now come as the nation is rocked by yet a shooting in Colorado. https://t.co/yecdbFVWhO While some suggest that relaxed mitigation measures could be to blame, others are pointing to the emergence of more contagious variants. https://t.co/PRiMfKucPa “To express what I’ve seen in a realistic way, this is the responsibility I’ve given myself. I also hope that much of the history should not be forgotten.” https://t.co/k832oL4pVF Campohermoso, a town of 3,000 people in Boyaca state in the mountains of central Colombia, has no reported cases of the coronavirus. https://t.co/MSJTS3WkLZ Eric Talley, a victim in yesterday's Boulder mass shooting, was the first member of law enforcement to arrive at the scene.\n\nHe \"loved this community,\" Boulder Police Chief Maris Herold says. \"He's everything that policing deserves and needs.\" https://t.co/vsyP9MqXUt https://t.co/M6PUysSFMY NEW: Hillary Clinton: \"Getting back to normal in America cannot mean getting back to regular mass shootings.\" https://t.co/zu4ji5ie9o https://t.co/vITaCeGC9g RT @ABCNewsLive: \"Our objective is to conduct a thorough and meticulous investigation...We encourage the public to share any information th… The slim majority that Democrats hold in the Senate presents an opportunity to advance gun control legislation. https://t.co/A2nMOyTTye The card is more than fodder for selfies, it could be your ticket to freedom in the coming months -- so it should be protected as such. https://t.co/hkkf4jbT4z Boulder County District Attorney Michael Dougherty to victims' families: \"I promise you that all of us here will work tirelessly to support you and help you through this process, and also to make sure that the killer is held...fully accountable.\"https://t.co/kW6qN5uKKi https://t.co/Pj1G2s7YsQ Rescuers recovered at least 15 charred bodies from a Rohingya refugee camp in southern Bangladesh after a devastating fire that destroyed thousands of shelters, officials say. https://t.co/pZI2MILkEg Rep. Joe Neguse: \"This cannot be our new normal. We should be able to feel safe in our grocery stores...in our schools, in our movie theaters, and in our communities.\"\n\n\"We need to see a change, because we have lost far too many lives.\" https://t.co/YnJgFCnfWJ https://t.co/ZJkHrZ1CW3 The military alliance now aims to get ahead of Belgium's vaccine program and have its staff guaranteed to be “virus-free” for a summit in June. https://t.co/qAFZtZrifv \"My heart aches today, and I think all of ours does.\"\n\nColorado Gov. Jared Polis gives remarks on \"senseless\" mass shooting in Boulder that left 10 people dead. https://t.co/YnJgFCnfWJ https://t.co/fmHi6eiivA BREAKING: Authorities identify suspect in Boulder mass shooting. He has been charged with 10 counts of first-degree murder.\n\nhttps://t.co/YnJgFCERlj https://t.co/HbXp3CBsEQ “He loved his kids and his family more than anything.”\n\nFather of police officer Eric Talley shares statement with @ABC News following his son’s death after gunman opened fire at grocery store in Boulder, Colorado. https://t.co/29oh0JDQO4 https://t.co/BxEsnDTypx BREAKING: Authorities read names of victims of yesterday's mass shooting in Boulder, CO. \n\n\"Our hearts go out to all the victims killed during this senseless act of violence.\"\nhttps://t.co/YnJgFCERlj https://t.co/F7V8DD4AFQ ABC News SPECIAL REPORT: Officials give update on mass shooting in Boulder, CO, that left 10 dead, including a police officer. https://t.co/K9Q9guS7dB WATER WAY TO TRAVEL: Amid severe flooding and evacuations in New South Wales Australia, one local man finds a quicker way to make it over drenched fields. https://t.co/fqrcPajbBj https://t.co/LzFadhS8oo Law enforcement officers salute as emergency vehicles escort the body of slain police officer Eric Talley, one of 10 victims in yesterday's fatal mass shooting in Boulder, CO. \n\nTalley had been a member of the Boulder Police Department since 2010. https://t.co/z2k7WrNNYD https://t.co/dDl4GgVZLw \"We couldn't tell exactly where the shooter was—we knew he was getting closer to us.\" https://t.co/RIeqOcN4oB The fire is still not under control six hours later. Firefighters are still battling \"a ton of hot spots\" and have been struggle with water supply problems. https://t.co/v5PIg8En0o NEW: Amid legal battle, NFL and counsel representing former players in league's concussion settlement program appear to agree race should no longer be a factor in determining eligibility for head injury compensation. https://t.co/ZqiXYw3goQ WHO chief says gap between wealthy and less privileged countries on number of vaccines administered is \"becoming more grotesque every day.\" https://t.co/OkXXBF7NkA https://t.co/WmF06bY2tp Russian President Vladimir Putin will be getting his first vaccination against COVID-19, but out of sight of the cameras, his spokesman says. https://t.co/FVNT9HzigS RT @CeciliaVega: I will never forget this story. Meeting 9 and 10 year old boys who migrated alone. Their family’s phone numbers written in… Northern California wildfire that killed four people and destroyed more than 200 buildings last year was sparked when tree branches came into contact with Pacific Gas &amp; Electric power lines, officials say. https://t.co/K5Zj1Ps2n1 STARTING NOW: @ABCNewsLive has the latest headlines from across the globe. @dianermacedo anchors: https://t.co/ex8EYSF6T0 \"One of the hardest parts about being a survivor of gun violence is having to keep showing up. It's learning how to publicly relive the worst moment of your life ... in the hopes that someday someone with power to do something will hear you.\" https://t.co/hiTmEGDySN Firefighters battle massive blaze as fire rips through New York assisted living facility, prompting the evacuation of residents and leading to the partial collapse of the building. https://t.co/far9z8oVWT https://t.co/8N7vswnIGJ Police officers move in on a crowd of partygoers as many take off running in Miami Beach, Florida, after another wild weekend of near-record crowds. One person was detained. https://t.co/SLsWbwMQel https://t.co/COpf8uQaTm The White House has over the past month increasingly found itself on the defensive as it balances its message that the border is \"closed\" with its stated desire to find safe places for the minors who keep crossing the border unaccompanied by their parents. https://t.co/Lxociuolct SURFIN' SAFARI: A Californian surf instructor has been nicknamed 'The Goatfather' as he takes his pet goats to the waves in a bid to help children gain confidence in the water. https://t.co/kMANVoxNUa https://t.co/NIDBNc5jH7 RT @GMA: “When we had gotten out of the store, there were people laying in the street” — Eyewitness and survivor Sarah Moonshadow recounts… According to data from the Stop AAPI Hate coalition, there have been nearly 3,800 anti-Asian incidents reported in the United States since the start of the COVID-19 pandemic. https://t.co/uBU0nk0iFM RT @GMA: At least 10 people, including a police officer, were killed in Boulder, Colorado, on Monday afternoon when a gunman opened fire at… The Biden administration has now released its first official images from inside two Texas migrant detention centers, with @ABC News receiving an exclusive first look at videos and photos produced in recent days by the U.S. government. https://t.co/BGKgsS0dji “Let us take a moment together to remember those who have been lost, to give thanks for their lives, and to acknowledge the inexpressible pain of parting.”\n\nPrince Charles reflects on year since first coronavirus lockdown. https://t.co/T3peBGAvEv https://t.co/DkzWNqCfzN More than 200 businesses sent a letter to congressional leaders urging action on a federal paid family leave program in any future infrastructure and recovery legislation. https://t.co/7GttGpqsEY New York detected its first case of the coronavirus variant initially found in Brazil, known as P.1, joining the ranks of at least 18 states reporting cases of the new variant. https://t.co/p6cmCTP30b Sec. of State Antony Blinken addresses Boulder grocery store shooting in his opening remarks at the NATO headquarters in Brussels, offering his “deepest condolences to the loved ones of those who were killed.” https://t.co/cQ2Uj2kehy https://t.co/xpe9tGhUrd Rep. Deb Haaland, who is the first Native American to lead a Cabinet agency, was photographed wearing an Indigenous-inspired look for her swearing-in ceremony as secretary of interior. https://t.co/EmI1groBbC A Washington mother's viral lesson on the #StopAsianHate movement has more than 1 million views and counting. https://t.co/N5hMfj0e8x ‘WATCH OUT!’ Dashcam footage shows a burning van rolling downhill in Arkansas, with first responders rushing to put out the flames. No injuries reported.\n\nPolice believe the fire may been caused by the vehicle overheating. https://t.co/OJ589NQmgb https://t.co/XcTFbmtPc8 Sinovac says its COVID-19 vaccine is safe in children ages 3-17, based on preliminary data, and it has submitted the data to Chinese drug regulators. https://t.co/l7JmXAvprs NEW: Amid legal battle, NFL and counsel representing former players in league's concussion settlement program appear to agree race-based adjustments should no longer be considered in determining eligibility for head injury compensation. https://t.co/fgVjmfgDdj “Our heart breaks for the lives needlessly lost.”\n\nDenver-based MLB team the Colorado Rockies share statement on Boulder grocery store shooting that left 10 people dead. https://t.co/TZp70yXhJW https://t.co/KedcYB554M Results from a U.S. trial of AstraZeneca's COVID-19 vaccine may have used \"outdated information,\" U.S. federal health officials say. https://t.co/wJ76GQE2sP “As spring sprung this weekend, and vaccines continue to get into arms, lightness creeped back in only for the darkness to descend on us again.”\n\nColorado Gov. Jared Polis on Boulder grocery store shooting that left 10 people dead. https://t.co/TW3xzV8Fua https://t.co/QjnSS2asSl Former Pres. Trump backs GOP congressman's bid against Georgia Secretary of State Brad Raffensperger. https://t.co/6fXBZjmMYc Now, that's talent: Adorable Siberian Husky mimics owner saying \"I love you.\" https://t.co/6mq3b6zWpw https://t.co/I2WeoDBvuo “He loved his kids and his family more than anything.”\n\nFather of police officer Eric Talley shares statement with @ABC News following his son’s death after gunman opened fire at grocery store in Boulder, Colorado. https://t.co/46wS9sW3SC https://t.co/8B7jXHNDjb Gracie the golden retriever has been busy spreading love and cuddles to nursing home residents in Ohio. https://t.co/WlMCwSKE4s New photos show an overcrowded Border Patrol tent for migrants. Journalists have not been allowed to visit the facilities. https://t.co/c1ak6hr8JX Birds flew low over icy Lake Erie at sunrise in Ontario, creating a picturesque scene. https://t.co/TLKsJVjxHB https://t.co/wMUtaj6rj1 \"My Savior\" features a variety of hymns the \"American Idol\" winner grew up singing. https://t.co/GBBGSBHtQf To make getting a shot even sweeter, Krispy Kreme is offering a free original glazed doughnut to anyone who shows their COVID-19 vaccination card. https://t.co/LwF5MOPCWY It’s Republicans under the age of 45 who are really concerned about “cancel culture.” @FiveThirtyEight has more: https://t.co/sXkm6H9Rob SHADOW PLAY: Grand Canyon ravens swoop and dive in soaring courtship display. https://t.co/585YKaaSZJ https://t.co/a8G3PFOdjV Two COVID-19 PCR test collection kits are officially available for on-demand delivery through DoorDash. https://t.co/KDJ7x9ybxB Due to Washington's status as a federal district rather than a territory, Mayor Bowser was unable to call up the National Guard to support overwhelmed Capitol police officers during the Jan. 6 Capitol assault. https://t.co/anNy8jlmKr Ten people are dead, including one Boulder police officer, after Colorado grocery store shooting, authorities say. https://t.co/xvBXLynX9V The trips are part of what administration officials describe as “ongoing discussions on how to manage an effective and humane plan of action on migration.” https://t.co/zouA146c2a \"I'm six months in and I'm still experiencing symptoms.\"\n\nFor millions of people, surviving COVID-19 has been the starting point of a longer journey—one that is poorly understood and increasingly consequential as the the world grapple with the pandemic. https://t.co/dETpMdDzFT https://t.co/ONuF92ZcuT Long-awaited preliminary data from final-stage U.S. testing of the AstraZeneca vaccine shows the two-dose shot is highly effective in all age and ethnicity groups, stopped hospitalization in all cases and did not raise the overall risk of blood clots. https://t.co/JANHtEuGxb PEACEFUL PIANO: A pianist helped set a calm tone for animals at a zoo in Colombia, performing classical compositions for zebras, lions and flamingos. https://t.co/mbloyXEC9u https://t.co/LYAfExIujP Colorado Sen. Michael Bennet issues statement on Boulder grocery shooting that has left 10 people dead, including one police officer: \"Enough is enough.\" https://t.co/Eo0zM38LxO https://t.co/vefRhTQa2w The treatment that infuses blood plasma from recovered COVID patients into people newly infected in hopes of boosting their immune response has not lived up to early hype. Via @InsideScience. https://t.co/7hdb6qdTeN The president also said the team won't compete in national events for two years. https://t.co/8RtQ3lOfte Boulder Police Chief Maris Herold commends “heroic action” of Police Officer Eric Talley, who was fatally shot after being the first officer to arrive on the scene of deadly grocery store shooting. https://t.co/Wlv0hSVmZT https://t.co/fszdOta7YV BREAKING:  Boulder Police Chief Maris Herold says “10 fatalities at the scene,” including officer, after grocery store shooting. https://t.co/Wlv0hSDM8l https://t.co/ScEWoUQtL4 HAPPENING NOW: Boulder police chief gives update after deadly shooting at Colorado grocery store. https://t.co/Wlv0hSVmZT https://t.co/YF2zn6PxAn ANOTHER PLANET: Drone footage shows the otherworldly scene around an erupting volcano in Iceland. https://t.co/Efv4IN5pcx https://t.co/HcFufW05RE RT @GMA: TOMORROW ON GMA: Dr. Fauci, who's now the Chief Medical Adviser to President Biden, joins us to talk about vaccine progress nation… GOP Rep. Tom Reed apologized to the woman who accused him of sexual misconduct last week and said that he will not seek to get elected for any office once his term ends. https://t.co/dxaTy3sGCU HAPPENING NOW: Procession for Boulder police officer killed in Colorado grocery store shooting. Authorities said at a press conference that “multiple” people were killed and a person of interest is in custody. https://t.co/Wlv0hSVmZT https://t.co/z5vx0Xm4vM LATEST: Multiple people killed, including a police officer, after suspect opens fire at a King Soopers grocery store in Boulder, Colorado. A person of interest, who was wounded during the incident, was taken into custody, authorities said. https://t.co/povroMXD7i He's the second pro-Trump Republican to launch a campaign to replace Sen. Shelby. https://t.co/7J9Aa0n33y Hospital visits for opioid overdoses rose 29% in 2020. https://t.co/vOYRuCKGQJ “We are very early in the investigation. We are still processing the scene,” says Boulder Police Commander Kerry Yamaguchi when asked by a reporter if he can say how many people were killed in grocery store shooting. https://t.co/Wlv0hSDM8l https://t.co/JUNk03L12Z BREAKING: Person of interest in custody after deadly shooting at Colorado grocery store, authorities say. https://t.co/Wlv0hSDM8l https://t.co/LsBYd1yNUd BREAKING: Multiple people killed in shooting at Colorado grocery store, including one Boulder police officer, authorities confirm. https://t.co/Wlv0hSDM8l https://t.co/UfpEoUw3PN Just days after he loosened COVID-19 restrictions for businesses, New Jersey Gov. Phil Murphy announced that an indefinite pause is being implemented on further measures to reopen the state because of the coronavirus variants circling the country. https://t.co/fSzKThZBWd LIVE COVERAGE: Officials give update on reported shooting. (KMGH-TV) https://t.co/OyfeQVVOTO RT @ABCWorldNews: OVERCROWDED CONDITIONS: New images reveal the cramped conditions where many unaccompanied minors are being held, with @Ce… JUST IN: White House press secretary Jen Psaki says Pres. Biden “has been briefed on the shooting in Colorado and he will be kept up to date by his team as there are additional developments.” https://t.co/ZnBVquU3wg https://t.co/RTGXtBWuBh Over the last week, more than a dozen states have seen increases in their daily case averages. https://t.co/7BPVwoPDQ8 RT @ABCPolitics: NEW: Attorney General Merrick Garland has been briefed on the shooting in Boulder, a Department of Justice official told @… Long-haulers describe feeling lost, hopeful and irrevocably changed. \n\nRead about their stories: https://t.co/KZFCP5uBYy RT @ABCNewsLive: \"It's still an active scene although it does appear as if police have now secured that grocery store,\" @kaynawhitworth rep… NCAA officials apologized for \"dropping the ball\" after providing women's basketball players with training facilities inferior to men's during the Division 1 tournaments. https://t.co/iYkY70R7oe NEW: Colorado Gov. Polis tweets statement on 'active situation' in Boulder: \"We are making every public safety resource available to assist the Boulder County Sheriff's Department as they work to secure the store.\" https://t.co/EbXzgYg3qP https://t.co/OxWxsO9PFX", "bag_of_tweets": ["The president of a major teacher's union is raising concerns about recent CDC guidance that loosens social distancing requirements in classrooms. https://t.co/TqaXPPS36R", "Jersey City to provide \"health buses\" for people who are homeless to shower, do laundry. https://t.co/g5mEYWkiN1", "Deadlock in the 120-seat parliament was a real possibility a day after the election, which had been dominated by Netanyahu’s polarizing leadership. https://t.co/ocBFrLG4Rw", "A crane being used during a film shoot fell onto a home in Pasadena, California, injuring one person.\n\nWhile no serious injuries were reported, three people were displaced, officials said. https://t.co/snGcov4AyC https://t.co/G6i4eBBe64", "WATCH LIVE: Our @ABC News team breaks down what you need to know about the fatal Boulder shooting. Plus, we have an update on the COVID-19 pandemic. https://t.co/0W5Gx9Jn7w", "Prince Harry, the Duke of Sussex, has landed a new job title at a Silicon Valley startup. https://t.co/entaFsUyAa", "Kim Janey was sworn in as mayor of Boston, becoming the first Black person and first woman to hold the office.\n\nJaney became acting mayor earlier this week when former mayor Marty Walsh was confirmed as Pres. Joe Biden's Secretary of Labor. https://t.co/jmQR1NT9Ea https://t.co/NHsCjPooZ4", "NEW: Pres. Biden taps Vice Pres. Kamala Harris to lead his administration's effort to stem migration from Central America. https://t.co/oLxNEhPnSs", "In a historic first, NASA will attempt to launch a helicopter into flight on Mars next month. https://t.co/u8sMz1bf7W", "Students of color more likely to be stuck in virtual learning during the COVID-19 pandemic compared with their white counterparts, according to new data released by the Biden administration. https://t.co/WeETrTWvvI", "Hang on to that COVID-19 vaccination card -- it’s important. https://t.co/EbKiYChgx5", "Oscar-nominated actor George Segal died Tuesday, his rep confirmed to @ABC News. He was 87. https://t.co/4qzDhUHQKV", "Prince Harry, the Duke of Sussex, has landed a new job title at a Silicon Valley startup. https://t.co/OJL3MCJPgA", "An Indiana man is accused of inciting a riot in Miami Beach amid a surge of tourists in the city, according to authorities. https://t.co/x4HbYMfmU8", "#CynthiaErivo to @janai on what Black joy means to her: \"Even in our pain we somehow find light.\"\n\nThe newest episode of @SoulofaNation now streaming on @hulu. https://t.co/l9npIC6P5H\n\n#SoulOfANation https://t.co/za8s04iHEf", "\"Today is a new day. I stand before you as the first woman and the first Black mayor of Boston, the city that I love. I come to this day with life experience that is different from the men who came before me,\" @Kim_Janey says. https://t.co/IiZ18HiXoZ https://t.co/ziSkv9ZzP9", "Federal prosecutors reveal a previously undisclosed message from a member of the Oath Keepers, in which they discussed an \"alliance\" between three separate far-right groups that planned to travel to Washington on Jan. 6. https://t.co/x2buSXodQ5", "A large container ship ran aground in Egypt's Suez Canal early on Tuesday, blocking navigation in the vital waterway for more than 24 hours, officials have said. https://t.co/iiW3P3mLRJ https://t.co/LD9ijdjFzm", "EXCLUSIVE: How suicide prevention is getting a boost from artificial intelligence. https://t.co/dvKTKXFydk", "NEW: Kim Janey makes history as she is sworn in as Boston's first Black and female mayor. https://t.co/IiZ18HiXoZ https://t.co/yHrrUBh8qD", "\"It is incredible to consider just how far we have come,\" Rep. @AyannaPressley says, about Kim Janey becoming the first Black person and first woman to be sworn in as mayor of Boston. https://t.co/IiZ18HiXoZ https://t.co/BOxJFErfB2", "A rhino enjoyed a temporary pool created by torrential rain at Mogo Wildlife Park in New South Wales. https://t.co/q0lVrZ88BL https://t.co/GMCTxbS9xJ", "SpaceX deployed 60 Starlink satellites, which will provide additional support for its internet satellite constellation system, into orbit from Cape Canaveral, Florida. https://t.co/7V3ieCBx4N https://t.co/GCC7gj9swv", "India's lockdown, among the strictest anywhere, lasted for 68 days, and some form of it remained in force for months before it eventually was lifted. Since the pandemic began, India has had 11.6 million cases and more than 160,000 people have died. https://t.co/nHY7157qVV", "Senate Majority Leader Chuck Schumer: \"If one political party believes that when you lose an election, the answer isn't to win more votes but rather to try and prevent the other side from voting, we have an existential threat to democracy on our hands.\" https://t.co/xY8G8YiI04 https://t.co/qYSYlXcM9t", "GLIDING ON ICE: Ice yachters brave the Siberian cold to glide across the world's deepest frozen lake in Irkutsk, Russia. https://t.co/BWgONXs1Ut https://t.co/EjTihVMLLx", "Senate Majority Leader Chuck Schumer slams GOP over Georgia voting rights bill, drawing comparisons to Jim Crow laws: \"Why are you so afraid of democracy?\" https://t.co/HBDJIYWgqh https://t.co/FWTKhM5vss", "AFTER THE FLOOD - SPIDERS: Experts in Australia are warning that recent floods have created conditions likely to lead to a plague of deadly funnel web spiders. https://t.co/s94bIIwkK5 https://t.co/6pSZbmumtH", "Senate Majority Leader Chuck Schumer on proposal from Arizona lawmaker to require absentee ballots to be notarized: \"How are poor people going to pay for a notary?...It's one of the most despicable things I have seen in all my years. Shame!\" https://t.co/xY8G8YiI04 https://t.co/Ky5bik9Ibt", "\"The accident is mainly due to the lack of visibility resulting from bad weather conditions as the country passes through a dust storm, with wind speed reaching 40 knots,\" Suez Canal Authority Chairman Osama Rabie said in a statement. https://t.co/DXMQGcQeFn", "Migrants are being released from custody in Texas before they have court dates, a practice Republicans say is the latest example of the Biden administration's struggle to handle the surge at the border. https://t.co/lEfSjlGHUj", "Senate Majority Leader Schumer at hearing on voting rights: \"Instead of doing what you should be doing when you lose an election in a democracy—attempting to win over those voters in the next election—Republicans instead are trying to disenfranchise those voters. Shame on them.\" https://t.co/Io83FgBl8N", "The Chicago suburb of Evanston has approved the first phase of a landmark $10 million reparations program that will give housing grants to Black residents targeted by discriminatory policies. https://t.co/kZ43BShMNO", "Kim Janey being sworn in as first Black, first woman mayor of Boston. https://t.co/ruRFzOeutY", "Thein Zaw was one of nine media workers taken into custody during the Feb. 27 street protest in Yangon, the country’s largest city, and had been held without bail. About 40 journalists have been detained or charged since the Feb. 1 coup. https://t.co/7ALWdqOQQN", "DOWNTOWN DESTROYED: Strong winds brought down buildings and caused roof damage over two blocks in Bertram, Texas. https://t.co/cbBquzWFml https://t.co/XQcQDUupn3", "\"Only God knows what will happen next.\" https://t.co/M4LWhuC9mb", "REEL RESCUE: A Ukrainian man used his fishing rod to pull a boy to safety after the child got stranded on a floating block of ice in the middle of a river. https://t.co/mYmm7gwwX1 https://t.co/DMCCLGQpPS", "@ABCPolitics MORE: Committee Chair Carolyn Maloney says the hearing will focus on disparities that have been exacerbated by the coronavirus pandemic. https://t.co/w7drLeIFeK\n\nWatch live: https://t.co/6LuwRDSqEE", "RT @ABCPolitics: WATCH LIVE: Congress holds hearing on gender pay gap; soccer star Megan Rapinoe to testify. https://t.co/F0lmukHl4o", "Plagues, fires, war — London has survived them all. But it has never had a year like this. The coronavirus has killed more than 15,000 Londoners and shaken the foundations of one of the world’s great cities. https://t.co/WMLaugLnQo", "25-year-old Rikki Old's uncle told @ABC News that his niece was a \"strong, independent\" woman who had worked as a manager at the grocery store for six years. \n\n\"She was so loved, and she will be so missed. We are heartbroken and saddened and devastated.\" https://t.co/UD1OdXKjnv", "“Let’s-a go!”\n\nMario leaps into the real world as Super Nintendo World opens in Japan. https://t.co/5RDWEm3vIJ https://t.co/gmQuJ2avrz", "To make getting a shot even sweeter, Krispy Kreme is offering a free original glazed doughnut to anyone who shows their COVID-19 vaccination card. https://t.co/8HnsNXQYxS", "BURIED: Days of heavy rain have brought deadly floods to Australia and also caused a landslide which swamped this mountain road, trapping one vehicle. https://t.co/jumK6pkmXi https://t.co/OepcyZpGJW", "The Pacific Beach Coalition recently noticed a dramatic increase in discarded PPE on beaches in and around the city of Pacifica, south of San Francisco, where it's been doing monthly cleanups for nearly 25 years. https://t.co/jzMxN95e1Y", "\"I asked her to come and leave in an Uber,\" Angela Right, owner of Azura Jewelry said, \"and when she gets home, she needs to text me.\" https://t.co/1LajjURpym", "Adults under lockdown orders gained more than half a pound every 10 days, according to a study published in JAMA (Journal of the American Medical Association) Network Open. https://t.co/X2IlcIAQ1x", "\"I still have what I feel like is a 48-hour memory.\" https://t.co/2skjijte8D", "\"There is a piece of my heart that's gone. It's just unimaginable, I can't even explain to you,\" 20-year-old Stone Foltz's mother, Shari, said in an exclusive interview airing Wednesday on @GMA https://t.co/gTUYmJYv3l", "WEATHER: Major severe weather outbreak expected in South, tornadoes possible. https://t.co/FiQO67OeR4", "Scandal-plagued former Missouri Gov. Eric Greitens announced he's planning to run for Missouri's open Senate seat after Sen. Roy Blunt said he would not run for reelection. https://t.co/oexVHoFNC8", "Those who lost their lives at the King Soopers store in Boulder ranged from 20 years old to 65. They included a magazine photographer, a Medicare agent with a passion for theater and others going about their days at a busy shopping plaza. https://t.co/dklE3JZBLj", "STARTING NOW: @ABC News has the latest headlines from across the globe. Diane Macedo anchors: https://t.co/0C07CgRqg4", "📸 An aerial view shows a burial at the Vila Formosa cemetery in Sao Paulo, Brazil during the coronavirus pandemic. Brazil's daily COVID-19 death toll soared past 3,000 for the first time this week as the country struggled to contain a surge in cases. https://t.co/zTtKdDz7Kd https://t.co/C0vM0fJN4W", "“We celebrate his life and legacy every day at Paisley Park, a place that Prince wanted to share with the world,” Paisley Park Executive Director Alan Seiffert said. “We acknowledge the incredible force and inspiration Prince is in people’s lives.\" https://t.co/EDKBKc6bbm", "DEEP SEA TRAGEDY: Devastating underwater footage show how Rio's sea life is under threat as trash and pollution swamps the ocean. https://t.co/Ks4Vo26cZp https://t.co/5dUPwxBlMr", "First lady Jill Biden on Boulder mass shooting: “Ten more lives have been stolen by gun violence.”\n\n“The grief we feel is heartbreakingly familiar, but we cannot become numb to it. We must act now.” https://t.co/LMN3TJhDxr https://t.co/cNOf8sa76L", "\"They were like, 'Well you haven't seen him or what he looks like.' And I'm like, I really don't care what he looks like. As long as he's a pit bull, I'll take him.\" https://t.co/YXtWLdB9AZ", "\"It's going to be a case the likes of which none of us have seen before,\" David Weinstein, a former federal and state prosecutor in Florida, told @ABC \"It's a case that's so important on so many levels to so many people.\" https://t.co/gcqHciBBGg", "“When there’s something about the case that resonates with you and that you identify with, it’s going to have a pretty significant impact.\" https://t.co/ZeeFMj7TNi", "March 24 marks Equal Pay Day for women, the day that women have to work into 2021 to make what white, non-Hispanic men earned in 2020 alone. https://t.co/Y04FPzl4KI", "The decision not to require public disclosures from those officials comes as the Biden administration has publicly released financial disclosure forms for dozens of other White House aides. https://t.co/cIL8CFq7JB", "“This is an extraordinarily difficult time for the fire services,” Clarkstown Supervisor George Hoehmann said. “Our thoughts and prayers are with the bravest and the fellow firefighters of Spring Valley who lost a brother.” https://t.co/TJ2sLTIgcm", "Not including suicides, 19,380 people died by gun violence in 2020, up from 15,440 in 2019, according to Gun Violence Archive, a nonprofit research group. In the five years prior, non-suicide gun deaths fluctuated between 12,000 and 15,500 annually. https://t.co/wYulIfErUT", "Deadlock in the 120-seat parliament was a real possibility a day after the election, which had been dominated by Netanyahu’s polarizing leadership. https://t.co/lR97AKeQ5a", "CITY LIFE: Pod of dolphins spotted swimming in New York City's East River. https://t.co/YORPxYmhgx https://t.co/vi7yz0Wzco", "REEL RESCUE: A Ukrainian man used his fishing rod to pull a boy to safety after the child got stranded on a floating block of ice in the middle of a river. https://t.co/alJZBhwK5r https://t.co/l7HQWBLsnZ", "ROCK BLOCK: Australia's famous Uluru, also known as Ayers Rock, is submerged in water as the effects of the worst flooding in half a century are seen across parts of the country. https://t.co/hv0Mizc3Jk https://t.co/dNvAG9PRTc", "People placed flowers on the police vehicle of Officer Eric Talley, who was one of 10 people killed at a grocery store in Boulder, Colorado. https://t.co/LZv6zxd2uE https://t.co/ULB1kyWIsW", "Witnesses outside Insein Prison in Yangon saw busloads of mostly young people, looking happy with some flashing the three-finger gesture of defiance adopted by the protest movement. State-run TV said a total of 628 were freed. https://t.co/6lsahNc35h", "The president of a major teacher's union is raising concerns about recent CDC guidance that loosens social distancing requirements in classrooms. https://t.co/ynUxpLqtfU", "Two COVID-19 PCR test collection kits are officially available for on-demand delivery through DoorDash. https://t.co/2wXL8ozbPg", "Prime Minister Scott Morrison expressed the Parliament’s condolences to the family of the man who died at Glenorie. Morrison said his own policeman father had taken their family camping near Glenorie every Easter. https://t.co/7Qrb0iUD2Q", "LIGHT SHOW: Timelapse footage captured an aurora borealis displaying green and purple lights above Chippewa County, Wisconsin. https://t.co/5Min7kRagf https://t.co/kVM96Q5lRK", "Hang on to that COVID-19 vaccination card -- it’s important. https://t.co/wNv0Co76FD", "SHADOW PLAY: Grand Canyon ravens swoop and dive in soaring courtship display. https://t.co/Ehs5x9Dbso https://t.co/TGo7Pc7iF3", "Dolphins were spotted in a Venice canal close to St. Mark's Square, as coastguard members and wildlife specialists searched for the animals.\n\nCoronavirus restrictions has brought fewer boat traffic and cleaner waters. https://t.co/MaApBKFGXN https://t.co/kAESVfpCgp", "SURFIN' SAFARI: A Californian surf instructor has been nicknamed 'The Goatfather' as he takes his pet goats to the waves in a bid to help children gain confidence in the water. https://t.co/tM5ZMa1tar https://t.co/g8oVR2VaRC", "Authorities in Southern California are investigating a possible hate crime after a man recklessly drove through a red light into a crosswalk where protesters were marching in a \"Stop Asian Hate\" rally. https://t.co/nIQSMyk3BQ", "Dr. Anthony FaucI criticized what he described as \"outdated\" information in AstraZeneca’s U.S. vaccine trial as \"unfortunate\" and acknowledged concerns with accuracy could lead to problems getting more Americans to take the vaccine. https://t.co/C0C9K7gNxL", "Prince Harry, the Duke of Sussex, has landed a new job title at a Silicon Valley startup. https://t.co/EkGrL09IB9", "Although vaccine studies are still ongoing, the vaccine brand and lot number listen on your card could be relevant when the time comes for a booster dose. https://t.co/QKuz1qv9Px", "For the first time in six months, Cineworld's Regal Cinemas chain will reopen, following shutdowns related to the COVID-19 pandemic. https://t.co/aRnfiT5J8L", "Colorado's tragic and prolific history of mass shootings from Columbine to King Soopers: https://t.co/XVvB54PMuw", "Staff at the Bradford Royal Infirmary took part in a moment of silence held in the U.K. to mark one year since the country's first lockdown due to the coronavirus. https://t.co/42jrk8eTua https://t.co/M326VytUPQ", "While some suggest that relaxed mitigation measures could be to blame, others are pointing to the emergence of more contagious variants. https://t.co/nax7OEXX1z", "Pres. Biden: \"We can ban assault weapons and high capacity magazines in this country once again. I got that done when I was a senator...and it brought down these mass killings. We should do it again.\" https://t.co/SU3APWdrmL https://t.co/8DB3ILRs3M", "This past weekend's tests are the first to occur during the Biden administration, which has acknowledged reaching out to Kim Jong Un's regime. https://t.co/45Av25ydPm", "Amid legal battle, NFL and counsel representing former players in league's concussion settlement program appear to agree race should no longer be a factor in determining eligibility for head injury compensation. https://t.co/TWigsO515l", "This mom's lesson for her kids on anti-Asian violence and the #StopAsianHate movement has gone viral. https://t.co/OYEar7vfHR https://t.co/SaYEerDvRZ", "Prince William and Kate, the Duke and Duchess of Cambridge, visit a COVID-19 vaccination site at the same location where they wed nearly 10 years ago. https://t.co/DFBiFtKpAS https://t.co/RbpNbibjjb", "Presidential approval ratings in recent years have been a decent indicator of what will happen in the midterms. https://t.co/b0PIy4WKoR", "Former Pres. Obama: \"A once-in-a-century pandemic cannot be the only thing that slows mass shootings in this country.\" https://t.co/6W9Go5isdV https://t.co/troZ85GUJe", "Hillary Clinton: \"Getting back to normal in America cannot mean getting back to regular mass shootings.\" https://t.co/LAIITjJLl1 https://t.co/uvs7xcF1qE", "As the nation reels from two mass shootings in less than a week, Democratic senators have committed to passing gun control legislation, including an expansion of background check laws. https://t.co/8Z2hY5ilO4", "ROO CAN DO IT: Kangaroo cheered on by onlookers as it swims through floodwater to dry land in New South Wales, Australia. https://t.co/HjBuQBjgzV https://t.co/1S01l5nwKN", "The White House has over the past month increasingly found itself on the defensive as it balances its message that the border is \"closed\" with its stated desire to find safe places for the minors who keep crossing the border unaccompanied by their parents. https://t.co/fAuS00wid0", "More than 200 businesses sent a letter to congressional leaders urging action on a federal paid family leave program in any future infrastructure and recovery legislation. https://t.co/FIQdhfzYdp", "“Black joy is ours, a freedom.” \n\nCulture columnist @SincerelyJenee breaks it down as she proclaims: “Be in the pursuit of happiness, Black people. Share your joy. Take your joy. It’s yours.” #SoulOfANation https://t.co/7uV3UezQMJ", "\"We couldn't tell exactly where the shooter was—we knew he was getting closer to us.\" https://t.co/ejn1Y3T2wK", ".@sunny asks @MichelleButeau and @EJthecomic \"what was the moment you knew you were Black?\" on #SoulOfANation's #InTheKitchen https://t.co/z1VHagrOtP", "#CynthiaErivo to @janai on what Black joy means to her: \"Even in our pain we somehow find light.\" #SoulOfANation https://t.co/MoTVPTT5NB", "Gun control advocates are making a new attempt to force the gun industry to comply with a California law requiring individual identifiers on all bullet casings. https://t.co/EkwClOFOav", "The Chicago suburb of Evanston has approved the first phase of a landmark $10 million reparations program that will give housing grants to Black residents targeted by discriminatory policies. https://t.co/NEDO7ILoth", "RT @ABCNetwork: .@SoulOfANation starts right NOW! We're talking Black Joy with tonight's host @tarajiphenson! #SoulOfANation https://t.co/2…", "RT @SoulofaNation: HAPPENING RIGHT NOW! With QUEEN @tarajiphenson as tonight's host. Welcome to #SoulOfANation #BlackJoy Watch here: https:…", "RT @ABCWorldNews: CRISIS AT THE BORDER: New video released by the Biden administration shows close to 4,000 people, many of them children,…", "CITY LIFE: Pod of dolphins spotted swimming in New York City's East River. https://t.co/sR1GcU44s1 https://t.co/ZRPtZKWgHv", "Actor George Segal, who was nominated for an Oscar for his role in 1966's “Who’s Afraid of Virginia Woolf?” and starred in the ABC series “The Goldbergs,” has died at the age of 87. https://t.co/N00GT1dyOY https://t.co/axVT7xMgdh", "Prince Harry, the Duke of Sussex, has landed a new job title at a Silicon Valley startup. https://t.co/JplPUs2n7Z", "Olivia Munn, Simu Liu and others are denouncing hate against their community. https://t.co/jGIda3iVCo", "An investigation has determined that last year's deadly Zogg Fire in Northern California was caused by a tree hitting electrical lines owned and operated by PG&amp;E, officials say. The blaze left four people dead and scorched 56,338 acres. https://t.co/UGp7qdR7Zx", "When asked about threats from Duckworth and Hirono to block nominees until there are more AAPI appointments, Biden said: \"We have the most diverse Cabinet in history. We have a lot of Asian Americans that are in the Cabinet and in sub-Cabinet levels.\" https://t.co/ezD6mkEyAy", "Sen. Mazie Hirono joined her fellow Asian American colleague in voicing concerns and said that she planned to support Sen. Duckworth in her objection to non-diverse nominees. https://t.co/7MP1HXPkDy", "\"There's no AAPI representation in the Cabinet. There's not a single AAPI in a Cabinet position. That's not acceptable,\" Sen. Duckworth told reporters, offering a rare criticism of the administration by a Democrat. https://t.co/hHPSHRX0FO", "Sen. Tammy Duckworth told White House officials that the lack of representation of Asian American Pacific Islanders in Pres. Biden's Cabinet is \"unacceptable,\" saying she will oppose all future non-diverse Biden nominees until the issue is rectified. https://t.co/bbdhOyGOZK", "Suzanne Fountain is being remembered by friends from Boulder's theater community as a talented, caring person.\n\n\"Just know that she was extremely talented, kind and wise.\" https://t.co/BgkHUsyFUb", "REEL RESCUE: A Ukrainian man used his fishing rod to pull a boy to safety after the child got stranded on a floating block of ice in the middle of a river. https://t.co/txbQy1tW5q https://t.co/ekwPQXqySS", "LIVE NOW: @MattGutmanABC is on the ground in Boulder, CO, with the latest on the investigation into yesterday's mass shooting that left 10 dead—and a city grieving. https://t.co/dZQIOUG6Ew https://t.co/lIViAxeluI", "Postmaster General Louis DeJoy announced plans to slow mail delivery standards and reduce hours at some post offices as part of a 10-year strategy to stabilize the struggling agency. https://t.co/Z0ArW5FeKX", "The Biden administration released its first official images from inside two Texas migrant detention centers, with @ABC News receiving an exclusive first look at videos and photos produced in recent days by the U.S. government. https://t.co/LnAlNMTuxb", "Senior Biden administration officials downplayed the launches as \"normal activity\" that was on the low end of the spectrum of provocations from North Korea. https://t.co/dsL70uH9Ql", "\"Only God knows what will happen next.\" https://t.co/fJlapzy4ZH", "WATCH LIVE: Our @ABC News team has the latest on the Colorado shooting that left 10 people dead. https://t.co/jYWMvsaaqx", "📸: Significant storm damage in Bertram, Texas, after a microburst with straight-line winds up 75 mph hit parts of the city. https://t.co/WbjHFtwbTW https://t.co/uonNpedGYk", "First lady Jill Biden on Boulder mass shooting: “Ten more lives have been stolen by gun violence.”\n\n“The grief we feel is heartbreakingly familiar, but we cannot become numb to it. We must act now.” https://t.co/cZNVpzAVcJ https://t.co/QumSOExXi3", "It’s Republicans under the age of 45 who are really concerned about “cancel culture.” @FiveThirtyEight has more: https://t.co/UiW98kiK1S", "The president of a major teacher's union is raising concerns about recent CDC guidance that loosens social distancing requirements in classrooms. https://t.co/xmSfhWVwoC", "Dolphins were spotted in a Venice canal close to St. Mark's Square, as coastguard members and wildlife specialists searched for the animals.\n\nCoronavirus restrictions has brought fewer boat traffic and cleaner waters. https://t.co/Jpp9Hb64Fx https://t.co/MVFyRGaj91", "\"This Senate will be different,\" Senate Majority Leader Chuck Schumer says.\n\nhttps://t.co/4a2n5Hxtoo", "WATCH LIVE: President Joe Biden delivers remarks in Columbus, Ohio. https://t.co/SSxsMXhuo2", "Scandal-plagued former Missouri Gov. Eric Greitens announced he's planning to run for Missouri's open Senate seat after Sen. Roy Blunt said he would not run for reelection. https://t.co/cpQM4kutJC", "RT @SoulofaNation: Watch the full story tonight at 10|9 on #SoulOfANation https://t.co/IWyUdrwNzE", "\"I would have never imagined that turning on the music and playing would bring so many people together.\"\n \nDJ D-Nice is one of many Black entertainers who connected people virtually during COVID-19—continuing a history of rescuing joy from perilous times. https://t.co/xhBP0C3IAW https://t.co/xmEMusheHl", "RT @ABCNetwork: Don't miss @tarajiphenson as the host of @SoulOfANation! Plus a performance by the one and only Cynthia Erivo TONIGHT at 10…", "People placed flowers on the police vehicle of Officer Eric Talley, who was one of 10 people killed at a grocery store in Boulder, Colorado. https://t.co/sIzEjaq8ZW https://t.co/ahgfcdllEk", "25-year-old Rikki Old's uncle told @ABC News that his niece was a \"strong, independent\" woman who had worked as a manager at the grocery store for six years. \n\n\"She was so loved, and she will be so missed. We are heartbroken and saddened and devastated.\" https://t.co/2mn37XqR70", "A Polish writer is facing up to three years of imprisonment for calling the nation's president a “moron” on social media. https://t.co/GTc3T2lV51", "Dr. Anthony FaucI criticized what he described as \"outdated\" information in AstraZeneca’s U.S. vaccine trial as \"unfortunate\" and acknowledged concerns with accuracy could lead to problems getting more Americans to take the vaccine. https://t.co/o2U5MzvGTx", "Gracie the golden retriever has been busy spreading love and cuddles to nursing home residents in Ohio. https://t.co/j3wfBlXrSx", "NEW: U.S. official confirms that North Korea fired two short-range missiles sometime over this past weekend. https://t.co/mzMSvT1tdr", "LIGHT SHOW: Timelapse footage captured an aurora borealis displaying green and purple lights above Chippewa County, Wisconsin. https://t.co/COclhun9rF https://t.co/LRHqzS56pD", "Stunning aerial footage captures close-up views of lava flowing from Icelandic volcano after rare eruption. https://t.co/wKOJ2CU1Nj https://t.co/klv5vOY54s", "Authorities in Southern California are investigating a possible hate crime after a man recklessly drove through a red light into a crosswalk where protesters were marching in a \"Stop Asian Hate\" rally. https://t.co/U6NN3F8pDw", "Atlanta spa shootings revive calls for gun reform: 'This moment has to be different.' https://t.co/D5vzsA6YSg", "A Korean-American mother's viral lesson has more than 1 million views and counting. https://t.co/GkDkixxLje", "Proof of vaccination may allow us to begin resuming our normal activities in the near future. https://t.co/sXsOPZXFuG", "Pres. Biden: \"We can ban assault weapons and high capacity magazines in this country once again. I got that done when I was a senator...and it brought down these mass killings. We should do it again.\" https://t.co/Bce3UYuoCV https://t.co/kPQDzamZFX", "Pres. Biden on slain officer Eric Talley: \"When he pinned on that badge yesterday morning he didn't know what the day would bring...But when the moment to act came, officer Talley did not hesitate.\" \n\n\"That's the definition of an American hero.\" https://t.co/kW6qN5uKKi https://t.co/59uYG0jwrj", "The victims of the Boulder mass shooting have been identified. Here are their names.\n\nhttps://t.co/4kmw3PFPcd https://t.co/gzFyWAU7xZ", "Pres. Biden: \"I don't need to wait another minute, let alone an hour...to urge my colleagues in the House and Senate to act\" on gun reform measures. https://t.co/kW6qN5uKKi https://t.co/FX82NgU7Zg", "\"We've all been justifiably focused on the pandemic, but this phenomenon of mass shootings has quietly gotten much, much worse, even as the pandemic unfolded,\" @PierreTABC reports after Colorado grocery store shooting. https://t.co/kW6qN5uKKi https://t.co/9EEoFjtYWV", "Prince William and Kate, the Duke and Duchess of Cambridge, visit a COVID-19 vaccination site at the same location where they wed nearly 10 years ago. https://t.co/gvxpyHZXn4 https://t.co/NtbbHOvSbM", "NEW: Pres. Biden: \"We can ban assault weapons and high capacity magazines in this country once again. I got that done when I was a senator...and it brought down these mass killings. We should do it again.\" https://t.co/YnJgFCnfWJ https://t.co/R7A08jx2ky", "JUST IN: Pres. Biden: \"I don't need to wait another minute, let alone an hour...to urge my colleagues in the House and Senate to act\" on gun reform measures. https://t.co/YnJgFCnfWJ https://t.co/BbMhfNLHS4", "THE NOTE: The White House was able to count on party unity to carry its first big legislative item forward. But as plans round out for what comes next, concerns are growing about what such unity might cost them from here. https://t.co/WbSSMzxHIi", "Pres. Biden on slain officer Eric Talley: \"When he pinned on that badge yesterday morning he didn't know what the day would bring...But when the moment to act came, officer Talley did not hesitate.\" \n\n\"That's the definition of an American hero.\" https://t.co/YnJgFCnfWJ https://t.co/Z7JAAew6Y6", "Pres. Biden on Boulder mass shooting: \"I even hate to say it, because we're saying it so often: my heart goes out. Our hearts go out for the survivors.\" https://t.co/YnJgFCnfWJ https://t.co/gYH4dZ5gSf", "Pres. Biden: \"Less than a week after the horrific murders of eight people and the assault on the AAPI community in Georgia, while the flag was still flying half staff for the tragedy, another American city has been scarred by gun violence.\" https://t.co/YnJgFCnfWJ https://t.co/kpigEDGLAm", ".@ABC News SPECIAL REPORT: Pres. Biden delivers remarks on Colorado grocery store shooting that left 10 people dead. https://t.co/SkErCtQlj3", "JUST IN: A full jury has been seated in the murder trial of former Minneapolis police officer Derek Chauvin, who is charged in the death of George Floyd. https://t.co/ojWDi7JkHe", "\"His life was cut far too short.\"\n\nA procession took place to honor police officer Eric Talley, who was one of ten people killed when a gunman opened fire at a grocery store in Boulder, Colorado on Monday. https://t.co/7zO1TFnB02 https://t.co/Kh4oI29pNc", "Authorities read names of victims of yesterday's mass shooting in Boulder, CO.\n\n\"Our hearts go out to all the victims killed during this senseless act of violence.\" https://t.co/5xHoVsR59x https://t.co/3JgqMTBP9E", "Former Pres. Barack Obama: \"A once-in-a-century pandemic cannot be the only thing that slows mass shootings in this country.\" https://t.co/Ghj4CVoBm8 https://t.co/cht4zoxmBF", "JUST IN: Former Pres. Barack Obama: \"It is long past time for those with the power to fight this epidemic of gun violence to do so.\" https://t.co/HU4DTbUWWk https://t.co/CxHmVEVZZ9", "JUST IN: Former Pres. Barack Obama on Boulder mass shooting: \"We should be able to live our lives without wondering if the next trip outside our home could be our last. We should. But in America, we can’t.\" https://t.co/yQia9YodvG https://t.co/3G2meLZIW1", "NEW: Pres. Biden orders flags flown at half-staff at the White House in honor of Boulder shooting victims.\n\nLast week, the president ordered flags to fly at half-staff in honor of the Georgia spa shooting victims, an order that expired at sunset Monday. https://t.co/AWMj7o7aF5", "Their pleas now come as the nation is rocked by yet a shooting in Colorado. https://t.co/yecdbFVWhO", "While some suggest that relaxed mitigation measures could be to blame, others are pointing to the emergence of more contagious variants. https://t.co/PRiMfKucPa", "“To express what I’ve seen in a realistic way, this is the responsibility I’ve given myself. I also hope that much of the history should not be forgotten.” https://t.co/k832oL4pVF", "Campohermoso, a town of 3,000 people in Boyaca state in the mountains of central Colombia, has no reported cases of the coronavirus. https://t.co/MSJTS3WkLZ", "Eric Talley, a victim in yesterday's Boulder mass shooting, was the first member of law enforcement to arrive at the scene.\n\nHe \"loved this community,\" Boulder Police Chief Maris Herold says. \"He's everything that policing deserves and needs.\" https://t.co/vsyP9MqXUt https://t.co/M6PUysSFMY", "NEW: Hillary Clinton: \"Getting back to normal in America cannot mean getting back to regular mass shootings.\" https://t.co/zu4ji5ie9o https://t.co/vITaCeGC9g", "RT @ABCNewsLive: \"Our objective is to conduct a thorough and meticulous investigation...We encourage the public to share any information th…", "The slim majority that Democrats hold in the Senate presents an opportunity to advance gun control legislation. https://t.co/A2nMOyTTye", "The card is more than fodder for selfies, it could be your ticket to freedom in the coming months -- so it should be protected as such. https://t.co/hkkf4jbT4z", "Boulder County District Attorney Michael Dougherty to victims' families: \"I promise you that all of us here will work tirelessly to support you and help you through this process, and also to make sure that the killer is held...fully accountable.\"https://t.co/kW6qN5uKKi https://t.co/Pj1G2s7YsQ", "Rescuers recovered at least 15 charred bodies from a Rohingya refugee camp in southern Bangladesh after a devastating fire that destroyed thousands of shelters, officials say. https://t.co/pZI2MILkEg", "Rep. Joe Neguse: \"This cannot be our new normal. We should be able to feel safe in our grocery stores...in our schools, in our movie theaters, and in our communities.\"\n\n\"We need to see a change, because we have lost far too many lives.\" https://t.co/YnJgFCnfWJ https://t.co/ZJkHrZ1CW3", "The military alliance now aims to get ahead of Belgium's vaccine program and have its staff guaranteed to be “virus-free” for a summit in June. https://t.co/qAFZtZrifv", "\"My heart aches today, and I think all of ours does.\"\n\nColorado Gov. Jared Polis gives remarks on \"senseless\" mass shooting in Boulder that left 10 people dead. https://t.co/YnJgFCnfWJ https://t.co/fmHi6eiivA", "BREAKING: Authorities identify suspect in Boulder mass shooting. He has been charged with 10 counts of first-degree murder.\n\nhttps://t.co/YnJgFCERlj https://t.co/HbXp3CBsEQ", "“He loved his kids and his family more than anything.”\n\nFather of police officer Eric Talley shares statement with @ABC News following his son’s death after gunman opened fire at grocery store in Boulder, Colorado. https://t.co/29oh0JDQO4 https://t.co/BxEsnDTypx", "BREAKING: Authorities read names of victims of yesterday's mass shooting in Boulder, CO. \n\n\"Our hearts go out to all the victims killed during this senseless act of violence.\"\nhttps://t.co/YnJgFCERlj https://t.co/F7V8DD4AFQ", "ABC News SPECIAL REPORT: Officials give update on mass shooting in Boulder, CO, that left 10 dead, including a police officer. https://t.co/K9Q9guS7dB", "WATER WAY TO TRAVEL: Amid severe flooding and evacuations in New South Wales Australia, one local man finds a quicker way to make it over drenched fields. https://t.co/fqrcPajbBj https://t.co/LzFadhS8oo", "Law enforcement officers salute as emergency vehicles escort the body of slain police officer Eric Talley, one of 10 victims in yesterday's fatal mass shooting in Boulder, CO. \n\nTalley had been a member of the Boulder Police Department since 2010. https://t.co/z2k7WrNNYD https://t.co/dDl4GgVZLw", "\"We couldn't tell exactly where the shooter was—we knew he was getting closer to us.\" https://t.co/RIeqOcN4oB", "The fire is still not under control six hours later. Firefighters are still battling \"a ton of hot spots\" and have been struggle with water supply problems. https://t.co/v5PIg8En0o", "NEW: Amid legal battle, NFL and counsel representing former players in league's concussion settlement program appear to agree race should no longer be a factor in determining eligibility for head injury compensation. https://t.co/ZqiXYw3goQ", "WHO chief says gap between wealthy and less privileged countries on number of vaccines administered is \"becoming more grotesque every day.\" https://t.co/OkXXBF7NkA https://t.co/WmF06bY2tp", "Russian President Vladimir Putin will be getting his first vaccination against COVID-19, but out of sight of the cameras, his spokesman says. https://t.co/FVNT9HzigS", "RT @CeciliaVega: I will never forget this story. Meeting 9 and 10 year old boys who migrated alone. Their family’s phone numbers written in…", "Northern California wildfire that killed four people and destroyed more than 200 buildings last year was sparked when tree branches came into contact with Pacific Gas &amp; Electric power lines, officials say. https://t.co/K5Zj1Ps2n1", "STARTING NOW: @ABCNewsLive has the latest headlines from across the globe. @dianermacedo anchors: https://t.co/ex8EYSF6T0", "\"One of the hardest parts about being a survivor of gun violence is having to keep showing up. It's learning how to publicly relive the worst moment of your life ... in the hopes that someday someone with power to do something will hear you.\" https://t.co/hiTmEGDySN", "Firefighters battle massive blaze as fire rips through New York assisted living facility, prompting the evacuation of residents and leading to the partial collapse of the building. https://t.co/far9z8oVWT https://t.co/8N7vswnIGJ", "Police officers move in on a crowd of partygoers as many take off running in Miami Beach, Florida, after another wild weekend of near-record crowds. One person was detained. https://t.co/SLsWbwMQel https://t.co/COpf8uQaTm", "The White House has over the past month increasingly found itself on the defensive as it balances its message that the border is \"closed\" with its stated desire to find safe places for the minors who keep crossing the border unaccompanied by their parents. https://t.co/Lxociuolct", "SURFIN' SAFARI: A Californian surf instructor has been nicknamed 'The Goatfather' as he takes his pet goats to the waves in a bid to help children gain confidence in the water. https://t.co/kMANVoxNUa https://t.co/NIDBNc5jH7", "RT @GMA: “When we had gotten out of the store, there were people laying in the street” — Eyewitness and survivor Sarah Moonshadow recounts…", "According to data from the Stop AAPI Hate coalition, there have been nearly 3,800 anti-Asian incidents reported in the United States since the start of the COVID-19 pandemic. https://t.co/uBU0nk0iFM", "RT @GMA: At least 10 people, including a police officer, were killed in Boulder, Colorado, on Monday afternoon when a gunman opened fire at…", "The Biden administration has now released its first official images from inside two Texas migrant detention centers, with @ABC News receiving an exclusive first look at videos and photos produced in recent days by the U.S. government. https://t.co/BGKgsS0dji", "“Let us take a moment together to remember those who have been lost, to give thanks for their lives, and to acknowledge the inexpressible pain of parting.”\n\nPrince Charles reflects on year since first coronavirus lockdown. https://t.co/T3peBGAvEv https://t.co/DkzWNqCfzN", "More than 200 businesses sent a letter to congressional leaders urging action on a federal paid family leave program in any future infrastructure and recovery legislation. https://t.co/7GttGpqsEY", "New York detected its first case of the coronavirus variant initially found in Brazil, known as P.1, joining the ranks of at least 18 states reporting cases of the new variant. https://t.co/p6cmCTP30b", "Sec. of State Antony Blinken addresses Boulder grocery store shooting in his opening remarks at the NATO headquarters in Brussels, offering his “deepest condolences to the loved ones of those who were killed.” https://t.co/cQ2Uj2kehy https://t.co/xpe9tGhUrd", "Rep. Deb Haaland, who is the first Native American to lead a Cabinet agency, was photographed wearing an Indigenous-inspired look for her swearing-in ceremony as secretary of interior. https://t.co/EmI1groBbC", "A Washington mother's viral lesson on the #StopAsianHate movement has more than 1 million views and counting. https://t.co/N5hMfj0e8x", "‘WATCH OUT!’ Dashcam footage shows a burning van rolling downhill in Arkansas, with first responders rushing to put out the flames. No injuries reported.\n\nPolice believe the fire may been caused by the vehicle overheating. https://t.co/OJ589NQmgb https://t.co/XcTFbmtPc8", "Sinovac says its COVID-19 vaccine is safe in children ages 3-17, based on preliminary data, and it has submitted the data to Chinese drug regulators. https://t.co/l7JmXAvprs", "NEW: Amid legal battle, NFL and counsel representing former players in league's concussion settlement program appear to agree race-based adjustments should no longer be considered in determining eligibility for head injury compensation. https://t.co/fgVjmfgDdj", "“Our heart breaks for the lives needlessly lost.”\n\nDenver-based MLB team the Colorado Rockies share statement on Boulder grocery store shooting that left 10 people dead. https://t.co/TZp70yXhJW https://t.co/KedcYB554M", "Results from a U.S. trial of AstraZeneca's COVID-19 vaccine may have used \"outdated information,\" U.S. federal health officials say. https://t.co/wJ76GQE2sP", "“As spring sprung this weekend, and vaccines continue to get into arms, lightness creeped back in only for the darkness to descend on us again.”\n\nColorado Gov. Jared Polis on Boulder grocery store shooting that left 10 people dead. https://t.co/TW3xzV8Fua https://t.co/QjnSS2asSl", "Former Pres. Trump backs GOP congressman's bid against Georgia Secretary of State Brad Raffensperger. https://t.co/6fXBZjmMYc", "Now, that's talent: Adorable Siberian Husky mimics owner saying \"I love you.\" https://t.co/6mq3b6zWpw https://t.co/I2WeoDBvuo", "“He loved his kids and his family more than anything.”\n\nFather of police officer Eric Talley shares statement with @ABC News following his son’s death after gunman opened fire at grocery store in Boulder, Colorado. https://t.co/46wS9sW3SC https://t.co/8B7jXHNDjb", "Gracie the golden retriever has been busy spreading love and cuddles to nursing home residents in Ohio. https://t.co/WlMCwSKE4s", "New photos show an overcrowded Border Patrol tent for migrants. Journalists have not been allowed to visit the facilities. https://t.co/c1ak6hr8JX", "Birds flew low over icy Lake Erie at sunrise in Ontario, creating a picturesque scene. https://t.co/TLKsJVjxHB https://t.co/wMUtaj6rj1", "\"My Savior\" features a variety of hymns the \"American Idol\" winner grew up singing. https://t.co/GBBGSBHtQf", "To make getting a shot even sweeter, Krispy Kreme is offering a free original glazed doughnut to anyone who shows their COVID-19 vaccination card. https://t.co/LwF5MOPCWY", "It’s Republicans under the age of 45 who are really concerned about “cancel culture.” @FiveThirtyEight has more: https://t.co/sXkm6H9Rob", "SHADOW PLAY: Grand Canyon ravens swoop and dive in soaring courtship display. https://t.co/585YKaaSZJ https://t.co/a8G3PFOdjV", "Two COVID-19 PCR test collection kits are officially available for on-demand delivery through DoorDash. https://t.co/KDJ7x9ybxB", "Due to Washington's status as a federal district rather than a territory, Mayor Bowser was unable to call up the National Guard to support overwhelmed Capitol police officers during the Jan. 6 Capitol assault. https://t.co/anNy8jlmKr", "Ten people are dead, including one Boulder police officer, after Colorado grocery store shooting, authorities say. https://t.co/xvBXLynX9V", "The trips are part of what administration officials describe as “ongoing discussions on how to manage an effective and humane plan of action on migration.” https://t.co/zouA146c2a", "\"I'm six months in and I'm still experiencing symptoms.\"\n\nFor millions of people, surviving COVID-19 has been the starting point of a longer journey—one that is poorly understood and increasingly consequential as the the world grapple with the pandemic. https://t.co/dETpMdDzFT https://t.co/ONuF92ZcuT", "Long-awaited preliminary data from final-stage U.S. testing of the AstraZeneca vaccine shows the two-dose shot is highly effective in all age and ethnicity groups, stopped hospitalization in all cases and did not raise the overall risk of blood clots. https://t.co/JANHtEuGxb", "PEACEFUL PIANO: A pianist helped set a calm tone for animals at a zoo in Colombia, performing classical compositions for zebras, lions and flamingos. https://t.co/mbloyXEC9u https://t.co/LYAfExIujP", "Colorado Sen. Michael Bennet issues statement on Boulder grocery shooting that has left 10 people dead, including one police officer: \"Enough is enough.\" https://t.co/Eo0zM38LxO https://t.co/vefRhTQa2w", "The treatment that infuses blood plasma from recovered COVID patients into people newly infected in hopes of boosting their immune response has not lived up to early hype. Via @InsideScience. https://t.co/7hdb6qdTeN", "The president also said the team won't compete in national events for two years. https://t.co/8RtQ3lOfte", "Boulder Police Chief Maris Herold commends “heroic action” of Police Officer Eric Talley, who was fatally shot after being the first officer to arrive on the scene of deadly grocery store shooting. https://t.co/Wlv0hSVmZT https://t.co/fszdOta7YV", "BREAKING:  Boulder Police Chief Maris Herold says “10 fatalities at the scene,” including officer, after grocery store shooting. https://t.co/Wlv0hSDM8l https://t.co/ScEWoUQtL4", "HAPPENING NOW: Boulder police chief gives update after deadly shooting at Colorado grocery store. https://t.co/Wlv0hSVmZT https://t.co/YF2zn6PxAn", "ANOTHER PLANET: Drone footage shows the otherworldly scene around an erupting volcano in Iceland. https://t.co/Efv4IN5pcx https://t.co/HcFufW05RE", "RT @GMA: TOMORROW ON GMA: Dr. Fauci, who's now the Chief Medical Adviser to President Biden, joins us to talk about vaccine progress nation…", "GOP Rep. Tom Reed apologized to the woman who accused him of sexual misconduct last week and said that he will not seek to get elected for any office once his term ends. https://t.co/dxaTy3sGCU", "HAPPENING NOW: Procession for Boulder police officer killed in Colorado grocery store shooting. Authorities said at a press conference that “multiple” people were killed and a person of interest is in custody. https://t.co/Wlv0hSVmZT https://t.co/z5vx0Xm4vM", "LATEST: Multiple people killed, including a police officer, after suspect opens fire at a King Soopers grocery store in Boulder, Colorado. A person of interest, who was wounded during the incident, was taken into custody, authorities said. https://t.co/povroMXD7i", "He's the second pro-Trump Republican to launch a campaign to replace Sen. Shelby. https://t.co/7J9Aa0n33y", "Hospital visits for opioid overdoses rose 29% in 2020. https://t.co/vOYRuCKGQJ", "“We are very early in the investigation. We are still processing the scene,” says Boulder Police Commander Kerry Yamaguchi when asked by a reporter if he can say how many people were killed in grocery store shooting. https://t.co/Wlv0hSDM8l https://t.co/JUNk03L12Z", "BREAKING: Person of interest in custody after deadly shooting at Colorado grocery store, authorities say. https://t.co/Wlv0hSDM8l https://t.co/LsBYd1yNUd", "BREAKING: Multiple people killed in shooting at Colorado grocery store, including one Boulder police officer, authorities confirm. https://t.co/Wlv0hSDM8l https://t.co/UfpEoUw3PN", "Just days after he loosened COVID-19 restrictions for businesses, New Jersey Gov. Phil Murphy announced that an indefinite pause is being implemented on further measures to reopen the state because of the coronavirus variants circling the country. https://t.co/fSzKThZBWd", "LIVE COVERAGE: Officials give update on reported shooting. (KMGH-TV) https://t.co/OyfeQVVOTO", "RT @ABCWorldNews: OVERCROWDED CONDITIONS: New images reveal the cramped conditions where many unaccompanied minors are being held, with @Ce…", "JUST IN: White House press secretary Jen Psaki says Pres. Biden “has been briefed on the shooting in Colorado and he will be kept up to date by his team as there are additional developments.” https://t.co/ZnBVquU3wg https://t.co/RTGXtBWuBh", "Over the last week, more than a dozen states have seen increases in their daily case averages. https://t.co/7BPVwoPDQ8", "RT @ABCPolitics: NEW: Attorney General Merrick Garland has been briefed on the shooting in Boulder, a Department of Justice official told @…", "Long-haulers describe feeling lost, hopeful and irrevocably changed. \n\nRead about their stories: https://t.co/KZFCP5uBYy", "RT @ABCNewsLive: \"It's still an active scene although it does appear as if police have now secured that grocery store,\" @kaynawhitworth rep…", "NCAA officials apologized for \"dropping the ball\" after providing women's basketball players with training facilities inferior to men's during the Division 1 tournaments. https://t.co/iYkY70R7oe", "NEW: Colorado Gov. Polis tweets statement on 'active situation' in Boulder: \"We are making every public safety resource available to assist the Boulder County Sheriff's Department as they work to secure the store.\" https://t.co/EbXzgYg3qP https://t.co/OxWxsO9PFX"]}