{"tweets": "RT @SiriusXMHits1: Y'ALL!!!!!!!!! #MoralOfTheStory is the #1 song on Hits 1 for the FOURTH straight week in a row!!!!!!! Congrats to @ashem… @likeablehes All good today. Did all the drinking on Saturday Thank you for all the lovely birthday wishes. Really appreciate all the love. Xx Going to be a good day @clutchprotour ! Amazing course @worplesdongolf ! @modestgolf https://t.co/L69xnEdsUH @kadylarry I’m always down Can’t stop listening to Mileys cover of ‘take it to the limit’ . What a voice ❤️ @horancuteboy @taylorswift13 This is me trying @_bendtherules Yep @damnnviall I miss him too. What a lovely guy @everywhereniaII No I haven’t @armsofnhx Nope 😂 @helloxpetal I feel hard as nails to be honest, I am soooooo strong 👈 @helloxpetal Can’t sign until they’re old enough @GOLFTV My man T @theirishkingnjh Of me in Lycra @theirishkingnjh Well I’d prefer to be giving you hit songs for your ears to listen to, instead I give you videos @fearlesssIwt Watching golf 😆 @solongnialler If it’s raining no @sparksfIicker 15 miles to the gym and back RT @ZenFloof: I would give my left arm to experience Niall performing the songs from Heartbreak Weather live sometime this year. I don’t ca… @SiriusXMHits1 @ashemusic Okurrrrrrrr @pallomoned It’s healed fast and I wore the big brace @flickersnjall All is well @flickerofgold Haha yes it is. I just wear it for protection in the gym, stops my ankle from rolling as it has two metal rods either side Goodluck to all involved in @socceraid tonight at Old Trafford. Live on @itv from 6:30pm. Please donate so they can raise lots of money for @unicef @niallernroses I would also tend to agree with them 😂😂 @niallernroses They are both very lovely people @MileyCyrus ❤️ wowwww ⁦@MileyCyrus⁩ ❤️. ⁦@thisiswatt⁩  https://t.co/5rapabpT4s RT @pandoramusic: Singer-songwriter @NiallOfficial shares a hand-picked mix of music with stories of thanks for the musicians that inspire… Hello world @AnneMarie Hahahahahaha that’s soo funny. I’ve heard some mad pronunciations of my name over the years, this is the best yet 😂😂 @heartbrkkwthr Yeh I’d say it must be my turn now 😂😂😂 An incredible week for @BrendanLawlor97. I am so proud of him. Thank you @ISPSHanda &amp; @EuropeanTour for making it possible. Sport is for all &amp; my team at @modestgolf will keep pushing to this message ! https://t.co/sxLiFA5c8X Thank you so much @TaylorMadeGolf &amp; @TaylorMadeTour ! Class company supporting inclusivity in the game ! https://t.co/BIJOGvByAl Best of luck @BrendanLawlor97 &amp; thanks so much @ISPSHanda for giving Brendan such an opportunity ! https://t.co/JmPEGeIJR0 @niall_capaldi 😆😆😆😆😆😆😆😆😆😆😆 @goldenmullingar You don’t know why I’m laughing??? Listen to the song that’s in the background @erodaIouis Yeh it’s pretty sore @otb28lwt Not for a while I Don’t think. Can probably chip and putt next week but full swing.... not for a while I doubt @PrfectlyFlicker Yeh but I’m hard as nails @SoniaDelfin3 Yep @derbyteesniall Actually not that drunk to be honest hahaha . Very low curb that I didn’t see @smalltalkbaby Shite 😂 @crokelads It’s too long to explain in this amount of characters to be honest @derbyteesniall Yeh he’s playing very well at the moment @hrtbreakhoran Tuesday or something @armsofniallh Yeh it is actually ahahah @tobesonialler No it’s the OCD 😂 @flickerofhopeG Went for lunch and that’s it. Don’t wana walk about too much @HoranSpotify @ashemusic 😂😂 @1980SFLICKER I wasn’t saying that 😂😂😂 @ashemusic See ya soon I’ve spent the afternoon watching videos of the Obama White House. How fun was it ? How humble were they? How much appeal to the regular person did they have ? The definition of you don’t know what you have till it’s gone. America please vote this year. @yarahbw @talenthouse On my Instagram story are my favourites for each song . There were sooo many for each @angievelsa13 @talenthouse Very impressive Massive thank you to the thousands of people who’ve shared their amazing art with me , I'm truly blown away by your talent. Congrats to Daniel Duque who designed the winning piece ! Shout out to all of the finalists and runner ups as well, it was a really difficult choice to make https://t.co/IakyZrOzck @ashemusic @Spotify Cmoonnnnnn RT @ashemusic: moral of the story ft. sweet angel @NiallOfficial hits 20MIL on @Spotify tmr!! to celebrate and thank all of you, we’ll be g… RT @DiscoverNI: This time last year, we were gearing up for the @ISPSHanda World Invitational @GalgormCastle! Sadly, it won't be happening… @horannangel Ya got it in one . Fair play 😂😂😂😂😂 https://t.co/5HHAKZ8xo0 @Conor_O_Donohoe Why the fuck are ya wearing a jumper then? @jpsaxe Wowwww!! Imagine Elvis singing ‘High and Dry’ @GilletteStadium @onedirection @Harry_Styles @Louis_Tomlinson @LiamPayne @zaynmalik Never forget. Absolutely love your stadium. One of my favourites RT @ashemusic: 👼🏼 @iHeartRadio thank you for all the love on moral of the story ft @NiallOfficial, it’s meant so much!!! listen here https:… @sweetIikestyles Please don’t apologise.  You’re fine x @smalltalkflickr Nothing going on Hahahah @snflwrvl I’m not mad at anyone . @__lisagrd I’m great !! Played golf this morning alone. Played a round in 2 hours and 15 mins @letme_adorelou @Wheres1D I’m not talking about specific people here, I’m talking in general . . @happilyval It’s not fun having surgery, I get ya. Hope you recover fast. I know that they get ya moving straight away after hip , so listen to the peeps. @1dstan_ot5 @Wheres1D Let’s not do the thing of Niall deserves better because I don’t deserve anything.. let’s just be nicer to eachother and spread the love and laughs . Xx @Wheres1D Probably because we’re on tv and somehow look untouchable ( probably because you can’t put your hand through the tv ) 😂😂😂😂 @Wheres1D It bothers me because I know it hurts other people and that’s the frustrating part. Not everyone is as thick skinned. we are normal people that do an abnormal job in which society has put us in a differet category for some reason. @niazempire It’s effectively the same as walking up to someone in the street and just saying what you want to their faces... you just don’t do it . @niazempire I’ve been through this 1000 times to help other people. Because we are famous faces and people see us online, on tv, in interviews etc.... doesn’t mean people can say what they want. @niazempire I respond not because Im personally offended by any of them ( in fact if you knew me personally you would know I couldn’t give a shit about most things in life )I respond because I try to help people understand that you can’t just say what you want to people online. @sweetIikestyles That’s not very nice is it ? @flickerevans Of course I have . You’ll seeee @CapitolRecords All of them . @xxpavxx @NiallHQMedia @ghostinlou If a paparazzi picture is taken at 1/15 shutter speed, what about all of the over movements in between the pictures eg: normal walking,  smiling, hand movements, eye movements ?? @ghostinlou By the looks of a picture taken at about 1/15 second shutter speed, NO. @niallspotatoo93 Oh really? @ashleig44666195 That’s coz they haven’t changed the billboards since lockdown Hahahaha . @Lucas03865131 😂😂😂😂 Go on my son . Love that @hrtbrkweather So beautiful ❤️. The lady is a genius @helenednulekkab Good . Let’s keep em on their toes 😜 @vmas @ArianaGrande @Camila_Cabello @edsheeran I’ll take it if no one else wants it 👍😆 @guccishabit Yeh you’re right. I’ll get my coat @prediction2021 What is it ? @HBWRAINBERRY Im alright. taking a break for a minute and enjoying life. I’ll be back soon. Myself &amp; @modestgolf are supporting @BezChristiaan &amp; @TyrrellHatton #BirdiesForStJude @WGCFedEx campaigns ! Learn more about how you can pledge to help these awesome kids @StJude: https://t.co/c9ShkHPpgQ https://t.co/w0C5Zca0na @lwtsgclden Why not babyyyy Emotion filled day today. The love from around the world 10 years on is amazing. Thank you for your loyal support as always. Crazy what 5 normal guys can achieve. Proud ❤️ #10YearsfOneDirection @Conor_O_Donohoe It actually is @SamFischer Well you are a very lovely man x @dearmaxencefvl Why’s that ? It’s the 150 person crew of carpenters, lighting, riggers, sound, stage manager Mill that flew the globe with us. it’s our band, our security boys, tour managers, our managers, our label, Sarah cooking our food for us on the road. Today is a day to celebrate those guys also. It’s such a major part of our lives and always will be. Cheers to US today boys and thank you to all you beautiful people who have supported us over the last 10 years. @LiamPayne @Harry_Styles @zaynmalik @Louis_Tomlinson ❤️ #10YearsOfOneDirection when I met these four gents there was no way I thought we would go on to do what we did. So many unbelievable memories we shared together. We felt the adoration of millions from around the planet on a daily basis and it was mind blowing. https://t.co/rHeGL8rY7z Love you Payno ❤️ https://t.co/9DTj0N4kM2 @Louis_Tomlinson @Harry_Styles @LiamPayne @zaynmalik Love you ❤️ @dxrbyniall @hippyityhop Exactly . It’s unbelievable on here @fireproofamber @hippyityhop Tell them to stop coming at me coz they know I’ll win 🤣🤣🤣 @hippyityhop Niall hasn’t got a hickey, Niall has a spot on his neck like any other normal human That sums up our season. we’re miles off. @MTVMusicUK Yeh I’ll take that RT @BBCR1: Happy #WorldEmojiDay! Can you guess the song titles below?\n\n1. ✨⬆️\n2. 💍💍💍💍💍💍💍\n3. 🐢👐\n4. 🕺🐒\n5. ⛔⌛💀 @LewisCapaldi @findingfletcher Not fuckin wrong 🤣🤣 @Chris_Stark Congratulations Chris . RT @Chris_Stark: I couldn’t be prouder 💛\n\nOur little lad is here.\n\nMy wife is incredible. \n\nWe owe Claire the midwife at Wexham Park Hospit… Tense night to be a @dcfcofficial fan! Not for the first time by the way. Cmooonnnn  🐏👍⚽️ @umusicNZ @billieeilish @IAMSUMMERWALKER @samsmith @conangray @Drake @PostMalone @ygofficialblink @taylorswift13 @lilyachty Me @AlecBenjamin My man Alec!! What a talent you are my friend. ❤️ RT @irishcharts: A new peak this week for Black and White! @NiallOfficial's latest single rises to Number 2 on the Official Irish Homegrown… thanks @mariolopezviva for having myself and the lovely @ashemusic on tonight for our @iHeartRadio @onwithmario @AskAnythingChat ! https://t.co/xyzfatV59Z @CrossyTweets Oh lovelyyyyy @Rylan All good babessss @fl_hbw_walls @NiamhroseH No but I can’t wait @hanuuummm @NiamhroseH Me ?? Always happy petal @derbyteesniall Congrats !! Go and smash work now!! @veerrr_ How’s it going ? Friend of mine doing the same, sounds intense . @NiamhroseH All goooddddd!! Chillin Wassuppp sexy people ? RT @irishcharts: Well in @NiallOfficial! He does the double with the biggest album and single released in 2020 so far by a homegrown Irish… @irishcharts ❤️❤️❤️❤️❤️🇮🇪🇮🇪🇮🇪🇮🇪🇮🇪 Love seeing all of your #HeartbreakWeather artwork , keep them coming ! Less than a week left https://t.co/7pog4hYTl8 RT @previewhoran: Cross your mind by Niall Horan\n🫀🍾🌊\n\nMy first art in a real good editor (Niall, I'm dedicating myself a lot to this contes… RT @niallmxckingjay: @NiallOfficial @talenthouse I did my second edit for the contest. I hope you like it. #HeartbreakWeather \n\n'𝑰𝒕 𝒄𝒂𝒏 𝒃𝒆… RT @reyreypelcastre: San Francisco Sunset ft @NiallOfficial and @talenthouse #HeartbreakWeather #SanFrancisco https://t.co/6LULIQ3PbU @RocketMortgage @modestgolf @TyrrellHatton @RocketClassic Would be great to make it out to your great tournament. Hopefully we will have more @modestgolf team qualifying next time. Congrats on a great week. Another amazing week for @modestgolf player @TyrrellHatton at the @RocketClassic with a top 5 finish ! Well done Tyrrell ! Great event thank you @RocketMortgage ! @dfencelessadore That’s after the haircut . Barely touched it hope you enjoy the @iHeartRadio @AskAnythingChat that @ashemusic and I did for @MostRequestLive . thanks @OnAirRomeo for getting us all together ! https://t.co/K7ySa2Jcsu @jonasxhoran My heart don't forget to send your questions in for @ashemusic and myself to answer on next friday's @iHeartRadio @AskAnythingChat with @onwithmario . looking forward to chatting again @mariolopezviva ! https://t.co/9ghd3tN0Z0 @MashUpStanleyT @ashemusic @MorningMashUp @SiriusXMHits1 Love ya stan @ashemusic @stiIlhoran MySpace ? @1Dforever_2020 Go and listen to great artists like this @icaruspatience No probably not 👍👍👍 @njhsanfran Shite , so I stopped 😂 @stiIlhoran No she won’t play me anything. . RUDE I know @helloxpetal Watching the players blossom. Also getting in a room with some major brand and brokering deals @PrfectlyFlicker Just picked the guitar up naturally that way for some reason @stvillnialler Cross your mind @helloxpetal No I’m taking a day off . I’m tireddd!! Tomorrow I’ll be back. Just persisted until it became a part of my daily routine @fireproofamber ‘I don’t trust myself’ and yeah ‘ continuum my @Putalittlelove_ PALLOM is Completely inspired by Elton RT @irishcharts: Heartbreak Weather by @NiallOfficial is the biggest Homegrown album released in 2020 - more: https://t.co/ltR3tXS97S https… @MTVUK Yeh good thanks you? @BeefGolf 😂😂😂😂 @BeefGolf Nah I gave up on that mate 😂😂😂. Too itchy. Don’t know how ya do it This photo is from one of the last shows I played before the world went into lockdown. I miss it like crazy. We must stick together through this. Share a photo from your last show and let’s get their attention. #LetTheMusicPlay Last year the UK’s live music industry added £4.5bn to the economy and supported 200k jobs across the country. Until we can get back to doing what we love, it’s important we speak up and demand government support for all of the various venues, festivals and promoters. Live gigs and festivals can’t happen without incredible hardworking teams behind the scenes, but without gigs all of those people are out of jobs and the live music industry is at risk. Today, we call on the UK government to offer their support. #LetTheMusicPlay https://t.co/4v2gdMSlBj @flickersnjall I think 22-25 degrees, small breeze @RUBIUSXNIALL Yes it’s not easy because everything gets wet. Your hands are wet, grips on the clubs are wet, the course becomes longer because the ball doesn’t roll as fast. RT @modestgolf: Nice drive boss. @NiallOfficial 🔥 https://t.co/rWYknvss4T @SoniaDelfin3 Compliment accepted, thank you @goldeniaIIer Greatest Delighted to take part in the @RocketMortgage Shot For Heroes ! Look forward to seeing your attempt ! Please tag in @RocketMortgage and use #ShotForHeroes ! https://t.co/gh9AHCKJMQ @tommomybean US @NHFLOOF1 Try and mix it into the weight session but I also cycle long distance @larrygoldenn Working out in 3 mins and then I got a few bits to do around town . @NHFLOOF1 The new one is pretty cool @NHFLOOF1 One from years ago @_jlovesharry_ Play golf, cook, read, write, @1Dforever_2020 12 @iv4n41 Right mid @horansorete 1 hour @jonasxhoran love the job Wayne Rooney is doing for us right now. Dictating the pace. @Denlovesniall1 Sing and watch derby county @ashemusic @MorningMashUp You 😂😂 https://t.co/SfSuJrJizo moral of the story lyric video is out now . enjoy ! @ashemusic https://t.co/ec66Gv425I https://t.co/PwSITqNmc8 🐏🐏🐏🐏🐏❤️❤️❤️❤️❤️ https://t.co/7F7N3KAQnW RT @dcfc_live: .@NiallOfficial reveals the Rams' new away kit...\n\nDo you like it? \n\n#dcfc #dcfcfans\n\nhttps://t.co/ZYXZG90A5S received this beauty from my beloved @dcfcofficial this morning ! The 2020/21 away shirt by @umbroUK. \n\nCan’t wait to see the rams next season!! #NeverFarAway #DCFC https://t.co/dENREwBxfX @LPLTHSZMNH @bellaFouad1d As of * @LPLTHSZMNH @bellaFouad1d I’m not educated enough on this topic to speak as if yet, which I’m sure you can appreciate . @bellaFouad1d What am I speaking up about ?? @FlickerXStill Yes it’s where I’m a member @curiouslyhoran It does look good @SiriusXMHits1 @ashemusic Only RT @MorningMashUp: Poor @NiallOfficial got more than he bargained for when he joined our Zoom chat this morning! 😂😂 https://t.co/piQ7kPGHEb @MorningMashUp 😂😂😂😂 my people !! Love you all @da_p1mp_1s_ere Songwriting award @ashemusic What Did I do now? @dailynialIpics It hurt aswell. That’s how I hurt my knee The @modestgolf boys are back this week at the @RocketClassic ! \n\nPlay well @TyrrellHatton &amp; @BezChristiaan ! @PGATOUR @RocketMortgage next weekend on @MostRequestLive @ashemusic and I will answer the @iHeartRadio @AskAnythingChat questions you're sending to @OnAirRomeo here ! https://t.co/9ghd3u4BQy @SamFischer It’s been said @SamFischer Ok .. my pal @ashemusic and i are doing an @iHeartRadio @AskAnythingChat for @onwithmario on july 10th ! send in your questions for us now . can't wait @mariolopezviva ! https://t.co/9ghd3u4BQy @Ave_angelic Intense read but good @vane_ccx Went for a coffee. Going to workout now @willahmed Love your work sir. @NiallsLittleLie Flicker, PALLOM, black and white, slow hands, the town @loveonniall Ajax @killmykiwi91 All of it @ruthfarrelll Yeh probably .... I like it though @curiouslyhoran Oh for sure @Carahayesxx No . Still to this day can’t do a wheelie 😂😂 RT @rte: What @NiallOfficial said 👇😎👕\n\n#RTEComicRelief\n\nhttps://t.co/Q2Wyw5GLr5 @laughinginside @whoop Have it on always. I heard that all the boys were getting sorted this week. It’s a great idea @budweiserusa @simpforlouist Oh hello you!! Treat me to as many freezing bottles as you want my love. @louiswtvol6 Too much This t-shirt designed by the brilliant @OliverJeffers is available now as part of #RTEComicRelief. It’s a thing of beauty for a great cause and you can get it here https://t.co/SHUadZMmxV https://t.co/Q4klrEIIn0 @niallerisart Much better than running . Also promotes muscle growth which I need to support my knees @horancuteboy The masterrssssssss @hrtbrkwthrnjh Cycled a bit . Gona workout at 6 when it gets a smidge Cooler @sincewerealone @talksport @coriniall Was thinking about it but I think I’ll get a second one in the same ear @weissamantha_ Correct Hahahahah @likeablehes Kev de bruyne @niallerhq_ Oh holy moly @natnewangel It’s brilliant . . Hard work but starting to see the rewards now @flickerevans No . Needed time off from it, brain was fried . Also this weather 😂 @niaIIhsun Every opportunity, tops off . In the great words of Maren Morris “ always, constantly, shirtless” hahaha @_bendtherules I’m not cutting it all off. Just gotta trim some edges. I look crazy sometimes @niallvinyIs @theirishkingnjh Yeh and it’s been fun to be fair . But when you work in the house, eat , drink, sleep, everything..... there’s only so much of that ya can do @shesnewangel My knees are not able for it. My right knee has tendinitis and it’s very sore after running for a few days. need to think about the future and not wanting to be in pain when I’m older @pallomoned I like the heat .. @frmthstars 505 @niallsdimples Hopefully Chelsea. Want Liverpool to just win the league already @helloxpetal I do both daily. Cycling is a good burn and loosens off the muscles. Do enjoy the weights these days though @theirishkingnjh The minute the border opens in America, I’ll have to go back and get in the studio. It’s getting to the point where There’s only so much I can do from home @theirishkingnjh Yeh wrote a good one the other day. First decent tune since lockdown started Hahahah @HetteLovesNiall I like the length I think. @larrykinghair is back open next week i think, so I’ll just get a mini trim @heysunflowerx It’s 31 today I think @simpforlouist Might have a beer this evening, hard not to with that weather @simpforlouist No I gotta record a performance for something and then workout @flickerwish About 13 miles or so . It’s ok actually . I’m used to it with it being that hot in LA most of the year @onedprojectt Streaminggggggg RT @DiscoverNI: ⛳️🤝 Northern Ireland’s world class golf courses will still be here to warmly welcome visitors when the time is right, and w… @niaIIsoul 14 @derbyteesniall Augusta @ohdearpatience If drinking at home and drinking in the pub were the same, then pubs wouldn’t exist 😝😝😝 @RainyDaysx_ Freezing cold pint in a glass and if I don’t get it that way, I’ll be handing it back screaming “ I waited nearly 4 months for this shit” @ashemusic Yeh parts of it... the sunny days of it This weather ❤️☀️ @Niallhxpotatoes It’s my house Thanks for having me @etalkCTV ! https://t.co/frjL0h8gUk Myself and @ashemusic are doing our @MostRequestLive @AskAnythingChat on July 4 . Send us your questions ! https://t.co/9ghd3tN0Z0 thanks @OnAirRomeo @iHeartRadio @helloxpetal Yes it’s amazing !! We work very hard and to see it paying off , its great @solongnialler I want to cry @njhdearpatience Tiger @elisaxhoran @TyrrellHatton HHahah he’s my golfer @shawnmxndes_98 It’s my job to. My player is leading RT @hitsradiouk: We are LOVING this collab 😍\n\n@ashemusic &amp; @NiallOfficial's latest track #MoralOfTheStory is a brand new trending song on #… @vincengogh He’s better to look at now though 🤣🤣 @hbwkailey Yes darling @nojudgemvnt Had a couple but I was so tired , finished early and came home.. @SandraLCosta1 Pints somewhere yeh ... RT @1075theriver: YESSSSSS! @NiallOfficial\n&amp; @ashemusic 👏👏👏\nhttps://t.co/GU6F5NiUxp RT @1027KIISFM: .@AsheMusic and @NiallOfficial dropped their duet version of 'Moral Of The Story!'\n\nListen! #MoralOfTheStory https://t.co/4… Don’t stop listening and whatever ya do , DONT STOP PLAYING IT FOR THE LOVELY AND SEXY AMERICAN PEOPLE https://t.co/N6sJwubWt3 @1D_missinghours 🤣🤣🤣🤣🤣 @njhsheartbreak No @niallhenergy Very similar concepts . Think about it @_lwtgolden Do I ? Since when ? @misisnistyles Coz I obviously didn’t mean to like in the first place @BrianODriscoll 🤣🤣🤣🤣 we did indeed . @bethanydaynow @talkSPORT No I’m not. still no managers or anything allowed. Just players and caddies at the moment . @njhdearpatience Yeh we’ll have a laugh @RUBIUSXNIALL For lunch I’m going to make a chicken pasta dish , might have some veg on the side for a nibble . @roseankles Yes I’m pretty much doing nothing this week. I wrote too much shite and didn’t. Know what I was writing about 🤪. So I’m just going to be Cooking, working out, long distance cycling, listening to a lot of music for inspiration..... clearing the brain out. @everywhereniaII 😆😆😆😆😆😆 @talksport  tell me what the people do at Stockley Park?? How can you and 7 cameras not see a football obviously go over the line. They have a better view than we do and they make decisions like that. felt for Sheff Utd on a few different occasions this season. RT @billboard: Listen to @ashemusic's \"Moral Of The Story\" featuring @NiallOfficial below https://t.co/fztH6QbPnM City move the ball so well.. poor arsenal have been pinned back for 60 mins @xneedniallx @talenthouse Wow Oh I missed watching Kevin DeBruyne play football. Such an intelligent player We sat on FaceTime for ages chatting, writing different parts and having a laugh and I concluded that @ashemusic is a legend, she’s insanely talented and we’re now going to be friends because of this. https://t.co/2wOunPvOcd From the minute @ashemusic got in touch and I heard this song, I loved it so much. From the chord choices to the natural storytelling melodies that she possess, it was a no brainer that I was going to be a part of it. Hope you love listening to this one https://t.co/2wOunPvOcd https://t.co/4mcepagQra Brilliant https://t.co/TRlxsqh1Ej @PLinUSA 2-1 to Sheffield United (although i want villa to win) , city 2-0 @lauren_mgreen also made some good friends off the back of that . @lauren_mgreen I love my derby county but Yes premier league team would be Chelsea only because of the care they gave me when I had my knee done. It was an incredibly incredibly tough time for me but was made so much better by the great team at Chelsea Today could be the greatest day I’ve had in a while. I have a new song out and the premier league is back tonight ❤️❤️ RT @BritishGQ: .@NiallOfficial has teamed up with @ashemusic on a new version of #MoralOfTheStory, out now. Don't miss it 🔥 https://t.co/go… @niallernroses All amazing ladies, super talented , music girls, all storytellers, honest. Just 🥰🥰🥰 @fvlicker Yes of course. I wouldn’t have put the lyric in if I thought otherwise @loveeforniall I only want to collab with someone if it makes sense for both parties, if the song is great, if that person is a genuine music person ( there’s a lot of people who aren’t ) @crossthetide No it was easy, I never want to go back to studio ... jokkkeee . I’ll definitely have to get back in a studio soon though in terms of access to guitars and drums, having a producer there. @bIakandwhite @ashemusic It 100 % helps. Now I know her story, know a bit about her, her interests, music taste, the type of writer she is etc . She would probably say the same @stiIlhoran No . I wrote it in facetime when we were chatting and then I recorded it In my house . @niallsorridimii Yeh I did . @fireproofamber Yes @iambreadinside Yeh it’s an amazing song. Had to be delicate as it’s her baby, didn’t want to over sing or anything @perfectlyg0lden As ya know I like to do what I want 😄 @flickerinfinity Yeh I’d love to write another tune with Ashe . She’s so fun and lovely @nialldivinely @ashemusic I heard the song, loved it . Ashe and I spoke on FaceTime for a long time. Then I FaceTimed her another day , rewrote the verse real fast and then I recorded it 20 mins later . That was about 2 weeks ago 🤣🤣 @vintageniaill Of course it was intended 🥰 @thunderroadnjh Correct @stillunsaid Love his work.. he’s fucking class @breengrue @Samniall1997 @villanellaaa He does @lovlymilkshake Is brilliant 😁 @putloveonangie I’m much better ahahahha @icaruspatience Yep Tomorrow ‘ moral of the story’ featuring me , is out. I love this song, I loved singing on it with the beautiful and lovely @ashemusic . Enjoy https://t.co/SQsDlmCtMV https://t.co/p6Ag4lA0di @villanellaaa Confirmed ?? 🤣🤣🤣🤣 @vane_ccx Don’t think we have one. We are soooooo coool @vickystaneadora @ashemusic She got in touch through my label and then I got her number straight away and we spoke @ineffabIelwt Ready when Sel is . @bravestommo ‘ The staircase ‘ @carolinalftv I can’t run anymore, so I decided I was going to start cycling @perfectlyg0lden Usually get 8 hours . Today I only got 5 and a half hours @RUBIUSXNIALL I’d say there’s 2 good ones, rest are shocking hahaha @niallhenergy No why? @nightsxlong I LOVE HAIM and those girls are very fun also @bostonniaII Night time I think @bnwniallj Had dinner and went to bed . @nightsxlong No and I would love to very much @bndtherules No @Daniela_CRam I think it’s my best work but i don’t think it will get a nom @Daniela_CRam I don’t believe it Hahahaha @njhsanfran No . I just woke up and I can’t get back to sleep for some reason but ....... cease the day and all that @nialltherules to an extent yes @NiallStyleNJH I am indeed . . @1Dforever_2020 I can’t @silkvol6 Yes it’s brilliant . @askiims I absolutely love the song. It’s haunting yet uplifting. She’s a very very smart songwriter and we need more like her. RT @MorningMashUp: 🥰🥰🥰 https://t.co/T2cNm4HEOX https://t.co/xPfxXZfDma @ashemusic Well that’s a major major compliment and thank you for it . This is your baby as we have spoken about, I wrote 4 new lines and sang on it. It’s still your baby and I have to respect that when I go to sing @ohdearpatience That’s exactly what I’m fucking telling ya 😜😜😜 Thank you @ashemusic for allowing me to sing your beautiful song ‘Moral of the Story’ with you . It’s out this Wednesday and I hope you all enjoy it x https://t.co/SQsDlmCtMV https://t.co/eogjXaPGGh @putloveonniall Ahahahah no I’ve cycled about 200 miles on this babbyyyyyyyy @DaveTodayFM Of course xx @champangelovers I think I scratched it in my sleep . . @willowg50517328 Lying in bed thinking I have to work out in 20 minutes and I can’t be arsed to get up. @nialwhorren That’s a button on my shirt @solongnialler Today’s weather . 23/24 degrees, sunny, small breeze @bostonniaII They are all very different . . I have been very lucky to have played some of the best, thankfully. @pallomniaII Have a few beers and a BBQ with the lads @dearpatiencie She’s the fucking best. Love her . We’ve become friends because of it. @holdmyhandniall I would absolutely never @letmeadoreyouu_ You need to be nice to me 😂😂😂 RT @ashemusic: some mistakes get made that’s alright that’s okay @NiallOfficial https://t.co/EiXLBmhfew I love seeing all the artwork you’ve been making around the album. Keep them coming ! For more info on how to enter go to @talenthouse https://t.co/7pog4hHhWy . Can’t wait to see what you got #HeartbreakWeather https://t.co/OvzE6N9G5b @LDNIrishCentre Not an Irish fundraiser anyway @onlythebear You honestly thought at 17 or 18 years old , that’s what I thought ? Hahahahahah . Ya don’t know me then Hahahah RT @1DOnChart: Niall's #Flicker has surpassed 1.7 billion streams on Spotify! https://t.co/zIFkf97c2y @horanftyonce No HHahahah @pepssafeplace Right hand is all about rhythm, like the guitar . Left hand moves the bass . Play individually and then slowly play both at same time . It will be annoying but you’ll be good @BetterOffTommo Yeh but do you REALLY think I was being serious ? Unbelievable !!! This is amazinggg https://t.co/V5eOcNlmOB @niallsperoni I’m a shit talker, so it’s a good way of getting rid @newstormangel Write your stories out, play 4 chords, start singing random melodies, see if you can fit some of your story into the lyrics with rhyme and slowly but surely it will match up . @harryftirene I just don’t understand where people think they get these stories .... @dearpatiences It’s all good . We’ll go again next year hopefully @niallerisart That happens all the time. Might change a line here or there.. happened loads on NTMY @RikkeS88 No. I write concepts before @niallsperoni I can bring friends now. There was government rule a couple of weeks ago where I couldn’t . @closetoniall Not me @dearniallangel Not mine @_bendtherules Of course not. @helloxpetal Watching pga tour Sunday’s from the pub. @horancuteboy The 50’s. I’ve made many mood boards, it’s going to be better @flickerftmitam Yeh in 35 mins @arctichoxran The more I listen, the more I love heartbreak weather @dearniallangel Concept stuff today. Was meant to be recording some of the stuff I wrote but someone fell ill . It is time to turn my voicenotes into records now @helloxpetal Can’t swing a driver in the living room can I ? Hahah @paperhouses I was a few digits out , but you get the point @BetterOffTommo I didn’t say it , but good quote @BetterOffTommo I didn’t say it but i would say it . It’s horrific to do that @TALKFASTGSGS Cracks me up @TALKFASTGSGS Yes this one . . I’ve seen this flying around for years. I mean let’s not go breaking hearts but I sound 8 years old @SxnflowerV0l6 @derbyteesniall Don’t even know what you’re talking about @derbyteesniall My favourite one if the paper airplanes apparent quote. @derbyteesniall Let’s go @bIakandwhite Sunny weather @flickerwish Yeh feeling good . Wish I could putt though @RUBIUSXNIALL I haven’t ran since about week 3 of lockdown maybe @always_harry28 Because my couch is big @louvinglyharry I think mine might be . There are sooooooooo many made up things on here, apparent quotes of mine. So funny to read and watch everyone believe them for years. @ziallstyles Correct. 😂😂 @flickerofhope4 Pubs are still closed @frmthstars That’s exactly what I’m telling you petal RT @radioleary: Wow. Thanks so much to everyone involved. Wonderful on line effort for @LDNIrishCentre 110k raised on the night, and the ra… RT @GolfDigest: Same, @NiallOfficial. Same. https://t.co/L2jKOpFsl3 Tears of pure joy again tomorrow it is https://t.co/Z4AmN7fLk6 RT @iHeartRadioCA: TONIGHT @etalkctv's #etalkOpenHouse continues with @NiallOfficial 🤩😍\n\n Tune in at 7pET on @CTV and 7:30pET on CTV2 https… @pallomoned @PGATOUR This weekend if the weather is good @derbyteesniall @PGATOUR Yes it’s gona be great . All the @modestgolf crew back playing very soon . .@PGATOUR I have missed you so much and I am over the moon to see you back! I might have shed a tear watching the broadcast 😭😭 Let’s get this number up . It’s such a great cause and I’m glad to be a small part of it . https://t.co/tJazRUtJOJ RT @eoghanmcdermo: We're live on @LDNIrishCentre Facebook and YouTube now raising money for the centre and @NiallOfficial is offering to fl… @stiIlhoran Correct Hahahahah RT @siobhni: Together at last @NiallOfficial @LDNIrishCentre #LondonIrishNightIn https://t.co/HwcbUpcRdC @nialwhorren You owe me 50 quid 😂😂😂 RT @gavinjames: So happy to be a part of this tonight ❤️ I love @LDNIrishCentre and the work they do! Also one of the best pints of plain i… @nialwhorren I’ll bet ya 50 quid We’re a lovely little country and there’s some very talented people in it. Come watch https://t.co/JzhAnRM8DF RT @IrishGolferMag: On this week's podcast we catch up with self-confessed golf fanatic @NiallOfficial - Listen Here - https://t.co/aYRHOfR… Tonight at 8pm BST I’m joining @radioleary and an amazing line-up of artists for the @LDNIrishCentre's Charity Night In. Each donation of £10 to https://t.co/FlOjtAK88a enters you in a raffle to come meet me in London. Get on it ! Tune in on https://t.co/SIKVqnCRf5 https://t.co/Is0hNlJaCw @AnnZheleznyak Nah just went coffee and now I’m sitting down to write some concepts RT @IrelandEmbGB: We’ll be tuning in to the @LDNIrishCentre’s Charity Night In at 8pm tonight🍿\n\nHead to https://t.co/Zz04N1z2Zj to watch @N… @everywhereniaII Yeh it’s going ok. . Finding it hard these last couple of weeks to come up with anything decent . You just go threw periods like that . I’d rather take my time than rush and release a load of shit @biancstyles They come easier @biancstyles No because you’ve basically told the story by then, so it’s basically any last thoughts to wrap the song up @RikkeS88 Yes it’s been a lot better. I have tendinitis in the one I didn’t have surgery one. So I took up cycling. It’s brilliant @horansalbum Still @horansalbum Arms of a stranger @horansalbum San Francisco @horansalbum Everywhere @horansalbum Small talk @horansalbum New angel @horansalbum dress @horansalbum Nothing @horansalbum No judgement @horansalbum Cross your mind @horansalbum Black and white @horansalbum Nice to meet ya @horansalbum Bend the rules @horansalbum Dear patience @horansalbum heartbreak weather @icaruspatience Obsessed @narriesangel Meeeee @njhsheartbreak No Hahahahahah . That’s brilliant. . No I just couldn’t make it that day . . @Jamie40685849 Patience is a big one. Also I would practice going between 2 chords over and over again. Start off very slow and then more confident you become with that change, it will get quicker RT @universalmusg: Bet you didn't see this coming 😉 It's okay, because same 🤝 #BlackAndWhite @NiallOfficial \n\nListen to the remix here 📺 ht… @nhtuned Scary guy @tinysunlouis Yep @_bendtherules You’ll know about it soon @stilllinIove Excuse me ?????? @dfnclesslwt Never @dearghostofmine Nope 😂 @tw0hearts1home 😂😂😂 The leader of the free world is Donald trump from the apprentice. I just had my daily dose of realisation. Day 1232 @FlickerOfStill Get to know about your local candidates in every election @stillnewangel Letting me down?? Please .... letting the world down @beachwoodlou Well we could all start by voting and that’s the real truth . If we want reform in the police system, you got to start at the top. do you think we’re going to get it from republicans or Tories? More chance of Christmas coming early. Hugely important primaries upcoming in the US!! To have the ability to vote is power, please use it. educate yourselves on your candidates and get voting. @ShesSunflower28 Ahahah sorry, you know I’m shit at this social media stuff @_sxphss_ @chooseIovehes I’m not saying. @chooseIovehes Listen I’m not saying that there are not police kicking off too. I’ve watched the videos, I’ve seen it. I’m just saying where possible, please protest safely . I’m trying to spread love for my friends @dearpatiences I’ll be there His attitude is one that I had goosebumps listening to. He said he always tries to look forward, he wants to educate people, he doesn’t want people rioting in the streets for him. He wants people to protest peacefully and as I said ‘educate people’. Protest safely for our friends I just bumped into my neighbour,  a young black man and we had the most amazing conversation about what’s going on in the world. He himself grew up in an area where racism was rampant, had many sad dealings with brutal law enforcement. But....... Can’t believe what I just watched. #TheShowMustBePaused ❤️❤️❤️❤️  https://t.co/GXv5zxge64 @its_cbhamilton I live in America most of the year, it’s in my interests of course. Let’s protest safely people. look out for each other. It’s time to really educate the younger generations that there should not be hatred based on the colour of the next persons skin. Only love.I go to bed tonight thinking of all my friends in America and hope they are safe ❤️ @MackayBobbi He’s done absolutely nothing to help the situation. Hasn’t arrested a single person involved and all he’s done is say “when the looting starts, the shooting starts” . That’s really really good leadership alright 👍 he brings 0 to the table @smalltclk Correct So Trump is now in a bunker ?? His country is struggling and he’s hiding in a bunker ? RT @irishcharts: Official Irish Homegrown Chart: @NiallOfficial's Black and White makes a Top 5 debut and is this week's highest new entry… Always a pleasure performing on @TheGNShow , thanks for havin me back ! https://t.co/Pi9T23ML6A RT @TheGNShow: WHO'S READY?! Tonight we're joined by @ChrisEvans, @ladygaga, @joshgad, @Michaelacoel, Michelle Dockery &amp; @NiallOfficial! At… Racism has been rampant for hundreds of years, it’s just that in this century people have camera phones to video it. It’s absolutely disgusting that you get mistreated because of the colour of your skin. You would think that those that are there to protect us, would protect. THUGS ?? these people are protesting against the fact that one of YOUR animalistic white policemen kneeled on George’s windpipe and forced him to stop breathing and killed him?? THUGS???? Are you listening to yourself? RT @BBC: Niall! 😍✨\n\nYou can listen to @NiallOfficial's beautiful at-home #BigWeekend set now on @BBCSounds. 🎧\nhttps://t.co/Fjwd4dXRY7 @elrinilla 😉 Incredible !!! Lovely version guys! Thank you 🥰 https://t.co/qc77KQivOl RT @TheGNShow: THIS WEEK! Join @ChrisEvans, @ladygaga, @joshgad, @Michaelacoel, Michelle Dockery &amp; @NiallOfficial! Friday at 10:45pm on @BB… @charlyniall Simple stuff like this.. just loved these coins when I see them on the shoot I did @natnewangel Correct hahaha Welcome @clutchprotour ! https://t.co/rqRy163zOm “When all the parts of the puzzle start to look like they fit it, Then I must remember there’ll be days like this”. 🙂 @dlibyhlucy I wasn’t heartbroken. I knew we were gona he beat and we probably shouldn’t have got to there anyway RT @BBCR1: N I A L L 😍✨\n\nYou can listen to @NiallOfficial's beautiful at-home #BigWeekend set now on @BBCSounds 🎧 https://t.co/u3OegiXdmA h… Poor Tom Brady. If he wants back in to this game of golf, he’s gonna have to pick the ball up and throw it #TheMatch definitely missed havin you all there but still glad I could be a part of @BBCR1 #BigWeekend ! you can rewatch my performance of Black and White now over on YouTube https://t.co/0smv0emKqN\n\nor watch my whole set on https://t.co/ezIleD4NF9 https://t.co/mXFM8XkMBs @BBCR1 @BBCSounds Cheers for having me. @dearwildflouwer Not me Back in 2018 when I last played #BigWeekend . Always look forward to it and this year is no different ! Catch my set tomorrow from 1.15pm BST on @BBCR1 https://t.co/cwwThkvIPl Gotta give it to @lcfc @Madders10 for accepting the forfeit after the challenge and wearing a lovely @dcfcofficial shirt. Top man Madders 🐏🐏 🦊🦊 https://t.co/cOGihUWiJl @NiallersNwAngel @Madders10 Wear a Leicester top with Maddison on back @cariadoresyou Hahah no worries @Madders10 @LCFC Imagine how sad it would be if ya had a red one with a tree on it RT @Madders10: I can only apologise @LCFC fans 😩 If you want to find out why I’m wearing a personalised @NiallOfficial Derby County shirt y… @Madders10 @LCFC Yes Madders. Cmon @dcfcofficial The stripped down version of Black and White is out now ! We recorded this one with @Spotify in London a while back and I’m so happy you all get to listen to it today. Enjoy x https://t.co/duKMt9EzXn https://t.co/wgAin177jS RT @ThisIsWhereWeA1: Niall has done an incredible job!  #HeartbreakWeather  is exceptional go stream it on @amazonmusic now ! @NiallOfficia… @iHeartRadioCA He’s a funny fucker RT @AshLondonLIVE: \"Wowee, what a treat\" - @NiallOfficial 😂😂😂\n\nThe first part of the 20 min Zoom chat Ash &amp; Niall had is here: https://t.co… RT @Smallzy: .@NiallOfficial chatted to me all about new music and how he's staying busy in isolation 🎶 \n\nListen to EVERYTHING he had to sa… RT @AshLondonLIVE: Incase you forgot...\n\n⏰ 7PM AEST\n \n👂 listen live at https://t.co/cjhZ5juYZb\n\nOR\n\n📲 on the Hit app (https://t.co/eiOIooGW… RT @BritishGQ: Don't miss @BBCR1's #BigWeekend featuring @samsmith, @jonasbrothers and @NiallOfficial 🔥\n  https://t.co/zr8E7jz28Z @HLDailyNews I’m just going to not answer the question anymore because if you read that quote it obviously reads that I’m being serious when I say “ and we came to the conclusion there was nothing”. If you watch the interview I’m 100000 % being sarcastic and it’s obvious. I won’t answer again Very sad to see ‘The Last Dance’ finish. Best sporting documentary I’ve ever seen. Passion, dominance, quality and class, Michael and this team had it all. if you find you doubt yourself or need inspiration to get going, this is your show. @nova1069 You’re not having my sunglasses RT @AshLondonLIVE: Our fav Irishman @NiallOfficial talked to @ash_london on Zoom for almost 20 mins!!! \n\nThe first part of the chat is on t… RT @997now: When you realize you were suppose to see @NiallOfficial tonight at the @SAPCenter 😭💔 https://t.co/lskPCHngJ5 @997now @SAPCenter Stop please it’s too sad RT @radiodisney: Here's Wednesday's #RDTop3!\n1. @DuaLipa - #BreakMyHeart\n2. @NiallOfficial - #BlackAndWhite\n3. @OfficialMonstaX - #WishOnTh… Love you hules !! Miss you and can’t wait to hug ya xxx https://t.co/aqEYbK7T0i @talkSPORT Playing a round of golf alone and listening to the boys Adrian and goughy. https://t.co/9LcPL7K9lq @ohnoflicker Yeh I’m going on the radio with my Aussie mates RT @Smallzy: I just hit play on @NiallOfficial's brand new track #BlackAndWhite 🙌🏼\n\nHow good is this song! Niall will be on the show THURSD… Welcome @pulserolluk ! Excited to work you https://t.co/iA7VJd4Ncb @iHeartRadio Coming in hot real soon, don’t worry @markmac14 @niallsperoni promise ? @fireproofamber I’ll either be unbelievable or horrendous @flickersnjall Especially when I play alone. 2.5 hours with your own thoughts @flickersnjall Multiple times @niallaar True shit sorry. I’ll do it this week , keep reminding me or I’ll forget @njhnewyork Yeh I’ll show some maybe @horancuteboy I’m on to the new season of one of my favourites shows ever ‘ killing eve ‘ . Jodie comer is the absolute best @solongnialler You have no idea @bIakandwhite Correct @_sxphss_ I’m gone . Enjoy your week 😂 @niallsperoni @markmac14 macca can’t stop this train from rolling . I’m playing alone tomorrow @flickerofhope4 No I haven’t . Will do when I’m back down in Florida. Rorys dad is a member @everywhereniaII @stilllinIove I was working. . Too busy. Going tomorrow for definite . @stilllinIove Tomorrow I’m in Our friends @taylormadegolf have done a great job here. 4 amazing golfers in Matt, Rors, DJ and Rick, great golf course, raising millions for covid- 19 relief! Well done to all involved @skysportsgolf @GolfChannel @_bendtherules I got up, had breakfast , cycled 20 miles, came back did an interview and now I’m sitting down to watch golf . RT @MTVMusicUK: Check out this week's MTV OMG playlist featuring the hottest tunes from...\n@NiallOfficial \n@5SOS \n@Alesso \n@LiamPayne @Aria… RT @SiriusXMHits1: IT\nFEELS\nDIFFERENT\nWHEN\nYOU'RE WITH ME\n\nALL OF MY LIFE IT'S BEEN HEARTBREAK WEATHER @NiallOfficial Looking forward to watching live golf on Sunday ! @TaylorMadeGolf https://t.co/C1zvxO7Z7N always been a huge supporter of me and I really appreciate it. Cheers @BBCR1 https://t.co/smjClp3CKH @stilloverose I’m not releasing anything til it’s a banger 😂😂 2am sitting in my living room basically in the dark and writing a song ....... cooooool RT @ebonyday1: Only took ten billion tries to get the chords in the right order but I got there in the end 😂 here’s a little bit of Black &amp;… @ebonyday1 Beautiful version and beautiful voice !! Tone is so pure. ❤️ @AshLondonLIVE I bloody wish I was coming down in about 5 months or so but heyyyyyy ! I get the idea that Health secretary Matt Hancock thinks he’s a lot more intelligent than he actually is. Always very smug and slippery. Excuse me but Matt you’ve had a major howler here and it’s about time you handed facts out instead of worrying about what the opposition thinks @3amhxrry @AshLondonLIVE @Angus_OL Correct . When the Irish and the Aussies get together, the badness comes out in us all 😂 @ohdearpatience Writing lots of songs for your ears missy . @nhandpotatoes @tinadfwyb Something really special. @tinadfwyb I ended up writing yesterday , today I’m working , tomorrow I’m working on something really fucking cool . The weekend will he my golf time @AshLondonLIVE @Angus_OL 😂😂😂😂😂😂 adamant for security reasons ( oh yeah coz I’m always causing trouble in pubs) that I take my hat off. Funny though, on to the next one how do I get my hands on those @chicagobulls warm up jackets from the 90’s, they are sooo cool. 🤘 RT @Bose: @Chris_Stark @BBCR1 @NiallOfficial @BBCSounds Let's go! 👀🎧 excited to be joining @BBCR1 at their first ever #BigWeekend remote festival on the 22nd-24th of May ! https://t.co/hIipFT7Zae https://t.co/TmVgMWPhAI @billboardcharts He’s disappeared but he’s back... It feels like a scene from a rocky movie. @Sekhmet_ Absolutelyyyy . Get some clubs and go play. Everyone can play @flickersnjall There’s nothing better than the vibe in a room when a good song is being written. bouncing off each other’s ideas, being able to easily put a particular sound on a guitar, play a different key board or Rhode. Having said that I do really enjoy not having to leave the house @SeeingxFlicker The tattooist of auschwitz. Nearly finished @njhsheartbreak Write them all down on a seperate page and pick what the best ones actually are, also what rhymes / sings well . @everywhereniaII Easy @myidolsbravery When shall we do it ? @ohdearpatience If you have something like this maybe?? ....... @flickerpatience Then got conor Masterson to play the violin on it @flickerpatience We just played everything live like as if we were playing on stage ( Greg Kurstin and i ) @ohdearpatience There’s 3 Roberts in my family. My dad, grandad and cousin, so I thought I’d keep the name going ahahahah @findyoumydear Reading for a bit now. Then I’m gona go on a big cycle and it’s willies birthday today so we’re gona make some food later tonight . @tpwklucy @BBCR1 Nailed it RT @Chris_Stark: Niall and the Machine (DJ Set)\n1pm on our show today ✌️🎶\n\n@BBCR1 // @NiallOfficial // @BBCSounds https://t.co/O87Cr4BhlN RT @Katelynx91: Niall Horan really has straight jams. I've not heard one song I didn't love yet from him. 🤔 @tkunde4 Yes @Arms_Of_Niall_ Not long at all. An hour maybe RT @officialcharts: 😍 @NiallOfficial's former Number 1 Heartbreak Weather returns to the Top 40 thanks to its new vinyl release #Heartbreak… did a little guitar tutorial of black and white for @BBCR1 .. have a look https://t.co/mDawdlCCU1 https://t.co/pn9ui4Zq8p See ya soon ❤️ https://t.co/QoOHE5JR0Z sorry I couldn’t make an appearance on @grahnort guys. The show is shot during the week and I was too ill to get involved. If Graham will have me back, i’ll get on again soon. @sunflowerljp Oh jeuss . I’m fully back 😂 WE ARE BACK https://t.co/2vVut2p5DA #BlackAndWhite vertical video is out now ! https://t.co/kaf2iPCJBT https://t.co/c7sVYy5MBi RT @irishcharts: Official Irish Albums Chart: Following its vinyl release, @NiallOfficial's Heartbreak Weather returns to the Top 5 and is… check out time synced lyrics on @AppleMusic to sing along to my favourite lyrics from #BlackAndWhite https://t.co/EzMMRhLLGn https://t.co/aBowg3jZji @romcomhes I’m not even crying hhhahahahahahaha @fIickerangeI I just don’t understand how people can say what they want about me online ( a person they don’t know ) and then when I come back at it I’m the prick . I’m not roasting anyone @nojudgemvnt @tobaccovanillou 😂😂😂😂😂 if that is what I’m up against then I give up @tobaccovanillou Show me all the crying images and I’ll explain all of them . 😂😂😂😂 @ItsDaniAlexis Yeh I’m better .... finally made it out of bed ahahahha @2011upallnight @Moon_Lightwood Exactly 😂😂😂😂😂😂 @Moon_Lightwood Why ya confused petal? @niallrelate Yeahhhhhh babyyyyyy @aIIexposed Are they not? @tootsieharold Ever hear of a technical issue ? @tootsieharold Correct. turning off mics ? Ya joking ? Hahaha. The stuff I read on here hahaha @niallsheadspace Correct and right my love.. @mendescole1 😂😂😂😂😂 @Arms_Of_Niall_ @PaulSmithDesign @paulsmithdesign @stilllinIove Correct 3 years ago I released ‘Slow Hands’ !! fun song to write, fun song to record, amazing to perform and even better watching it climb to number 1. Thank you for your support on this song and album xx @NiallersNwAngel Literally . “ go home you’re drunk pal” RT @officialcharts: Official Chart Update: @NiallOfficial's chart-topping album Heartbreak Weather could torpedo its way back into the UK T… RT @SkySportsGolf: 🗣️ \"We've put a lot of time and investment into doing this properly, we are on site at various tournaments whenever we c… Sorry been quiet guys, haven’t been feeling very well last few days. . I’ll be back soon x @stilllinIove Don’t feel well RT @AppleMusic: .@NiallOfficial leads #AListPop with #NoJudgement. 😍\nListen here: https://t.co/mQW68x3loo https://t.co/kGypvs8IqQ @NormalPeopleBBC Great show, great acting. Congratulations guys!! @flickernialls Think it’s the massive back muscle @charlottes0phia Get into it , it’s brilliant @AiryFairyLiz It’s basically my teenage years 😂 @fireproofamber No I didn’t actually know it was a book. Will now. cheers for the recommendation If you ever want to know what it was like growing up in rural Ireland, the first two episodes of ‘Normal people’ is a fair assessment 😂 . Think I also might love marianne I’m on @RTELateLateShow tonight. 🇮🇪❤️ RT @TheGNShow: Next week on #TheGNShow we have @IamSandraOh, #StanleyTucci, @robbeckettcomic, @RomeshRanga, @OtiMabuse  and @NiallOfficial thanks @applemusic for putting me on the cover of #AListPop ! https://t.co/M8zLbpNBQq https://t.co/vffJMtDICc The boys @itsDannyJones, @tomfletcher, @ollymurs, @jamesarthur23 and i came together to shine a little light on all of the key workers during these dark times . hope you enjoy x https://t.co/ZxDULPtRX1 Listening to Mo Farah talk on @talkSPORT. I’ve met the man on multiple occasions, had a laugh, played football with him and I can say he’s an absolute gentleman. Hearing him on the radio is like listening to someone superhuman. What a champion!! RT @RTELateLateShow: Also on the show tonight, the lovely @NiallOfficial will be chatting to us from London. #latelate https://t.co/36kwUrz… @horancuteboy Ya won’t my friends @juliamichaels and @jpsaxe wrote a beautiful song and all of their friends including me jumped on it in support of @MSF_USA helping COVID-19 relief https://t.co/GmtCyKr7uU https://t.co/LHmVkBJ8ZS I’ve been on hold to Apple for about 45 mins and I haven’t heard one Niall Horan song ... wowwww !!! Speechless RT @modestgolf: A message from us to you. @modestgolf ♥️ https://t.co/pbLClvtyJi @JamieMoonenn @iamirishdave Agreed. Sound skin @icaruspatience @PrfectlyFlicker No I enjoy the shit actually, I just know there are people who don’t @PrfectlyFlicker Correct ! Everyone chill out ❤️❤️❤️❤️❤️ https://t.co/dKrlcdom7I RT @Pressparty: Two years ago today, @NiallOfficial made history as the first Irish artist to hit 1 billion Spotify streams https://t.co/wf… @bedroomflicker Yeh I’m so tired now . Long day RT @SiriusXMHits1: We're soooo happy to have @NiallOfficial take over TOMORROW to Hits 1 n chill!!! He'll be hosting his own hour + telling… RT @ImeldaOfficial: We can definitely do this! Keep going everyone and we’ll get there sooner. X Thanks @NiallOfficial for your dedication… @MTVUK @MZ_Udit I do the same We can do this #UniteByStayingApart #InThisTogether https://t.co/3FTAkv9SSq @larrysglitter PALLOM RT @BBCR1: Of course we've been watching @NiallOfficial performing from his coach 🤷‍♂️🤷‍♀️\n\nListen to him talking about writing new music a… @MTVUK @maggierogers No you can’t @livenationmy ❤️ @fireproofarii @stillcapaldi 😂 @fireproofarii @stillcapaldi I hope someone is doing it for me @sinceewerealone A nose . @horanhearted I haven’t worn this T-shirt in a agessss @lilflicker Yes @xSunshine_Harry Yep RT @CapitalOfficial: Niall has been passing on his expertise, the angel 😇 https://t.co/u3dTFiCOXQ @fIoofniall Pissing rain Indeed mags !! See ya on zoom babyyyyyy https://t.co/q4sP2N2emi RT @umusic: 📂Documents \n └📁 @NiallOfficial albums\n      └📁#HeartbreakWeather\n          └📁 Skippable songs \n              └📁(0) items @niallvinyIs We already have summer weather here in England @nhtuned Gin, elderflower tonic, lime, raspberry and blackberry @njhsheartbreak drank a bit last night so I just wanted to run it off @niallersmug Correct 🙂😂😂 @armsofalouie Uk 8 @bostonniaII I mix with him @chescasrants Coz I where what I want @shawnsnewhope Just go to the melody that feels the most natural at the point in the song . I usually sing the chorus and then just keep going on a new melody @itsalongwayup Coz it’s where I dry my hair 🧐 @thelaurajayne_ It is indeed. iPhone doesn’t do that view any justice. One of the nicest views about @niamhworkman I moved out of that house @smalltlkniall I wear them watching tv @niallerisart NTMY @bIakandwhite You explain @flickerpatience I’d love to ! Maggie is the most fun and lovely person I know. We would have a laugh even if we never wrote a lyric @ohnewangel Free falling but did that for John Mayer cover @arctichoxran Both of my parents were born in 1960 , so as they were growing up at the start of the next decade, this was the music that was in the charts at the time. Thankfully they passed it on to me, I wouldn’t be the same person without this stuff @njhnewyork Any time at all @stillcapaldi First Tom petty song I ever heard and I remember being obsessed and playing it over and over as a ten year old @natmyNH All of them @stilIstrangers Yeh I think it’s great but it’s hard to pick one song a day @realDonaldTrump Wish you would use common sense before you open your mouth. @nhwalls Yeh kinda used to be being behind . What happens is, I think about it all day and then something grabs my attention in the evening and i completely forget 😂 Happy birthday to the queeeeen @maggierogers ! Can’t wait to dance around the pubs of LA with ya when this is all over @icaruspatience Gona do a little workout I think. Had a few glasses of rosé last night and I’m going to sweat them out first . Free man after that @niallsdimples Always a great interview with Tom @niallmynewangel Why you asking me ? Hahahaha . I love it @nialldivinely Yeah @BBCRadio2 @radioleary @BBCSounds Love ya Dermot !! ❤️ RT @BBCRadio2: N'aww, we love these snaps of @radioleary and @NiallOfficial from a few months back! 😊🧡\n\nFor today's #PhoneInFriday, Niall t… @hbwpigeonary No actually @derbyteesniall Definitely @GirafaGitana If we want the quality we get then yes .... some people are doing zoom writing sessions but there’s a delay on that. The one we are using, we can make full tracks on it @foreigniall There’s nothing like the vibe in a room when you are writing with others but I’ve written tonnes of songs alone at that piano. @newangeldaisy I mean yeh it’s been complicated. The software we are using to record remotely isn’t the most trust worthy of all time, crashes quite a bit hahaha @niallernroses Yeh wrote ‘ everywhere ‘ on the beach as the sun set @RikkeS88 I always thought I was quite an efficient person but i definitely am Hahahaha,  I get it done here . Black and white!!!!! I love this song with all of my heart. Up there in the top 3 or 4 songs I’ve ever written. Hope you are enjoying it and it’s video ❤️ RT @FM104: @flickersfire @NiallOfficial yes! @sunfIowernarry Chorus is definitely hardest @sunfIowernarry I think it’s the easiest actually , @niallrelate @shesnewangel I have some stuff to do but not much @fIlckers Happy birthdayyy!! @niallhenergy Coz It’s my bedroom and this is where I sleep 😂😂 @shesnewangel wake up, did 2 live radio interviews, breakfast, workout (before you know it’s 1pm), shower, go to the store, cook lunch, write a verse and a bridge for a couple of songs I haven’t finished, got some modest! Golf business to do and then chill for the evening coz it’s Friday @niallsheadspace Yeh wanted to do it all like the skyline on the cover but the vinyl company couldn’t do it @MissIsabells No they are good actually . Just watch your rhyme at the end of every second sentence. For instance “ when this is all over, I’ll find my love. I’ll run for forever to find what I’ve been dreaming of “ . Probably a bad example as I just used the first phrase ahahah @PrfectlyFlicker Tomorrow or Sunday maybe . Taking it easy today @JuliaR_AA No @Josefine_sand I mean there are 10,00000 songs I feel everyone should listen to but....... holly is a new artist, this song is absolutely beautiful and she’s going to have a great career, i promise @theirelad Just been on radio 1 and radio 2 @vane_ccx Sorry I was very busy, I’ll do two tomorrow @MyNiallKoala I’m sure they are inundated with requests and all sorts , I’ll have a look into it but I’m sure that’s what’s happened. Apologies @everywhereniaII Did a bit on my own and then joined the lads @aesthxticstyles I really don’t know and I really don’t @ohdearpatience I just wrote them 😂😂😂😂 some aren’t even near finished. @niallhoran_oops I like this a lot . Reads very well RT @byalexpopovic: In love with this song ❤️ #BlackAndWhiteMusicVideo @NiallOfficial https://t.co/mKxrXGZS8o @dearchonce I released one 48 hours ago Hahahahahah will ya give me a minute 😂😂😂😂😂 @MikeAdamOnAir 😂 @flickergolden32 @niallsnewxngel Yeh I’ve been keeping an eye out for lyrics online here ... I’ll sit down and have a proper go it this one of these days @Tomlinbucks I’d say a lot of my starts have been piano and then guitar kicks in after @horanftyonce I obviously have a melodic pattern than I tend to follow without knowing @flickersnjall It’s okayyyy !!! My good melodies haven’t kicked in yetttt @littlelouv Yeh I have and I would yes @sanfrrancisco Yeh there’s one we started last week and we’re on our third version. making sure we get the right production, tweaking melodies here and there. It’s important to get production right early as it might change the way you sing a melody @armsofnh Yeh it was good actually . Took off that shit green icing and ate the sponge, that was lovely. @PrfectlyFlicker Aww lovely!! Thank you . . We have a sickkk team! All of @_CTierney ‘s footage @newangel Yeh I’ve been trying . . No I don’t think I’ll ever go to the studio anymore ahahahah . I prefer it. I get to mute everyone else and come up with my own melody instead of us all shouting over eachother in the room. @_sxphss_ Big response ., let’s get it into the millionsssss @horansalbum Yes sometimes I write very well and then others I listen back to my voicenote and I’m like who the fuck is that singing ? @flickernialls I have loads of stuff written down and I’ll go to that for inspiration. Sometimes the night before I might try and come up with a melody to kickstart the next days session. @helloxpetal @iamkialee I was just messing about and thought fuck it , I’ll make Friday easier @thelaurajayne_ Get out there babe. Save up and go see the world. @niallsnewxngel When you put yourself out there like that, you have to do it better than anyone. I’ll keep trying to do my bit but I’ll not always get it right. @niallsnewxngel Of course I would but I don’t ever want to be a hypocrite. I try and do my best to save energy where possible, I use as little plastic as I can, I turn the taps off when I’m not using them, I turn off lights where possible but ...... if I ever go off campaign, I’m a hypocrite @elkhairhoran No it was a village elsewhere in Thailand @iamkialee No I started cleaning my bathroom and changed the sheets on my bed 😂 @super_star_96 Yesssssss!! I appreciate being able to get out of the hotel so much you wouldn’t even believe @strangersniall West coast of Ireland and that was it. Couldn’t afford anywhere else @Wild949 Miss you too @bIakandwhite This one was amazing ! 10 miles in Yosemite, California. Hence the levels of sweat @closetoniall The golf course 😂😂😂😂 RT @Vevo: Dear @NiallOfficial, we promise that we'll love you for the rest of our life 😍Get a glimpse of the tour life and learn all the ly… @nojudgemvnt Gave it a go though @nojudgemvnt Absolutely not . Not for me the baking thing @theirishkingnjh I was trimming the edges off my icing @roseappleliam In the hole petal..hole in one @smalltalkari Exactly , I’ll always have cooking @niallersfloof Not very long clearly hahaha @armsofstranger Probably not hahah @wontbetheIast I’ll never place in that contest Hahahah . Standard way too high . I’ve never baked in my life til today @flickerwish I made a cake about it . That’s how much Hahahah @niallsfavguitar No got other stuff tomorrow but I’ll probably just write a verse and a bridge for a song I started today , at some point tomorrow evening quickly @YouKnowHoran @horancuteboy Just two but I had to play all the guitar parts and I mic’d up the piano in my living room to play, setting that up took some time @horancuteboy wrote from 9:30am - 7:15pm @crossthetide Yeh wrote a couple of good ones today . Really enjoying it @icaruspatience Angela - Lumineers . . #BlackAndWhiteMusicVideo RT @BritishGQ: Following the amazing success of his No.1 album 'Heartbreak Weather',  @NiallOfficial today premiered the video for his new… Black And White video out now ! go give it a watch x https://t.co/vtHXReKH0k #BlackAndWhite https://t.co/TY7BTDsZdb Hope you enjoy this #stayathome playlist I made with @Deezer to carry us through these days at home ! https://t.co/gI0UUB7PPL https://t.co/kGLTt2DGCq @flickersnjall Ya won’t see me for days ahahahah @dearwildflouwer Big song writing day today @helloxpetal I tend to naturally come out with country melodies . It’s true there is a bit of that too it @hrtbreakbarbara Thunder road or I’m on fire @stilIstrangers 😂😂😂😂😂😂 brilliant @lilflicker Need a chorus aswell 😂😂😂 @bIakandwhite My phone was about to die @theirishkingnjh Keep going babe .. @stillnewangel That’s not my writi @trulyjessNH Yes great ! Let’s do it @smalltlkniall Oh amazingggggg)! @natmyNH I love it so much @tpwk1Dx The news Delighted to share that Black And White is the next single off Heartbreak Weather. Love this one more and more every time i listen to it . Video out tomorrow at 6pm UK https://t.co/mXFlVSAraO https://t.co/Xunf6HXTx7 I promise that I'll love you for the rest of my life https://t.co/jiyb622jRq @LallaySouza Is mental?? @poeticjace Reiss There'll never be another https://t.co/Cig8agTrTQ @flickerofniallj Yes bigtime @Wendys_89 I’m coming in hot with two songs today @Wendys_89 Yeh sorry got busy. ended up writing I see us in black and white, crystal clear on a starlit night https://t.co/Pjql5Cf76Y @niallsnewrules The smoothest , creamiest pint of Guinness . Oh Jesus I can’t wait @niallxwalls Vegas Niall @needanewangel No I can’t ahahah @moonlightnjallx Friday . Done babeeeee @newangelsteve Fact @bostonniaII Different every time. I like story telling so I usually try start at the first verse but sometimes you might bump into a melody that sounds like a chorus and just go from there @RikkeS88 Wonderwall @restaquiniall My friend and I @toosweetflicker Mine @allthenouis @juliamichaels merch ❤️ @ohnoflicker Usually a semi tone as you say @ohnoflicker All the time .... 80 % Of songs I’d say. . @mirrorsdonny definitely come up with my concepts at night . It’s quite, alone with thoughts etc @mirrorsdonny We’ve decided we’re gona start at 9:30 am and take an actual lunch / gym break in the middle of the day and then go again @habithazza A month ago @helloxpetal Sweetener @myirishfeelings Never unreleased songs @blckwhitexniall No @nhtuned oh highly underrated !!! My streets of Philadelphia @_sxphss_ I have a few hahah @LEEYUMSNIALL In the house, 5 !! @derbyteesniall Depends babe @niallstiIl I’ll do it . We have time babe, we’re going absolutely nowhere @MissIsabells Nashville @imanarrystan just whatever feels the most natural based on feel I guess and the general consensus of What everyone is thinking @flickerdem It’s easier for sure ahahah . Don’t have to get drive anywhere @helloxpetal The little one I use a lot more . . For a small guitar it makes a bigggg sound and it sounds great when I finger pick it . . The bigger one is great for big strumming Patterns and going into other tunings like DADGAD @damnnviall Lunch for sure @80SFLICKER Fuckkkkkk @80SFLICKER You made these ??? @stilIstrangers No never seems to be the case. You might take production stuff away but never to that extent @Josefine_sand Bend the rules @flickersfire That playlist I made for zane Lowe’s interview the other day, I’ve been listening to that a lot @flickerpatience Yeh depends how ya start the song. If you start a song on acoustic guitar and it sounds sad, you also then have the option dress it up however you want production wise after. If you start with a drum groove or intense riff, it’s hard to go the other way @harrryyisgolden Eat, walk, drink loads of aguaaaaa @lostonlewis Pub @thunderstovrm Helps if it’s quiet and you can think about life etc @dearpatiences Don’t think so babe @defencelesslilo Meeeee @lilflicker Definitely less pressure here @njhsbuddie Go @needytommo I agree @adamsniaIl Still @njhnewyork Melody has to come first.. I find writing stuff down (full personal stories) helps lyric come quicker. @findyoumydear I’ll try @ntmyimbronsgem I’ll try @stillinlovenjh Yes . Delicate and yesssssss @stilllinIove One of @strangersniall It’s soo high in the key I wrote it in Hahahaha @lovebeneathskin For sure @horancuteboy I’m never going to the studio again 😂 @habithazza I’ll be coming in hot later today when I go to the shop @_sxphss_ You have no idea!!!!!!! Breaks my fucking heart @ohgodmylarents Yes I did @flickerswift13 I’m enjoying it. Think we need to enjoy it . It will be over soon if we just stay inside .. @niallmysuun I’m still in bed 😂 @eversincemanila A fair few petal @RikkeS88 I mean look at my face in that picture, it’s not easy 😂😂 @fireproofamber I’ll be back @fireproofamber It was raining yesterday @icaruspatience Ask the millions that listen to it every day since it came out @stillcapaldi Not an easy life @iamkialee Ya are missing out @bIakandwhite Depends what I’m playing . I prefer to pick with my fingers and prefer to strum with a pick. On stage I have a pic holder on my mic stand , so I can do both @niallernroses Pretty soundproof our place @njhnewyork It’s not @lovestillniall Thank you but..... i don’t need / want any plaudits for these donations and I’m serious about that @NHFLOOF1 No I’m hungover 😂 @ZlayingZjmft1D ❤️❤️❤️❤️❤️ @ceisharry Don’t think so @xflickerNHx Need a few more moments RT @GlblCtzn: .@NiallOfficial has been a big supporter of our campaign in the last few weeks.\n\nIt’s so wonderful to see you back for One Wo… @GlblCtzn Not a problem!!! See ya for the next one It’s time for @GlblCtzn’s One World: #TogetherAtHome ! Tune in now https://t.co/5gMwcVdxZJ https://t.co/67ILYYJCwO With greater support they will be able to reach so many more, always a priority but especially during this unprecedented crisis. It’s a real pleasure to help such a great cause. Through interactions with the Irish government and HSE about critical and immediate support that Ireland needed, I found out that @ALONE_IRELAND was a charity doing fantastic work looking after older people all over the country. RT @ALONE_IRELAND: We are truly delighted &amp; grateful for the support of global star Niall Horan @NiallOfficial who has donated €100,000 to… @AnneMarie @LiveNation 😂🥰 @newangeIniall I won’t . I’m going through old videos of me singing karaoke hahah My live shows are not possible without the incredibly hardworking crew behind the scenes. Please join me in supporting them through the #CrewNation Fund by visiting https://t.co/MZHg60lmuo to donate or buy merch. @LiveNation is donating $5M upfront + matching the next $5M. https://t.co/5duM9m5Y4Y My good friend and legend @GaryBarlow invited me to his #thecroonersessions and here's our version of Slow Hands together https://t.co/jenHBGz0h4 @crossthetide Ahahah ... I reset all of my pedals up (took ages) and the last thing I needed to do was just flick on the amp , when I flicked the switch a fuse blew @niallerisart Depends @flickerhialler Yes my 1964 fender telecaster ❤️❤️ @newstormangel Different guitars for different sounds . I know which one of my acoustics would be right for a certain vibe @dearwildflouwer Ahahah I was doing a session earlier @nialIsangel With zoom there’s too much of a delay @nialIsangel We only have zoom on so we can atleast see eachother . We are actually using software on the computer where we can hear eachother and record as normal @armsofniallh A 414 @armsofniallh Yeh same mic . @damnnviall I wish it was easy to explain. Artists who don’t write their own songs just record all the time. If you write your own stuff you are writing then recording as you go . . Hard to explain. Just write something and then record a little scratch vocal quick . @smalltaIknh Yeh good one today @nhtuned @Conor_O_Donohoe Yeh fuck him , look at that extended tricep 😂😂 @JKCorden @NHSuk yes Malcolm !! Love it @ashleyft1d 😂😂 10 years since my Xfactor audition aired on TV. Lost for words to be honest. All I can say is thank you to every single one of you for your support over the years. I love what i do more than most so, thank you !! ❤️ RT @GlblCtzn: @NiallOfficial @WHO We can't thank you enough for the support, Niall! #TogetherAtHome 💕 Woww!! What a lovely gesture . https://t.co/Z6KZKWy1ev @nhandpotatoes Oh cmon Babbyyyy @bnwaesthete Please tell me you know that I’m joking ?? @crossthetide Yes @larrysvalntyne Easy @CapitalOfficial Niall horan @stilllinIove We’re not doing it totally through zoom. We’re just using zoom so we can see each other but we’re hearing ourselves through software we have @flickernialls Conceptually i find it easier being home. More time to think of stuff to write about @natmyNH It sounds good actually yeh. We would all definitely prefer to be at the studio but ayeee @bndtherules At the moment we’re just messing about, trying to figure the best way to use the software that’s enabling us to do 3-4 way studio sessions. Complicated stuff. Written a couple of halves of songs etc and put down some riffs etc . we’ve got time to make mistakes @dearpatiencie @crossniallsmind Yeh it’s quite difficult but we’re trying to make it work @yearsinthedark @crossniallsmind It’s ridiculous. He’s a major part of my life now and as you say i went to see him when I was 4 years old for the first time @thedaywestarted Tune aye ?? I’m excited to join @GlblCtzn for One World: #TogetherAtHome, in support of @WHO’s Solidarity Response Fund. A lot of incredible people are involved, it’s one not to miss. Tune in this Saturday April 18: https://t.co/bjMyc4iEr6 https://t.co/70l0FTB1jR @niallakasmile Yeh I think I might @artvvniall Maybe , if that’s what people want And a great caddie at that .. we’ll do it again some time https://t.co/Gsn8te0tMa @mirrorsdonny @dimplelouie Tell me about it hahaha @dimplelouie Hahahah babe I’ve been listening to these songs for a lot longer than a month. @newangel My amp broke the other day when I plugged it in. Have no way of getting it fixed @myirishfeelings Rumours @dncingmoonlight We would love to do that. I’m sure one day maybe. We’ve written together but nothing came of it. We’ll try again @gotIoveforya No but I’d love to or even play there @flickernialls Good actually . Late to bed tonight for some reason but I’ve been good @_sxphss_ Yes.  On the loose, slow hands, since we’re alone, bend the rules, PALLOM, San Fran, @niallhsunflwr Multiple occasions @yarahbw Heartbreak weather . Everywhere @njhftdolans Wow !! ..... best song is slow hands. Favourite song would be black and white , PALLOM, flicker @happilyval Heartbreak weather @dearpaitence There’s so many guitar parts stacked on top of eachother on the record, we usually just take a part each . @ohgodmylarents Natural as possible . If you try and chase “ the hitty melody “ , you’ll never find it @crssyourmnd Put a little love on me will always win that . @nhtuned Jane @nialltour Black and white @nhtuned I think I’d have another go at slow hands . Slow hands was dirtier sounding before and I toned it back, wish I hadn’t @NiallersNwAngel Heartbreak weather is a hard song to play and sing @NiallersNwAngel Still is easy to play but the tuning of the guitar is mental and I’m not very good at finding it ahahah @harryseingblind Oh I have a few favourite Bruce albums. Born to run, darkness on the edge of town, born in the USA . Dancing in the dark would be a song that means a lot @soft_njh Went for a walk today and walked around where I thought of the idea for ‘everywhere’ , so I was having a reflective type day . @admitreckless Holy shittttt !!!!! That’s what a colourful tone sounds like . What a voice ! @crossniallsmind Ok lets do that on my next live @hawyeehoran They were unbelievable , timed the frying perfectly tonight . Juicyyyyyyy @NewAngelAng How to rock the fuck out like no one is watching @Ioveonniall What a question!!!!!! Dress would be just before still and nothin goes just after new angel @heartbreaktours @bIakandwhite The verses in heartbreak weather talk about what happened in San Francisco then San Francisco is talking about wanting to be back there @bIakandwhite About stuff that happened in San Fran . Heartbreak weather and San Fran are tied together Oh why thank you xxx https://t.co/WWgJLurVcz @smalltalkbaby In his late 60’s he was still playing 3 hour sets in full stadiums . . As an artist you want classic songs and in turn you get longevity and I really look up to Bruce as he has all of the above . @smalltalkbaby He’s got everything . Goodlooking dude, always dressed cool, he speaks to the masses with his lyric and his chat,wrote amazing sad songs and also rock classics, demanded the audiences attention and you can tell he’s always loved what he does. @newangeIhoran Not think that I’ve just put a sweater on? The white bit sticking out at the top not the the tshirt In previous post ? 😂😂😂😂😂 @moonlightnjallx Cmon darling what are you waiting for ? Get on Bruce Springsteen. You are missing out @niallersmug Hahaha I only had 2 bits of chocolate 😂😂 @crossthetide lose the plot at the weekend and eat and drink what I want. Midweek I’m usually pretty good . @dearpatiences I’ve definitely cut back on it . A little Milk in tea about 3 times a day, cheese on a burger like tonight ( not often ) @Josefine_sand I don’t really eat bread to be honest anyway @gavinjames @bandwildyouth I’m on it gav... Hahahah @BetterOffTommo Couldn’t fit them in the bowl , they got their own side plate . Legends @myidolsbravery More than anything else . . @NewAngelAng I have written with Teddy many times @smalltlkniall Correct . It’s too hard every day. @niallsorridimii Fuckk I love that video.. thin Lizzy are a major major force in Ireland . @helloxpetal Yeh it’s unbelievable @fireproofamber Of course @closetoniall No ya need a massive stupid grin, head to toe in Nike Hahahaha @theirelad Could be here all day talking about great songs of the 70’s @paperhouses I’m trying to have a bit of diversity in the songs I choose for these challenges aswell. I want it to be a solid playlist at the end of the month. @myidolsbravery Great album. Very proud of it! If it wasn’t my record, I’d still like it very much. Went number one in some countries obviously but definitely would have preferred to not release it during this pandemic.. not great timing @ohnoflicker Landslide, hotel California, tiny dancer ... I mean pleaseeeee @horancuteboy Love of my life @lovebeneathskin Aloe @restaquiniall Great choice @smalltlkniall I explained in the story petal @flickersnjall How long is a piece of string ? Hahah @niallsfavguitar No hahah . I’m basically listening to a 70’s playlist I have and choosing from there @bIakandwhite Being in the Nissan micra with my mother driving between rochfortbridge and mullingar. She had it on cassette @armsofniallh I’m obsessed with these songs, the lyric, melody, how much 70 year old Bruce still loves his craft and life @frmthstars Yes thankfully @AllyLuvsNialler Good idea. RT @irishcharts: Four weeks at Number 1 on the Official Irish Homegrown Chart for @NiallOfficial and No Judgement! Full Top 20: https://t.c… @everywhereniaII Yeh I played the playlist I made for Zane @AppleMusic interview @njhsnewangel Without a doubt !! Bruce is my man @strangersniall No not really . @stormtoweather I love that song so much @RikkeS88 It’s a great healer my love @shesnewangel I put both in @AngelaxHoran It’s happening in November . I’ll be there no doubt @flickerhialler Me @niallernroses Listen to the radio and go for a walk or run @bostonniaII Yesss indeed @soft_njh Gin n tonic babessss @closetoniall Yeh babyyyyyy @Smallzy Can I bring Capaldi? @natmyNH Can we stop talking about it , I get too upset . I miss everything about . @TheCoronas @gavinjames @IsaacBroe 😂😂😂😂😂 @gavinjames @bandwildyouth I’m coming in hot later on with a banger @sanfranialler No I don’t know who . I’m going to ask around . @fIoofniall No, Not really !! Had a few glasses of wine after the live last night and I’m feeling it this morning. Just making a smoothie now and gona sit in the sun @magicftnh Yes . Go on . @derbyteesniall I try to work out twice a day and have both in there. Much prefer strength, don’t like gasping for air @bIakandwhite Try and train 5 days a week in some capacity . Usually 3 big sessions and then maybe lighter stuff like a long power walk or something. @sunflowervol1d Lab is the man, great guy! @sunflowervol1d Oh what a song !!!!!! @ashleyft1d Tuuuuuune @helloxpetal Red has to be ..... @lovestillniall I love this song so much but it gets me bigtime . My favourite lyric is “ everything else has room to grow, cause in better light, everything changes” @niaIIsmonet I need time on that one 😄. I shouldn’t have started this challenge because I find it too hard to pick one song @flickersnjall Oh yeh bigtime but to be fair my living room is quite a dull sounding room, the sound doesn’t reverberate about. So I’m lucky in that sense @harryseingblind You have taste @niallhenergy Rosé @hrtbreakbarbara Play golf in the pub @hesunflowervol6 😂😂😂😂😂 no questions RT @AppleMusic: .@NiallOfficial selects music from some of his favorite songwriters and chats with @zanelowe on staying creative at home.\n#… @nellopatatello_ There was a lot going on yesterday. I’ll do two today . @helloxpetal Maybe yeh if I knew people would listen. RT @latelateshow: Watch #LateLateShow in 5 mins to enjoy \"The Proclaimers\" all over again! Plus #EmilyBlunt, @SamHeughan and a performance… RT @LiveNationUK: Calling all @NiallOfficial fans 📢 Join Niall at 7pm tonight 👇 He'll be playing some tunes, raising cash for a good cause… @stillnewangel @respectkook I’m just messing with them hhaha I enjoy it @respectkook I Care about what I say @harryseingblind @crushonniall_12 Think I might use it tomorrow @1DLTHSNHLP1 @eleanor051 @nialloveflicker @LewisCapaldi Yeah but who’s to say who it’s for ? Tomorrow night at 7pm I’ll be live on Instagram playing some songs for you guys and we’ll be raising money for @ISPCCChildline . This stream will also be live on @RTE2fm.  What songs would you like me to play? https://t.co/VO3LNTjIPo @horansalbum Yes of course @drimsmailo write, workout ? @horanftyonce Yes of course @everywhereniaII No I’m only ever out for about 20 mins @nialloveflicker Learn an instrument . Write a tune. Definitely exercise , it makes ya feel so good @nialloveflicker @LewisCapaldi No I don’t know if we’ll ever do it , can’t say really. It will have to be the right song for both of us.. we are good friends, both of us like writing songs, we both have a lot of time on our hands. We’ll just write for either of us, a collab, for other people. . Just write @niallsdimples Yes let’s do it @RikkeS88 My BMI songwriting medal RT @zanelowe: Having a great catch up w. @NiallOfficial right now. Join us on @Beats1 @AppleMusic https://t.co/imVBzCZmGg Great chat as per usual my man https://t.co/lfmAaP2gZu @crushonniall_12 These things are hard to choose every day Hahahah @crushonniall_12 I can’t feel my face @crushonniall_12 Life in the fast lane We had a great time chatting as always. Make sure you tune in. https://t.co/JGS1kRiHPh Tonight at 7pm UK time I’ll be chatting to @modestgolf player @TyrrellHatton . Tyrrell currently sits inside the top 25 in the world rankings, big football fan also and most importantly a great fella. This will be fun. https://t.co/1oENl1OMGq @eleanor051 Don’t know what I’m writing ahahaha . Just writing .... @MTVUK Seaweed hahaha @helloxpetal This stuff I can do at home but do miss the gym @damnnviall Not gona do the run today actually , my knees have taken a battering from the amount of running I’ve done @lovestillniall Correct @ohnewangel Just did some radio work. Going to workout now, eat, interview later today, changing my bed sheets which is a task ( the bed is huuuge. ) This is brilliant !! How well mannered are these two lads ? https://t.co/5NAKNx2zJL @PrfectlyFlicker 😂😂😂😂😂😂 RT @idolator: An anthem! @NiallOfficial's \"Arms Of A Stranger\" is one of 2020's best pop songs: https://t.co/Ctx0f9ZIEz https://t.co/jOBKf4… RT @shesnewangel: niall black and white is the song that makes me want to dance 💃  i love everything about this song and my absolute favori… @strangersniall Smashed it @nialIsangel Heartbreak weather @weatheredhrtbrk Great shout @nhandpotatoes Same . That covers yesterdays challenge too RT @nhandpotatoes: Day 6 of 30 Day Song Challenge-\nEverywhere from #HeartbreakWeather by @NiallOfficial \nThis song can literally make me da… @PrfectlyFlicker Me toooo @billboard well done lads @Conor_O_Donohoe Pricks!! 🤣 @Josefine_sand 😂😂😂 @Josefine_sand Needed to use it in the end 🧻 @vane_ccx Shit . I was gona do this exactly at the end of the month @ItsDaniAlexis Cute as RT @Kruti41553792: Day 5 - For today, I'll probably choose Small Talk by you @NiallOfficial! Cause honestly the guitar riff, the bass and t… @niallhenergy No . I always do it on my floor 😂 @niallernroses It will be sooo much easier now . . We can do shit on zoom @horanftyonce I got dressed like this to go buy chicken thighs hahaha @myidolsbravery 20 degrees celcius @natmyNH I’m making margaritas and sitting on the balcony @Niallxstormx Start with the bottom half . Then match a top to that @trisholiveira Hahahahahaha love this . @RikkeS88 The whole first album was written and recorded on it @niallsdarIinng NTMY . You can just rock out and not worry about hitting bum notes or anything @horancuteboy Yeh @harryseingblind Yes he is 😂😂 @niallvinyIs I’m a wholesome Irishman. Always porridge @yarahbw @nhandpotatoes PALLOM on SNL and late late, NTMY in norton and EMA’s . @thisispigeonary Little porridge. Banana, blueberry, strawberry, natural yoghurt and orange juice smoothie @whatevverlouis Coz I drank too much of the other shit last two days ahahahaha @bIakandwhite A workout I’m not gona do today . I’m gona do one from an app I use. a dumbell class @nhandpotatoes I think it’s my favourite too hahaha @crossthetide Literally to put bags in the rubbish room 😂 @crossthetide They’re both very very simple. . @souadXII Hell yeaahhhhhh RT @irishcharts: Official Irish Homegrown Chart: @NiallOfficial claims his longest-reigning Number 1 on the chart as No Judgement claims a… @dearpqtience @1DSam99 Yeh but that doesn’t have to be the reason why . @flickerevans Feel good babe . Sun is shining . Worked out, eating lunch. Going to go for a walk in a bit @sanfranstorm Yeh @1DSam99 Who said she hurt me ? Ahaha @harrysskindnes Wish I had a Pool . Would be lovely on a day like this @harryseingblind Yessssss @RodLaverArena @Ticketek_AU But I’ll be back next year hopefully @crossniallsmind No because I’ll probably do the same next time @yarahbw No one knows ahahah . We don’t know when we’re going to get out of this. @sunfIowernarry Yes pops !! @dncingmoonlight Yeh course @niallsorridimii Yeh I will @njhftdolans Doubt it sadly @solongnialler Amazinngggg @armsofthirlwall Nah wrote two and they were shite enough 😂😂 @ntmychalamet More than the pub and that’s saying something @heartbreaktours You save up babe and I’ll see ya next year.. @everywhereniaII Yeh hopefully @nialloveflicker It’s absolutely no ones fault . The economy is suffering at the moment and I don’t see why I should go on tour to make it even harder for people. @vintageniaill Yes babe @moonlightnjallx I’m my top two shows of the year @everywhereniaII Cleaned my house from top to bottom @smalltalkingnh No idea hahah @strangersniall Don’t know if it will be an album. Just gona write to pass the time and maybe , we’ll see @vintageniaill Exactly darling ! It’s fucking heartbreaking but next year, everything will hopefully have settled back down and we can go. @eleanor051 Gona miss this  😭💔💔💔 This was a difficult decision, but the well-being of my fans and touring family is always my top priority . Please stay safe everyone x https://t.co/1Etlfp3NaV @hawyeehoran Friday is the big cleaning day @nojudgemvnt No 100 % !! Just had a few drinks with the lads . Great laugh @niallertomeetya @stilllinIove Coz I live there @stilllinIove What goes on, on here ? Hahaha @stilllinIove 1 and 3 are the same shirt. 2 is a matter of it being warm at the time 😂😂😂 @bostonniaII Give me examples @thatblkgrl Oh shit I forgot about This. I have it ready to go @niall93hw Hahahaha this is us sober @hrtbreakbarbara I took off a top Hahahahah @harryseingblind Bare in mind both of these pics were taken in the last few days hahahahaha @newstormangel Little espresso babbyyyyyy @bIakandwhite 60-90 minute power walk RT @MirrorSportIE: .@leona_maguire talks practice during shutdown, Olympic hopes and good advice from @NiallOfficial https://t.co/9zsbNuzxVi RT @crossniallsmind: I’m telling you, he started the live when I was in class so if I fail I’m blaming Niall @NiallersNwAngel some of my touring stuff got delivered. 2 of my acoustics, my telecaster , amp and pedalboard . Cmonnnnnn. Let’s rip this fucking building down 😂 @NiallersNwAngel Yessssss Been listening to this record all week. beautiful stuff boys. . Go get it people!! @5SOS @Calum5SOS @Luke5SOS @Ashton5SOS @Michael5SOS    https://t.co/0dEViXAM5T Show me what songs you have chosen here on Twitter . @ranialljames Not running today @niallsorridimii The ole sarcasm not going well I see @closetoniall No just quite a relevant song in my life currently @KaceyMusgraves What a record! Beautiful @Josefine_sand All good babe. Breakfast , 5km run, workout, lunch, started working on a little project I wanna do for Covid, cooked dinner , watching tv . All good !!! You ? @ShaneLowryGolf Incredible stuff guys @AlecBenjamin Same bud!! Yes sir, I’d love to . Love your writing @AlecBenjamin @urshwn Good buddddd!! How’s things ? Yessssss scotty https://t.co/C7OXYNSrHm @smalltalkbaby Life changing artist he is. Go have a proper listen @starsofgoId It’s quite therapeutic . Put something on tv and kinda sign and watch at the same time @flickerofhope13 Well I try and save it for a few drinks at the weekend . But I’m seeing this period as a time to get fit and learn stuff about myself @mirrorsdonny Both for completely different reasons @smalltalkingnh I’m looking for some stuff @ohnewangel It’s a good vid hhaha @myidolsbravery Yeh babe. Loads @NewAngelAng Pint of Guinness, no doubt @carolinevol6 Yeh I think so. It’s definitely a trial and error type thing, I guess it’s like any art in that respect. @ntmyanialler @markmac14 I’ll do it !!! @mirrorsdonny Well I’m massively into it , so yeah I guess @bostonniaII Yes @heartbreaknialI Turkey is leaner @niallhenergy Ok . @closetoniall No bread babeeeee @allthenouis Lighting babessss @PrfectlyFlicker Yeh I made sweet potato fries @MusicEmma25 Sweet fig @niallaar Bigtime @kmmsunfIower It’s Irish ahahah @flickerofhope13 Pick 4 chords and a rhythm pattern, and SING SISTER RT @MTV: I just listened to @NiallOfficial's acoustic version of \"Flicker\" and now I'm an emotional mess. @bndtherules Everything I took for granted before. Going outside for longer than 30 mins, watching football and golf, being able to go on stage, go to studio, hugging people, going for a coffee , going out for food, meeting my mates, having mates over. hello fellow isolators!! How are we all doing ? @twerkingniall94 No why ? 😂😂😂😂 @iHeartRadio I’ll try not to @flickernadine Great music and killer gigs @_kissytommo Baby pink @armsofniallh I’m not bored at all to be honest . . @dearpaitence Yes @newstormangel Use an app called ‘Fiit’ . I do classes on that, sometimes do my own bits and also run @hrtbreakjaz Watching a really good show called ‘ patriot’ on prime @strangersniall Asparagus , broccoli, carrots , sweet potato @hrtbrkpatience Just going to leave it for a week or so @hrtbrkpatience 3 but then I ran into a mental block @strangersniall I listen to @talkSPORT on the radio. People chatting seems to make it go passed quicker ahahah @_niallsnewangel You meant shredded @dearnialIer Gets lighter in the sun @heartbreaknialI Been doing 3 x 5 km runs @dlibyhhabit Chicken breasts. . Trying to keep it lean and boring Hahahah @hawyeehoran No no . . Been out for a run, worked out, cooked twice. RT @MikeAdamOnAir: #NoJudgement by #NiallHoran has now sold over 200,000 units in the US!!! Congrats @NiallOfficial! https://t.co/yvhNxVmJxL RT @AmericanTop40: .@NiallOfficial running things on #AT40 this weekend is exactly what the world needs right now ❤️ Listen: https://t.co/L… @derbyteesniall Currently 😂 @flickernialler Haven’t been doing anything really extravagant just yet as I find the they are usually the more fattening dishes. I mmmm trying to lean up so my food has been quiet boring . @niallernroses Tried writing this week, finding it hard to get creative like that. Golf courses are closed now. Listening to old and new music, cooking and mainly working out a lot RT @iHeartRadio: Tweet me your @NiallOfficial #HeartbreakWeather anthem! Mine is 'Nice To Meet Ya' 😜 https://t.co/1T5wn5rHfr RT @iHeartRadio: Don’t miss @NiallOfficial on the #iHeartCountdown with @JoJoWright this weekend! ❤️\n \nYou can listen here: https://t.co/4H… RT @AmericanTop40: The best quarantine party of the weekend starts now with @NiallOfficial counting down the biggest hits from 40 to 1! Lis… RT @irishcharts: Official Irish Homegrown Chart: @NiallOfficial is Number 1 for a second week with No Judgement https://t.co/17ghjJyyqm htt… @carolinesenter8 He’s a great great man and we always have a laugh @harryseingblind Cute as fucccccckkkkkkk RT @AmericanTop40: #PajamaParty! You're stuck at home, so why not listen to @NiallOfficial guest host #AT40 in your PJs ALL WEEKEND LONG...… @JiffyRugby Stunning that was @JiffyRugby Game over for me ahahaha @RyderCupEurope @JustinRose99 Roseyyyyy @everywhereniaII Oh he does, he’s a good man. @babyhoneynjh Very different shows. Pharmacist is shorter so maybe that @niallaar I haven’t been outside in them for two weeks  hahaha @romcomhes Absolutely correct, I agree. I am here for entertainment, these people are here to run society and keep us alive and healthy @JillLovesPALLOM Yes girl !! Hats off to you and your colleagues. @piersmorgan @MattHancock @BorisJohnson only during the pandemic ? RT @amazonmusic: @NGLoveNH @NiallOfficial #HeartbreakWeather has been on heavy rotation for us! 💕 @stilllinIove Rightly so . All over the world I assume RT @New1027: #HeartbreakWeather by #NiallHoran has now sold over 100,000 total units in the US! Congrats @NiallOfficial! ~@MikeAdamOnAir ht… Wow that was special!! The sound of London out clapping for the medical staff working on the front line of this pandemic and the workers of the National Health Service was immense. It was beautiful but let’s hope they get what they really deserve after this is all over.. RT @FallonTonight: #FallonAtHome Music Break: @NiallOfficial performs an acoustic version of his hit “Dear Patience” 🎶 https://t.co/49Tq0he… Always a laugh with my buddy @jimmyfallon !  What kind of weird things are the rest of ya doin to keep busy at home? #NoJudgement https://t.co/8CTJj7tok2 . @thewhitmore and I sat down to have a chat for her podcast . Listen and enjoy. https://t.co/nQ4nZbHG68 https://t.co/scZNnawm4T RT @jimmyfallon: If you’re able to help in any way, we are raising money for @_MealsOnWheels! Give them a follow or click the Donate button… RT @jimmyfallon: The Tonight Show: At Home Edition (@NiallOfficial) https://t.co/0gWhz1HooB https://t.co/CkucaDjUXj RT @FallonTonight: Jimmy &amp; @NiallOfficial have the same quarantine nickname! 😊🐟 https://t.co/49Tq0hemoE #FallonAtHome https://t.co/triBMolO… RT @FallonTonight: .@NiallOfficial performs “Dear Patience” off his album #HeartbreakWeather https://t.co/49Tq0hemoE #FallonAtHome https://… RT @IainDoesJokes: BRAND NEW EP OF CASTAWAY OUT NOW. This week this absolute sex rocket is interviewed by @thewhitmore. Yes @NiallOfficial… RT @_MealsOnWheels: @ItsYourBigBoy @NiallOfficial @jimmyfallon Whoa -- thank you so much! RT @thewhitmore: PODCAST DAY! New Ep of #CASTaway with @NiallOfficial that we recorded a few weeks ago, chatting everything podcasts over a… Iove that guy hahaha https://t.co/0g36ywmgqO RT @enews: Why Niall Horan's Performance of \"Dear Patience\" Has Extra Special Meaning Right Now https://t.co/XY6vseQzWF RT @gregjames: I really miss the pub @gregjames Can we go together when this is all over ? RT @SiriusXMHits1: BIG NEWS!!!!!!! @NiallOfficial's #SmallTalk will be making it's debut this weekend in #HitBound with @MikeyPiff!!!!!!… @idkdais I have a new album out . Tell your mates Love how I still say to myself “ I must do that this week” and I really don’t know why. I’ve got fuck all to do next week. RT @Ticketek_AU: Congrats to @NiallOfficial on scoring No.2 album in Australia, and No.1 in the UK and Ireland 🥳🎉 #HeartbreakWeather https:… RT @mtvema: omg and this 👍 from @NiallOfficial! https://t.co/13mfF4cBWL Calling in for a chat with my bud @jimmyfallon and live performance of my song Dear Patience, tomorrow on @fallontonight #FallonAtHome edition ! https://t.co/tLSugjtVEc @hrtbrkweather May forget about seeing your mates for a while. We all need to get used to being around the same people for the next while Feels like we’re living out a chapter from a school history book. RT @UMG: 🏆 @NiallOfficial just landed at No. 1 in 🇬🇧 for the very first time with his album 𝘏𝘦𝘢𝘳𝘵𝘣𝘳𝘦𝘢𝘬 𝘞𝘦𝘢𝘵𝘩𝘦𝘳! https://t.co/3cEtwNpm4I RT @AmazonMusicUK: What does #NiallHoran sing in the shower? What's his fave 1D song? @NiallOfficial does Amazon Music's nosiest quiz, Song… RT @billboard: .@NiallOfficial's live-stream was the fans' favorite so far https://t.co/O76U4oK1oU RT @_luna_ac_: I love it!!!! @NiallOfficial #HeartbreakWeather https://t.co/EBlh8aE2gB RT @SSEBelfastArena: We're loving Heartbreak Weather from @NiallOfficial!\n\nTough question.......but what is your favourite song from the al… RT @BritishGQ: Today, we’re talking about @NiallOfficial and his sky-high grooming game right now. Here’s how to achieve it...  https://t.c… RT @babyhoneynjh: Niall like we could ever forget that #HeartbreakWeather is out now!!! Let’s keep streaming we’ve got to keep our dude at… @TheWeekndStats @theweeknd Holy moly @AllyLuvsNialler @Conor_O_Donohoe Lost the plot @Conor_O_Donohoe Oh it is 😂😂😂 @Conor_O_Donohoe Hahahaha I thought this was Conor’s Twitter Hahahahahah @Conor_O_Donohoe Fuck off conor RT @nhandpotatoes: I hope everyone is still streaming #HeartbreakWeather ❤️\nLet's give Niall another #1 ❤️ https://t.co/BmCP82Aj6o RT @irishcharts: .@NiallOfficial scores 2020's fastest-selling download album with #HeartbreakWeather https://t.co/cR0fRQbfB7 https://t.co/… @niallsnewrules Correct!!! We’re playing fifa hahah RT @irishcharts: Congratulations @NiallOfficial! No Judgement rises to Number 1 on the Official Irish Homegrown Chart 🆙↗️ https://t.co/17gh… RT @billboard: .@NiallOfficial lands his first No. 1 album in the U.K. with #HeartbreakWeather https://t.co/N7vryvV6tg RT @simonjonespr: Huge congratulations to @NiallOfficial.\nSome lovely news for this week.\nHis album #HeartbreakWeather enters the UK Album… RT @thisisruthanne: Number 1 album in UK and IRELAND!! Congrats @NiallOfficial proud of you!!! Congrats all involved xxxxx https://t.co/6KL… RT @irishcharts: No Judgement has become @NiallOfficial's fifth Top 10 single in Ireland this week! Official Irish Singles Chart: https://t… RT @UMusicuk: Massive congrats @NiallOfficial ❤️ https://t.co/3vk30sdIzB RT @BritishGQ: .@NiallOfficial has just scored his first UK number one album with #HeartbreakWeather 💥 https://t.co/goR6uTu2wX https://t.co… @SonnyJay @officialcharts Thanks bud Ireland, I love you!! Thank you so much for making ‘Heartbreak Weather’ #1 this week. This is incredible. Nothing better than the support of my home land ☘ https://t.co/WYm9F8nn25 Number 1 UK album! Thank you sooooo much to everyone who bought / streamed this record. I worked very hard on it and thank you so much for receiving it like this. Can’t believe this x https://t.co/bD7Yfj7i89 RT @officialcharts: “This is just incredible…” @NiallOfficial scores his first UK Number 1 album with #HeartbreakWeather: https://t.co/WJCh… RT @niallontours: #HeartbreakWeather just went down to #3 in the US! Cmon team, we still have a few hours left until sales/chart week is ou… Many thanks to @GlblCtzn and @WHO for having me be a part of the terrific #TogetherAtHome series . Make sure to watch out for @Hozier and @OneRepublic's performances tomorrow https://t.co/u1T9ySHP3S RT @GlblCtzn: Day made. Thank you @NiallOfficial for showing us that we can all play a part in protecting global health  #TogetherAtHome. h… Going live on Instagram at 1pm PT for the @GlblCtzn @WHO #TogetherAtHome concert series . Going to be playing a bunch of songs for ya . Don't miss it ! https://t.co/Rw1WVVGYPS @AmyyyT18 No @ohdearpatience 5k RT @UniMusicIreland: Dear Patience is a song we need to hear while working from home @NiallOfficial  😂😂😂 https://t.co/CGrPmclB1m RT @eleanor051: In the world there are:\n7.53 billion people \n195 countries\n7 continents\n\nSo we can easily make #HeartbreakWeather #1 everyw… Until midnight tonight, you can get Heartbreak Weather for £4.99 on iTunes ! Thanks guys , appreciate the support x https://t.co/PKkYF04xyG https://t.co/Q4aVEjMuhs RT @habithazza: Can’t stop listening to #HeartbreakWeather !! The album deserves to be no 1 so stream it!! @NiallOfficial https://t.co/87i0… RT @flikrallie: cmon guys, stream #HeartbreakWeather !! let’s get niall this number 1, he deserves it! https://t.co/8ClZhuR28p @AshLondonLIVE Obvs Heartbreak Weather is @amazonmusic's Deal Of The Day in the UK ! For today only, you can get my new album at £4.99 . Grab yours now https://t.co/lrlYPQDbWF #HeartbreakWeather https://t.co/TvUVsEdPo6 UK - last chance to get your signed copy of the album ! Very few copies left https://t.co/cFW2oNP1an #HeartbreakWeather https://t.co/SaRO8JPWiA @armsofstranger @crossniallsmind Next week we can push for it. @derbyteesniall No ? Really ? @niallaar Not as good as me but I appreciate the effort 😂😂😂😂 RT @sanfranstorm: US , CANADA, AUSTRALIA AND NEW ZEALAND DO IT FOR NIALL !\n#HeartbreakWeather https://t.co/lkzXLqoZCI Morning!! hope everyone is well today. Reminder that my album is out and you can buy it and stream it. Appreciate the support!  #HeartbreakWeather Had a great chat with @rebecca_judd on @Beats1 in London a little while ago to talk about the new album . Listen to #HeartbreakWeather and watch the interview now on @applemusic https://t.co/CRnQtzWCwm https://t.co/Z6TGN81ZA9 I’m doing a special IG Live show for all you lovely people tomorrow at 1pm PT with @GlblCtzn and @WHO as a part of the #TogetherAtHome concert series . What songs do you all want to hear ? let's get this album to number 1 in the UK ! it'd mean the world to me . love you all x https://t.co/Zl9LTM1Lhq https://t.co/qxu5wV72DK RT @MTV: YEAH I SEE US IN BLACK AND WHITE \n~𝒄𝒓𝒚𝒔𝒕𝒂𝒍 𝒄𝒍𝒆𝒂𝒓 𝒐𝒏 𝒂 𝒔𝒕𝒂𝒓 𝒍𝒊𝒕 𝒏𝒊𝒈𝒉𝒕~ @Conor_O_Donohoe @niallersfloof You send in your progress aswell con 😂👆 @yarahbw Course RT @dearpatiences: @NiallOfficial Already got some of mine!!!! 🤍 #HeartbreakWeather Let’s get you this #1 in the UK charts babyyyyy https:/… RT @RikkeS88: @NiallOfficial Just received your album today, I LOVE IT ❤️ #HeartbreakWeather https://t.co/aUiqQiFs8t RT @RikkeS88: @NiallOfficial Streaming #HeartbreakWeather all day 🌦 https://t.co/CitPLrcZ2Q RT @newangelrose: @NiallOfficial Doing my job sir! Streaming #HeartbreakWeather on Spotify and Apple Music! https://t.co/xuiNxYrLyP RT @amazonmusic: Looks like @NiallOfficial loves @theweeknd just as much as we do 😎 \n\nAsk Alexa to play the #SongOfTheDay to listen to Nial… RT @hmvtweets: If you haven't caught up with @NiallOfficial new album 'Heartbreak Weather' yet, here's Everything You Need to Know...\n\nhttp… RT @hitsradiouk: He's just released his album #HeartbreakWeather and tomorrow morning @NiallOfficial is joining us on Hits Radio Breakfast… Album’s just £5 on iTunes in the UK ! Let’s get it all the way up the charts https://t.co/xlkPLokDCP Join me for a #HeartbreakWeather @Spotify listening party tonight at 8pm uk time !  https://t.co/2octk1PcTq https://t.co/fuyGQmSPrF US we’ve got more signed albums for ya too ! https://t.co/gFUv2GMQ0y https://t.co/SkmWpzHAWV Thank you @AmazonMusicUK ! #AskAlexa to play #HeartbreakWeather and get a copy of the CD on sale now https://t.co/D7tAqh2V8B https://t.co/DK25M6mUqF Hello everyone !! Been busy doing interviews today, so I haven’t been online. Hope everyone is doing ok out there and staying home. Keep buying and streaming the new album. #HeartbreakWeather RT @EmilyAlexandraL: “Small Talk” by Niall🥺❤️ @NiallOfficial Incredible album!🤘🏼Go and listen to #HeartbreakWeather https://t.co/Y0ernIa6iy @DominickWhelan @LDNIrishCentre @darraghdoyle @radioleary @ImeldaOfficial @angelascanlon @thewhitmore @Jarlath @AnnieMac @WeeMissBea @theirishpost @daraobriain @Failte_Ireland @TourismIreland @IrelandEmbGB Love this . . Cmon Rita . Hope you’re well RT @officialcharts: In our new sales flash today, @NiallOfficial has pulled ahead in the race for Number 1 with #HeartbreakWeather - but ca… Thanks @AmazonMusic ! Alexa, play Pop Culture: https://t.co/ZdMrRISTxr https://t.co/DNkTdbHnRP RT @irishcharts: #HeartbreakWeather from @NiallOfficial has a lead of over 4:1 in the race for Ireland's Number 1 album this week https://t… UK - very few signed albums left so grab them before they go ! https://t.co/mzwB9NApWE https://t.co/SGtfTps81S RT @ItsJamieScott: Go check out the new @NiallOfficial album ‘Heartbreak weather’ myself and the Catherine Songs team wrote and co produced… @YTVChase Well I have a brand new album out that you can listen to and become a big fan ? Love ya bud, thank you !!! https://t.co/Y3bSNRcDmq #PaddysDayWithNiall https://t.co/uCfBhUhDCy #PaddysDayWithNiall https://t.co/S1cMaGjN9M #PaddysDaywithNiall 6:30pm live on twitter for paddy’s day ☘️ @RikkeS88 @amazonmusic Sarcasm again hahaha RT @amazonmusic: A message from @NiallOfficial to brighten your timelines 🤗 \n\n🎧: https://t.co/9vHr7bTfaq https://t.co/WUngrWKw7I RT @jcstewart: BEND THE RULES - @NiallOfficial \n\nThis is such a heartbreaker\n\nAlso, get on my Instagram at 8pm for a St. Patricks Day Speci… @everywhereniaII In the Bahamas in april last year @smalltlkniall When I say “ the making of cross your mind” , this video is me writing the song hahah @njhdenise God knows . The team were telling me ya can go live on twitter Hahahaha @nhandpotatoes The other video I posted, is me writing the song, So just me and piano RT @iHeartRadioCA: #HappyStPatricksDay to one of our FAV Irish lads @NiallOfficial!! 👏🏼🍀 https://t.co/rE3FdgnvGF Happy St.Patricks day my fellow paddy’s. ☘️☘️☘️☘️  love our little country 🥰 RT @BritishGQ: .@NiallOfficial's new album #HeartbreakWeather has entered a close race for Number One in the UK charts this week  🔥🔥🔥 https… I’ve signed a bunch of copies of #HeartbreakWeather for you to enjoy ! Go and grab yours now https://t.co/mzwB9NS0Oc https://t.co/8Wiv95zOAC RT @Spotify: Thanks to @NiallOfficial for stopping by and answering everyone's #HeartbreakWeather questions 💚 https://t.co/UYiHPlY4MC Great time shooting this one ! check out my @FAULTMagazine cover here https://t.co/f0YhiJU0K4 https://t.co/ApJLdangTm RT @watermelonline: This is honestly my favorite song on the album. It’s truly a masterpiece. #HeartbreakWeather @NiallOfficial https://t.c… RT @suewentworth: @SiriusXMHits1 What channel is the album on? I do have Sirius in the car. while you’re indoors today,  get your ears around #HeartbreakWeather . #HoranAtHome #HoranAtHome RT @hotpress: Huge Thank you to everybody who's told us about the impact @NiallOfficial music has had on them ❤️\n\nhttps://t.co/biGqzrM3e1 RT @Spotify: Ask me questions with #askniall Got a special new video for #NoJudgement out today ! This one stars the one and only Boss Baby Brody . Huge thanks to him and his family for being a part of it . Hope you enjoy https://t.co/Q2ZDEs8Kvb https://t.co/97f32WxSyT RT @Spotify: And put a little love on the album while you wait 😉☂️ \nhttps://t.co/58ZbKhM6BR RT @Spotify: Hello @NiallOfficial fans 👋\nTweet your #HeartbreakWeather questions with #AskNiall and he might answer them later today! https… RT @irishcharts: Official Irish Albums Chart: Niall Horan (@NiallOfficial) set for second Number 1 with Heartbreak Weather https://t.co/EHj… Cmoonnnnnnn https://t.co/eth48lUump @hsftniall Hahahaha . .I’m a songwriter. It’s my job and it’s also my hobby so I don’t necessarily have to be writing for anything in particular .8 @sondra_m @YeaNarry Love this . Bass RT @ArianaGrande: please https://t.co/N9WkKyVNn1 RT @amazonmusic: .@NiallOfficial is taking over Amazon Music’s #SongOfTheDay this week!\n\nHis pick today? 'Undrunk' by @findingfletcher 😎 Li… RT @ConorSketches: @NiallOfficial new album is class!! 🙌🏻 well done bud!! 🎶\nSocial distancing in my apt all day listening to it and loving… RT @MorningMashUp: Listen to the man. ⛈ https://t.co/JsLWGchbL0 🤣🤣🤣 https://t.co/AphBDPCwak RT @oliviakt102: Get @NiallOfficial back to #1!! https://t.co/nrszsWavXX @hrtbreakbarbara Yeh exactly @coriniall I’m watching ‘ the pharmacist ‘ @alecbambi Shes like raving but being deadly serious about it 😂 Is it trending yet? RT @natmyNH: Even my dad loves heartbreak weather 🌩❤️ #HeartbreakWeather @NiallOfficial https://t.co/Crs2QECVjz @natmyNH Yes dad. Hope you are enjoying the record sir @benwinston Ahahahahha what a laugh that was. Love ya benno. Who would like to have a number album this week? ................... ME!!!!#heartbreakweather RT @lovebtrklcj: My mood when Small Talk is playing hahaha THANK YOU NIALL #HeartbreakWeather https://t.co/4hP6dbtrYg @njhsheartbreak Not really RT @ohnoflicker: niall can I please thank you for writing and singing dear patience ? It’s my favorite song from the album and something I… RT @flickersnjall: Niall i'm so obsessed with this song, i love it\nStream Heartbreak Weather!!!!💪🏻🔥\n#HeartbreakWeather https://t.co/bwyeDav… RT @crokelads: Niall you already know that we are streaming #HeartbreakWeather aka the album of the year!!!! https://t.co/QoM9F5tJPH @theirelad Love that from @hmvtweets @helloxpetal do whatever you need to do @heartbreakwther Something like that . Bit more bite I think in the show RT @Zuziixx: Niall I'm so fucking in love with #HeartbreakWeather and really can't wait to hear it live in Warsaw 🇵🇱 ✌🏻 https://t.co/u8nioz… RT @flickerswift13: You all better be streaming #HeartbreakWeather \n\nI LOVE THIS ALBUM SO MUCH!! Congrats Niall x https://t.co/Erc2E13TBW @hispanicnialI I’d be very happy with that RT @hispanicnialI: Niall you didn’t have to snap with everywhere it’s one of favorite songs from the album @NiallOfficial #HeartbreakWeathe… RT @sambiebs18: niall, this album is absolutely magical, I have no words, each songs are so beautiful and special in their own way!❤️\n\n#Hea… RT @harrysincerly: @NiallOfficial bold of you to even think that i’m listening to anything else #HeartbreakWeather https://t.co/a8DjvqRWOI @Jazzyb123_ Yeh heard that too Love https://t.co/q0xlO5CVaM #HeartbreakWeather #HeartbreakWeather #HeartbreakWeather #HeartbreakWeather #HeartbreakWeather #HeartbreakWeather RT @newangelrose: @NiallOfficial Currently enjoying the album! #HeartbreakWeather https://t.co/nf2YQ55ipr @newangelrose Yes girl !!! Now that we’re on lockdown basically, I have an album out that you should listen to . If you’re not particularly a fan of mine, give it a go anyway. RT @blackwhite_nh: I love her so much :(( it’s so cute please thx u @NiallOfficial for making the best album known to man. https://t.co/SsT… @horancuteboy Love this RT @stilllinIove: niall is TAKING OVER the irish charts! two albums in the top 5 plus a number of songs in the top 50 (&amp; black &amp; at #60!) #… Want to thank @benwinston , @JKCorden and all the crew @latelateshow show for an unforgettable week on the show. Performing, doing sketches, carpool was so great. Love you all . Given the ongoing and developing coronavirus situation we‘ve decided to hold the on sale for the recently announced summer US tour dates until further notice . I’ll let you know as soon as we have more information to share . Stay safe everyone x RT @latelateshow: Watch @NiallOfficial rock Stage 56 with this performance of “Nice to Meet Ya” 🎸\nhttps://t.co/SaSnwVY9f7 https://t.co/0n2E… #HeartbreakWeather RT @maisiehpeters: If honesty means telling u the truth, then I 🥺 guess 🥺 we 🥺 lost 🥺 our 🥺 focus 🥺 RT @latelateshow: Warning: Your heart might break during @NiallOfficial’s beautiful performance of “Put a Little Love on Me”💘\nhttps://t.co/… Put some of my absolute favorite songs in this playlist with @deezer . Hope ya enjoy https://t.co/yMxYgH1KcO https://t.co/k44CVt3qG5 Hot Hits UK ! Much love @Spotify \nhttps://t.co/PcIXZQeyEt https://t.co/2q0JhTdQrY RT @pandoramusic: Keep calm because @NiallOfficial's \"Heartbreak Weather\" is finally here ⚡😍 Listen to the new album now: https://t.co/RQ8g… I've truly never experienced a feeling like I felt whilst writing this song. I rarely take videos of studio stuff but I had to capture this. Hope you love it. B&amp;W https://t.co/mwA5PrqHBs I wanna kiss ya like the first time, hold ya like it’s not goodbye, before ya fall for someone new. @stilllinIove It’s definitely worth a laugh for the smartarses with 1000 followers @favejonah @Patrickavenell @onlyangelmon Am I? @Patrickavenell @onlyangelmon No. Definitely ‘pricks’. Think of your own issues before you come at me. @onlyangelmon @Patrickavenell Yeh but it turns out the pricks arise after midnight , I love them @Patrickavenell Who are you by the way? @Patrickavenell Sorry your iPhone is perfect @pizzahutuk Huh? Swear infront of all our friends ...... @duhitsnialler Unbelievable news . If we could keep it like that for a week or two , that would be of epic proportions @70sniaII @niallernroses @CapitolRecords I’m going to sleep now. Night xx @niallernroses I had tonnes of BTS footage from the campaign photo shoot and my team of genius ladies @CapitolRecords said thats what we should do with it RT @flickernialls: NIALL LONDON LOVES YOUUU #HeartbreakWeather https://t.co/wfhqXtv0Uo @flickernialls My town @RikkeS88 Lyrically not even in the same stratosphere,  vibe yes potentially @RikkeS88 Me @hbwstill Alright I’m gona be playing a lot of golf next week, I’ll go live @Hazza_Storan We had a right laugh @expecttioniall Sad for still. @flickerofhope13 Me too babe RT @romyydixonn: heyyy @NiallOfficial sOo my favourite song from heartbreak weather is still 🥺🥺 she’s a beauty! Anywayyy this was my reacti… @romyydixonn This is so lovely @fulldivein Purple and yellow RT @nhoranshope: Niall three of the songs of your poll are with the same % \nDid you think it’d be a close fight like it’s being? #Heartbrea… @nhoranshope No I didn’t think this was going to happen. Wow . @happilyhorann_ Is it ? Fuck offf ????? I love chipotle @diana_the_1Dfan Smashed it 😀 @hrtbrkpatience 🙂 RT @AllyLuvsNialler: PALLOM is trending in the US Niall. See we do love that masterpiece! ❤️😍 https://t.co/DFgLJW8AYZ @997now The album starts and finishes in the bay @stilIstrangers Not sure about history but it’s a great record @sugarrrhoran Thank you babe @STILLPATlENCE @LONELYNH The opening line of the song @ohdearpatience Exactly babe, you’re telling me Hahahah @happilyIauren That San Jose show will be the hardest on the tour @nialldivinely “ You walk in to the room I go quiet , I catch your eyes and don’t blink an eyelid”. That song wouldn’t have been written without that line @dearhrtbreak Go get it babe @irishbabenjh @_bendtherules Good for you @fIoofniall @LONELYNH I’m good now. @ifeIIforittwice @LONELYNH Now that I think of it . I re-wrote the verses twice @reachthestarnjh Heartbreak weather riff is still a pain in the arse ahahahah @dearhrtbreak @LONELYNH It’s the most important. pulls all of the songs above it together @LONELYNH The most honest lyric on the record, about 3 seconds @harryseingblind I Can’t promise picket fences or sunny afternoons but at night when I close my eyes , I see us in black and white @_bendtherules You tell me who it’s about in your life ? @JuliaR_AA @nialImendes What do you know ? @guccidaydreams Heartbreak weather ? If honesty means telling you the truth,\n\nwell I’m still in love with you ❤️ @niallsonIyone By a mile @LlTTLELOVEONME Mom don’t be a spoil sport @nhdimple No judgement was a great laugh @iplanetnarry All of them for different reasons . All major milestones @SeeingxFlicker With great difficulty @nightsxlong Of course I did . @niallnext @thisisruthanne San Fran and ntmy @ohgodmylarents Different shows, different setlist @niallsheartbrk Nailed it babe ! @sunrisjng @flickerbops To be honest, every single song ahahahah @myirishfeelings Yeh I dreamt it , played it on piano next day @helloxpetal Yeh I read the whole thing. I’ve read that magazine since I was a child and now I’m on the cover . It’s just madness @solongnialler 😂😂😂😂 @stiIlnh Nice to meet ya . Black and white, everywhere , heartbreak weather, cross your mind , new angel , small talk . Great songs to work out to @flickerdimple PALLOM , still , San Fran @stiIlnh Black and white. I usually rip my live vocal to shreds but I think this is the best vocal I’ve done on television . @thunderroadnjh I’d eat my hand off for a smidge of his class and his Talent @dearhbw Still @sweetnewangel It’s more than enough darling . Thank you @horancuteboy Me too @flickerwrong Yes . Big part of this album @LlTTLELOVEONME No , wrote is pretty quick .. knew exactly what I needed to say @MendesJonasArmy Major part of this record @horansalbum Well that’s a lie Hahahahah @ladstatted I can’t talk about it too much or I’ll get emotional.. my Bruce moment @caroIinanjh Great hamstrings hahahahaha @niallaar Me too . More than any song I’ve written @poeticnialll Let’s talk about number 1 ? @expecttioniall I mean I’m not gona wear a rain jacket in Texas in July haahahah @yihoonjh Everywhere is that song !!!!!!! @nouiscahoran Yeh . I hate you 😂😂😂😂. Don’t be soooooo fickle . Love you @acoots98 Let’s keep it there for about 4 weeks . @smaIltaIk_ @sebstianjh Im not sure what the label with them Hahahah . I just sign tonnes ahahha @sebstianjh https://t.co/xPb1svuOiz @pizzarollspayne @glowysniall Well when that picture was chosen, it was mine @stillinlovenh @glowysniall I’ve never been more driven. @flickersangel Best time @niallertomeetya @glowysniall Not today sister ahhh @HessasAngels @glowysniall If I didn’t like that photo I wouldn’t have released it. I choose every picture that gets released . @91larents @glowysniall I’m obviously never going to say why but the Bay Area has a lot of meaning to this album.. @happilyhorann_ @glowysniall As I said , it’s my album Hahahaha @irishbabenjh @glowysniall I’m sorry I started this coz I keep forgetting Hahahahah #HeartbreakWeather @glowysniall Coz the other photo is better and it’s my album HHahahah @stilesaetre 20 mins @middlegrier #1 and we can talk 😂😂😂 @nialltrench Didn’t think I nailed the aesthetic last time . Needed a change @twerkingniall94 Wohoooooooo @losingyounh If I see a tweet I’ll always reply babe . As you can imagine I get a lot of tweets . Dont worry , I got ya @Keeeeeegan_ I agree weirdly enough 😂😂😂 @POPPINSOOKAI I have tooo many favourites . San Fran , don’t get me started . Sums up the whole storyline . Heartbreak weather and that song have sooooo much in common RT @AllyLuvsNialler: #HeartbreakWeather is #4 on WW Apple Music albums. Let’s get it to #1!! https://t.co/2X1DE58NH8 @AllyLuvsNialler Let’s get it back to the top @flickeringhoran @hrtbrkweather Filthy tune . Groove is a joke @sadandsex Oh please don’t Hahahahahaha . Or do @flickerofhope13 @hrtbrkweather Arms of a stranger darling . Wrote the second verse and the pre chorus in a dream , woke up at 5 am and thought i should write that down or sing it in to voicenotes. @newangeII @hrtbrkweather Usually get a natural feeling . . Don’t think I was wrong with what I chose a single . It’s not what I do next . The fans usually choose that single for the Artist once the album is out @interiiorworld @hrtbrkweather Me too . Some of the grooves on the album are filthy . It’s a very tiring record to play live actually . We’ll sleep well every night after the show. Especially for bass and drums @mylifeisirish No I’ve changed it up a bit @heartbrkflicker @hrtbrkweather Written in my living room in London #HeartbreakWeather @heartbrkflicker @hrtbrkweather I would never . She’s my baby @starslitnight @hrtbrkweather The vibe feeling . If you get on a vibe with a song , it’s goosebump stuff. It could be the saddest song ever ( it will make you cry and you won’t stop) or it could so happy ( makes you dance and cry ) . They could be the worst songs ever but once you get that feeling,it’s insane @heartbrkflicker @hrtbrkweather Indeed it is. She’s a beauty @hrtbreakbarbara Would ya not ? @njhftdolans He’s fucking hammered drunk somewhere @xojaanae 😂😂😂😂😂 brilliant ! Gotta start em young @crossniallsmind @hrtbrkweather I’ll be playing guitar babe @hrtbrkweather You fucking get it babe. . It’s a feel good dancing tune. @onthelipa Me too darling @crokelads You 3 cracked me the fuck up . . So great RT @nialldivinely: @NiallOfficial BLACK AND WHITE IS MY FAV!\n\n#HeartbreakWeather https://t.co/qwEnVywtYT @ohdearpatience Yeh there was one more but it didn’t turn out like I wanted it to production wise @ItsDaniAlexis Agreed @niallerar Black and white, small talk, heartbreak weather, everywhere @niallerar #HeartbreakWeather @niallerar No!! These were all absolute definite s @solongnialler @ohdearpatience I actually don’t . @newangel @ohdearpatience #HeartbreakWeather @newangel @ohdearpatience Lyric and quality of melody combo , chord choice. In a world of uptempo madness a good ballad usually stands out @HessasAngels @ohdearpatience #HeartbreakWeather @HessasAngels @ohdearpatience Forgot forgot sorry Hahahah @crossniallsmind @ohdearpatience 😂😂😂😂😂😂😂😂😂😂 @ohdearpatience PALLOM is THE best song I’ve ever written for sure . It’s a shame that the masses didn’t think so Hahahahah @nhoranshope Yeh I cried for the whole time @muIIingarking @mylifeisirish @darlingflicker Knew you’d like small talk . Knew it @muIIingarking @mylifeisirish @darlingflicker Wrote still in about 8 minutes ahahahah @njhftdolans Couldn’t agree more if I tried @reachthestarnjh I mean if we’re all gona talk about the album , we might aswell get the fucker trending aswell right ? #HeartbreakWeather @mylifeisirish @darlingflicker Wowwwwwwww !!! Black and white or PALLOM @noscrubzzz @darlingflicker Still is beautiful live. That song is why I have to really take care of myself on the road. It’s a very hard song to sing and I need to try be in best shape possible and in good voice to sing that song @darlingflicker Let’s put #HeartbreakWeather in every tweet @septxmberstyles @darlingflicker I love dress aswell @darlingflicker Hold on it’s not a fight about what gets on the Poll. Cross your mind is one of my favourites. I had 4 options, picked 4 randoms @wallsislouis @YeaNarry It’s hard for me coz I wrote every lyric and played on every song and this is the first time ive written a collection of songs where I find it hard to really pick a favourite. There’s not one song on the album that I would get rid of @HALL_HOSSLER1 @YeaNarry Banger @stillnewangel @YeaNarry Didn’t have enough room for her on the poll Hahahah @goldenarryy @YeaNarry I tend to agree @nhdimple No they’re not @YeaNarry No .... just 4 tunes. Wana see where we’re at @tattooednumber I’m bigtime now Hahahah Only have 4 options here , so I’m going to pick 4 randoms @nialltour 😂😂😂 @ash_london Go on then . Start it ? @niallsonIyone @blackwhite_nh @happilyIauren Yeh where are ye ? @horansalbum No you’re not . . Bravery it’s where it’s at RT @blackwhite_nh: @NiallOfficial @happilyIauren Making all these videos for you at 12 AM @NiallOfficial but u won’t see them :((( https://… @blackwhite_nh @happilyIauren Go on !!! Lose your shit Hahahaha @happilyIauren Did you buy them or did you just sit in target with copies ? Hahahahahahahaha @newangelrose “ if ya leave me like a message in a bottle “ RT @YeaNarry: @NiallOfficial #HeartbreakWeather video #2 lmao... https://t.co/OhgUaNFazV @YeaNarry Yeaaahhhhhhhhh @LEEYUMSNIALL Yes girls . Love it @3amhxrry Me too . Fucking love that song @niaIIskiwi 😆😆😆😆😆 wooooop wooop @niallaar #NoJudgement ? RT @997now: Happy release day @NiallOfficial 🥺 #HeartbreakWeather https://t.co/3i1lsoa0gA @997now Thank you and you tooo Send in videos of you guys listening to your favourite song on #HeartbreakWeather , doesn’t have to be a happy one just for the video 😂😂😂 @flickerofhope13 @latelateshow Heartbreak weather ? Don’t get me started , I’ve danced around my kitchen to that song for the last year @sugarrrhoran @latelateshow Heartbreak weather, dear patience @niallhenergy @latelateshow More than likely petal Hahahah @LallaySouza @latelateshow Exactly . @hawyeehoran Oh for sure @newangelrose No .not this time . Have too many songs I like now @flickernialler Yes julia. Get it @stilIstrangers Just heard crazy stuff in my head. @ohdearpatience Dear patience is my brain chatting @itsemilychong You dance your ass off , Emily @hbwtalk @adidasxlwts @_heyitsdan_ Yes it’s a stunner . . Gives me goosebumps . The lyrics couldn’t be more honest if I tried @ItsDaniAlexis I know you’re not ready. I wasn’t either but now Im ready go go @flickersmartina @adidasxlwts @_heyitsdan_ One of my favourites too. Soo many great memories of writing songs on this album.the most present I’ve been in a process @perfectflicker @adidasxlwts @_heyitsdan_ Obvs @bndtherules Dress is my baby and a very emotional song to write . Personal stuff for me @crossniallsmind @ohdearpatience Coz I didn’t like 18 songs . I liked 16 @patiencenialler Yeh I’ll put em out @aIightinthedark @IrelandsAss @_heyitsdan_ If I ever write twenty songs that I think are great, I’ll do that and release it. I didn’t do it this time so , ya got 16 Hahahaha . Still not happy ? @clingynialler Coz 34 of them were shit Hahahah @adidasxlwts @_heyitsdan_ Fucking tuuuuune and it’s a rocket live aswell @ohdearpatience No coz then I wouldn’t have been happy with my album. @nialltrench @_heyitsdan_ Alright smart ass . @ohdearpatience Read the other tweets in this chain by me@ @NewAngelAng @_heyitsdan_ Yes they are both in the setlist RT @YeaNarry: @NiallOfficial NIALL THIS IS ME JAMMIN TO #HeartbreakWeather !! It’s amazing !! 💙☔️ https://t.co/secNGxuwRV @_heyitsdan_ Ya know ???????? @_heyitsdan_ But was willing to go 14 + 2 @_heyitsdan_ I wanted 16 songs on the album . Target always like two exclusives and rightly so coz they are great. I just wasn’t willing to go 16 + 2 @_heyitsdan_ They are released.i want to clear that up and don’t  want anyone to think i don’t like those songs and they are just some extra tracks I was forced to put out . They are very much part of the story. RT @onedreamnarry: i cam now confirm, San Francisco is another of my favourite 😭 keep streaming #HeartbreakWeather @NiallOfficial https://t… @loveagainmendes That’s Niall storm . Got to play my favorite track off #HeartbreakWeather last night on the @latelateshow . Hope you all enjoy this song as much as I do https://t.co/BWibYVb61A https://t.co/ypLWdvkj1C @hbwstill It just rounded off everything I’d worked on all year . . RT @benwinston: Well, we have announced we have to come off air for a little while. We will be back as soon as it feels appropriate to do s… RT @hrtbreakbarbara: Niall Storm here to tell you to KEEP STREAMING AND BUYING #HeartbreakWeather on iTunes and Spotify!! Lets keep it at #… This Tweet from @NiallOfficial has been withheld in: United States. @flickerofhope13 Guitar . Exactly as you hear it RT @FINELINEREADY: niall how excited are you to come to toronto? #HeartbreakWeather https://t.co/FNR8GVEPhE @FINELINEREADY Yessssssss Let’s see it trend again on its release day . #HeartbreakWeather @ntmychalamet I think ‘still’ . It’s the song I’ve been trying to write my whole life. Completely honest, musically stunning, lyrically smart @bostonniaII No I wrote it in LA @newangeII Thinking about runway modelling next @NewAngelAng Coz the other photo is better @heartbreaknialI Small talk @NHFLOOF1 Yep @hrtbrkpatience Yes @soIotides Dress and nothing will be proud @Niallxstormx Yes boy ! Smashing it @niallertomeetya Black and white obviously !!! Cmon @finelinemoonx Love this RT @CLW1998: @NiallOfficial how do you feel that  #HeartbreakWeather  is #1 in the UK! 🇬🇧 https://t.co/NgGOxL3C4j @CLW1998 Huge news . I’m soo happy @actualIynarry New angel I think it was hahaha @reachthestarnjh That’s what it’s about . I’ve been dancing around like this for years, thats why my knees are in bits Thank you @amazonmusic ! Ask my girl Alexa to play my new album #HeartbreakWeather\nhttps://t.co/9c2Ocu5Xmt https://t.co/D4LjWEgwbb RT @myidolsbravery: Niall this masterpiece is on repeat till yesterday night 💪🏻 24 hours of streams no stop! #HeartbreakWeather @NiallOffic… RT @super_star_96: We live in uncertain times but something that’s constantly consistent and there is Niall and his beautiful music. I love… @super_star_96 Thank you love RT @neniaguirre33: I just went to target &amp; had to buy 2 copies of #HeartbreakWeather I am obsessed ❤😭 @NiallOfficial https://t.co/0S3OJ0ZA4X @neniaguirre33 Love you @EmmaLouCarey Why thank you darling @fallingkissie No toilet roll and no Niall Horan albums, it’s a weird world @SanfransicoNjh 😭😭😭 @DaydreamsWell It was shot weeks ago RT @billboard: Billboard News: @NiallOfficial finally unveiled his sophomore effort, #HeartbreakWeather, today. #BillboardNews https://t.co… RT @IrishCentral: If you need a break from the rather grim stories dominating the news cycle ... take a moment to enjoy the endlessly charm… RT @JustJared: .@NiallOfficial is smiling through the storm as a weatherman in his official music video for #HeartbreakWeather - Watch here… thanks @pandoramusic for putting me on cover of New Music Now! https://t.co/jVwKJI27SS https://t.co/AFzSD69sqx New Music Friday in New York and Toronto ! Thank you so much @Spotify . Go on and give #HeartbreakWeather a listen https://t.co/HxRcVukwS3 https://t.co/Ag4kOUAAIq MY ALBUM ‘HEARTBREAK WEATHER’ IS OUT ! Go get it ! #HeartbreakWeather RT @iHeartRadio: On our latest episode of 'Inside The Studio,' host Joe Levy chatted with @NiallOfficial about his new album, #HeartbreakWe… RT @youtubemusic: Ladies and Gentlemen @NiallOfficial's new album #HeartbreakWeather is here → https://t.co/S15uStlFUC https://t.co/i4YBFcp… Driving around Hollywood with my mate, singing a few tunes and having a laugh . Good to be back in the car with @JKCorden @latelateshow https://t.co/fEga5xKf1f #NiallCarpool https://t.co/eqWUQEmtVM Thanks for all the love on #HeartbreakWeather @youtubemusic ! https://t.co/neGNdOQ059 https://t.co/RdrUyA84dz RT @iHeartRadioCA: Two words, many forecasts : HEARTBREAK WEATHER ♥️\n\n📸: @NiallOfficial #heartbreakweather https://t.co/Fj0Ucjt16L my brand new album Heartbreak Weather is out this week and to celebrate, i'm taking over the @Spotify TGIF playlist ! So make sure you go and enjoy it https://t.co/1AVXQNReGX https://t.co/SfcPiCeUMm RT @BuzzFeedUK: Have you been listening to @NiallOfficial's new album, #HeartbreakWeather?\n\nOn Monday, Niall Horan will be revealing a bunc… @BuzzFeedUK I loved doing this !!! 😂 RT @hotpress: Three years after making history with his globe-dominating solo debut, @NiallOfficial is back.\n\nHeartbreak Weather is out now… RT @IrishMirror: @NiallOfficial in disbelief as new album 'Heartbreak Weather' rockets to top of iTunes charts worldwide\n\nhttps://t.co/Qj7t… RT @SiriusXMHits1: HAPPY #HeartbreakWeather day!!!!! @NiallOfficial you’ve done did it again!!! What a lovely album, the growth shines thro… Heartbreak Weather is out everywhere and so is the video . this entire creative process has been incredible , thrilled to share it all with you https://t.co/yWXCi50j8z #HeartbreakWeather https://t.co/N36nHe2I6H 1 more thing ... #NiallStorm #HeartbreakWeather https://t.co/yWXCi4IHJZ https://t.co/Z3DSmyGhFS Thanks for playing Black And White on Best New Pop ! @BBCR1 @MollieKing #HeartbreakWeather https://t.co/D7QrNB3moh #HeartbreakWeather RT @thismorning: 'Is Harry Styles guilty of crimes against fashion?' 😅\n\nFormer #1D star @NiallOfficial had no judgement about Harry's fashi… RT @latelateshow: “Black and White” from @NiallOfficial off his new album #HeartbreakWeather \n\nhttps://t.co/L7iAD3zmYD RT @harryseingblind: Niall Horan singing the most beautiful wedding song ever made. That’s it. That’s the tweet https://t.co/my2aQ7NXrY @1DOnChart Fuck RT @nhstreamteam: 🇺🇸 #HeartbreakWeather is #1 on US iTunes! Congratulations, @NiallOfficial! https://t.co/yPwvGQHXjX RT @Spotify: Grab your umbrellas ☂️\nIt's #HeartbreakWeather \nListen to @NiallOfficial's new album right now: https://t.co/dd2GRefSxh https:… RT @WORLDMUSICAWARD: #NiallHoran's brand new album #HeartbreakWeather is just out and already #1 on iTunes in over 25 countries including t… RT @ZenFloof: #HeartbreakWeather #1 iTunes in USA!!! https://t.co/6dBikirkfv RT @CamillaKugelfis: There is no better feeling that waking up and listen to @NiallOfficial new album #HeartbreakWeather \nIT IS AMAZING❤😍😊… @aIwaysIths Cmon mexicooooooo @otbsuns I love this so much RT @latelateshow: Cool. Cool cool cool. Totally cool @niallofficial. Suuuuper cooooooooool. \n\nFull #NiallCarpool: https://t.co/AzPsCfhOO5 h… RT @latelateshow: Some impersonations for your pleasure #LateLateNiall #NiallCarpool https://t.co/UaL1R73R5S RT @ntmyimbronsgem: #HeartbreakWeather being #1 in America is what it deserves! SO PROUD OF NIALL!!!! https://t.co/LgpO3qHtTh thanks for the love on the new record @AppleMusic ! Listen to #HeartbreakWeather available now https://t.co/4ukOdzhQRK https://t.co/OV0ouELZyQ RT @rarejoker: niall is number #1 in brazil!!! please best fans in the world 💖 we are so proud of you #HeartbreakWeather https://t.co/yd5N4… 😂😂😂😂😂😂😂😂😂😂😂😂 https://t.co/m5INrJGfdM RT @latelateshow: Oh hey! 5 mins till #NiallCarpool, a chat w/ @eizamusica\n &amp; @vindiesel plus @NiallOfficial closes out #LateLateNiall http… RT @Hits93Toronto: YOU WALK INTO THE ROOM I GO QUIET... I CATCH YOUR EYES AND DON'T BLINK AN EYELID... FEELS LIKE THE WORLD LOCKED US ON AN… @Hits93Toronto I love that song @NHFLOOF1 Few hours RT @heartbreaktours: NIALL YOU'RE OFFICIALLY NUMBER ONE IN CANADA BABY IM SO HAPPY FOR YOU #HeartbreakWeather https://t.co/1Jou2fy79a @niallsheadspace Let’s go with the number 1 @ohnoflicker Best friends @flickernialler Yes girl I had so much fun and a lot of hard moments writing this album and I’m very proud of the record as a body of work. ￼NOW IT’S YOURS. Dance, laugh, cry, take the lyrics in, do whatever makes you feel it. https://t.co/yIuD6AteX5\n\nLove you all\n\nNialler x\n\n#HeartbreakWeather https://t.co/S789niZFGV @ClifforniaIl Carpool and a new song from the record @smalltalkhabit That’s if we ever go on tour 😂😂 @hrtbreakbarbara Is it fuck Hahahahahahaha @bndtherules Watch late late show tonight and you’ll see @niallxwalls No I’ll be way too bigtime after that @hrtbrkweather Fuck it yeah @stilesaetre It’s huge . Hopefully there’s longevity to the reaction , that will be the test on the music @patiencenialler Arguably the best live one actually @ohnoflicker Yes I am . Worked bloody hard on it @starslitnight Funny you say that. This couch and this type of wine I’m currently drinking is part of ‘ no judgement’ storyline @nojudgemvnt I know what it sounds like live and yes you’re correct RT @DalrympleCarlie: 3 words. \nStream Heartbreak Weather!\n@NiallOfficial \n#HeartbreakWeather https://t.co/KZS2646QHH @lovebeneathskin I can’t pick I swear. . I’m too in love with soo many @hrtbrkpatience Coz you beinggggg badddddddd @shesnewangel My favourite too babe @stormtoweather 😂😂😂😂😂😂 @niallertomeetya Hold on I’m the one making the video telling people to stop. You stop laughing @stormtoweather Agreed Thank you darling https://t.co/VirZaypueV @itsyourvanessa Thank you @ohgodmylarents My country . @itsyourvanessa Tuuuuuuuuuuune RT @libbymollet25: Number 1 in New Zealand 🇳🇿 @NiallOfficial #NewZealand #HeartbreakWeather https://t.co/keFZQMV1Vd RT @acousticliffrd: Niall is trending #1 on twitter AND is #1 on itunes in Sweden, we really love him here ⛈ #HeartbreakWeather https://t.c… RT @ohnoflicker: Niall #HeartbreakWeather is Number 1 in the Philippines https://t.co/nOzNhdKln0 @NJHsDrtyLiLScrt #NoJudgement RT @armsofstrngrnh: basically if you live in all these countries THAN PLS KEEP BUYING #HeartbreakWeather @newangelrose Yeassssssss RT @RikkeS88: Niall you’re #1 in Denmark 🌦 #HeartbreakWeather https://t.co/QREIbLa3xw @1DOnChart #1 and it’s a deal? RT @latelateshow: Join us tonight for #NiallCarpool and chat w/ @eizamusica &amp; @vindiesel plus @NiallOfficial closes out his week long #Late… @goldenldn Let’s get the number one next week RT @ntmygolden: Number 1 in the Netherlands Niall!!! #HeartbreakWeather https://t.co/lsyeP107aY RT @myirishfeelings: #1 in Portugal!! LETS GOOO @NiallOfficial so proud of you 🥺 https://t.co/sN0IRrJdJ5 @manuelaa4321 Tuuuuuuune @lyd_linda 😂😂😂😂😂 RT @PrfectlyFlicker: NIALL #HeartbreakWeather IS 15TH IN THE WORLWIDE ITUNES CHARTS. LET'S BE NUMBER 1 🙌🙌🙌🔥❤️🙌🔥🙌❤️ https://t.co/W5kZ7ScDOI RT @latelateshow: Three seconds in and @NiallOfficial and @JKCorden are already roasting each other 😂\n\nCatch #NiallCarpool tonight at 12:37… @latelateshow @JKCorden @CBS 😂😂😂😂😂😂 @flickerpromise Cmonnnnnnnnnnnnnnnn!!!!!!!! Trending #2 worldwide and it’s just out. Let’s keep it going my people! Love you all . Glad you are enjoying it so far. #HeartbreakWeather Night 4 and my final night of #LateLateNiall @latelateshow . Carpool karaoke and a new song from the album anyone ? RT @sincewerealone: @latelateshow @hbwtalk YESSSS RT @gavinjames: Absolute banger central!!! FairPlay Pal @NiallOfficial 🥳 https://t.co/z0c9mfTtbV RT @laurenglancy15: NIALL YOUR NUMBER 1 in IRELAND @NiallOfficial #HeartbreakWeather https://t.co/7rNLLln8AM RT @stilIstrangers: Niall!! #HeartbreakWeather is number 2 on the Canadian iTunes charts! Only 3 more hours left until we get the album! ht… RT @chantal240681: @ntmyonvinyl @NJHNEWS2 #HeartbreakWeather RT @tinystarlouis: Niall heartbreak weather is #1 in Finland!!! We love you  #HeartbreakWeather https://t.co/gzrgCWYe44 RT @fIickernjhs: #4 on German iTunes now!!! #HeartbreakWeather https://t.co/z8hzYcp941 😍😍 https://t.co/O8jZ3ublJT Spill it girl https://t.co/apVusYpBBG RT @IsabellaMarando: NIALL HEARTBREAK WEATHER IS NUMBER 1 IN AUSTRALIA 🇦🇺 👏👏 #HeartbreakWeather @NiallOfficial https://t.co/bDpVGedaEw RT @melahoran: SHES OUT!!!!!! NIALL OUTDID HIMSELF AGAIN #HEARTBREAKWEATHER https://t.co/gLysER6InE RT @isnickmikaelson: I SWEAR I THOUGHT SMALL TALK WAS GOING TO BE IT BUT THEN CROSS YOUR MIND DRAGED ME TO THE DANCE FLOOR AND IT JUST WOUL… @isnickmikaelson 😂😂😂😂😂😂 RT @creepobeepo: (14) Still\n\nHoly fuck this hurt me \n\n#HeartbreakWeather https://t.co/6VLn0Jg5ua @creepobeepo Me too RT @littlelouv: OHMYGOD SHES HERE AND SHES BEAUTIFUL!!!!! #HEARTBREAKWEATHER BY NIALL HORAN!!!!🔥🔥🔥🔥 https://t.co/XhB8mAJ2ga RT @niallontours: The #HeartbreakWeather CD! ⛈🌤💿\n(Via @lovebeneathskin) https://t.co/vofd6c0oqB RT @harryseingblind: HEARTBREAK WEATHER NUMBER #1 TREND ON SPAIN!! GO SHOW SUPPORT TO NIALL’S SECOND STUDIO ALBUM, LET’S GET IT NIALL NATIO… RT @mardierzd: @ash_london @NiallOfficial MAAAAAAAAAAAATE RT @AshLondonLIVE: Yaaaas #HeartbreakWeather is finally here!! (Well in Australia at least!) 🙌🙌\n\n@NiallOfficial is uber talented and 10000%… @AshLondonLIVE Love you ! RT @EMIMusicAU: ⛈️ It's Heartbreak Weather for all of us @NiallOfficial ⛈️ 'Heartbreak Weather' is out now! https://t.co/do9xIEXXdY https:/… @EMIMusicAU Yeppppp Everyone pre- order and pre-save ‘Heartbreak Weather’ . Not long to go now #HeartbreakWeather RT @New1027: I mean, it IS the eve of #HeartbreakWeather dropping, so it's only right that I play a lotta @NiallOfficial on the show today.… One day we won’t have to wear these ridiculous rubber outfits but until then … It’s heartbreak weather for all of us #HeartbreakWeatherWatch https://t.co/I9X1l4YRup https://t.co/ofePW8VJsM @romcomhes @dncingmoonlight I’ll be having a few Of them tonight @RikkeS88 Shall we ? RT @RikkeS88: @NiallOfficial Let’s focus on getting your amazing album #1 on the charts around the world 😉 #HeartbreakWeather @dncingmoonlight Let’s not talk about corona. I don’t want my album to be associated with that haahahah It’s such a big day. . Wish I could really tell you guys how I feel but I can’t describe it. Something I worked on for over a year is being released in a few hours and it’s just a crazy feeling . Correct James https://t.co/nW8DVMBcob had so much fun performing No Judgement for ya ! Tune in to @latelateshow tonight for a new one #LateLateNiall https://t.co/ajkLk1be6y https://t.co/GGrS96r10n Surely as far as ‘difficult second albums’ go, I’ve smashed it with my timing RT @BritishGQ: From his favourite London pub to the poetry book he's reading at the moment, see @NiallOfficial's top recommendations over o… RT @CapitolRecords: LET'S GO!!!! #HeartbreakWeather 🌦https://t.co/pcZygEpn5J RT @iHeartRadio: Important update regarding tonight's iHeartRadio Album Release Party with @NiallOfficial. https://t.co/vrsNERrc71 Album time babyyyyyyyy! #HeartbreakWeather RT @troiansbiscuit: I swear to god this is the best thing I’ve ever seen in my life ahahahaha @latelateshow @NiallOfficial https://t.co/tE0… RT @latelateshow: Strut @NiallOfficial STRUT. #LateLateNiall https://t.co/vkou5JVZeM USA i'm thrilled to share that I’m going on the @HondaCivicTour ! i've just added NEW dates for the US summer run and cannot wait to see you all . Make sure you get your tickets at https://t.co/khks2RMI21 #HondaCivicTour #NiceToMeetYa https://t.co/6dyXv1SuoN @latelateshow @JKCorden Everyone that watches this , YOU ARE ALL SOO WELCOME @latelateshow @xT4SH @SamHeughan 😂😂😂😂😂😂 biggest understatement of the year RT @livexlive: TOMORROW! We are live streaming @NiallOfficial's @iHeartRadio Album Release Party at 9:00PM PT/12:00AM ET. 💜🙌🏼😊 His new albu… My performance of ‘ put a little love on me’ from last night. I absolutely love singing this song and last night was so special  https://t.co/FKum4LkssA https://t.co/mkAwt9JMNf @romcomhes Oh yeah I hate the Beatles 🙄 I’m giving away a ton of merch to one lucky fan who presaves the album ! Go and enter here https://t.co/i00D6tlfGH https://t.co/Yo8YdvpjdA Only 2 days until #HeartbreakWeather ! can't believe my new album is out so soon . so excited to share it with you all ! available Friday March 13 at midnight local time \nhttps://t.co/zPZPkVSIFk https://t.co/luRDHWX6KW Niall Storm here with an urgent message . Tune into the sky to see the magic of reflection, refraction, dispersion and other complex physics I’m not gonna pretend to understand #HeartbreakWeatherWatch https://t.co/I9X1l4YRup https://t.co/KuM3Ai971V RT @GlamourMagUK: \"We never really saw ourselves as these big celebrities. We were just in this little fishbowl having a great time and all… RT @MTVNEWS: .@NiallOfficial serenaded us with a performance of \"Put a Little Love on Me\" on the second night of #LateLateNiall https://t.c… We are just over a month away from the start of the North American leg of the NTMY tour with @LewisCapaldi and @findingfletcher . Go get your tickets, it’s going to be class @callmecamile No seriously !! It’s not up to me or my agent or anything . It’s local government making calls @callmecamile I don’t have insurance for my tour 😂😂😂😂😂 RT @BanquetRecords: with the original Niall Horan show selling out in minutes, an additional gig has been added. on sale Thursday morning h… You’ve sold out the first show so we’re adding a second one ! @BanquetRecords on March 30th , grab your tickets tomorrow at 11am https://t.co/fb1DisiZU4 https://t.co/jMv48rnUUP @urlocallouie Yesssss @harryseingblind I’m tired Hahahahah ... it’s been a crazy day but I’m very proud. Very rewarding feeling @shesnewangel I love it very much also @lwtcaprio We still have more to do but I’m having a great time . Incredible show @heartbreaknialI Horrendous. I’ve showered on two different occasions since RT @wtrmelonkiwi: niall, this was performance was absolutely heavenly. \n\nwe’re so proud of you! \n\n#LateLateNiall https://t.co/7xMmyolP0j @wtrmelonkiwi Thank you darling One for the books! Round 3 tomorrow ❤️❤️ https://t.co/UKGFgI1qcb RT @latelateshow: \"Put a Little Love on Me\" is a swoon worthy performance @NiallOfficial https://t.co/Ip3WqXF9fk RT @latelateshow: Just a couple of hot boyz. #LateLateNiall https://t.co/ohx00QHBGB RT @latelateshow: A pic for your diary of @NiallOfficial commanding a room. #LateLateNiall https://t.co/srRmLlbxLr #LateLateNiall @latelateshow let’s trend it!!! Round 2 is coming in hot ❤️ RT @latelateshow: #LateLateNiall Night 2 is coming in hot with @NiallOfficial, Annette Bening and Elle Fanning plus Niall performs “Put A L… RT @niallaar: Niall nation, can we trend #LateLateNiall to #1 worldwide or what do you say?🤪 https://t.co/V88n58R8aE @flickerkale Yep @NewAngelAng Yeh my Instagram is doing weird shit , I just gave up after a while ahahah @randomliz96 Sickkkkkkkk . RT @BOKCenter: Did you catch @NiallOfficial on the @latelateshow last night? We can’t wait for his new album ‘Heartbreak Weather’ to drop o… RT @latelateshow: How did @NiallOfficial warmup for Night 2 of #LateLateNiall? Just a bit of golf around our office. 🏌 https://t.co/cis4hUH… RT @GlamourMagUK: .@NiallOfficial opens up about post-breakup songwriting on his new album #HeartbreakWeather, being kind online and why he… @GlamourMagUK Great chat had a great time performing Nice To Meet Ya on @latelateshow last night . #LateLateNiall round 2 tonight ! Let’s goooooo\nhttps://t.co/wCC2KRv3qs https://t.co/uCjvnrfbiO California ! Which of you lovely people want to come to my #HeartbreakWeather album release party with @iHeartRadio this Thursday? https://t.co/BBIYJQm05f https://t.co/y725ujziQi Sun, It’s Niall. I miss you , please come back ! #HeartbreakWeatherWatch https://t.co/I9X1l4YRup https://t.co/pSUtTQPoHV listen to @stevevoidmusic’s remix of my latest single #NoJudgement, out now !  https://t.co/UC8GU3oKo5 https://t.co/2XV4TJu4OM UK ! To celebrate the release of Heartbreak Weather, I’m playing a special show at @BanquetRecords in Kingston on March 30th ! Tickets on sale tomorrow at 11am https://t.co/ItjSK1F7Dz https://t.co/xQj9D7qwTH Only 4 months until the @JPProAm in Limerick ! Looking forward to heading back home and to @TheAdareManor to help raise funds for charities in the Mid-West of Ireland. See you there ! https://t.co/TQnOFbfWQK @heartbrkflicker Of course we know Hahahah . They are on show 750 or something, if they don’t know by now, they’ll never know 😂😂 @flickerevans Some fun and some sad Can’t wait for round 2 !! #LateLateNiall . https://t.co/wBqYZ609As @perfectflicker Orange RT @niallaar: I love this show so much, I can’t wait for the rest of the episodes !! 🔥🔥🔥🔥\n#LateLateNiall https://t.co/ctRzvZ1xIi Nice To Meet Ya ! #LateLateNiall https://t.co/X1sn4paUDm RT @lujainn1l0: #LateLateNiall #LateLateNiall #LateLateNiall #LateLateNiall #LateLateNiall #LateLateNiall #LateLateNiall #LateLateNiall #La… RT @latelateshow: **Jaw Drop** @NiallOfficial https://t.co/q5ZGgbmIBh RT @bendwtherules: can @CBS give to @NiallOfficial his own talk show, please? #LateLateNiall https://t.co/A0GhssxKmA @bendwtherules @CBS Ya hear this ? RT @niallernroses: niall is so happyyyyyy 😍 #LateLateNiall\n\n https://t.co/59lgIaaVK1 RT @latelateshow: Screaming. Cause we are trending @NiallOfficial !!! #LateLateNiall https://t.co/fpvdvUO898 RT @latelateshow: HE'S HERE in 5 mins!!! Catch @NiallOfficial and @thandienewton on night 1 of #LateLateNiall https://t.co/5aJyAHgpDV I’m here to report that today’s forecast is mostly your problem. Go take a look for yourself, it’s not like it’s against the rules #HeartbreakWeatherWatch https://t.co/I9X1l4YRup https://t.co/iQ0MDkCnLp Only 30 more minutes !! #LateLateNiall https://t.co/u0EY4Wae6T @maisiehpeters 😂😂😂😂😂 ive dished that look out on many occasions RT @Fangirl1D_hnllz: @NiallOfficial @latelateshow Let GOooooo #LateLateNiall ,I am so Excited Can't wait to watch it 😊👍 @ohgodmylarents @latelateshow Shall we ? RT @HessasAngels: @NiallOfficial @latelateshow I WAS IN THE AUDIENCE TODAY AND YOU ABSOLUTELY KILLED IT WITH YOUR PERFORMANCE!!! #LateLateN… @HessasAngels @latelateshow Thanks petal #LateLateNiall @latelateshow tonight and all week 12:30 EST !! Let’s make it trend RT @latelateshow: Starting a week of #LateLateNiall off in style with @thandienewton and — surprise, surprise — @NiallOfficial! https://t.c… RT @latelateshow: Well, well, well, look who we have here: it's @NiallOfficial! \n\n#LateLateNiall https://t.co/dmiWKqJTWi Going to be an incredible week here on the @latelateshow with my good friend @JKCorden. Make sure ya watch #LateLateNiall https://t.co/ORqRH2miqM RT @BritishGQ: 🚨 It's here 🚨\nWe put your questions to @NiallOfficial, exclusively for #GQHype in #NiallHoran Vs The Universe 🔭\nWatch the fu… Thanks @BritishGQ for having me on the cover of Hype ! Loved catching up with ya and talking about the new album https://t.co/bHx7csyazd https://t.co/Rl601Xs0yk RT @pandoramusic: No Judgement if you've been playing this track on loop – us too 🎶 Spin the acoustic version of @NiallOfficial's \"No Judge… RT @latelateshow: #LateLateNiall starts tomorrow!\n\n https://t.co/pcu6zUEN93 It’s time for #LateLateNiall #HeartbreakWeather RT @heartbreakhabit: preorder niall’s album #HeartbreakWeather for bops like this one!!! i’ve never been more excited for an album EVER !!!… RT @IrishSunOnline: Niall Horan gives fans a sneak peek of his new song ahead of album release https://t.co/sljc93zVWe Also @Lisa_Maguire_ doing a great job running the women’s division of @modestgolf First @PGATOUR win for us @modestgolf . Seems like not long ago I started the company and I’m so proud of our small little team. @markmac14 @katyhall26 @DannyWardrop @JackBarber92. @TyrrellHatton https://t.co/buhvd0zAij RT @emmastacey_: @NiallOfficial What a banger! The 2020 @APinv champion!! So happy for you @TyrrellHatton. Being a part of your team I see how much hard work you put in and to see you get your first @PGATOUR win is very special. The king @ArnoldPalmer would have been proud of that performance at his place. @modestgolf https://t.co/x8wZyeYra5 RT @PGATOUR: Arnold Palmer’s iconic red cardigan is awarded to the @APInv champion. \n\n@TyrrellHatton wears it proudly. https://t.co/ThOa74l… RT @ConorSketches: Congrats to @TyrrellHatton ! And big congrats to @NiallOfficial and the @modestgolf team!!! Big day for the fam!!! 🙌🏻… RT @PGATOUR: A win at Arnie's Place. 🏆\n\n@TyrrellHatton claims his first PGA TOUR victory @APInv. \n\n#LiveUnderPar https://t.co/L71FkpXORX It’s a real scorcher out there today folks. So make sure you take a little extra time at the water cooler and work on your small talk ! https://t.co/WDkOCUbdOy #HeartbreakWeatherWatch https://t.co/O2bc3smU8l RT @SiriusXMHits1: Thank you @panerabread for playing @NiallOfficial #OnTheLoose!!! Our lunch was bomb af thanks to that!! 😍🥰 You’ve been askin for it... tweet #HeartbreakWeather to get a preview of the wedding song ! @theirelad 100 % I have two golfer in the top 4. Yesss @dcfcofficial !! 🐏🐏🐏 RT @PGATOUR: His last 4 worldwide starts:\n\n2nd\nT21\n1st\nT29\n\nHe's currently T7 at @APInv.\n\nMeet Christiaan Bezuidenhout: https://t.co/GzLvDi… @armsofstranger Try and play a few times a week. This time will be a mix of writing and touring @frmthstars @blcndehair @PGATOUR @APinv @modestgolf @TyrrellHatton @BezChristiaan We have our wonderful Katy RT @iHeartTheaterLA: This is your last chance to enter to attend @NiallOfficial's exclusive Album Release Party in Los Angeles!\n\nDon't miss… @blcndehair @PGATOUR @APinv @modestgolf @TyrrellHatton @BezChristiaan There’s only 5 of us . @newangel @PGATOUR @APinv @modestgolf @TyrrellHatton @BezChristiaan Just work hard @Hits93Toronto Well that is lovely ! Thank you Amazing feeling looking at a @PGATOUR @APinv leaderboard and seeing two of my @modestgolf boys right up there. @TyrrellHatton @BezChristiaan good luck to both for tomorrow. Proud of our little company Niall Storm here with Heartbreak Weather. If you’re watching this, nice to meet ya ! #HeartbreakWeatherWatch https://t.co/I9X1l4YRup https://t.co/Hd4m5lo63H @jukatarry Again. Sarcasm not going down well. Of course there’s piano on the record, I play music @harrysskindnes There’s 0 piano on the whole record @NJHsDrtyLiLScrt I have no idea hahah @nhandpotatoes NTMY, new angel, small talk .... etc @horansrauhl It’s so cold that my fingers are sticking to the guitar strings and wondering how the hell am I gona play this song now. @horansrauhl I have a jacket very similar and I really wanted to make one of my own thanks @Spotify for putting me on the cover of ‘Best of Singles’ ! https://t.co/Ot4y7Rw7ac https://t.co/SblknsM7rE Niall Storm here. Crystals are putting a little love on each other tonight and a crazy little thing called snow is coming your way ! #HeartbreakWeatherWatch https://t.co/I9X1l4YRup https://t.co/M5RoI2Sz0Q Good or bad weather , there’s #HeartbreakWeather merch for every occasion . Available for pre-order now https://t.co/zDqDQldvcO https://t.co/e4bthMVJvm RT @MTV: *immediately grabs tissues* https://t.co/UiyNgvGiQ6 @dncingmoonlight I really wanted to play TD garden but it was unavailable @theirelad I love that arena , so yeahhhh @ranialljames @MayaNiall Looking out at a sold out venue 🤪 @heartbreaknialI Tulsa my babies, shall we ? @MayaNiall Cmonnnnnnnnnnnn!!! Fuckkkkkk!!! Beautiful stuff . 😭😭😭😭 @armsofstrnger Cmon friends , it’s gona be magic @nialltour Yes Chicago, let’s do it @falling_728 TO is nearly sold out @bendtheheartbrk Not a hope 😂😂😂😂 @happiIytommo Me too .. LA my part time home , let’s goooooo @inmytides Columbus , let’s fill it up and we’ll have a great night RT @katyflicker: Guadalajara city we need support from Niall https://t.co/eqSPEWkJco @heartbreaknialI Atlanta let’s do it @frmthstars Cmon philly @hrtbrkwethrr Oh I’ve seen. Miami where ya at ? The acoustic version of #NoJudgement is out now , hope you enjoy x https://t.co/7DoBAU2hEd https://t.co/Vg5BBDopzN @fuckyeahhniall One @newangelrose Let’s go mexico @4EKAD4 Oh that looks like a bit of me .... can they all look like that? RT @CapitalOfficial: You can bag tickets to see @NiallOfficial in the flesh on his 'Nice To Meet Ya' tour now!! 😍🔥 https://t.co/pJh3hBk07L RT @BBC: There's a very special live performance on @BBCTheOneShow tonight...\n\n... from @NiallOfficial! 🤩\n\n#TheOneShow | 7pm | @BBCOne &amp; @B… @christinagraphi @Faby_1DFam @maisiehpeters Can’t wait, see ya there RT @hotpress: An extra date has been added to @NiallOfficial 's Nice To Meet Ya tour on October 31 in @3ArenaDublin \n\nhttps://t.co/NPowE35O… RT @BBCTheOneShow: HAPPY FRIDAY! 🥳   \n\nSO EXCITED to be welcoming in the weekend with a live performance from @NiallOfficial. \n\nSee you at… @hesunflowervol6 Will never forget bologna .in my top 5 shows of the whole year @nhandpotatoes It’s absolutely incredible !! P RT @3ArenaDublin: Due to phenomenal demand @NiallOfficial announces a second show at 3Arena on Saturday 31 October! Tickets are on sale now… @niallsdimples Me too :( RT @maisiehpeters: Let’s goooooo ⚡️⚡️⚡️ get a ticket now if ur not a coward and come to the best tour of the year objectively https://t.co/… @SSEBelfastArena Cmonnnnnnn @seeingniall_ Went to Julian’s studio on the day of the Super Bowl and just played what we thought would be a nice version. When we started writing the song, it was a bit like this anyway RT @lucy225042: @NiallOfficial I’m coming to see you in Manchester! #NiceToMeetYaTour https://t.co/12F3g9mkjh @putalittlelove6 We did . The band and I Second Belfast show added too !! Grab your tickets now https://t.co/vVBdCQ6zKf #NiceToMeetYaTour https://t.co/KSd8svMPl5 If you are in central London this evening and you like me, I’ll be at bbc broadcasting house for the @BBCTheOneShow performing outside. if you are at home about 7pm, stick on the telly and watch. #NOJUDGEMENT @ssearena @maisiehpeters Wembley arena, Where it all started. Can’t wait to play Can’t wait https://t.co/ATlySegOo3 @ManchesterArena It’s going to be amazing to get back into your arena. Love this place RT @mcd_productions: ✵  𝗘𝗫𝗧𝗥𝗔 𝗗𝗔𝗧𝗘 𝗔𝗗𝗗𝗘𝗗 ✵ Due to phenomenal demand @NiallOfficial’s Nice To Meet Ya tour comes home to @3ArenaDublin on bo… @3ArenaDublin I can and I can’t believe it.. my home country coming out strong . God I can’t wait , You guys smashed the pre-sale so we're adding a second Dublin show to the #NiceToMeetYaTour ! So excited to come back home for two nights in a row . Tickets on sale now https://t.co/QD3toXaepy https://t.co/NxISEPJLPU tickets for shows in the UK &amp; Ireland, Russia and a bunch of European dates are on sale now. Go get yours ! https://t.co/QD3toXaepy https://t.co/k1ILWj5a9y Niall Storm here and believe me , it’s freezing out there so don’t be afraid to find warmth in the arms of a stranger. Just make sure it’s not someone too strange … #HeartbreakWeatherWatch https://t.co/I9X1l4YRup https://t.co/ooMUHW8hOK @BBCRadio2 @ladygaga @badly_drawn_boy @BiffyClyro @Harry_Styles @JPCooperMusic @ronanofficial @emelisande @JamesTaylor_com Thank you very much !! ❤️ RT @mcd_productions: 𝗥𝗘𝗠𝗜𝗡𝗗𝗘𝗥 ⌁ Give @NiallOfficial gets the welcome home that he deserves at @3ArenaDublin on October 30th! Tickets go on… RT @iHeartRadio: Walking into @NiallOfficial's Album Release Party like... 😎\n\nEnter now for your chance to attend! https://t.co/jO82UsDSIq… RT @SSEBelfastArena: ⏰Is your alarm set?⏰\n\nTickets for @NiallOfficial 'NICE TO MEET YA' Tour 2020 are on sale tomorrow at 9am! \n\n🗓️Tuesday… @SSEBelfastArena Cmon Belfast . Let’s go . Sell that place out RT @BBCTheOneShow: That's it for tonight! @iamchrisramsey is back with @missalexjones tomorrow night, when they'll be talking to #JoannaLum… RT @CapitolRecords: \"Lover is one of my favourite songs I’ve heard in a long time...The minute I found out I was doing a #SpotifySingles, t… RT @imanarrystan: @NiallOfficial Niall looks like the \"feels like the world locked us on an island, an island without waves\" tweet of yours… It’s Niall Storm with the weather. Expect high winds to blow your hair everywhere ! Not mine though , it’s never fazed . #HeartbreakWeatherWatch https://t.co/I9X1l5gsSZ https://t.co/QPyxOkXhIo RT @MTV: STOP WHAT UR DOING and listen to @NiallOfficial's cover of #Lover by @taylorswift13!! 💘 https://t.co/c7izqCxAtx RT @enews: You Need to Hear Niall Horan and Fletcher's Cover of Taylor Swift's \"Lover\" https://t.co/No98PdFoF2 @PaulSmithDesign @hrtbrkwethrr @svradavis No not this time . Niall storm generally doesn’t wear Paul smith @smalltlkniall Usually about 6-7 hours @littlebitstran1 60 years old RT @littlelouv: ok this is PURE FIRE 🔥🔥🔥🔥i love this so much niall https://t.co/DNLdPvkSPI @shesnewangel Yes it is . . we’ll play live like that and I’ll sing just for vibe for and afterward I’ll record a seperate vocal. When there is acoustic guitar, the guitar and vocal definitely have to be recorded seperately or you would hear the guitar in the vocal microphone . RT @niallertpwk: for god sake im seeing niall in here!? i can’t keep up with my excitement https://t.co/4MTAxRSaY1 RT @findingfletcher: got to reimagine @taylorswift13’s perfect pop song Lover with the lovely @NiallOfficial 💕 https://t.co/JZskO4VheR Great day recording a live version of no judgement and a cover of Lover by the lovely @taylorswift13 for @Spotify singles sessions https://t.co/prRCQITE1i https://t.co/agLd5rMtge I also just had a thought about the start of the show and got goosebumps. This is going to be amazing . @tinykissy @ladstatted He’s got loads of places North America!!! The first run of NTMY Tour is gonna be here before ya know it. Go grab tickets and join in on the madness . @niallerar Oi Toronto lets go @putalittleIove Shower always, brush my teeth and warm up my voice . That’s it @lovebeneathskin All of em . Friends are in Melbourne but I love all the aussie cities, shows are always unreal @hrtbrkwthrnjh Opening night is gona be fun @hbwflicker Yes first show sold out . Let’s do it @ntmyimbronsgem Saved my favourite lyrics for next Fridays RT @Tomlinbucks: Hi Niall !!! We Got tickets to Miami, Orlando, DC, NYC, Philly, Warsaw, Berlin, Amsterdam, Paris, Cardiff, London, Glasgow… @Tomlinbucks Wow RT @theirishkingnjh: Can't wait to see you in Amsterdam, Glasgow and Antwerp, Niall! Get your tickets people!! 🤟#NiceToMeetYaWorldTour http… RT @flickerkale: Niall I can’t wait to see you in Columbus and Chicago this May!! https://t.co/7mVFbTVMfI @goldenontours Yes last show of the run, it’s going to be fun . RT @_niallsmysmile: Niall me and my friends are traveling to come and see you in both in USA and EUROPE!!! We love to support a TALENTED AR… @_niallsmysmile Love this . Enjoy and travel safe @NJHsDrtyLiLScrt Think people will love still, cross your mind, black and white, heartbreak weather @flickernialls Legend ! Travel safe and I’ll see ya there @niall_capaldi None sadly . @finelinetime Still @njhsbuddie Yeh please @tattooednumber So April last year @tattooednumber This was written in the Bahamas . @jadorelaniall We’ve been doing everything . @sugarrrhoran All the good stuff. Two friends on worldwide television. We’re going to have a laugh @nhdimple Both . More nervous @_lesliejj Yeh maybe just don’t wear make up @heartbreakwther Arms of a stranger @thelaurajayne_ Good idea. @putloveoniall Yeh hold on, just getting changed 😂 RT @NewAngelAng: Niall because of you i am meeting some of my mutuals!! We cant wait to dance and sing along with you in toronto!!! #NiceTo… @NewAngelAng Dance your asses off ladies @hrtbreaknjh I’ll explain next week how this came about @MusicEmma25 Let’s have it @crokelads Love this song so much. I’ll explain more about the songs next Friday when they come out . @Jazzyb123_ Black and white @angeltidenjh One of my favourites @svradavis 😂😂😂 RT @Number1NewisFan: @NiallOfficial see you in manchester! https://t.co/PtoANa4OHD @myidolsbravery He’s soo confused . @NewAngelAng 😂😂 @soft_njh Gorgeous hahahahahahah ? RT @Lauratobin1: So @NiallOfficial is trying to steal my job\n☀️The forecasts tie in with tracks from his new album #HeartbreakWeather They… It’s cloudy today! Partly… #HeartbreakWeatherWatch https://t.co/I9X1l4YRup https://t.co/P7GboPREPY RT @SykeOnAir: Hanging with @NiallOfficial in a few weeks to talk #HeartbreakWeather! Any questions you want me to ask for you? Tweet them… @flickerevans Gona be great !! @lilflicker Can’t wait @_bendtherules Nervous @niallmysuun It’s going to be very funny @flickerofhope13 I’ll just never ever forget how I felt writing that song @expecttioniall Top 20?? RT @harryseingblind: Niall I’m seeing you at Wembley!!! Can’t wait to see ya 🙌🏻 https://t.co/y8CDoWYhxM @heartbreaknialI I love the today show and have some of the greatest memories from it . St patricks day in New York is gona be amazing @imanarrystan 2,000 @niallaar Love this tweet ahahahha @heartbreakwthr That’s what I can’t wait for On stage with @iheartradio and infront of fans as my album comes out. watch the Heartbreak Weather album release party March 12 on @livexlive. Can’t wait ! https://t.co/zmRadypyW5 UK ! Pre-order ‘Heartbreak Weather’ before 12PM (Midday) on Wednesday 4th March to be in with a chance of winning a pair of tickets to a very special album playback with me on Thursday 5th March at a secret London location. https://t.co/kbWwR2ScBF St. Patrick’s day in New York City on Rockefeller plaza with the @TODAYshow. Now we’re talking #NiallHoranTODAY\n\nhttps://t.co/mWVKAfLajH https://t.co/W64vPVtrdd @Mrjamieohara1 @SportsBreakfast Got an album coming out that day, I’ll be in America geeeezzzzz RT @ThisisiRadio: Full Interview coming soon with @NiallOfficial \n\nNew Album out on March 13th #HeartbreakWeather #NiceToMeetYa https://t.c… @Mrjamieohara1 @SportsBreakfast I’ve been on a few times Jamie . I’m due another trip to be fair @Sjopinion10 You always were Simon. The blonde highlights were clearly influenced by myself from 2013 @NiallHoranUA Niall storm would yes @hrtbrkfearless The one and only @talkSPORT . Simon Jordan talking about the football league again 😂😂😂 @shadowsdancingg Yes babyyyyy @NiallHoranUA Fire Hahahah . Niall horan would not say that @ZenFloof Look at the size of them calves wow! 🦵 RT @bestfitmusic: Niall Horan talks perception, identity and reunions ahead of new album Heartbreak Weather: https://t.co/9LHx8Pkmu3 https:… @bestfitmusic Loved chatting 😊 RT @hotpress: 🤩 Ireland’s biggest ever pop star. His first ever solo #HotPress cover. \n\n#NiceToMeetYa @NiallOfficial\n\n#HeartbreakWeather\nGe… ❤️❤️❤️❤️ https://t.co/takOpV4dqB @glimmeryniall Funny ? *frustrates I love @talkSPORT, I love the conversation/ debate that happens on a daily basis but some of the tweets and texts they get from very fickle people, frustrated me so much. RT @vlvetgoldmine: @NiallOfficial so excited see you in Manchester 💘💘💘💘 RT @nhdimple: @NiallOfficial I GOT MINE! I cannot wait to see ya in London!! #NiceToMeetYaTour 🤝 https://t.co/nmKEiDOTOw Amazing to wake up to happy people getting their tickets to the tour. Let’s keep it going, get yours now. RT @latelateshow: @NiallOfficial @JKCorden @CBS Hey @NiallOfficial - sorry to bother, but James is wondering when you'll be round the tidy… @latelateshow @JKCorden @CBS tell James I’ll have an almond milk latte in my room every morning. RT @billboard: .@NiallOfficial is gearing up to take over the @latelateshow! 👀\n\nWatch the teaser clip below https://t.co/vkhrZfXhj8 Niall Storm here . I’m gonna head outside and pray to the angels above that I don’t come back looking like a sunburned Irishman #HeartbreakWeatherWatch https://t.co/I9X1l4YRup https://t.co/V9b5IdHofM RT @hscutest: i have front row tickets for another show!!!!! now in Monterrey NIALL HELLO GIVE ME ATTENTION IM SO HAPPY https://t.co/ZhlPpg… @duhitsnialler A while . Hhaha RT @latelateshow: .@NiallOfficial has a big week coming up on the #LateLateShow:\n\nCarpool Karaoke ✅\nNightly performances ✅\n@JKCorden's chor… Can’t wait to be on the @latelateshow with my good friend @jkcorden for a whole week #LateLateNiall https://t.co/2K9vYccDso @pinkktorres Yessssssss!!! Cmon . See ya there @niallerisart Am I now? @ohnoflicker Has no one figured out that Niall storm is a character and a ridiculous one? @heartbreaknialI You don’t know this song ? Whattttttt??? ‘ walking on a dream ‘ by empire of the sun RT @BBCTheOneShow: 🚨 News just in... 🚨\n\n@NiallOfficial is performing live this Friday 6 March on #TheOneShow   👀 \n\nSet your reminders for 7… RT @allontheboard: We are fed up with the storms, but we are excited about Niall Horan’s new album ‘Heartbreak Weather’ coming out next wee… Thanks for having me Dermot ! https://t.co/diW40XQaRs RT @ohgodmylarents: 211 days and we will be seeing niall in brisbane !! https://t.co/E3skwNwJjw @hrtbreakbarbara Ready RT @Ticketek_AU: ON SALE 😍 The wait is over! You can now lock in tickets to @NiallOfficial's #NiceToMeetYaTour in Sydney, Melbourne and Bri… @Ticketek_AU Let’s go RT @RodLaverArena: 🚨🎉 Tickets to see @NiallOfficial at #RLA are on sale NOW!  🚨🎉 \nDon't miss Niall as he brings his #NiceToMeetYa tour to M… RT @AshLondonLIVE: You can win tickets to see @NiallOfficial STARTING TONIGHT! \n\nENTER HERE ➡ https://t.co/cjhZ5juYZb (click the 'win tab)… RT @hsftniall: @NiallOfficial YES GO AUSTRALIA GRAB IT BEFORE THEY ARE SOLD OUT . @shawnsdelight_ See ya there babe @niaIlstorm Til mid December RT @3amhxrry: @NiallOfficial i’ve got my tickets, can’t wait to see you in sydney and melbourne!! #NiceToMeetYaWorldTour https://t.co/Kpkds… RT @bndtherules: @NiallOfficial I CANT WAIT TO GET MY TICKETS #NICETOMEETYAWORLDYOUR see you in sao paulooooo Australia tickets are ON SALE NOW for the #NiceToMeetYaTour ! cannot wait to see all of you lovely people . Get your tickets here: https://t.co/Jr9aZ1fjMm https://t.co/xpuNAtRK6n That was so great! Thanks for watching. Love you all 🥰. #HeartbreakWeather #NoJudgement @80SFLICKER You are all welcome @NiallHSPN There’s a massive storm on March 13th . Get ready RT @harley36206088: 😆😆 this song just made my day 10x better❤️ @SiriusXMHits1 @NiallOfficial #NoJudgement #HeartbreakWeatherWatch https://t… This just in ! It’s clear skies today and a 100% chance of love making #NoJudgement  #HeartbreakWeatherWatch\nhttps://t.co/I9X1l5gsSZ https://t.co/WLH4Xm8x3V @loutallinson There’s a few that are really intense . . Still will be a tough one, black and white, everywhere @goldenarryy @HEARTMEETSLOUIS And you think I was being serious? @nhstreamteam We need quite a few more to chart, I believe . Let’s go team @HEARTMEETSLOUIS Just the one . What ya think this is ? Amateur hour ? 😂 @sugarrrhoran Yeh when the album comes out I’ll try @niallernroses Rehearsing and then home to watch the football and make some food @niallaar Yes I do RT @SundayBrunchC4: 📀 Now Playing 📀 \n\n🎶 ‘No Judgement’ by @NiallOfficial\n\nFollow our playlist for more 🔥 #SundayBrunch\nhttps://t.co/vSxrVAM… @seeingniall_ I thought so too 😂😂😂 @nhandpotatoes Some Irish hunk @solongnialler Of course @souadXII Yeh I have three new pairs @njhsbuddie That’s a bass, I can’t play that thing Foggier than San Francisco out today. #HeartbreakWeatherWatch https://t.co/I9X1l5gsSZ https://t.co/4qm81kNBQL RT @hbwflicker: start searching for the ad !!! let’s unlock the second song #HeartbreakWeatherWatch @NiallOfficial @vintageniaill I’m going to assume your question is a joke ? Amazingggggggggg !!! https://t.co/huvM6bPyt1 @foockinialler @niallernroses No Hahahahah . They are my live band @njhftdolans I mean the bigger the better RT @mcd_productions: 🇮🇪 𝗚𝗜𝗚 𝗡𝗘𝗪𝗦 ✵ \nThe one and only @NiallOfficial is set to bring his 'Nice To Meet Ya' tour home to @3ArenaDublin on 30t… @_niallsmysmile Yes . . My kind of music is made for live gigs @smalltlkniall Me @niallernroses Each part is sent sent in an individual stem to each of the lads and they learn them. I’ve written them so I know how to play them. Then we go from there @vaniIlahoodie Yesssss I can’t wait !! @duhitsnialler Yes and my super team @CapitolRecords @derbyteesniall Soon actually . @horancuteboy Different acoustics suit different songs also @horancuteboy Different guitars are good for different sounds .that one is good for the rockier sounds and like jangly sounding guitar parts @solongnialler I have to sign like 10,000 of the fuckers Hahahahah . @niallsorridimii Bologna was in my top 5 shows of the whole year in 2018. Italy has always been class @stillnewangels No never met him. @nhandpotatoes I really hope so, it’s all I ever want to do @duhitsnialler 🤫 @flickersnjall Great relief. Took us a long time to get the dates together. I’m sort of in between in terms of the big arenas and the huge theatres in Europe. So finding arenas that fit my show but are not crazy huge, takes time @nhandpotatoes It’s not on this list , It’s elsewhere @zouisminds 100 % @faiystyles Cmon downnnn @NartisNi I really really really really really hope so . I’ve wanted to visit Poland for a long time @hrtbrkjules That’s not me though, that’s niall storm @hrtbrkjules Yep Hahahaha RT @CapitolRecords: Help Niall Storm make sense of the weather. Locate all 14 #HeartbreakWeather forecasts over the next 2 weeks to unlock… @NJHNEWS2 Why’s it not #1 ? Hold on to your lover ! If you don’t have a lover, a good jacket will do #HeartbreakWeatherWatch https://t.co/I9X1l4YRup https://t.co/qG4lnHnlU0 US and Asia, I’m working on more dates for you guys . Hold tight and I’ll let ya know what’s happening soon ! Niall Storm here and I need YOUR help to make sense of the weather . Locate all 14 #HeartbreakWeather forecasts over the next 2 weeks to unlock something special at https://t.co/I9X1l4YRup .  Make sure you watch to the end for instructions. Let the #HeartbreakWeatherWatch begin ! https://t.co/x0s5rwvkla @onthelipa So excited @spin1038 He is indeed RT @BBCRadio2: This sounds like a pretty dreamy Saturday morning to us, @NiallOfficial. ☺️ https://t.co/tKgQWW8WKM RT @mcd_productions: Niall Horan brings his Nice to Meet Ya tour to the 3Arena on October 30th! 🕺\n\nYou want access to the exclusive presale… @fIckerofhope well I appreciate it a lot and travel safe please @niallsorridimii Irish shows will be unreal. Never been to Poland so I’m excited about that, same with Russia @nialldivinely Let’s do it again @vane_ccx Can’t wait RT @niallerhnews: I'm seriously thinking about going to the London concert because that day it's just my birthday @NiallOfficial #NiceToMee… @sunflwerflickr 😂😂😂 RT @hotpress: Tour dates for @NiallOfficial's \"Nice To Meet Ya\" EU/UK tour have been announced! \n\nhttps://t.co/7pHuCQbMAd RT @radioleary: Radio HQ: on @BBCRadio2 Saturday Breakfast tomorrow, Niall Horan is in session with Dermot, playing tracks from his new alb… RT @Ticketmaster_NL: @lisavoets @NiallOfficial @ZiggoDome Hi, Helaas is dit nog niet bekend. Wanneer hier meer informatie over bekend is za… RT @spin1038: Win 2x tickets to see @NiallOfficial in the 3Arena this October before they even go on sale! Head to our Facebook page now 🙌… RT @BritishGQ: .@NiallOfficial has just announced 2020 UK tour dates and we cannot wait🔥💥 #NICETOMEETYATOUR https://t.co/mh2CyenQM4 RT @TicketmasterUK: #tmAnnounced @NiallOfficial has confirmed an arena tour for October/November this year! See him across the UK by snappi… RT @Niallxstormx: NIALL HOW MUCH EXCITED ARE YOU FOR THIS AMAZING TOUR??? I CAN'T WAIT TO SEE YOU https://t.co/Uf5akYCrxl @maisiehpeters Can’t wait !!! Huge fan ! RT @maisiehpeters: Can’t believe this but I’m supporting the very sick @NiallOfficial this autumn round the U.K. and Europe!!!!!! ♥️✨💓💕⚡️ M… pre-order my new album for presale access to shows in the UK and Europe. Can’t wait to see you !  https://t.co/uu0S0OIxK1 https://t.co/XGs4EkyFts Here we goooooo! #NICETOMEETYATOUR is going international babyyyyyyy! Can’t wait to see you all\n\nFor all pre-sale and general on-sale info visit https://t.co/0p2vhUmKQ6 https://t.co/rPiJKNmFZI @horansalbum @barclayscenter Cmon parents . You come aswell, we’ll have a great night . @MorningMashUp Let’s do it @barclayscenter I heard the same thing to be fair . . I’m going to it RT @hitsradiouk: We're only 58 days into 2020 but the likes of @AnneMarie, @NiallOfficial &amp; @samsmith have been WORKING! \n\nWhat's your fave… Your skin is gona be immaculate https://t.co/abYltCRCrF @hrtbreakangels The storm is coming RT @hmvtweets: Make sure to get your pre-order for the new @NiallOfficial album, #HeartbreakWeather, in quick because copies are shifting q… @Melbourne @flickerofhope13 Where we goin? RT @EMIMusicAU: @NiallOfficial @_CTierney See you at every show! ❤️ @BRITs It’s not I swear. Who’s getting tickets for the #NiceToMeetYaTour ? https://t.co/BnjqkAaInu\n📸: @_CTierney https://t.co/WRwYioO0pU Stream #nojudgement for clear skin https://t.co/RK6lYfTTMI @finelinetime Correct RT @njhhesIover: TWO MORE DAYS TILL #HeartbreakWeatherWatch ⚡️💙 @NiallOfficial RT @sergeantnemo: SEVERE HEARTBREAK WEATHER WARNING: 16 days left. #HeartbreakWeatherWatch will begin in 2 days. @fearlessxfl Go on then @glimmeryniall I haven’t even got one yet 😂😂 @niallflvr Lunch babbyyyyyyyy @niallrelate @ZenFloof Yeh I wouldn’t drink that, it’s scorching @ZenFloof 😂😂😂😂😂😂😂😂 thats the Tea people .. see how I’m using the lingo now RT @needytommo: SYDNEY EARLY ENTRY SECURED IM SEEING NIALL!!! https://t.co/bZIv56vjGh @LEEYUMSNIALL Love this . Looks great RT @nova919: 30 mins until @smallzy is giving away @NiallOfficial tickets! 😍\n\nCall 13 24 10 for your chance to win 📞\n\nListen here: https://… @BOKCenter Yes same weirdly enough !!! Tulsa let’s do this . RT @MGMGrand: It's going to be Nice To Meet Ya, @NiallOfficial, @LewisCapaldi, + @findingfletcher. 👋 👋 👋 Don't miss them #LIVEatMGM on 5/16… @EvinPriest I understand you don’t I evin. RT @SiriusXMHits1: @NiallOfficial so excited to see you in LA on March 13th!! So ready to hear some tunes off #HeartbreakWeather performed… @SiriusXMHits1 Can’t wait @LewisCapaldi I want answers @SeeingxFlicker Listening very close to a mix @dncingmoonlight Yeh I mean you have to make some big decisions for the good of the set. Some songs roll in to each other better than others and that might be a reason why one has to go. It’s not a great feeling. I also have the option to just throw in a different song every night if I want. @myidolsbravery Tired !!!!! It’s a hard set to sing @wakeupatmidday Oh really ? @hrtbreaknjh Oh she’s my main beast @hrtbreaknjh Not sure actually . 😂😂 @niallxjonas in bits and pieces for the first few days . Once we guarantee a set list, then we can run it from top to bottom.. @thelaurajayne_ It’s 9 at the moment @defnclesscherry Yes there’s some major dance breaks, as you can tell from that photo @flickerofhope13 Nope Deep concentration in tour rehearsals. Can’t wait to get on the road and see you all. It’s going to be amazing. https://t.co/BnjqkAaInu  📸: @_CTierney https://t.co/gytfIXBegS RT @MTVLAargentina: @NiallOfficial 🇦🇷🇦🇷🇦🇷🇦🇷 RT @MTVUK: we ! will ! be ! attending !\n#nicetomeetyaworldtour https://t.co/gR5fVHuVvW RT @MorningMashUp: Congrats Melysa in LA! You're meeting @NiallOfficial at our exclusive celebrity session!!\n\nMore chances to win tonight o… RT @MorningMashUp: Who is up early and ready to call in for @NiallOfficial tickets? #NiallOnHits1 https://t.co/mwEJOkz7p1 @AlexGaskarth Yes sir . RT @guidomigliozzi: Delighted to confirm I have signed with US Immigration Fund on a long term sponsorship agreement. \n\nI am so excited to… Yesssssss! Great stuff . https://t.co/wpfnHuXkI2 #nicetomeetyaworldtour @azuu_11 @loualmightyy @niallerisart I think so too 😂😂😂 @aesthxticstyles Screenshot all ya want @ItsDaniAlexis Yes Toronto !! Honestly just got goosebumps. It means more to than you’ll ever know . @imanarrystan Every day in some shape or form. Gym and then play golf the other days @blcndehair @LewisCapaldi Nah he’s actually a funny fucker @whatevverlouis @putalilloveonme No not one bit . . I actually don’t find much funny at all. You just have to make sure peoples bad jokes don’t fail, so you gotta laugh for them.. @hfkgolden Yep @loualmightyy @niallerisart If the tour sells out, I’ll do a dance in my boxers in Times Square. I promise @putalilloveonme Mostly because I laugh to make people feel better about their shite jokes , that’s the kind of guy I am. @flickerdem Yeh I’ll do that at some point later in the year @flickerevans It’s gona be unbelievable. Two albums worth of stuff @notaskintoomuch Don’t worry you’ll be dancing @niallsdimples Very close once or twice. It’s the worst feeling in the world. Up on stage, everyone staring at you and your not sure what sound is going to come out of your mouth @niallerisart Hold on I need to sell a few albums first 😂😂😂, I’m more worried about that 😂 @louwiilbefound About 25 degrees, Touch of breeze. Perfect 👌 @nhandpotatoes Ahahahah. . Black and white, dear patience, a bit of nice to meet ya, everywhere , cross your mind 😂😂😂 @flickernialls I didn’t do that on purpose . SAN Francisco is where a lot of tech firms are based @PrincessParkNJH Not really but if hollywood comes calling babyyyyyyyyy @xLorixLullabyx chill for a bit, Go to the gym in a bit, eat . @heavenlyfringe I’ll get your coat Taking it relatively easy today... had fun chatting to the Aussies on the phone last night about the announcement of my shows in Oz. Should have seen me walking around the house with my AirPods in, I looked some SAN Francisco based tech mogul. @smalltalksteve @flickerhrtbreak We should all be allowed do what ever we want. 🤣🥰👅😁🛌👍🌶🐈📸💼🏆👻🤙👁🧢🐸 RT @Niallxstormx: THE STORM IS COMING... don't forget and pre-saved this amazing album called #HeartbreakWeather by Niall horan is out marc… @flickerhrtbreak Niall not giving a shite ever and still people think he’s being serious , that’s the tweet 😂😂😂😂😂😂😂😂😂😂😂😂 @qudosbankarena Lovely people @PLinUSA Also would be great if my team were actually in the league 😂😂😂 @PLinUSA I mean if ya give me a proper heads up, I could be there. RT @fitzyandwippa: \"I'm really excited, it's going to be unbelievable I can't wait.\" Did you hear that Aussie fans? @NiallOfficial told us… @fIlckers Yes @PLinUSA If I wasn’t rehearsing for a tour, I’d be all over it Rebecca. Still love you though RT @wtvokay: @NiallOfficial Hello Niall! I already pre-saved and pre-ordered #HeartbreakWeather and bought two pieces of merch! https://t.c… @wtvokay Love that xx @loveeforniall Both to be honest . . Different feelings @flickernialls Yeh RT @NHFLOOF1: Niall has three wonderful new songs you should listen to and an album on the way\n\nStream and buy #NoJudgement\nStream and buy… @tastednh If that arena is full I’ll be buzzing @flickerofhope13 Yes a fair few RT @capsflicker: Niall 2fm has been playing #NoJudgement all week! The homeland is so proud of you! My dad loves the song too he was hummin… @capsflicker Love it RT @niallxwalls: don't stop streaming #NoJudgement by niall horan. call your local radio station and ask them to play it, let's get this so… @happilyIauren Amazing!!! Take care of yourself @sugarrrhoran Bit more fun but also had some rough moments RT @niallsheadspace: niall, see you soon baby 🤪🤪🤪 i cant wait to dance the night away with ya ❤️❤️ #NiceToMeetYaTour https://t.co/UB0BcBc8Go @yihooxflicker Amazing ! Thank you . It’s going to be fun. Tell your friends to get a ticket @nhdimple A fair few @NiallHSPN Wrote still in about 15 mins RT @RikkeS88: I’ve been streaming #NoJudgement ever since it came out and I honestly love everything about this song, the lyrics, the messa… @RikkeS88 Thank you lovely @ubiquitousnjh Lovelyyyy ! Safe trip and I’ll try make it worth the while . @niallaar We’ll have a great time @flickeryhslot I’ve been mixing this record for months. It was the only music I was listening to for that long. I’ll be just be happy to have it released @NiallHSPN March 13th @NiallToMeetYa Yeh. It’s made me cry on multiple occasions , so you guys are dooooomed hahahahaha @fIoofniall Yeh I don’t see them as “ just the special edition” type songs . They are part of my story. I wanted to keep the main album medium sized . @YeaNarry Thank you darling . @happilyIauren Yeh exactly . Can’t wait @heartbreakwthr Hope there’s gona be loads of people there @myidolsbravery About 10 minutes ago 😂 @myidolsbravery All of them to be honest . They all mean something to me.  Still maybe @niallerflickerr Indescribable . Just insane . I’ve played hundreds and hundreds of shows and I’ve never once got bored of that feeling @HoranUpdatesFR Black and white @flickerofhope13 Thank you very much and I’ll do my best to make it worth your while @paynesroses No no . @theirelad October 2018 to about February 2020 @horansalbum Cry for about 6 months and go on a holiday for 6 months after that @ubiquitousnjh I’m gona look fab up there @nhcrossyourmind Tooo excited . 16.5 @needytommo 100 percent @niallsdarIinng No. @nialloveflicker It’s been a good year for me, I think the music is good but we’ll see what the masses think. Yes I am proud @shesnewangel Yesssssssss! Pre order ? @niallaar Got it in a vintage shop in the valley in LA @haroldplz_ Always eating nuts . @bbabylouiss Don’t know hahaha @harryseingblind It’s weird . Coz you just say your feelings out loud and then pick lines from what you’ve just said and then it kinda falls together .. its not easy at all but quite relieving when it’s done @AngelicaAr106 Who said I’m not coming to Texas ?? @NewAngelAng No Hahahahahah @supportlwt I’d claim black and white @stormtoweather Insane ! Could cry . Nothing better than looking at that type of image. I promise I’ll give the best show I can @flickerofhope13 Melbourne is maaaa townnnnn! Love it @18monthmyass Still RT @qudosbankarena: We can arrange some AWESOME #Sydney Friends!!\n@NiallOfficial cant wait to have you Oct 2!!!\nTickets and info: https://t… @qudosbankarena Had some of the greatest nights of my life in your arena, Personally and professionally. Holds a very special place in my heart. I can’t wait to come back and play in October. Let’s fill this place up and have a great night. @NHFLOOF1 March 13th @mirrorsdonny @vaniIlahoodie Yeh I’m watching . u ? @shesnewangel @vaniIlahoodie Legendary people . @canyonwalls_ March 13th @vaniIlahoodie Let’s hope the Aussies like me as much as I like them @heartbreaknialI The people, how beautiful it is, how fun, carefree . Love it @nhtuned I have a song called ‘ nice to meet ya ‘ RT @EMIMusicAU: @NiallOfficial is back! The honorary Aussie brings his #NiceToMeetYaTour down under this September &amp; October. Tickets on sa… @EMIMusicAU Honorary Aussie ? really ? Fuck yeahhhhh!! Cmon @Louis_Tomlinson @BritishGQ Hoping to get a few quid for my start up. You want to donate anything to me ? RT @RodLaverArena: 🚨 Big announcement 🚨\nGlobal superstar @NiallOfficial comes to #RLA on October 3 😍 \nNice To Meet Ya, Niall - welcome to R… @RodLaverArena Played many shows at your lovely arena. Been to shows and watched a lot of tennis there, can’t wait to come back and play it myself. RT @Ticketek_AU: JUST IN 🙌 @NiallOfficial has today announced he’ll be bringing his critically acclaimed #NiceToMeetYaTour to Australia! Ti… @Ticketek_AU Cmonnnnnnnnnnn! Can’t wait delighted to share that Im bringing the Nice To Meet Ya Tour to my beloved Australia. Everyone knows how much I love Oz and I can’t wait to come back and see you guys\n\nTelstra Plus pre-sale Feb 26\nGeneral tickets on sale March 2, 2pm local\nMore info go to https://t.co/Jr9aZ0XIUO https://t.co/Xwt6R1YBm3 @FitzySA 😂😂😂😂 @fitzyandwippa @samsmith @sam_armytage @kochie_online @DancingOn10 I’m not picking up the phone to you fuckers @blcndehair Fact @7ringsforhoran And the rugby @7ringsforhoran Yep @NartisNi Correct That’s THE best boxing performance at heavyweight we’ll see for YEARS @hsIotflicker March 13th @Fiorebianchini5 My managers dad is a famous Italian photographer and he took that photo of Obama from across the room when obama visited Italy. Thought it was a great photo @_niallsmysmile Yes @derbyteesniall Yes I know already which will be fan favourites, I know you lot @LallaySouza Hahahahahah i’ll tell ya March 13#€ @armsofstrnger It’s gonna happen @aman_ntmy Ready to go @aman_ntmy Yes @sunflowerxlwt No other name . @Icarus_Niam Yes girls . Smashing it @hxranftpizza @harryseingblind No @PrfectlyFlicker Correct @bndtherules I’ll have to release a blooper reel . Madness @hrtbreakhs Nah it’s usually a stand out word in the song or a title you already had and wrote the song around the title @Tomlinbucks Yeh dancing shoes are a major part of the tour . @hbwflicker PALLOM and one other and I’ll tell ya when the album comes out @heartbreaknialI Yes from minute one . @RikkeS88 Rehearse the shit out of it until you know it inside out and don’t have to worry about anything RT @horancuteboy: london treats niall well ✨\nKEEP STREAMING #NoJudgement !!!!!!!! https://t.co/CYAi7GbvO6 @horancuteboy My team @flickersnjall Yes @defencelesslilo Black and white @vane_ccx No too old now, not able for it anymore @flickernhc First song was ‘No judgement ‘ and last was ‘Still’ @Number1NewisFan March 13th @holdmyhandniall Yes . Set list done @mydearlester Tells a story @finelinetime Small talk,  Some of ‘arms of a stranger’ , some of ‘PALLOM’ @hrtbreaknjh Yep @harryseingblind Of course not Hahahahahah . What’s this ? Court ? @souadXII Yes and yes @stillnewangels What? @shawnniam There’s a few 😂. @morganluvsniall Black and white was the best feeling I’ve ever had in a studio. Never felt anything like it. @littlelove_nh Personal @shadowsdancingg @morganluvsniall I have too  many favourites this time ... still , cross your mind, black and white etc @njhftdolans Small talk . Completely changed the melody a few times @littlelove_nh @morganluvsniall All of these were definites. Didn’t have to think at all @morganluvsniall Black and whitteeeeeeeeeeeee aaaaaaggggggghhhjhhh love that song so much @morganluvsniall Oh shit yeh.. we can talk about this stuff now RT @RollingStone: Watch Niall Horan Reveal ‘Heartbreak Weather’ Track List as a Cheeky Meteorologist https://t.co/FpFPNA3R7s @gotIoveforya People who think they can beat jetlag, make me laugh so much. There are lines of longitude and latitude there for a reason, so if you are awake or asleep , you still went through them . @perfectflicker I wish . I would have gotten over that 10 years ago I have fallen asleep at 10pm and woke up at 5am every day this week. Jetlag youuuuu crraaaaazzzzyyyy 🥴 @goldenarryy No @hesangeljp I always write @cherrrhi Why would I tell anyone that? @hesdreamy94 Absolutely not !! Ya jokin? RT @radioleary: Can’t wait for this. Thanks a million @NiallOfficial https://t.co/YxSJF4KmMi @radioleary We’re going to have a great night Dermo. Up the Irish Very excited to announce my special London Irish centre charity night with my good friend @radioleary . Love what the @LDNIrishCentre have been doing for years and I’m glad I can now be a part of it . Limited tickets available at https://t.co/1m4ul8TkRM https://t.co/RKR4Nt4UA9 RT @irishcharts: .@NiallOfficial reveals tracklist for new album Heartbreak Weather 💔☔ https://t.co/OjgqK0dDgM https://t.co/wBmQBhTLyl RT @RollingStone: Niall Horan reveals ‘Heartbreak Weather’ track list as a cheeky meteorologist. Watch the clip below https://t.co/sqFzK6JV… RT @loveagainmendes: THIS IS THE ABSOLUTE BEST WAY ANYONE HAS EVER ANNOUNCED A TRACKLIST DON’T FIGHT ME ON THIS #HeartbreakWeatherWatch SHS… RT @ForgodsakeLarry: Tbh Niall’s promo &amp; artistic world for #HeartbreakWeather with #HeartbreakWeatherWatch &amp; #NoJudgement is just brillian… RT @njhworldtour: niall storm: the only meteorologist I’ll ever trust 🤚🏼🤚🏼 #HeartbreakWeatherWatch https://t.co/82u9UEwRhr @nialloveflicker Nice? 😂😂😂 not what I was going for Heartbreak Weather out March 13th ! Let's go!! https://t.co/zPZPkVSIFk https://t.co/8O7yNpBk5a New album Heartbreak Weather is out March 13th... but #HeartbreakWeatherWatch begins February 28th so get ready. https://t.co/Rs4EE7t1nu I’ll be honest ...... not many https://t.co/UL7pIKfjc9 @matt9dawson @Blackheart4good @JustinRose99 It’s gona be a great time RT @nova100: 🎶 NO JUDGEMENT 🎶\n\n@NiallOfficial is playing NOW on #SmallzysSurgery 🙌🏼\n\nICYMI, Niall was on the show last week talking all abo… @shesnewangel Type of guitar Delighted that myself and my good friend @JustinRose99  will be back together this September for the 3rd Horan &amp; Rose charity event.\nThis year we'll be supporting and celebrating the 20th anniversary of Ric Lewis’ charity @Blackheart4good &amp; the incredible work that they do ! https://t.co/7dr0TDP5Iq @wakeupatmidday Don’t blame me 😂😂 @canyonhoran @laura_letitiaxo @needytommo I’m joking 😂😂😂😂 @thistowndani No I won’t party til I see where it charts 😆😆 @nialltour In my head yes kinda.. the concept of heartbreak weather helped me write specific styles of song as I went through the process @flickersnjall Oh a few yeh @YouKnowHoran I love this suit . My lovely friend @PaulSmithDesign made it for me and I’ve been trying to find a time to wear it for a while. @targbyers Gym, need to buy a fender Stratocaster and then work after that . @HarryAdoreZayn well if it feel like a big song , you can tell.\nOtherwise is preference and the feeling you get when you listen to it @perriesbright I wish @fIickernouis Any of them @heartbreaknialI 😂😂😂😂😂😂 @nhandpotatoes No @sunflowervol1d It was warm ice tea, horrendous 😂😂 @nialloned11 Yes apparently that show is selling well so that makes me excited . Love canada too @niaIIsfool I think I’ve smashed the set list. Just gotta go off feel, it needs to have an up and down feel throughout. @thistowndani Hope it’s good coz I’m gona be outdoors @lizzbianlou @needytommo I’ll tell ya all of this March 13th @laura_letitiaxo @needytommo Spring / summer evening about 8pm @katcafe7 Today I’ll do 22.5 mins on the bike and then 22.5 mins on the crosstrainer @JuliaR_AA fuck yeahhhhhhh @helloxpetal @niallsdimples Just cardio today darling @ohgodmylarents One of the best I’ve written I think @needytommo Yes there are a few variables in play. How many songs are the best ‘songs’ . Then from there I would go off production / best mixed.. also if you live for a year with songs you listen to every day , you have a fair idea of what are your favourites @fearlessx1d Yes @callmebabyagain Love the number 8 for some reason. @hawyeehoran Yeh I found a couple @restaquiniall @sadandsex Yes 🙄 @hawyeehoran Nervous. Need to get rid of some tickets and would love the album to do well @niallsdarIinng I think so yeahhh @niallsdimples Yeh I’m gona go now @HessasAngels @imanarrystan @heartbreaknialI Coz I just go on instinct and I can’t see it happening . @sadandsex I was working yesterday and smashed it @lonelycth @heartbreaknialI if it gets a few more streams it might @imanarrystan @heartbreaknialI I’m the most positive person in the world. @heartbreaknialI Probably not 😂😂 @hrtbreakbarbara Amazing feeling. Was so happy when Clara opened the envelope and it said his name. He deserved it and I’m glad I could be a part of that @hrtbreakbarbara I didn’t do it ahahah . Someone else did it 😂😂😂 @niallaar All of em . You’re welcome in advance 😂 There's a storm coming ... https://t.co/Lwy03BAupN @flickerofhope13 Does it look like it ? Hahahahahaha RT @BBCR1: “You never know what someone is going through. Kindness sounds simple but I think it’s key.” https://t.co/0EfCM6KcVk @niallsrevivalx You name it @nhwalls All of that @7ringsforhoran Jetlag @CherryStyles11 Love it @tattooednumber She got style @_goldenhes I will @ladstatted #NoJudgement @myidolsbravery Hunky horan I’m a baller 😎 #NoJudgement https://t.co/XL7GNgcqrP @nialldivinely Flicker @NiallToMeetYa Me too @fall1ngs Hi @acousticliffrd The other two are underrated . End of @flickerofhope13 You should get a ticket and come watch @navyhoran Yep @paynesroses Yeh @finelineish Shitting it @niallaar Hold on , why ya saying that to me ? Hahahaha I love them, there’s only so much I can do 😂 @seeingniall_ You’re asking the wrong man 😂😂 @patiencenialler Yeh I agree. I’ve just heard it . Great tune @njhftdolans Just heard it for the first time. Banger . Get on it . @iHeartRadio I assume you’re still in there, it’s only been two hours @hrtbrkwther Yeh we are RT @1DOnChart: “No Judgement” enters this week’s Top 40 at #39 on pop radio. The Niall Horan single received 861 tracking period spins, bes… @tbywildflwr #Nojudgement and #NoJudgement only @stilesaetre You’d be bored if I told ya ahahah #NoJudgement  let’s gooooo RT @headlineplanet: .@samsmith's To Die For + @NiallOfficial's No Judgement + @Meghan_Trainor &amp; @NICKIMINAJ's Nice To Meet Ya officially en… @heartbreaknialI Squats babyyyyyy . Deadlifts honey RT @Smallzy: SO. MUCH. NEW. MUSIC.\n\n💅🏼 @samsmith \n💃🏻 @Camila_Cabello \n🎸 @5SOS \n😍 @NiallOfficial \n\nListen here: https://t.co/Lnlo2pKbXb http… @heartbreaknialI Yeasss @brooklyntide fire away, on my own, few off the new one @bostonniaII Yeh a few actually @souadXII adlibs ? Probably RT @BBCNews: \"I'm going to talk about her and give her the respect that she deserves and that she didn't always get\"\n\nLaura Whitmore pays a… @BBCNews Love you @thewhitmore ! ♥️ hahaha when I think of the cackle, you knew Caroline was a in a room before you even walked in. @BigTop40 @itswillmanning We don’t judge anymore #NoJudgement RT @itswillmanning: Always a pleasure twin 🤪 @NiallOfficial https://t.co/4jyh7ljBWs RT @stingraymusic: Have you listened to #NiallHoran's new single, \"No Judgement\" yet?!\n\n⬇️ Listen to the artist's playlist on #StingrayMusi… RT @UniversalSpain: #NoJudgement es el nuevo single de @NiallOfficial https://t.co/Ly118ybsco Ya puedes reservar su nuevo álbum \"Heartbreak… RT @BigTop40: Not long to go before the UK's biggest chart show and these *huge* guests are joining @itswillmanning this week...\n\n🌩 @NiallO… RT @Challenge_Tour: That. Winning. Moment. \n\n@BezChristiaan #DDProAm https://t.co/YvjNGriGeD @Challenge_Tour @BezChristiaan That’s my man @BezChristiaan @modestgolf @pinocchioboy2 You’re really cool That’s our actual friend, a person. Because she is talented and famous she automatically gets treated differently by society and in turn the tabloids and social media. The outcome is society’s fault . Tabloids will never hold themselves accountable in any shape or form for any death. I feel very sad for those who write these terrible articles simply for clickbait and a wage at the end of the year. Caroline 💔 @paynodobrikvlog Oh shit yeh, forgot . I’ve got a new song out called “ no judgement” go listen Who's comin to the #NiceToMeetYaTour?? Get your tickets now ! https://t.co/QD3toXaepy https://t.co/8EkZYos7Qa RT @navyhoran: I’ve been streaming your new song since the minute it came out and and I just can’t get enough of it. Thank you for sharing… @icednialltea Yeh I can’t wait for that show. That arena is insane RT @myidolsbravery: Niall i’ve spotted the best single cover in London, do ya know who the artist is? #NoJudgement https://t.co/Q7zmzf9q9O RT @niallandjonas: NIALL can’t wait to party with you in brooklyn!!! i’ll be in the front row #NoJudgement https://t.co/Sx9soRjDn9 @evrywherenjh Not much to be honest @awisniallx @hxranftpizza Let’s do it @niallertpwk Me either 😂 @killmytomlinson I hope so @SeeingxFlicker No didn’t know it was out , back In a minute @hxranftpizza Let’s gooooooo RT @sottours: @NiallOfficial hey niall i’m streaming #NoJudgement! also i hate my voice lmao https://t.co/rROrCDH6HZ RT @Pressparty: Congrats to @NiallOfficial, whose #NoJudgement video has nearly reached 3 MILLION YouTube views in only a week! https://t.c… RT @heartbreakwthr: @NiallOfficial Look what they were playing on one of the major radio stations in the Netherlands!!!!! Let’s get #NoJudg… #NoJudgement If you haven’t got a tour ticket yet, Make sure you go get them. There isn’t long left and I can’t tell ya how excited I am for these shows. #NiceToMeetYaWorldTour @nhandpotatoes Hope so RT @lameleyy: nashville isn’t ready for us 😎\ncant wait to jam to #NoJudgement with ya niall!!! https://t.co/y5p565FTbr @niallxjonas Let’s have it babe @shesfireaway I’m designing the stage Hhahah @niallsoftness @njhworldtour Actually was Hahahah @otbsuns Yessssss RT @waIIflowerhes: can’t wait to see you from 3rd row in toronto Niall!!! #NoJudgement https://t.co/OcofUIB6pp @njhworldtour I did them only 2 weeks before the song came out . I just had them in my head, went to studio to record them and then they ended up on it @stilesaetre Yep RT @DlVlNELOU: can’t wait to scream the lyrics of #NoJudgement with you in Brooklyn Niall https://t.co/wYpG7pssL3 RT @finiallyaway: Niall I can’t stop listening to this song #NoJudgement https://t.co/0AqSSqMtry RT @tattooednumber: can’t wait to jam out to #NoJudgement in glendale with you niall ! gonna be a blast https://t.co/iLoZnKwE2N @harryscriss Amazing !! Love this. Let’s go for the next chapter RT @morganluvsniall: Niall are you ready for Columbus?? #NoJudgement https://t.co/C2JCio0yM3 @morganluvsniall So ready RT @ohhoneylwt: niall this is my forever dancing jam. i love it so much. #NoJudgement https://t.co/uPvIpdwaYO Love it https://t.co/gFAPTNj1sp @cosmicstyless 😂😂😂 RT @NHFLOOF1: Niall !!! #Nojudgement was added to \n💥Singled out\n💥today's top hits\n💥Chilled Hits\n💥mood booster\n💥daily lift\n💥Pop rising\n💥Pop… @favejonah That’s what I like to hear . Be free love @Niamsxx I haven’t heard it yet Hahahah RT @needytommo: streaming #NoJudgement at full volume and pissing the neighbours off are ya proud niall? @NiallOfficial https://t.co/dAZH5b… @needytommo Yeh babyyyyyy RT @pluginiall_: we are here listening to #NoJudgement and waiting for niall to notice us https://t.co/vDjzLFyed2 RT @nhandpotatoes: Niall #NoJudgement is a blissful song❤️ Thankyou for sharing it with us!\nSteaming on repeat!! https://t.co/tPCT3pCLtY @nhstreamteam Let’s go teammmmmmm!! @endswithnjh Wana keep it all a suprise @perriesbright To have a number one album and a sold out tour. Big asks but I’m gona try @bradleyflicker 3 @micaxlf Yes girrrllll RT @blondieee_98: Niall these pics are old but I was so proud of you after releasing #NiceToMeetYa that I had to take a picture in front of… @heartbrkflicker So exciting !! Love ittttt @jadorelaniall Too many @niall_pallom No Hahahahah @irishbabenjh Means a lot darling ! @finaIIysafe Hiiii . Please come see me RT @spideysniaII: niall I cant wait to see you at the forum! it’s my first time seeing you on floor !!! 👆🏼 https://t.co/TCPeMm9HoI @njhwildflower Yes bud . See ya in Brooklyn @brooklyntide Of course!! Love this stuff @nialltrench There’s quite a few to be honest. Hahaha @heartbreakhabit Yeh it goes in order @nialldivinely I’ll figure than part out soon @heartbreaknialI Can’t wait for Tulsa @heartbreakhabit Tell them I love them @NIALLCIDlO No I’m happy with everything on it . @helloxpetal I can’t tell ya that @sugarrrhoran Both equally personal . @interiiorworld @heartbreaknialI Can’t wait to get up there every night. It’s the best feeling in the world. @finelinetime Yep @fluffysoftlouis Sydney @svociety I have quite a few to be honest @heartbreaknialI Yes of course.. some are not easy to write @finelinemoonx Outside . @Perfect_Habit Cry my eyes out RT @MikeAdamOnAir: \"Put A Little Love On Me\" by #NiallHoran has now sold over 100,000 units in the US! Congats @NiallOfficial!!! https://t.… @holdmyhandniall Probably . He’ll probably get me to be in a comedy with him @hrtbreakbarbara I’ll have quite a few this tour . There will be 4 or 5 different acoustics in different tunings. Again 4 electrics maybe. Loads of shit going on. @nialldivinely Very very excited @hrtbreaknjh Yeh it’s not part of the album, it’s just a little suprise @nhoranshope @jdorelamer I just know. . It’s a feeling . I’m the one that has to release them, sing them every night on tour, they are the songs I’ll be known for. I need to make those decisions ya know? Currently mixing something really cool for you guys..you’ll find out what it is soon. X @bqtterbeer Mel’s diner after a New Year’s Eve party, drunk RT @njhwildflower: niall i cannot wait time hear no judgement live in dc, brooklyn, and philly!! https://t.co/1dQqWn6gzV @bostonniaII How could I forget about one of my favourites I’ve ever written @hrtbrkwthrnjh The morning of my sinus surgery @souadXII Probably 😂 @brooklyntide @ItsDaniAlexis One of the acoustics that i was using on the flicker tour @finelinenjh Oh shittttttt! I’m excited @babypinkniaIl Just what are my favourites RT @niallth: NIALL!!!!! guess what im listening to the moment i wake up!!!!! #NoJudgement https://t.co/gPViqfiIrJ @ItsDaniAlexis Not long . I knew exactly what I wanted to say @NIALLCIDlO Just ramble like this . Select chords I like @niallsoftness 100,000,000 and it’s a deal @itsfIicker Heartbreak weather coz I was just having soo much fun and didn’t want to stop writing songs . If you come to my concert this year , you’ll see how much I love these songs Ryan Reynolds just followed me, @LewisCapaldi who? Here we gooooo !! https://t.co/70yMGY1sa4 RT @Tomlinbucks: GUYS LOOK AT WHAT I FOUND WALKING AROUND IN LONDON 🥺@NiallOfficial #nojudgement https://t.co/dmEkKpLM4r listen to 'No Judgement' on Today's Top Hits . \nThanks @Spotify ! https://t.co/Taat7UAGbQ https://t.co/lDURve9Cm4 RT @deodevine: @NiallOfficial #nojudgement https://t.co/RfQJt1MGC9 @deodevine Irish lad outside a hospital with a dislocated shoulder, smoking a cigarette in a GAA jersey . I’ve seen it all now Goodnight my lovely people! Talk tomorrow and remember #nojudgement is out, go and do your thing. Xxx RT @hrtbreakbarbara: GOODNIGHT TO THIS PICTURE AND THIS PICTURE ONLY! And Niall and Niall nation of course 😌 Don’t forget to keep streaming… RT @UniMusicIreland: Living for the new Niall Horan video 😎 \n\nNo Judgement - https://t.co/qcmFM9sMyI https://t.co/edPPLobL6V RT @Smallzy: .@NiallOfficial has a message for all his Aussie fans out there 💕\n\n#SmallzysSurgery https://t.co/WiVsxlO9hH @hopelesslover41 Wohooooooooo let’s gooo @sugarrrhoran Hopefully . @nhtuned Was just catching up with friends on a day off . . Been super busy recently . #NoJudgement Miss you guys https://t.co/Tq3EMWayNZ @shreeester #NoJudgement Had a few too many but #nojudgement https://t.co/NYOO1nZp7L RT @scott_mills: Here’s our chat with @NiallOfficial today @BBCR1 https://t.co/o6JWjjBRIE @niallschalamet Lovely to meet you, thanks for being nice . RT @ash_london: #nojudgement https://t.co/4oePpM68wP @ot5zouis We are definitely on a par when it comes to looks aswell . @MusicEmma25 Let’s have ittttttt @becauseoflwt #NoJudgement @sadandsex #Nojudgement around here RT @RareFIicker: Niall I’ll be seeing you in Toronto! #NiceToMeetYa https://t.co/mJTn8nTGzc @nialljhntmy @niallernroses Like a week . . @niallernroses My stye really inspired me @flickeringhoran @derbyteesniall Wrote some of the best songs of my life in the Bahamas @hslotemma @derbyteesniall Yeh some cream I was given to put under my eyelid ahahahah . Was rotten RT @YeaNarry: @NiallOfficial Drunk selfies 🥴 #NoJudgement https://t.co/hrPGZRDQX2 RT @flickernialls: @NiallOfficial hello these are some of my embarrassing moments but #NoJudgement so i am good !! https://t.co/8hVw8kZR93 @derbyteesniall Still had a great time but they are the most awkward things in the world Wrote a few tunes in the Bahamas , got a stye. #NOJUDGEMENT https://t.co/0ItiPTF5vj @fuckyeahhniall #NoJudgement @NarrysMedicine_ next post . You eating a shoe , no judgement though RT @NarrysMedicine_: @NiallOfficial Going all out here, if niall’s sees this I will eat my shoe HAHA #NoJudgement @NiallOfficial https://t.… Well I’ve posted an embarrassing photo, your turn. This is a judgement free zone! #nojudgement My finest hour #NoJudgement https://t.co/yoRM0Thn6p @AllyLuvsNialler Coz it is and I like it . RT @hipsdontlienjh: Yyyaaaayyyy can’t wait to see you in Tulsa, niall! And now a physical copy of Heartbreak Weather too😍😍😍 https://t.co/El… I’d love to go for a pint with Brad Pitt 🍺 @sincewerealone Well I only live about 15 mins from the Dolby theatre, I can be there real fast if they give me a hint Surely my performance in #NoJudgement video gets an Oscar tonight ? @svradavis @caroIinanjh #NoJudgement @frmthstars I just made it up as I sang Hahahaha as ya can tell by the end of the video RT @niallaar: Niall, I’ve been streaming non-stop!! Let’s gooooo ! 🔥 #NoJudgement https://t.co/GgCZ0Vs1DK Go ask Alexa to play the ‘song of the day' and listen to to #NoJudgement ! @amazonmusic https://t.co/I6QDg8Popu RT @RTE2fm: WHOPPER!!!! 🔥🔥🔥\n\nOn our A list already @NiallOfficial 🇮🇪 @RTE2fm My people ❤️❤️ @ash_london 🤣🤣 hope you’re alright darlllll @ash_london 🤣🤣🤣🤣🤣🤣🤣 #NoJudgement let’s see it trend WW @PrincessParkNJH @hrtbreakbarbara Depends. NTMY and NJ were me @hrtbreakbarbara No I’m never gona sing one of my biggest songs ever again 😘 RT @hitsradiouk: .@NiallOfficial's just announced his second album #HeartbreakWeather is out on March 13th 🙌\n\nHis latest track #NoJudgement… @niall_pallom Yeh same 😭😭 ....... 😁 @onmyownniaIl I like both obviously, upto you @tmhbeckie Let’s hope so RT @fIickernouis: #NoJudgement has been stuck in my head since Thursday night and I’m not complaining.... Niall really did THAT https://t.c… @ohgodmylarents Hahahaha yeh good one. I’ve written some serious shite in my time @niallerisart I wasn’t saying ‘whole’ @niallerisart If it was the right thing then yeh but it’s longgggg , there’s a lot of waiting around ahahha RT @PrfectlyFlicker: GOOD MORNING PEOPLE. DON'T FORGET TO STREAM #NoJudgement THE BEST SONG THAT NIALL MADE SO FAR. I LOVE THE RIFF OMG A B… @ntmyimbronsgem Thanks petal. I do enjoy the ole acting thing @flickersmartina WellI knew exactly what I wanted it to look like, So I just drew it out @derbyteesniall Yeh exactly . RT @niallth: don't forget to stream no judgement by niall horan and while you're at it but tickets on his NA ntmy tour to see him live!!!!!… @aesthxticstyles About 50 odd.. whittled it to 19 and then had to make some decisions based off productions and mixes I preferred @niallerisart Yeh always Just been to see @chrisdelia !! He is different level of funny. My face is sore from laughing @shesfireaway One of the first lyrics I had . that was basically the concept originally and built the song around that @ot5zouis 🤣🤣🤣🤣 @muIIingarking 🤣🤣🤣🤣🤣🤣 go on girls @theflickerablum I’ll talk to ya about all of this in about 5 weeks hahaha @heartbrkflicker It’s insane . Biggest reaction I’ve had to a song in a lonnnnggggg time . @niallsheadspace Bit of both to be honest. It helped me right specific songs @njhsbuddie Portugallllllll @ohnoflicker 😜 RT @imanarrystan: good morning to niall horan and #NoJudgement only https://t.co/L13s2WUKFL @heartbreakwthr 😂😂😂😂😂 RT @lonelycth: No Judgement has literally been on repeat since it it came out 🥰 it is so good and I CANT wait to hear it live! 🥳❤️😍 stream… @nhsoftsoul Yeh you are soooo correct RT @niallaar: I can’t stop listening to no judgement. the song is so catchy and I can listen to it ALL DAYYYY. niall what have you done to… @ntmyanialler Yes they do understand . There’s a whole process. Finding dates, if venues are free on those dates, talking to each promoter in each country. It’s a lot more complicated than it looks. RT @CrystaRose_: @Z100NewYork Erica, can you hook us up with some #NoJudgement by @NiallOfficial ??? \n\nAbsolutely LOVING his new music - #H… @njhftdolans Not as of yet no @nhtuned Never . It’s coz I type so fast that and then I don’t even look to check RT @MostRequestLive: FIRST SPIN #NIALLERS! Thanks for all the requests! #NowPlaying @NiallOfficial \"No Judgement\" on #MostRequestedLive - T… RT @Wild949: Alexa, play #NoJudgement by @NiallOfficial https://t.co/bEGVVv17Vq RT @Deezer: Brand new music from @NiallOfficial aaand he's announced his second album #HeartbreakWeather, coming March 13th too! 😍🙌  \nHear… No Judgement is on Pop Rising ! Thanks @spotify \nhttps://t.co/Pu1JEMQ7h2 https://t.co/8v41DCCIMJ Thank you very much.. appreciat it https://t.co/td9r9YbC4x So many people have said this 😁😁😁😁😁 https://t.co/dzxRSWSo1V @mutualniaII @pinkshirtnjh It’s complicated ahahahah @niallerar Just wanted something to reflect HW in logo form RT @sebstianjh: @NiallOfficial today was promo day in Argentina with @nialldivinely @niallsoftness ! https://t.co/qoQ89g85Rh RT @horancuteboy: two days of promoting #NoJudgement around London❤️ \n@NiallOfficial love you and hope it goes up the charts !! https://t.c… @niaIIsdarling It’s an amazing feeling . Let’s hope it’s a song that really grows @niallflicker_ @pinkshirtnjh When they come out I’ll dig in deep but I don’t want to give too much away right now. 😁 @bostonniaII It’s a mix @mylifeisirish @findingfletcher @LewisCapaldi They are my friends and we’re just going to have a great time .. @nialloveflicker Golf @pinkshirtnjh Yeh I have a few new ones for this tour . A fender strat and a new 12 string acoustic guitar RT @niallvinyIs: niall im absolutely in love with #NoJudgement let's get you to number 1 🔥🔥🔥🔥 https://t.co/AmZp84YsIT RT @nialldivinely: niall this happens when i hear #NoJudgement!\nit's promo day in Buenos Aires! 🇦🇷\nlove ya!\n\n@NiallOfficial https://t.co/wB… @nialldivinely Yeahhhhhhhhhhh @niallerisart It is indeed RT @_niallsmysmile: Hey Niall, we made promo in Rome for #NoJudgment!! \nHad the funniest time with my girls 💗 @NiallOfficial https://t.co/y… @niaIIftansel Ok I’ll look into it for ya RT @heartbreakhabit: niall, #NoJudgement has been on repeat from the moment it came out !! love this song and love you! https://t.co/WmHW2e… RT @heartbreakhabit: STOP what you’re doing and go stream no judgement by niall horan! https://t.co/Ayw6UI4TCO @TomlinsonBack1D Oh we’re in it @imanarrystan Yeh for instance I didn’t have the bridge “one minute your there ...... “ for a few months after I initially wrote it . @hrtbreaknjh Yeh ya caught me, Scorsese is looking for me RT @GorgeouslyHarry: Stream #NoJudgement by Niall Horan \n\nStream #NoJudgement by Niall Horan \n\nStream #NoJudgement by Niall Horan \n\nStream… @sugarrrhoran “ even though we don’t talk for a couple of months, it’s like we didn’t lose any time. I can be your lover or your shoulder to cry on, you can be whoever you like “ RT @niall_capaldi: Although English isn't our language, we continue singing with niall  🇲🇽@NiallOfficial \nhttps://t.co/OxztuCcHQD RT @njhsbuddie: sir @NiallOfficial my grandpa loved #NoJudegment so much !! 🤍 https://t.co/dfwROB9Feq @njhsbuddie 😂😂😂😂 legend @svftness Loads of em RT @PrfectlyFlicker: STREAM #NoJudegment LET'S GET NUMBER 1 AND GET UP IN THE CHARTS NIALL X @NiallOfficial ❤️🤟 https://t.co/euXqPclLit @mylifeisirish Yeh still writing, always do to be honest . Im definitely always writing ideas down/ concepts and titles etc . @niallerflickerr These songs are gona be so fun live @niallerflickerr You’ve no idea how excited I am for it, whether I deserve it or not 😂😂😂😂 @fiorebianchini4 No . That’s what a white suit jacket looks like when you wear it for 12 hours on a music video set RT @LIVEatMGM: NEW SONG ALERT! 🎧 Listen to @NiallOfficial's new jam #NoJudgement and don't miss him #LIVEatMGM on 5/16. https://t.co/rOFJhN… @LIVEatMGM Ya can’t miss it RT @TOOTIMELOU: niall it's been on repeat https://t.co/TziwE8XfHl @Perfect_Habit Let’s go to numero uno @Kiss108 I like it sunny ! You ? RT @Vevo: We hope everyone can grow old like these two! Watch a beautiful romance on @NiallOfficial's new music video for \"No Judgement\" 😍… Hot Singles ! Thanks Amazon Music for putting me on the cover. Go on and give #NoJudgement a listen there\nhttps://t.co/r13N3OZUsn https://t.co/k22cHuupkO @rosejenhes 😂😂 @rosejenhes Am I? RT @Z100NewYork: #NiallHoran Announces Second Album, Drops New Song 'No Judgement' 😍\nhttps://t.co/B2Mr0DVtvk https://t.co/fS4slJeLEb #NewMusicFriday ! Thank you @Spotify \nhttps://t.co/RW7hCU5nDH https://t.co/uCYDVhNat2 RT @flickernialls: niall how has the release day been ?? we went to do a round of promo in london ! #NoJudgement https://t.co/rYxVYP8Lhu RT @AppleMusic: “When you’re with me #NoJudgement.” ❤️\nListen to the latest from @NiallOfficial on #NewMusicDaily now.\nhttps://t.co/OmvaaDa… RT @1DOnChart: iTunes US\n12. Niall Horan - No Judgement +4\n\nBuy/Stream: https://t.co/0I6vwrru2x @niallsoftness Cheers thanks . don’t feel tired at all 😂 Heartbreak Weather merch is up now ! Grab some as it comes with the album 🔥 https://t.co/V6Pcy3hz7H https://t.co/jnCIMNeqby RT @pandoramusic: This track might be called \"No Judgement,\" but if we were a judge we'd give it a 10! 💥Spin \"No Judgement\" by @NiallOffici… Thanks for the cover of Just Good Music @Spotify ! \nhttps://t.co/RjgbLH476t https://t.co/0ZdWH1Jo1W @poeticnialll @flickerbops @nialltrench There’s a few sad ones dressed up as happy ones ahahaha @flickernialler In the middle somewhere @reachthestarnjh From start to finish to follow the storyline a little RT @people: Niall Horan Announces New Album Heartbreak Weather, Releases New Song 'No Judgement' https://t.co/uREFei02uC @shawnrueIs There’s not @nialltrench I actually can’t even pick one , I’m serious RT @stingraymusic: #NiallHoran's new single ‘No Judgement ‘ is out, and we couldn't be happier!!! 🤩\nListen to it now! Check out the music c… RT @idolator: No sophomore slump in sight. Based on the quality of \"Nice To Meet Ya,\" \"Put A Little Love On Me\" and now \"No Judgment,\" @Nia… @mirrorsdonny @nialltrench I want to be different than everything else on the radio @KevinGolab @niallsorridimii @seasidetucker I’m talking about 4 year olds. The time when you don’t have a care in the world @helloitsamerica @niallsorridimii @seasidetucker I knew it was gona be the title from the very first day I started writing concepts for the album @niallsmilingx @ItsDaniAlexis @seasidetucker Oh so many Hahahah @thatblkgrl We went looking and these guys stood out by a mile . They were soooooo fun all day @NIALLCIDlO @seasidetucker 1 is gona be huge on tour. 14 ........ oh so many . Can’t wait @hrtbrkwethrr I just write , I don’t care anymore about genres and stuff . Just write and then see what production I feel fits each one , afterward @niallsorridimii @seasidetucker When I think of the words ‘ no judgement ‘, I tend to think of either little kids who never judge each other or old married couples who have spent soo much time together over the years and nothing bothers them anymore about each other . @flickernialls I love the painting scene . Cracks me up. And the wee one 😂 @capsflicker Not that hard @nialltrench I’m honesty obsessed with every single song on the album . @hrtbreaknjh Public service announcement , I had to stand on the chair for it @flickersnjall This was just a random shot from a really set up photo shoot . I was just looking down the road and dean caught it RT @paperhouses: i didn’t know what to expect when niall said that he didn’t fit into any specific genre with the album but after listening… @paperhouses Yes babyyyy @finelinezaddy No but my arse looks class @niallaar Yup @letmetreatya Anything visual you see from me this year, I’ve been all over it @niallhenergy Yeh I mean they are not shot yet but there will be more @seasidetucker Oh Jesus I don’t know hahaha I’ve loads. I love all the singles I’ve released. Slow hands still is big for me, nice to meet ya(underrated i would say), this town and this bad boy ‘NJ’ @harryseingblind I’m absolutely delighted. I think this song is great and I really hope it connects @sugarrrhoran I’m sure I will be @finelinetime Yes he’s a great guy and LOVES music more than most @emilyscott194 I’d be forever trying to explain this video Hahahaha RT @LiveNationNYC: .@NiallOfficial's new song #NoJudgement is out now! Listen here: https://t.co/VRUKVwVt0V \n\nDon't miss his #NiceToMeetYa… RT @amazonmusic: Roll the windows down and turn the volume all the way up to listen to @NiallOfficial's new song. We won't judge you. \n\nStr… RT @UMG: 𝙉𝙤 𝙅𝙪𝙙𝙜𝙚𝙢𝙚𝙣𝙩 if you can’t stop streaming @NiallOfficial's new track either. 😎\n\nPre-order his sophomore album, ‘Heartbreak Weather’… RT @barclayscenter: Top Track - No Judgement - @NiallOfficial 🎶\n\nHear it live in BK on April 29!🤩🥳\n\nhttps://t.co/a9mnCdsKRQ RT @AppleMusic: Keep calm, new @NiallOfficial is here. 😍\nPre-add #HeartbreakWeather and listen to #NoJudgement now.\nhttps://t.co/vw1s2xhmqP… RT @Shazam: #NoJudgement by @NiallOfficial is here!!! Stream our Song of the Day on @AppleMusic ---&gt; https://t.co/xYLRbeT1c7 🙌 https://t.co… RT @thebbtcenter: This #NoJudgement video was great and all…\n\nBut we are totally judging if you haven’t grabbed your tickets to see @NiallO… Great to see my friend @zanelowe after so many years. Catch our chat live on @AppleMusic @Beats1 in 30 minutes ! \nhttps://t.co/HArgu4gfxs This song is one of my favourites I’ve written. Loved writing this song as I knew exactly what I wanted to say. Now go and dance like no one is watching. #NoJudgement\nhttps://t.co/UpcAwyF0vU https://t.co/5GGRdErCMC RT @ubiquitousnjh: good morning to niall horan heartbreak weather and no judgement only https://t.co/nNj4v1QyKm RT @deodevine: Im not a big fan of Marmalade, but this is a Jam! Well done bud @NiallOfficial #NoJudgement #niallhoran #HappyFriday https:/… RT @HEARTMEETSLOUIS: @NiallOfficial How do you feel knowing that your new song #NoJudgement  is trending right now https://t.co/KZ0lDFJMvS @Katie_May07 This is what I love to hear. Xxxx RT @irishcharts: The new single from @NiallOfficial is out today, and he's announced his new album! https://t.co/OjgqK0dDgM RT @RollingStone: Niall Horan previews his new album 'Heartbreak Weather' with single \"No Judgement\" https://t.co/bXG5BZp5f3 https://t.co/p… RT @iHeartRadioCA: Me sitting all my friends down to tell them how great @NiallOfficial's new song #NoJudgement is! 👏😂🙌 https://t.co/1KKhho… RT @Spotify: .@NiallOfficial just keeps on blessing us. Hit play on #NoJudgement now.\nhttps://t.co/J7xPFvL2ok https://t.co/w4VSLFUgVh @reiluvsthelads This video looks like the inside of my brain hahaha @reiluvsthelads Yes darling . I’ll explain the video at some point and then everyone will get it Ahahahahah RT @Popprince: #NoJudgement You need to watch the new ⁦@NiallOfficial⁩ video.. Brilliant new song &amp; message 🙌 New album #HeartbreakWeather… @Popprince Thanks Kev @heartbreakhabit No . Just like the hoody RT @wtrmelonkiwi: NIALL THIS SONG IS SUCH A BOP AND THE MUSIC VIDEO IS SO ADORABLE \n\nI LOVE YOU AND I’M SO PROUD 😍😭\n\n#NoJudgement https://t… @shesfireaway I wrote it with @drewkirsch. I’d wanted to do this idea for a long time @morganluvsniall Hahaha nothing ! They are literally the engineering writings that were just there. some news I KNOW you lovely people will want to hear. My second album is called ‘Heartbreak weather’ and is out March 13th. https://t.co/zPZPkVSIFk https://t.co/XSH9JTBylP What do ya think of the song ? #NoJudgement 45 mins people ! #NoJudgement RT @997now: We can’t wait to have @BigReidRadio premiere it!!! 😎🔥 #NoJudgement RT @goodygrace: @NiallOfficial let’s gooooo RT @1027KIISFM: .@NiallOfficial is dropping his new song #NoJudgement tonight and to celebrate, he’s calling in to chat with @JoJoWright at… @1027KIISFM @JoJoWright Yes I am @babypinkniaIl Yeh I really want this to be WELL received @nhtuned The vibe of it in general I’m soooooooo excited for you to hear this song!! 2 hours to go ❤️❤️❤️❤️❤️❤️❤️❤️❤️ RT @PopCrush: .@NiallOfficial's \"This Town\" has surpassed 400 million streams on @Spotify. https://t.co/Da2q6ZoAuF RT @adidasftIwt: I’m so excited to party in Chicago!!! I can not wait! Make sure to stream #NoJudgment and to go get your tickets to see Ni… RT @universalmusg: Who's counting down the time till #NoJudgement? @NiallOfficial https://t.co/KfCDBYZy8r @romcomhes Call me Mr.Worldwide petal . 😁😁😁 @PrincessParkNJH Generally people judging eachother and then also tied in with a personal story @svradavis Wrote no judgement in October or November of 2018. Wrote the riff in July or August 2018 @RikkeS88 No Easter eggs this time Hahahaha RT @nhdimple: @NiallOfficial Already pre-saved it on spotify!! I'm so so excited ✨ @putalittleIove The most fun so far. @ntmylive No @80SFLICKER I will not stand down on the serving 😂 RT @iHeartRadio: Can't contain my excitement over the fact that we're finally getting new music from @NiallOfficial this FRIDAY 🙌 #NoJudgem… It’s a big day for me https://t.co/Z4WUrSyTOE Not long to go before no judgement is yours ! Out tomorrow at midnight EST . https://t.co/7WJIERRVO2 Let’s get Tommo right up the charts. This album is quality and deserves to be up there. @Louis_Tomlinson #Walls https://t.co/oUnG2cTdlh You can be whoever you like @Navarro_Cheer love this show! Congrats to you all. Hard work wins @nhtuned It’s not a music video Had an unbelievable day shooting something very fun. Cant wait for ya to see it 😂😂 @CapitolRecords I’ll take that , I wrote it 😂😂😂😂😂 cheers RT @ElvisDuranShow: #NiallHoran Teases New Song 'No Judgement,' Arriving February 7!🤩\nhttps://t.co/bECUZowC3R https://t.co/JYMGUp6oJQ RT @billboard: There's new Niall Horan on the way! #NoJudgement https://t.co/HiF1dPS3Ro @jdorelamer Love you too ! Enjoy @benwinston No worries petal @1027KIISFM I’m not ready !! It’s a banger 😂😂😂😂 You can just be yourself RT @CapitolRecords: @NiallOfficial @_CTierney https://t.co/NtMZqOcnL1 RT @iHeartRadio: Mood. Always.\n\n@NiallOfficial https://t.co/RIn1h7PBvb RT @KISS107: For those wondering; yes. \n\n#NoJudgement from @NiallOfficial is 🔥🔥🔥🔥🔥 https://t.co/i59Meeyki7 RT @nialltour: @NiallOfficial SEE YOU AT THE CHICAGO SHOW!!! like you said i can’t wait to have the best night of our lives @feedmesheeran @mylifeisirish No Wooooop https://t.co/L4DBj32CT2 @caroIinanjh That’s my girl. See ya there @flickerbarbara_ Yes @hsIotflicker @mylifeisirish See ya there @njhftdolans Of course . @mylifeisirish This years tour is gona be the best show I’ve put on and we’re all going to have the night out of lives, every night . I’m gona make sure of it . Tell all your friends . Get ya tickets @gngflicker No you haven’t seen it . I’ve spent ages on it hahahahaha @loutallinson Yeh I hope so @niallandjonas Yes I am @louisttdelrey No @endswithnjh yes and then he’ll dance with you like crazy @gldnhournjh Happy / thoughtful @nhespos I do indeed @loveoncapaldi Made a setlist today I’m happy with . . Stage is fully designed and ready to go @louishs_ They’re brilliant . @ohgodmylarents I am more than ready . . You gotta like it a lot first and then get it up there . O @niaIIftansel Oh you’ll hear it @28tommos One of my favourite pics of me from a photo shoot I really enjoyed @niaIIftansel 2 completely different vibes . @flickeringhoran It definitely feels better if they know. When you hear the lyric of this one , you’ll see why it was an easy one to do so @finelinenjh A mix of both @fivescrews @RUBIUSXNIALL I wrote the song in November 2018 so .... I’ve been waiting a long time Hahahah @babypinkniaIl You have a fair idea yeh @shesfireaway Yes hopefully @sugarrrhoran I don’t really have a proper sound on this album. It’s obviously gona be guitar driven coz it’s me but...... I just wanted to write songs and have fun and not worry about what genre they fit into @yuhflicker One of yessss @NIALLCIDlO Oh yesssss @RUBIUSXNIALL No . I wrote this riff in Chicago of the flicker tour 2018 @madisonsflicker Yes @niallertomeetya Oh you be dancing baby @faiyholland Nope @dreamofhoran Ya might @ClifforniaIl No @cherrysniall No ahahahah this picture is from like 2 weeks ago lol @pallozouis No don’t do this Hahahah . Just make up your own version of events . @caroIinanjh @niallrelate From the second I wrote it @niallrelate It’s a personal song about someone in particular but also just generally about people judging eachother too much . @niallaar Maybe @flickerbarbara_ Not long actually . I knew exactly what I wanted to say basically word for word @najihah_ma Not that one no RT @CapitolRecords: waiting for #nojudgement to drop like \n@NiallOfficial https://t.co/RjXOJcPMGt RT @coffeewithniall: let’s get it to #1 on friday niall nation!!!!! LETS GO!!! #NoJudgement february 7th @NiallOfficial https://t.co/jGqOrN… RT @LiveNationNYC: Us at @barclayscenter on 4/29: https://t.co/NCgI5FiaKs RT @MTV: Looks like I'm taking off work on Friday to celebrate the release of #nojudgement!!! Thanks @NiallOfficial!!! RT @Q997Atlanta: We shook!! Ready #Niallers? - @adambombshow RT @CrossyTweets: We got to hear some of this a few weeks back!!\n\nIt's v v v good 👏👏👏\n\nHear it on @FM104 soon!! @NiallOfficial 👏👏 Couldn’t be more excited for this one if I tried. My new single ‘ no judgement ‘ is out Friday ! https://t.co/2LO3RksBT7 https://t.co/AkKsel5gKk @YeaNarry KC for me . Yessssss Demi !!! Nailed it. Congratulations.. #SuperBowl @azuu_11 Most 1D tunes, slow hands, fire away, flicker was finished here, on the loose, NTMY and all the goodness @niallflicker_ Most of it yeh RT @niallsoftness: #NiceToMeetYa was playing on the radio a couple of minutes ago Niall @NiallOfficial ! argentina loves and supports you &lt;… @Spotify 😂😂😂 @Spotify Niall Horan! Lovely fella, great tunes. @umusic Playing golf I reckon @flickeringhoran 😂😂😂😂😂 @JStir and I were just talking about that RT @PulpChickee: LETS TALK ABOUT HOW I AM SEEING NIALL FOR THE FIRST TIME AT THE LA SHOW https://t.co/Rmhf1IfAOM RT @gldnhournjh: LETS GOOO!!!!! niall i cant wait to see you in DC and have the time of my life!!! https://t.co/bCzS6UgmNM @PulpChickee They all will be RT @gldnhournjh: niall cant wait to see you rock out in DC!!! want April to come faster !! @NiallOfficial https://t.co/TY8MOy7lID RT @flickerbarbara_: Can’t wait to see you front row Niall! ❤️May 18th at the Forum! Gonna be an LA party! 🎉 https://t.co/bMETbVugrU RT @Z100NewYork: @NiallOfficial https://t.co/M6ZPIP8UkP RT @obriensflower: @barclayscenter @NiallOfficial ❤️ Not long til tour!! Go get your tickets for the NICE TO MEET YA TOUR of North America. Let’s gooooooooo RT @LiveNationNYC: Nice to meet ya, what's your name? 🎶 \n\n@NiallOfficial is bringing his #NiceToMeetYa Tour to @barclayscenter on April 29… RT @arlowhite: Goodness me 😳👏 #LFC https://t.co/NGeOaZTpQz Welcome to @modestgolf Jayden Schaper ! \n\nSo proud to welcome former South African number 1 amateur &amp; Junior Players champion @schaperjayden to the team ! \n\nExcited for the next chapter ! https://t.co/47qSm168UL @BrittNicole1495 @SiriusXMHits1 Wowwwwwww can’t believe it @stringer9 Stringer go home, you’re drunk RT @siobhni: Livid! Well we will have to do pints some other time. But no photos please Niall. You have me tormented for the photos. @canyonharryy I love both of them equally and feel they should be as big as eachother forever @AislingCasey4 Thank you. Was a great night @Sophie14582146 Working babe @fookinghabit It’s from a book called ‘ pillow thoughts ‘ . I read a lot of poetry to learn and help my writing. @glimmeryniall No he’s fucking not 😂😂😂😂. Just the one Incredible to see the wonderful Sir Lucian Grainge getting his star on the Hollywood walk of fame. He is a music industry legend and more importantly a great man. We’ve had some great moments together and I look forward to many more ❤️ @siobhni @RTELateLateShow I actually did really want to meet you 😂😂 ragin . RT @LiveNationIL: .@NiallOfficial = Weekend Vibes ✨🕶💸\n\n🎟 Get tickets to see Niall live at @AllstateArena on May 9: https://t.co/ttxeBNnO6f… In the home land !!! Can’t wait to perform on the @RTELateLateShow tonight 🇮🇪🇮🇪🇮🇪🇮🇪🇮🇪🇮🇪 RT @OMEGAGolfDubai: The perfect weather. An outstanding golf course. A world-class field. The OMEGA Dubai Desert Classic has arrived ladies… @irishcharts Let’s do it. @SiriusXMHits1 Fuckkkkkk Huge congratulations to my beautiful friend Paul Smith @PaulSmithDesign on 50 years of his amazing company. Thank you so much for having me this weekend in Paris #PaulSmith50 . Always love collaborating with you guys x https://t.co/TcJXqTOIS2 @nialleraustria Cmon now 🇮🇪🇮🇪🇮🇪🇮🇪🇮🇪🇮🇪 @NJHsSTLRckstr2 😂😂😂😂 RT @findingfletcher: this tour is going to be insane !! @NiallOfficial @LewisCapaldi https://t.co/LTBWQ2hUQj RT @rudeziamhour: @NiallOfficial got my tickets for Nashville! Can’t wait!!!! #NTMYtourNorthAmerica https://t.co/90RagqZwH5 RT @Justyna08074731: @NiallOfficial I'm just buying tickets, see you at Toronto Niall ❤ @NiallOfficial https://t.co/XeiteeH5u7 RT @Pressparty: .@NiallOfficial's \"Nice to Meet Ya\" receives Gold certification in Australia https://t.co/z27nS18nKX https://t.co/P1kz8FIWGA RT @LiveNationNYC: The #NiceToMeetYa Tour is coming!\n\nDon't miss @NiallOfficial with special guests @lewiscapaldi and @findingfletcher ar @… @lovelyxxHoranxx Probably say “get the fuck off me, you can’t even play “ 😂😂😂😂 RT @halsey: Thank you Niall 😭 🤍🤍🤍🤍 means so so much to me Any to our family @CapitolRecords , best team in the business @halsey congratulations on a beautifully honest album. Musically and lyrically, I was there all the way through. 🤘 RT @niallsonIyone: @NiallOfficial me !!! see u in vegas 🤍 https://t.co/8bvNQvZf4t @bostonniaII Yeh come on down RT @katyflicker: @NiallOfficial See you in Vegasssss May 16th❤️❤️ @brooklyntide See me wherever is easiest . @emily_cruz0 😍😍😍 @ot4lwt 😂😂 love it @afterflicker Go get it RT @loveoncapaldi: @NiallOfficial I bought my tickets to Toronto today!!! Can't wait!! https://t.co/lGAmBnayus @loveoncapaldi My girl !! That makes me really happy @YeaNarry Either . Mohegan nearly sold out I think . Anyone just about to get tickets for the tour or just got them? #NTMYtourNorthAmerica @ntmyerica Go get it 😂😂😂 @finelinetime PALLOM, smalltalk and one other song RT @LiveNationNYC: Can't wait to hear it @NiallOfficial! 🎸 \n\nSee you soon! #NiceToMeetYa Reading of the passing of the great Jim Smith. What a man he was!! He was the manager of @dcfcofficial when I first became a fan and we had so many great moments under his management. Rest well sir. A proper football man. 🐏🐏 @SiriusXMHits1 Fuckkkkkkkkkkkkkk Just had a little tear roll down my face, So happy with this album. I / we put everything into it and listening to it back in full, is an amazing feeling. @imanarrystan That was done before I finished the mixing and mastering @thebbtcenter Oh it’s going to be huuuuge! @POPSUGAR God I am soooo funny Album officially complete @Fiorebianchini2 Live in LA , it doesn’t rain hhahah RT @flickerkale: Niall I can’t wait to see you again at the #NiceToMeetYaTour #NiceToMeetYa #NiceToMeetYa100M https://t.co/uXthsxPloG @ntmynarry Yeh @halsey FACT 😂 @rckmeniall Liverpool @tinpantbsl @flickerofhope13 Why would I do that? @flickerofhope13 Yeh that’s one thing I do know @ubiquitousnjh Small little thing called Time. There’s about 12 years in the difference @flickerevans @nhtuned If it ever gets released, I’ll put the voicenote out @shesfireaway No no @nhtuned Don’t know yet. I’ll see where the production ends up ..might save it @niallernroses I sat down, played the piano and started singing melodies and fell in love with it . Ran to the studio where my mates were and finished it. Love when it happens like that @niallernroses I just got home. Working hard on an idea I had this morning and just went to studio and finished it . RT @Shazam: Congrats @NiallOfficial! #NiceToMeetYa reached 1⃣ million #Shazams 🎉 https://t.co/PzkGXPkjG6 Banger @wowwpatricia Tell them I’ll give them their value for money , I promise . @katyflicker No !!! Mr Mully does You are the baddest bitch in town https://t.co/24s1uNBCYN @rckmeniall Couldn’t agree more RT @NiallPromo_: 🚨ATTENTION NIALL NATION🚨\nTomorrow we hit 100M streams on NTMY and we want to celebrate it with you!! Make sure to trend #N… Let’s get it up there https://t.co/xiWoafkA52 Yesssss https://t.co/8VKAWsHt4t RT @ntmyimbronsgem: I have my tickets for Chicago and Tulsa I am SO EXCITED TO SEE NIALL!! https://t.co/zOTkibEeIR RT @sugarrrhoran: Niall I got my tickets for @barclayscenter and @MoheganSun !!! So excited! https://t.co/UsUp1bKzsD @putloveoniall Oh I know RT @CapitolRecords: 🎟 https://t.co/eYUiLyA7oW 🎟 @Niamsxx @seeingniall_ Not distorted basically . @niallsorridimii Probably @niallersfloof This album was made for big venues @seeingniall_ One on the left is a fender telecaster and it’s known for its distorted / twangy sound when it’s plugged in ( play it on NTMY and others from the new album) , red one is better when clean @artomhoran Yes and it’s brilliant @flickerbarbara_ I absolutely love @theforum . It’s one of my favourite venues in the world to go to @itsfIicker I choose guitars based on the different sound it gives off . So this one is amazing when it’s set to ‘clean’ for songs like ‘TMTA’  and ‘ on the loose’ for example. Other guitars are better for a more distorted sound and work well with different pedals. All very geeky stuff @nialljhntmy I’m recording one small something tomorrow and then we’re done @kellyn_singer Yessssssss you should ! we’re going to have an unbelievable night @ifeIIforittwice Any venue that is full hahahahaha @AllyLuvsNialler Amazing ! That’s what I’m talking about !!!!!!!! 😭😭😭 . Hopefully all the others look like that too @BrdgstoneArena Can’t wait Who coming ? Who’s just about to get tickets. The show is coming together nicely and I’m super excited. The tour is not far away now, so make sure you get tickets quick. https://t.co/fMBO51K3lO RT @nhstreamteam: #NiceToMeetYa UPDATE \n(Jan 11)\n\nSPOTIFY: 98,079,751  (+916,215)\n▶︎ https://t.co/2N97wOREzg\n\nYOUTUBE: 30,160,487\n▶︎ https:… @niall_pallom Wow! @halsey Beautiful Looking forward to watching the @OMEGAGolfDubai in a couple of weeks ! \n\nThis year’s field is set to be one of the strongest in the history of the tournament  – Grab your tickets now at https://t.co/zMLH55LfTW @luvnhoran Might aswell Hahahah @rckmeniall Listen to music, talk about stories from when we were kids and stuff @niall_capaldi Absolutely not ahahahah @paperheartsljp I’m not tired at all but cheers for the compliment 😂😂🤨 @sugarrrhoran Love driving so much . We take turns on this trip coz we are doing long drives @hsIotflicker I’m coming up soon. @seasidetucker @holdmyhandniall No . Still going . All over the place @vaniIIahoodies As Taylor swift once said “ you play stupid games, you win stupid prizes” Hahahah @holdmyhandniall Coz I like to do what I want Hahahahah @niallvinyIs 9 miles @niallvinyIs Coz it’s sunny, why ya think?? 😂😂 @souadXII Went on a biggggggg hike babesssss RT @TheSoldierKid_x: This song is such a jam 😍 @NiallOfficial #NiceToMeetYa https://t.co/IpMjEQESAt RT @LiveNation: 2020 is going to be a year of AMAZING music ⚡ \n\nGet tickets to see some of the hottest tours of 2020: @NiallOfficial, @maro… @niallvinyIs Yes . Few hours at a time @LEEYUMSNIALL Yes we are bored as fuck Hahahah let’s do this ! \n#Niallers #BestFanArmy #iHeartAwards https://t.co/B7cTQBO4LU @umusic I can’t paint @NikolleRimando Thank you xx Put a little love on me lyric video out now ! https://t.co/ZNBTdJgPNr https://t.co/Q40KLO9WCc @vxlkyrieloki It’s not real money Hahahaha calm down @thunderroadnjh I have indeed @Fiorebianchini2 A little ! I’ve got a throat virus so I’ve been just chilling really @bethanydaynow No I’m just messing around RT @LiveNationIL: .@NiallOfficial's May 9 show at @AllstateArena will be here before you know it!\n\n🎟 Grab your tickets here: https://t.co/m… 2020 NICE TO MEET YA @solongnialler Think it was NTMY @coffeewithniall Nowhere near that yet @fuckyeahhniall Learn to speak Spanish, get in good shape and read more. Whether they happen or not is another story but..... we’ll give it a go @itsfIicker At night when I was a kid I would dream of being on stage infront of thousands and rocking out and because of all of you guys, I can do that whenever I want, for real . @Kiss108 Oh big time!! I miss making your job fun @Kiss108 3 weeks is a long time! What about you ? Do you miss me ? RT @nialljhntmy: C'MON PEOPLE\nSTREAM NICE TO MEET YA BY NIALL HORAN. WHAT ARE YOU WAITING FOR?????? WHAT A GREAT SONG!\n#NiceToMeetYa2020 ht… @Kiss108 You tooooo!!! Miss me? We are incredibly proud to announce the signing of former world top 10 amateur, @BWindred to @modestgolf. Blake is a passionately patriotic Australian so we would like to use this news to highlight the State of Emergency in Australia right now as it faces a national crisis. https://t.co/8dXWin8xwO @TheEllenShow I love you @shesfireaway I fucking hope so Hahahah @luvnhoran Yes of course . @finelinetime Yes @hissmilenjh Strong American accent @derbyteesniall Yeh good result and a good performance . Not easy to go away to a premier league side and get a win. Feeling a bit better about things now RT @LiveNationNYC: .@NiallOfficial is bringing his #NiceToMeetYa Tour to @barclayscenter!\n\nDon't miss him with special guests @LewisCapaldi… @ntmylive 😂😂😂😂 @lwt28infinity Yeah it’s really not easy. Also now I’m a coffee influencer album artwork feeling amazing, stage design coming together too. 2020 let’s do it. IF YOU HAVENT GOT A TICKET TO THE TOUR, GO GET SOME NOWWWWWWW 🤘 @derbyteesniall 200 by the end of jan @SiriusXMHits1 5 weeks ????? My days ! Thank you all so much @finelinenialljh 200 It’s a deal 😂😂 @nhstreamteam Let’s go again ❤️❤️❤️❤️ RT @officialcharts: New year, new you, new music – can't wait. Big albums coming in 2020 include @DUALIPA, @selenagomez, @NiallOfficial, an… @PopCrave @ArianaGrande Hahahahaha Jesus Christ ! That’s insane Ari.. @solongnialler Bathroom mosaic RT @tastednh: i swear @SiriusXMHits1 LOVES niall 🥰 https://t.co/cW1miUgMQn RT @Pressparty: .@NiallOfficial &amp; @LewisCapaldi's #NiceToMeetYa North American tour is coming! https://t.co/yyLoTkwkAu https://t.co/Y0Rj4wW… @ash_london Ya know me way too well RT @allielainebrown: SEE YOU MAY 9TH NIALL I CAN’T WAIT OH MY GOD https://t.co/VIXbDXnQMm @nhtuned Yeah I honestly keep forgetting @ntmynarry I‘ll just walk down the middle @ash_london Oh I’ve had a few of them in that place, they’re rocket fuel !! Best country in the world. RT @bostonniaII: i cant wait to see niall may 1st ! i've been waiting months for this yayy https://t.co/BzsU0DAyce @PulpChickee See ya in LA @svradavis I’ll sing to ya babyyyyyy @loveonthor Yeh I think so @cxbelloxmila Yes you fucking do... cmonnnn @ash_london What ya reckon ash? @derbyteesniall I started coming up with a moodboard and stage design from feb this year. Then I did my first free-hand drawing of the stage when I was in my dressing room at the EMA’s this year RT @thebrianamlopez: I’m seeing my favorite person Niall - what?! 5 months seems to long, can time go faster? https://t.co/yYeswLlPZT RT @MikeAdamOnAir: Ready to win those @NiallOfficial tix from me?!! Turn on @New1027! https://t.co/rl9ytOuYbn @niallerflickerr Getting there . . RT @AllTooFlicker: i’m seeing niall on tour omg- https://t.co/E6SrJrwOqL @GaryLineker @dcfcofficial @WayneRooney Was thinking the same thing myself, Gary RT @thorsmoonchild: @NiallOfficial ME i can't wait to see you in miami 😭😭 it'll be the best show of the tour tbh https://t.co/AOz4CEAzuD Who’s getting tickets for NTMY tour? RT @thebbtcenter: 😅 Time is flying by and @NiallOfficial will be back at the #CENTEROFITALL before you know it! \n\nDon't miss him when he re… @ash_london Joan 😝 RT @CapitolRecords: mood all 2020 @niallofficial #HappyNewYear https://t.co/GgEptzpGzA Happy New Year 🤘❤️ What a decade!!!!! Thank you all so much for everything, sincerely RT @xflickerxnjh: I’m still so excited to see Niall again :)))) https://t.co/gQHaTrvD23 RT @officialcharts: We can’t see into the future, but we reckon these albums will be on your headphones in 2020. Big ones to come including… Liverpool are sooooo good to watch. As a lover of football, I really look forward to sitting down to see them play. @jadorelaniall Try and do 5 @niall_capaldi I do something similar to be fair Hahahaha @niallvinyIs Differs every other day . Today I did 40 mins cardio and 10 mins abs . Tomorrow I’ll do only upper body , next day I’ll do some strengthening on my legs to protect my knees . @hissmilenjh 10 ??? I fucking wish Hahahah RT @Pressparty: .@NiallOfficial's 'Put A Little Love On Me' video has already surpassed 7 million YouTube views https://t.co/xX7UMCyVGz htt… My friends and I play a charity football every year . This year we’re donating to the North Westmeath Hospice and I want to give my jersey to someone who donates within the next 24 hours . Donate here ! https://t.co/17kbOBmo7Y https://t.co/arq8qAmG7T RT @MoheganSun: .@NiallOfficial is bringing his Nice To Meet Ya Tour with special guests @LewisCapaldi &amp; @findingfletcher to #MoheganSunAre… My days I’ve listened to ‘Golden Hour’ by @KaceyMusgraves hundreds of times and it never gets old. Theres no other art form that makes me feel things, the way music does 😍 RT @umusic: UMUSIC and @NiallOfficial are wishing you the happiest of holidays! What did you get this year? 🎁🎄 https://t.co/WlHzjyOrN4 RT @bqtterbeer: I GOT NIALL TICKETS YALL WHAT THENSKRNFKDKDJHF @nicetomeetya4 Fuckk yeahhhhh RT @horansbutterfIy: mom sent me these this morning, finally get to see my love again after a whole year later after meeting him🖤 @NiallOff… RT @FallonTonight: Jimmy challenges @NiallOfficial to read “Twas The Night Before Christmas” in 7 different accents! https://t.co/2hmJSv5GEG Remember if you’re in North America,  there’s no better Christmas present to buy for someone than a ticket my tour 😁 Hope everyone has a lovely Christmas!! Enjoy x RT @RIAA: We were excited 🎉 to present @NiallOfficial with a platinum award 💿 for his only solo album #Flicker. @capitolrecords https://t.c… RT @UniMusicIreland: We're seriously feeling the love for @NiallOfficial 😍 ❤️ #PutALittleLoveOnMe #NiallHoran Listen to the new single here… @Y100MIAMI that was amazing. Thank you for having us. Few beers in town tonight and then home for Christmas. It’s been a good year xx RT @thatblkgrl: @thebbtcenter @NiallOfficial ok I’m convinced, just might have to go now @thebbtcenter See ya in april xx @StateFarmArena @photorushin I think we should ❤️❤️❤️❤️ ATLANTA!! It’s soo good to be back. Love this city, love the people, the southern hospitality in full swing. See ya tonight ! @POWERATL @IoufineIine Microphone attached with tape RT @Y100MIAMI: Here are the official #Y100JingleBall set times! 😍 Now you have no excuse to miss anyone ;) 🎟 https://t.co/IJFCEjxirC https:… RT @13katie_kat: Can’t wait to see Niall next year in Boston for the NTMY tour! Didn’t want him to leave the stage at Jingleball❤️ @NiallOf… @CapitalOfficial I didn’t hit back . . The sarcasm just didn’t work ahaha. Have a right good look at my arse if yizzzzzzz want RT @PaulSmithDesign: .@NiallOfficial wears dusty pink #PaulSmithSS20 suit on @nbcsnl. 📸 :@_CTierney https://t.co/8RdHSc2Rw5 RT @Vevo: .@NiallOfficial stopped by our Times Square studio and broke our hearts with his performance of \"Put A Little Love On Me\" 💔Check… Chicagoooooo!! Oh how I love this city so much. can’t wait to see you tonight @1035KISSFM jingle ball. Let’s make it loud @OnAirWithRyan Found it Put A Little Love On Me live at @Vevo https://t.co/Biz61XvRgF https://t.co/2ZAPNFSFmb This reads like I’ve just hosted the show itself hahaha( if I ever get the chance to host the show , wait til you see the thesis length story i have for that haha ) \n\nThank you @nbcsnl The wonderful and beautiful Scarlett Johansson. Thank you for taking me under your wing and just being a lovely person on top of all that. It was an honour to be on the show with you. Xx The cast are always so lovely and fun to be around. Thank you to cecily especially for helping me out with the skit etc.. thank you guys.\n\nThank you Lorne for asking me to be a small part of your incredible show. You are a gentleman and I hope we can work together again some day https://t.co/TyQUnAwO4l The same crew has been doing that show for years and years. They are the nicest and most efficient people in show business and I thank them very much for making my week seamless and very special. https://t.co/LcAEBnutUZ What a week! \n\nTo be the musical guest on Saturday Night Live was one of the greatest honours I’ve had in my career. \n\nGetting back up on the SNL stage after a few years was incredible,I’ve never felt more at home. https://t.co/t4jPqPL3NF RT @ntmysymona: soo excited to fly to Nashville to see niall opening night! also going to DC &amp; Brooklyn! https://t.co/UnxYXo4seJ @ntmysymona Legendary @loveagainmendes I wish it was RT @sunfIowernarry: i can’t wait to see niall in toronto!!! https://t.co/Nq2308B8Wk RT @tearsflicker: nothing better than knowing i’m seeing niall next year 🖤 https://t.co/JrpM0hxoN9 RT @tastednh: see you in dc for the ntmy tour niall 💛 https://t.co/QPqqW2nmMh @babypinkniaIl Paul was making egg nog ahahahah RT @jadoreNialll: May not be seeing Niall tomorrow, but I will be seeing him in May and I honestly can’t wait 🥺💛 https://t.co/vzMgjVXZnO D.C. I’ll be back On the 27th of april next year, go get tickets, we’re going to have an incredible night https://t.co/E4pR69ctuF D.C. it was a pleasure as always, thank you @hot995 for having us . #iHeartJingleBall 📸 @_CTierney https://t.co/6nuvrxSzie @Kiss108 It was an amazing crowd!! Loved it . Thanks for having me . ❤️ RT @hornyhoranwhore: IM FINALLY SEEING NIALL I THINK I MIGHT CRY https://t.co/pavkxDdbBB My god I just recorded a voicenote with one of my favourite melodies I’ve written, went to listen to it back and deleted it by accident. Very upset so don’t talk to me 😂 @IittleIoveonme @xDeathSeeker Right well that’s it settled Hahahah @erodalockdown What makes ya think I’m not a nice person? @holdmyhandniall Ya hear that @PaulSmithDesign @sixthsunflower Soft as fuckkkkkkkkkk RT @SiriusXMHits1: Tonite's Top 3 on the #WutchuWant Countdown with @MikeyPiff are:\n\n#3 @samsmith \n#2 @charlieputh \n#1 @NiallOfficial!!!! h… @juliamichaels @floofyniallerr @vaniIIahoodies Yeah drag her 😂😂😂 @niallxwalls PALLOM was started at my house and finished on this @ot4lwt Once you are in the building it’s fine . . With my show I’m making sure that even if you’re up the top , you’ll see me just fine @ntmynarry Dancer @niallhappier Hunk @FaIIinCherry Yesssssssssssss!!!!! Let’s go @Faby_1DFam Yeahhhh Niall deserves better 😂 @vaniIIahoodies the ole Americans and the sarcasm ????? Doesn’t go down tooooooo well at all 😂😂 @xDeathSeeker Yeh I agree. We need to forget about my songwriting, musicianship, creative being and just really focus on my arse  😐 @faiyholland Ehhhhhhh...... im around on Thursday evening, are you free ? @AllyLuvsNialler Let’s get going on streaaaaaaaaminnnnnngggg @hot995 Alright D.C. let’s go. What a crowd in Boston as per usual ! Cheers kiss 108 for having me #iHeartJingleBall 📸 @_CTierney https://t.co/8UUp5jl1jp @m_ollymac 😂😂😂😂😂😂 PINK to make the girls wink @nbcsnl 📸 @_CTierney https://t.co/DUzzTQz4N3 https://t.co/oMXjisfGvY @Kiss108 Arena = empty @ 6:25pm. You only need 1 hours parking @Kiss108 Oh hello again RT @benwinston: .@NiallOfficial was so so brilliant on #snl tonight #PutALittleLoveOnMe @benwinston Love you Ben x RT @Pressparty: .@NiallOfficial smashes his #SNL solo debut! https://t.co/Edv7em2t9j https://t.co/QmUm8yQ4hW RT @nbcsnl: Thank you, Scarlett Johansson and @NiallOfficial! Goodnight! 🌙 #SNL https://t.co/PGLezor9p5 RT @nbcsnl: ✨ Put A Little Love On Me ✨\n@NiallOfficial \n#NiallOnSNL https://t.co/prd9grhZ57 #NiallOnSNL ! RT @nbcsnl: 😊 Nice to Meet Ya 😊\n@NiallOfficial \n#NiallOnSNL https://t.co/if7yCNwets RT @Shazam: #Shazam during @NiallOfficial's performance tonight on #SNL to unlock exclusive behind-the-scenes content!! 🙌🎉💪 #ShazamNiallSNL… 30mins to showtime! @nbcsnl Here’s my @MostRequestLive @iHeartRadio @AskAnythingChat ! Thanks for sending in your questions . Love ya @OnAirRomeo x https://t.co/K5UUh70ooE @helloxpetal Coffee and sleep as much as possible. RT @RTE2fm: Can’t stop watching this @NiallOfficial 👏🏼 https://t.co/ULrPd7bzye @NIALLCIDlO Cheers haahahah I don’t feel tired . RT @LiveNationNYC: 🙋🏻‍♀️🙋🏻‍♀️🙋🏻‍♀️ can’t wait! @nbcsnl @NiallOfficial #NiallOnSNL https://t.co/RDJx4KJKUA RT @UMG: Don’t forget - @NiallOfficial takes the stage on #SNL tonight!\n\nWho’s watching?! https://t.co/3jiGKHVBr2 Madison square garden, z100 #iHeartJingleBall 2019. Always an honour, thank you xx 📸 @_CTierney https://t.co/s94DDVU14P RT @ElvisDuranShow: BEST 👏 FRIENDS 👏 FOREVER 👏\n\nShout-out to these guys for some AWESOME performances and interviews last night at #Z100Jin… @PLinUSA @NBCSportsSoccer Im afraid I won’t be able to make that one happen. I’m doing another @nbc show tonight in @nbcsnl 🤘🤘😂🤘😂🤘 @tattooednumber @NBCSportsSoccer Yeh I absolutely hate it 😂 RT @LiveNationFL: Tonight, Niall Horan will be on Saturday Night Live! Don't miss him live on his Nice To Meet Ya Tour with special guests… .@NBCSportsSoccer are doing an unbelievable job for football in America. The fan zone set up in Miami Beach is incredible. Congrats everyone involved. Also, LOVE YOU REBECCA! @MarenMorris exactlyyyyyyy!! Miss ya Moran @MarenMorris Yes maren , that’s what you sound like 😂😂 I joke I joke RT @ConorGilsenan: 😂😂😂 Brilliant @NiallOfficial https://t.co/kSgEHkCyA6 @niallernroses Id do anything to play to that every night 🤘🤘🤘 @Z100NewYork @CapitalOne My pleasure @itsfIicker They asked me to pretend I had dropped the cup off a ski lift , so I did exactly that Hahahah RT @iHeartRadio: I'm just going to leave this here...\n\n@NiallOfficial #iHeartJingleBall https://t.co/pwHwKO69Zf Getting ready for to perform at the #iHeartJingleBall ! Watch now at https://t.co/JbeDIdDwzv x @assftnialI Don’t ask me!! I’m colour blind as fuckkkk @JOEdotie party tricks . Accents have gotten me out of some situations before Thanks bud 😂😂😂 https://t.co/HHgvYzQ096 We probably won’t be very Irish before we go on stage tonight at MSG in New York at Z100 jingle ball. Don’t believe the stereotypes. #iHeartJingleBall @z100newyork 📹 @_CTierney https://t.co/t0f8tmFrUe @AnneMarie 😂😂😂😂 cheers my love RT @barclayscenter: Darling put a little love on me🎶💛 Sing along with @NiallOfficial when he comes to Brooklyn with @LewisCapaldi &amp; @findin… @Schlotzskys @finelineniall For sure . RT @FallonTonight: Jimmy challenges @NiallOfficial to read “‘Twas The Night Before Christmas” in 7 different accents https://t.co/t5Rg0ZPUXX RT @1DOnChart: iTunes US\n33. Niall Horan - Put A Little Love On Me +1\n43. Niall Horan - Nice To Meet Ya +2 Well .... jimmy and I had a bit of a laugh tonight to say the least 😂 @FallonTonight \n\n📸: Andrew Lipovsky/NBC https://t.co/neuqd4A4BT SNL. it’s on Saturday Night and weirdly enough it’s LIVE https://t.co/fBNnPXFUDc RT @FallonTonight: TONIGHT: @VancityReynolds is here! Plus @NiallOfficial, and music from @Camila_Cabello ft. @DaBabyDaBaby!  #FallonTonigh… RT @BachelorABC: Nice to meet ya, what's your name? Pilot Niall? https://t.co/vr310laaxa thank you philly ! @Q102Philly @iHeartRadio 📸 @_CTierney https://t.co/PH0rEp73oA Here we go ! @nbcsnl In a New York minute 🥶 RT @Q102Philly: THANK *YOU* @NiallOfficial! Can't wait till you come back in May 😍 https://t.co/5QEV5KDNYn thank you so much philly! That felt amazing to be up there tonight. I’ll be back May 2nd next year. Go get your tickets xx https://t.co/E4pR69ctuF https://t.co/y8EdzVIRKj #PutALittleLoveOnMe is the Song of the Day ! Cheers, @amazonmusic https://t.co/j8zCIGNHGj https://t.co/Ug82Acw85O @BachelorABC but it's all aboard Horan airways https://t.co/tBYDO60mod Thanks @BachelorABC for making Nice To Meet Ya the track to promote the next season ! https://t.co/3uLHAavwP7 RT @musicnotes: Watch as @julianbulian discusses the collaborative process behind @NiallOfficial's “Slow Hands” and offers some tips for wo… Philly are you ready for the #Q102JingleBall tonight?! See you there!! philly I’m here and I can’t wait to see you tonight 📸 @_CTierney https://t.co/SSlVgRQtmw @littlelove_nh @frmthstars @Kiss108 Yes It’s amazing ! Can’t wait for it @frmthstars @Kiss108 I’ll be in bed. Have THE busiest week of all time with SNL the night before @YeaNarry @Kiss108 😂😂😂😂😂 @Kiss108 But yeah . leave after I’m finished I’m joking !! Everyone get your butts to the garden on Sunday . The line up is great and we’re going to have a good time https://t.co/A4OxhzD1j3 @Kiss108 No . Deadly Serious 😂😂 @frolickinghobo @Kiss108 @halsey Love her . I’m joking @brooklyntide @Kiss108 I mean they are one of the greatest NFL teams of all time , I’m not sure I’m Sherlock Holmes for figuring that one out @niaIIskiwi @Kiss108 I’m gona try give a good quality performances everywhere between now and Miami , then that’s it I’m afraid 😂 @flickernialler @Kiss108 More chance of it being half empty when I’m playing 😂😂 @Kiss108 Then ya can leave once I’m done.. early in , early home . Perfect Sunday evening 😂😂 @Kiss108 @whydontwemusic @5SOS @lizzo @charlieputh @halsey some of the magic?? You mean all of it right ? 😂😂😂 RT @thebbtcenter: We know what we're wearing April 24th at BB&amp;T Center! #NicetoMeetYaWorldTour 😍 https://t.co/6SaZ6i6G5j @adoreyouafi Yes pops love this RT @adoreyouafi: my dad just came into my room and handed me these 🥺 im seeing niall at wells fargo tomorrow and again in may im 🥰 https://… @revoluketion_ Thanks girls for being lovely ! Have a good night and enjoy tomorrow. X RT @hot995: Fans patiently waiting for @NiallOfficial's new album just got another taste of the forthcoming release, as the singer/songwrit… @brianwacker1 Not a hope in this weather Brian I love the homeland 🇮🇪 https://t.co/xRMHoUYMOm RT @1DOnChart: iTunes UK\n99. Niall Horan - Flicker (Deluxe) +15 @niallontours Let’s save the bloody planet people Nice to meet ya merch now available to pre-order ! https://t.co/FgK93KAYEb https://t.co/zQyFcEd8NR @hot995 We’re going to have an unbelievable night . Great line up @Z100NewYork @CapitalOne let’s do it New York ! @barclayscenter ❤️❤️❤️❤️❤️❤️❤️❤️ can’t wait Super excited about these next couple of weeks. SNL,Jimmy Fallon, Jingle balls. It’s going to be a good time RT @PaulSmithDesign: @loveoncapaldi @NiallOfficial We couldn't possibly ruin the surprise! PS @Q102Philly @CapitalOne If you are not there and that line up exists, don’t talk to me RT @beat102103: #NowPlaying on Beat at Work with @itsDaveCronin 🎧\n\n@NiallOfficial's brand new single #PutALittleLoveOnMe \n\nListen: https://… @NiallsFlicker93 I’ll try give you your value for money darling RT @KIIS1065: KIIS' 2019 #iHeartRadio Jingle Ball has a MEGA star lineup! 🎊😱@taylorswift13 @jonasbrothers @Camila_Cabello @halsey @NiallOff… 🔥🔥 https://t.co/VbO8hyWzxw RT @icarusIine: I just bought my bestfriend and i tickets to see niall for Christmas https://t.co/yrpiROW1Zz RT @Hits93Toronto: Now Playing: Nice to Meet Ya by Niall Horan. https://t.co/gCdjI2V0wy Having one of those realisation / thankful moments while I lay in bed. I’m living my dream thanks to you all. I LOVE MUSIC SO MUCH. RT @pandoramusic: .@NiallOfficial will have you in the feels with “Put A Little Love On Me\" 💖🎹 Spin his new piano ballad now: https://t.co/… It’s @nbcsnl week ! My heart could explode 😍 @IittleIoveonme Crazzzzzyyyyy ! Mind is blown . Let’s keep it going Huge jump for NTMY in the iTunes Chart and PALLOM is moving too, Thank you guys. Keep up the amazing work. glad you are enjoying the New music. @flickersmartina @SophiexHorayne @romankemp @imacelebrity Guitar all day Long, id go mad without it @ntmysteph We’d get kicked out for messing @ntmysteph Yeh I went . . Just go in there, get it done and remember that 45-50 mins a day is nothing. @SophiexHorayne @romankemp @imacelebrity That ‘ BEEEEP’ button would fracture. @LiveNationUK @findingfletcher @LewisCapaldi @GorillaMCR @o2sbe That’s our CARIIIIIIIII Very proud of my very good friend @romankemp on his few weeks in the @imacelebrity jungle . Congratulations pal, you’re one of the greats and the nation got to see it for themselves @talkSPORT if you know one thing about Alan Brazil is that he’ll read ANYTHING that’s put infront of him.... also that he can drink more than anyone you’ve ever met @bbcstrictly Thank you for having me . . I loved it , parents loved it. All is well ! Xxxx Delighted to be featured on the cover of Brand New Music . Thanks @amazonmusic ! https://t.co/cLRbXYoNkh https://t.co/mHlLRxdVIf Bobby horan was a happy man in the audience of his favourite tv show as I performed ‘ Nice To Meet Ya’ on Strictly. Keep streaming everyone x https://t.co/qc7nRYhQUH RT @iHeartRadio: A new emotional song from @NiallOfficial has arrived and I can't stop listening 💙 #PALLOM https://t.co/172164ewFZ Here we go ...... @bbcstrictly @EBUNC1 See ya soon bud @Faby_1DFam These girls work so hard on their craft and lyrics,  dance routines, screen content, marketing etc.... and then they just get ridiculed by trolls online . @Faby_1DFam Never effected me . Im too private , I don’t read things online , i don’t really know what people are talking about online but every now and then I’ll look and I see people just saying awful things, especially to the female artists. @NJHsSTLRckstr Me too 😂😂 @lgbtfineline Whatttttttt????? I just said stop bullying others . What the ??? I’m not talking about any artist in particular. I’m talking about the culture on here of just abusing people because you can. It’s not like you would walk down the street screaming out loud about the people you dislike a small bit. @imanarrystan I’m not talking about me coz frankly I don’t give a shite about that stuff coz I’ve better things to be worrying about but..... some of the abuse I see artists getting on here is shocking . I see a lot of abuse aimed at artists online. Why can’t everyone just concentrate on the artists they like and if you don’t have anything nice to say about artists you may not like , well just keep your mouth shut 🤐 @rxflickerfloof @imanarrystan I don’t know 😂😂😂😂 I just do it @niallsorridimii @imanarrystan Yes he loves strictly @imanarrystan Hahaha . No I’ve never had a lesson or actually know what chords I’m playing . I play a guitar chord and try and match up notes wise to make the Chord. Then my right hand plays a lot of the melodic stuff @Gnarlyale_ Yes you should I will be performing tonight on @bbcstrictly . Make sure you tune in to see quite the sexy dance to ‘Nice To Meet Ya’ . RT @CapitolRecords: 𝑷𝒖𝒕 𝑨 𝑳𝒊𝒕𝒕𝒍𝒆 𝑳𝒐𝒗𝒆 𝑶𝒏 𝑴𝒆\n@NiallOfficial out now #PALLOM\n\nhttps://t.co/MhfN5AOhm9 https://t.co/tmIb9iQ2Gs Thanks to @OnAirRomeo and @iHeartRadio for all the love on Nice To Meet Ya ! My @MostRequestLive @AskAnythingChat is next Saturday night . Keep on sending in questions here https://t.co/9ghd3u4BQy Sydney! Loved every minute of it. See ya next year x 📸 @_CTierney https://t.co/kRIYDZLWo9 I’m so happy this song is out in the world for you to hear now . Go and have a listen on @Spotify’s Pop Rising x https://t.co/d2zKqKgcft #PutALittleLoveOnMe https://t.co/b9iowFkAQt Cheers @applemusic @arjanwrites for adding #PutALittleLoveOnMe to the A-List Pop ! https://t.co/kvoLmPF6qe https://t.co/zI1bNKnGmE RT @ItsJamieScott: Yes sir https://t.co/4i65UdpKuA @niallsorridimii @imansafiyaaa I recorded put a little love on me in a few different ways, recorded different vocals , tried different productions with different people but I just kept going  back to the day 1 demo. First vocal and first piano pass is what you hear now @ntmysteph I might @imansafiyaaa Thank you darling @shesfireaway Yes you did Hahahah @PrincessParkNJH @assftnialI It feels amazing from what I’ve seen . . I love this song so I’m glad people like it . @assftnialI If you’ve ever had jetlag , you will understand Hahahaha . It’s the worst . You just wake up randomly and feel more awake than ever RT @Spotify: Put a little love on @NiallOfficial's new single 💚 https://t.co/t4pFZEbaoe https://t.co/2I8xgFLTA4 @JKCorden I love you My massive face on Times Square ! Thank you @YouTubeMusic for the love on the Put A Little Love On Me video https://t.co/NfuUXsm0XH https://t.co/FooMePerij RT @youtubemusic: Oh Niall, oh my 😍. Watch @NiallOfficial in #PutALittleLoveOnMe → https://t.co/cwIhZ4NDqm https://t.co/zcHx8oFQZe Huge thank you to radio 1 ! @BBCR1 @MollieKing https://t.co/6Qzme1rccx Thank you @AppleMusic for putting Put A Little Love On Me on New Music Daily ! https://t.co/WLsLgwhLg2 https://t.co/Sws8fEuGuR Put A Little Love On Me is on @Spotify's New Music Friday ! Thank ya for listening x https://t.co/UbLqJShOsJ https://t.co/UGdjLbkDQC Put A Little Love On Me is out now ! I recorded this song a number of times but always kept coming back to the original demo so I ended up using that for the final track . Enjoy x https://t.co/UY38MqlNsD https://t.co/Nh32NDunjS #PALLOM I’m jet lagged out of my mind but I couldn’t not stay up to see your reaction to this song. I love this song and I’m glad it’s yours now, can’t wait to play it live on tour for ya! ‘Put a Little Love on Me’ is out now. Hope you love it x Not long now!! ‘Put A Little Love on Me ‘ is out in a couple of hours. Just wanted to release this song because I feel like it deserves to be released and I want you to have it now. please enjoy xx The song I’m releasing tonight at midnight EST is one of my favourite songs I’ve written and a song very special to me. Hope you love it #PutALittleLoveOnMe https://t.co/lEojFT9mgL Meself and our Jamie sat down during @socceraid and had a chat for his podcast. Not gona lie, wish I had a heads up on the 5 a-side team question. I’ve had a howler there. @Carra23 legend . https://t.co/jFK6hwEjxG https://t.co/f0lojLDMBx 323-405-9055. December 6. #PutALittleLoveOnMe https://t.co/PpfxvW5Vmt @sunriseon7 I’ll hold you guys to that! @Conor_O_Donohoe Ehhhhh....Nice to meet ya, slow hands , flicker, this town, too much to ask, on the loose, on my own . What an incredible day! This morning Co-hosting @sunriseon7 was one of the most fun experiences I’ve had in a long time. Thank you for having me and if you’ll have me back sometime, it would be an honour. Thank you @sam_armytage for helping me along. RT @Smallzy: .@NiallOfficial is in Aus and we're chatting tonight before he takes over the show tomorrow...\n\nIt all kicks off at 7PM! 🔥\n\n#S… RT @SiriusXMHits1: Tonite's Top 3 on the #WutchuWant Countdown with @MikeyPiff are:\n\n#3 @twentyonepilots \n#2 @nfrealmusic \n#1 @NiallOfficia… What a day! Great to be back in Sydney. Going to bed now so I can be up nice and early for @sunriseon7 Melbourne! One of my favourite cities in the world. I always have the most beautiful time in your town. Xx 📸 @_CTierney https://t.co/QAIGqfEQrQ Wow ! Claustrophobia is a real thing isn’t it ? 😥 😴😴😴😴 Long but very fun day of promo! All the interviews today were a great laugh. Australia I love ya. Now it’s time to chill and relax x RT @awisniallx: @NiallOfficial @niallernroses @smallxtalk LET'S GET NICE TO MEET YA TO 100M BY THE END OF THE WEEK  🙌🏻😎 I start, Niall 👇 ht… I’m going to be live on @theprojecttv tonight. Tune in any time after 7:00pm AEST . X RT @sunriseon7: Music superstar @NiallOfficial is co-hosting Sunrise this Wednesday 👏🏻 https://t.co/dKXrEGVl2x @bostonniaII Nice to meet ya @smallxtalk @niallernroses Let’s do it 👍♥️ @niallernroses @smallxtalk By the end of next week would be unreal 😂😂😂😂😂😂😂😂 can ya imagine ??? I’m going back on @MostRequestLive with @OnAirRomeo on Dec 14 , send me your questions ! https://t.co/9ghd3u4BQy @iHeartRadio @AskAnythingChat https://t.co/ODLB1d1NhN RT @irishcharts: Congratulations @NiallOfficial! Nice To Meet Ya is Number 1 on the Official Irish Homegrown Chart, ending Dermot Kennedy's… RT @niallontours: You heard him!!!! Go stream #NiceToMeetYa, let’s get it to the top 💥\n\n(Niall via Instagram story) https://t.co/iMQnNFbnhK RT @PrfectlyFlicker: STREAM #NICETOMEETYA\nSTREAM #NICETOMEETYA\nSTREAM #NICETOMEETYA\nSTREAM #NICETOMEETYA\nSTREAM #NICETOMEETYA\nSTREAM #NICET… @nhstreamteam I agree Happy thanksgiving to all my lovely American friends. Enjoy x RT @SiriusXMHits1: Tonite's Top 3 on the #WutchuWant Countdown with @MikeyPiff are:\n\n#3 @NiallOfficial\n#2 @jonasbrothers \n#1 @lizzo!!!! htt… @queerlibra That’s a habit I need to get out of ahahahha . I have too many of the fuckers @flickerntmy I like songs like graveyard because the title itself is a state of mind and once you get that title, you are out of the gates flying @shesfireaway @halsey Yeh I didn’t bring a guitar on this trip for some odd reason. ‘Graveyard’ by @halsey is a song I wish I’d written. melodically and lyrically beautiful throughout @letmetreatya Bit of both @JuliaR_AA “Ibiza are you ready? “ RT @AshLondonLIVE: LOOK WHO’S COMING TO AUSSIE IN A WEEEEEEK!!! @NiallOfficial https://t.co/u35A01H9ny @ntmysteph Absolutely everything ahahah Australia I CANNOT WAIT . I’m coming home and I’m Co-hosting @sunriseon7 next Wednesday morning. 🇦🇺 🦘 ☕️ 🍺 ☀️ @TheLauraJayne_ @sunriseon7 @DUALIPA It’s too hot . @sunriseon7 @DUALIPA Australia I’m coming back. Can’t wait for this . You know how much I adore your country Having a great a time on my trip to Singapore so far https://t.co/HOFdkkyTkd RT @mtvema: Just gonna leave you with this beautiful @NiallOfficial smile to brighten up your Monday! 😍You're welcome #mcm https://t.co/TZl… @softlynl Coz i can @hsftniall I had a shave today ahahahah bald We’re going live NOW! Talk to me https://t.co/zV5cjcTasQ Don’t forget about my nice to meet ya chat on @Spotify .......... I’ll be there answering questions, come for a chat https://t.co/VG32z687o6 https://t.co/IteHKUsyPV RT @BrdgstoneArena: @NiallOfficial NASHVILLE, BABY! \n\n(We are VERY excited) @flickerofnouis Can’t wait . Went to posts show the other night and just being in the audience got me excited @caroIinanjh Bring it back I reckon @stylesbenefit Who said Mexico was out of the tour ? @narrysfineline @bowsienjh @Niamsxx @nialltrench No I was on a plane . Didn’t see anything @bowsienjh @Niamsxx @nialltrench Of course RT @nandreafp: @NiallOfficial Can't wait to see you for the first time 💕 https://t.co/stL4S3D0Fu @90sNiallftafi No @hesitatehoran Got it all @Louisangelx Very excited . I’ve been waiting to put this type of show on for a while now . It’s gona be amazing @Niamsxx @nialltrench Yes I was . I know which one aswell @nialltrench It’s really good @HEALYSFLICKER Go on pops RT @igotloveforyouu: @NiallOfficial can’t wait to reunite in ny!!!! i can’t believe how lucky i am!!!! 🥰 https://t.co/AkZy9qTqxq @usedtobenjh Yeh same @nextleveljuless Let’s have it @kiwisnarry I was gona say the same thing about myself . @soloflicker Excited . I love a jingle ball. Always good laugh backstage , meet other artists, play a few tunes , see fans in places I haven’t been to in ages RT @narrysfineline: @NiallOfficial never been more excited niall !!! https://t.co/nuhjGZ2ryF @happilyIauren What a celebration week ! RT @hrtbrkweathr: @NiallOfficial see you in nashville, LA, and san jose!!!! can’t wait to yeehaw party it up with you across the country @newloumantics Only took me 10 years to figure it out RT @_emily_joyce_: @NiallOfficial is going to BLOW MY MIND again in 4 months and I actually cannot wait. Niall you are SO talented &amp; you ca… @Sophie14582146 I can’t wait . You’ve no idea @pauhsn Go get em babe Nashville baby https://t.co/mvbRZDTha4 RT @RUBIUSXNIALL: @NiallOfficial niall, in official singles chart top 100 and 40 #NiceToMeetYa is in 25nd place, in official audio streamin… @superrichlads Why thank you lovely RT @niallernroses: Everyone keep streaming #NiceToMeetYa by the one and only niall horan and get him moving up in the charts! Let's give hi… @wakeupatmidday You are off the charts talented !! @nialldivinely No that’s from a few weeks ago . Not today @wakeupatmidday What the??? Who drew this? @vaniIIahoodies 1 day. Don’t you worry . It’s all good , I’m chill I promise you we are going to have an incredible time on the ‘Nice To Meet Ya World Tour’  and I would hate for ya to miss it. Go get tickets !!!!!!!!!!! #NICETOMEETYAWORLDTOUR @seeingniall_ He’s always on the fucking toilet. @PenguinNiallxr I can’t win best dressed every year, everyone would freak out. RT @Y100MIAMI: 😍 @NiallOfficial will be performing on 12/22 at @thebbtcenter for our #Y100JingleBall presented by @CapitalOne , will you be… @niallsoftness There will be others don’t worry , I ain’t silly @seeingniall_ I’m trying to make it now HHaha @boobearmedicine @shesfireaway bigger the show the better for me . . . @niallsorridimii @shesfireaway 5 hahaha @ohgodmylarents @shesfireaway Obviously @theirelad Yeh of course. I want to tell a story with my show @0NeringaJ @shesfireaway I have quite a few . I really really struggled to condense my songs down. @flickersmartina Yes and that’s why Billie eilish is a very intelligent lady @derbyteesniall a lot of my stuff sounds better live because of the nature of my music . @flickerswift13 @shesfireaway Yes . I have many examples @aesthxticstyles I’m on a different time zone to the guy I sent it to and I keep missing his calls hahah"}