{"tweets": "@BritBrit_90 You got this! 💪 @channyac 🎃🍁💚 @nofussn 🎃🍁 @jurassiklarc That's alright! There's time to catch up on your gourd sips. 😁🎃 @Crimson_Crush Which flavor gives your cup that halo? @MelissaSulewski That sounds so amazing, Melissa! Enjoy your season. 🍂 @jax6605 Cold brew for the win! @hotdadfanclub You're already having a wonder-fall season! @nofussn It's definitely the way to spice up their season! @channyac That's it. That's the tweet. 🎃😋 @kristinuwu Sounds like you found a wonder-fall favorite! @amhassman Hello, thank you for reaching out. I am so sorry to hear of this experience. I would love to follow up with you regarding this concern. Please DM me with the store location at the following link?  https://t.co/ifXnzspJpX -Kevin @jrodriguez_xo Always. 😉 @vanefootball7 Can't wait to sip with you! https://t.co/qMIjCQlXXr @ZacPacleb That first sip feeling got you, Zac! @pinksandtravels https://t.co/xBaAV9rVou @yessenwahs We're glad your sips were a hit! @ashleyksilva121 Starbucks Delivers is available on Uber Eats (but you are correct it won't earn Stars unless you pay using the Starbucks Rewards Visa Credit Card or Starbucks Rewards Visa Prepaid Card): https://t.co/FT9Kh0PvhK @kadeearbor To help clarify our policies: Everyone is welcome at Starbucks, and we also have a long history of supporting law enforcement and working with police in creating a welcoming environment, incl. hosting 1,500+ Coffee with a Cop events. https://t.co/tnlXdZV6qz @taylorshae05 Looking forward to satisfying that craving with you! \nhttps://t.co/J9xALyJeJA @littlemissjulz It goes exactly as hard as it needs to. 🎃 @hardin_diana Cheers to delish fall first sips. https://t.co/oJNlzFwaHa @krispyyyg This is exactly what our business is all about. 😉 @RealOccuRian Such a delish treat! @StarringPamela Switching up from your go-to can be hard! Enjoy your PSL. @GregMeetsWorld When spooky season is close and your Pumpkin Cream Cold Brew is closer. @stacijowal We would never lie to you! @jrodriguez_xo Everything you need for a wonder-fall season. 🍁🎃 @_suheyyyy Something nice for your bf and something wonder-fall for you. 😉 @SophieXylia 🎶 I want more cheers and that cozy feelin'.. PSL so wonder-fall and yum 🎶😋🎃 @ALxMarquise We'll thank you know. Who doesn't love a warm Pumpkin Cream Cheese Muffin? \nhttps://t.co/3WkKvBy4Es @nikistrand We're happy to give everyone more ways to earn Stars no matter how they pay! 💫 @kenzvdo Starbucks Delivery can help you get through the work day! It's available in select cities. Simply download the Uber Eats app and search “Starbucks” to see if it’s available near you! If it’s not, don’t worry, we’re rolling it out nationwide soon. @honeygxre 🎃🍞🎃🍞🎃🍞🎃🍞🎃🍞🎃🍞🎃🍞🎃🍞🎃🍞🎃🍞🎃🍞🎃🍞🎃🍞🎃🍞 @xomissmora Uber Eats is our exclusive partner for delivery. Download the Uber Eats app and search “Starbucks” to get started. 💚 @bkrdr2010 Yes! Not to worry, nothing has changed for existing members. We want to provide more options when it comes to earning Stars. @ashleyksilva121 🌟 Starting now, you will be able to earn Stars on almost anything no matter how you pay, at participating stores. @kenzvdo Cheers to life-changing gourd sips!  🎃 @jlangley1967 Hi, John. Now more than ever, we must come together to affirm specifically that Black lives matter and confront racism in our communities. We also have a long history of supporting law enforcement and working with police in creating a welcoming environment. @josie_beauran Sip cozy. It's FALL y'all! https://t.co/JWMWyF1cNY @tanzin1034 Thanks for the suggestion! We aren't accepting reusable cups at this time (though we are still honoring the 10-cent discount) and we look forward to serving you in your favorite cup when it is safe to do so. @michaelaclarkk_ Happy Birthday! 💚🎉 @higginsdunn Best day! 🎃 @TTay97_ Ask and ye shall receive! You can now earn 1 Star for every $1 spent using credit/debit cards, cash and select mobile wallets, at participating stores. You will continue to earn 2 Stars for every $1 spent when you use your registered Starbucks Card. https://t.co/wKrhiyK3yy @joehernandez246 Now we're making it so you can earn Stars no matter what form your bucks are in. ⭐️ @ZacharyZWA 💚💚💚 @hobsmona It's PSL o'clock! https://t.co/qMIjCQlXXr @sehoward3 https://t.co/Ix9n2WKhes @AmeluzO Can't wait to satisfy that craving with you! https://t.co/J9xALyJeJA @nikki_hetrick We're happy to provide more ways to earn Stars towards Rewards! 💫 @CamiElizabeth_ We're excited to help you earn Stars however you pay. 🌟 @troyglidden https://t.co/va9wPofuUq @kadeearbor Please note our CEO is Kevin Johnson. @Alexaness12 We're excited to give you more ways to earn Stars! 🤩 Hooray—new ways to pay have arrived in the Starbucks® app. 🙌 Starbucks® Rewards members can use credit, debit or cash to pay &amp; earn free drinks.\n\nEarn/$1 spent:\n1⭐Credit/Debit/Cash\n2⭐Starbucks Card\nAt participating stores. Some restrictions apply. See https://t.co/Kx5NOZ05mA https://t.co/A1yx0jR0rd @CoquitoMamii It's time.🍂 https://t.co/qMIjCQ4n5T @Kinginshitt_ Looking forward to sipping with you soon! https://t.co/qMIjCQ4n5T @abbracadabra_ We can't control the weather, just the pumpkin spice. 😉 https://t.co/cHrSfJcOGc @gueriitachofiis In order to receive your Birthday Reward, you need to have earned at least one Star this year. If that’s the case, we’re happy to look into it for you. @lamessynessi Sorry, since it is a regional beverage oatmilk is not available as a modifier in the Starbucks App. @jenniferdlaws Hello Fall! https://t.co/Tvcd36UaII @Caity_McD Let's get you in touch with @StarbucksCare @zoectjones Coffee-free Pumpkin Spice Creme coming right up! https://t.co/4S1pthg9Qy @Caity_McD In order to receive your Birthday Reward, you need to have earned at least one Star this year. If that’s the case, we’re happy to look into it for you. @GOLDENMlCHELLE In order to receive your Birthday Reward, you need to have earned at least one Star this year. If that’s the case, we’re happy to look into it for you. @brooklyn_kasson Cheers to a delicious season! @lightskingirl__ Perfect cozy sip! @ContraryMary Hope you enjoyed it! @supremeshandiin See you soon? @SargeantSweety Glad you love it! @KPcbeach We think you'll love it! @KPcbeach Have you tried steamed apple juice with cinnamon dolce topped with whipped cream and caramel drizzle? @Yulissax3 We hope to sip with you soon! @glamwithtania We're going to miss hanging with you! You can try Uber Eats to get your morning treats. Visit https://t.co/FT9Kh0PvhK for availability in your area. We wish you the best this year! 💚 @sheswinning365 🧡🧡🧡 @ariespink2 Was it love at first sip? @AthenaLingo Glad you love it! @sheswinning365 Star employee! ⭐ @madisongahimer Bring on the Fall! 🍂 @bxtchpng Totally adorbs! 🥰 @chelsea_lena Awesome! Happy Fall. 🙂🍂 @bxtchpng It stays on our minds too! 💚 @House_Zolli Check the Uber Eats app for delivery availability in your area! https://t.co/FT9Kh0PvhK @kadeearbor Starbucks does not get involved in national political campaigns. We will continue the pursuit of doing good, and will create a welcoming environment for everyone who enters our stores. @kenia3m You're welcome! We hope it's been wonder-fall! 😍🍁🍂 @kenia3m Happy Birthday! 💚🎉 @AmandaPlease_19 Sorry! We didn't know how to make it less yummy. 😉 @ceruleanbee72 Happy Fall to you both! 🍂 @JennyChachan Or brewed cold! 😉🎃 @jurassiklarc It's always gourd to live your truth! @TeaTeresa_ Totally love your style! 🎃 @mraaronarnold Pro tip: ⬆ @collin_estes We see you're spicing things up! 😉🎃 @miss__dyke Sure to leaf you smiling this Fall! 😋🎃🍂 @mlascharton Let the gourd times roll! 😍🎃 @lul_stephhh The weather is the perfect guide to happiness! @vianeyhdz30 What is: name a delicious Fall favorite? 😉🍂 @SmolHeroOfPuns He sounds like the best brother ever! Enjoy.🧡 @marina__sky Looking gourd! @SarahAsh47 Enjoy! @BestYrsAlvarez We're honored! Cheers to Fall favorites! 😋🎃 @dianegld Oh yes, super good! Have you tried the Salted Caramel Cream Cold Brew? @Slept0ne Partner safety is a priority of ours and many stores in the area have temporarily closed or have limited hours. We do not have visibility to the store hours; however, we recommend checking the Starbucks mobile app for an open store near you and the most updated information. @Svetlana305 https://t.co/2Mp8RIBBqc @NotTheLetterKay 🎶 You're doing good, you're on some new sips, been saying \"Yes\" instead of \"No..\" 😉🎃 @Jayeeses611 It's currently in select Midwest stores, but if this changes we'll let everyone know! @Chaseyanity The best way is to sign up for Starbucks Rewards at https://t.co/3ktu65gD6c and add funds to a registered Card so you can earn Stars toward free drinks &amp; food! @jasj1v Use Starbucks as an attributive noun and pluralize the second one: \"Starbucks drinks,\" \"Starbucks stores,\" \"Starbucks partners who make your favorites just right,\" etc. @MrEeeZee Enjoy! 😁💚 @the_fed_23 The new lids have approximately 9% less plastic than the flat lid and straw combined, and are made from polypropylene, a commonly accepted recyclable plastic that can be captured in recycling infrastructure. @Selfrevealed Splash sticks present the same challenge as straws due to their size and weight. We take our environmental leadership very seriously and are pushing ourselves to find potential solutions that reduce waste, meet our quality standards and can be scalable across our stores. @WhoRuthie Great question! We're currently working to develop a fully recyclable and compostable cup in partnership with Closed Loop Partners through the NextGen Cup Challenge. https://t.co/2Yqa1yWdXd @MrEeeZee Way ahead of you! https://t.co/ckoLGBVXK2 @MrEeeZee Totally! We love the layered favors too. Thanks, Mr. EeeZee! 🙂 @kristenolene Hello, thank you for reaching out. I'm sorry this was your experience and I’d like to look into this. Can you please send me a DM with the day and time of your visit using this link https://t.co/ifXnzspJpX? - Kevin @GOLDENMlCHELLE Your Birthday Reward will arrive on your birthday, but we’ll send you an email reminding you beforehand. We can’t wait to celebrate you on your big day! @ShedWool https://t.co/5tehUgofV1 @celestenavv Whatever helps you survive Monday.  https://t.co/ldgVGvZx18 @bernie_2112 Close enough. Your taste buds explode with happiness, so Fox Cake Pop brings the boom. 😉 @Neeshole Hope to sip with you soon! @MrEeeZee And yet so refreshing! 😉 @MrsMMZ_2018 Gourd plan! @mtgeekchick Sorry, no. To lessen the sugar in your drink, you can always ask for less Pumpkin Spice Sauce and/or skinny Vanilla Syrup. If you try the PSL, ask for no whip. @hollenbeck2NW Enjoy your Autumn Adventure! @briiiannaxoxo So glad you did! It looks oh so gourd. 😋 @deeter_emily Happy birthday. Thanks for including us as part of your special celebration! @bernie_2112 Seems pretty clear that's what it is. But if he needs a bigger clue, send him a link to it in the menu.🦊🍰💥  https://t.co/t9E7JJlwQL @margijpatel Quite possibly. What are you waiting for? 😉 https://t.co/qMIjCQlXXr @rreneeaxx Looking forward to sipping together! https://t.co/qMIjCQlXXr Take a sip as the leaves fan out and let all the fall feels sink in. 🍂 #PumpkinSpiceLatte #PumpkinCreamColdBrew 🍂 https://t.co/00k8ChbNNx @dbatcswift Here's hoping thinking leads to sipping! 😉  https://t.co/ldgVGvZx18 @Sebastian187_ Better latte than never. See you soon! 😉 https://t.co/ldgVGvZx18 @NOkerholm Happy Sipping! 🎃 @edifffbadass For sure! @dianegld Your new fave? @_martiiiiv Fall fave? @briiiannaxoxo Did you sip with us today? @Notorious__GRG 🧡🧡🧡 @awakened2life If this is something you'd like to see on our menu, be sure to let us know at https://t.co/1BxewVH8JT. In the meantime, you can try a Cinnamon Dolce Latte with coconutmilk, no whip or Cinnamon Dolce Topping. Ask for a dash or two of Pumpkin Spice Topping. @Mackenz95854876 Happy Fall! 🍂 @Notorious__GRG This season is full of treasures! 🎃 @puppertheclown Aren't they adorable? @Cellini_LL https://t.co/d9eFV6X58e @zanesvlog Happy sipping! @lukesrayy HUGE! 🎃 @kenjiownsme Gourd thinking! @Cellini_LL Orange you glad it's back? @Brooke_Benedict Say less! 😋 @extracandy_ We love pairing the Pumpkin Spice Sauce with vanilla! @_paulina_liz Can't wait to sip-lebrate with you! Happy Birthday. 🎉 @Jordan_Kendrick 🎵 We love pumpkin spice it's true so we changed the game for you! 🎵 @E_donche Live your truth! 🎃 @armadillo4 The perfect way! 😋 @DrLo_ So gourd! @aynoshole Say less! 😋 @becca_haney Woah! 😋😋😋 @petiteemafia Sure is! 😋 @CaptPolitical These delightful Fall flavors are available in the ground format as well! https://t.co/qc7DVGvi7n @SalishBeauty_ Loving all the gourd things! https://t.co/qON9st7aya @Fancyreba1 https://t.co/Wh97i0sgYH @absolutely_ali Ali approves! 🎉🧡 @blessedurfeed Of course! 🎃 @jules_laurizio Cheers to Sunday Siptivities! 🎃🎉 @aktennis19 Pumpkin Spice is so gourd that you should say it twice! 😋🎃 @Luthfiology https://t.co/PySv4wEfyW @glowbossglow We understand. Thanks for sharing this with us. We will take this into consideration as we are continuously updating the mobile app. @BettyGentle This is available at our company-owned, stand-alone locations. @mkaiyaa Oh no! Well, we hope to see you soon. 💚 @loveofmagical You're welcome! @loveofmagical Awesome! Enjoy every sip. 🎉 @jennyyily Love you too, Jenny! 💚 @luuccc__ Oatmilk isn't available as a modifier because it is only available in select markets. If anything changes, we'll let you know! @_paulina_liz Aw, this warms our heart! 💚 @ilooovelulu Enjoy! @BettyGentle You can get that reusable cup you've been eyeing or your favorite at-home coffee valued up to $20! Visit https://t.co/3ktu65gD6c for more details. @ichbedich021818 Hey Breanna! It can take up to 24 hours for your stars to appear in your account. Have you received them yet? @suebrackney Happy Belated Birthday! 💚 @loveofmagical Which sip are you celebrating with? @glowbossglow Hey Jessica! For most beverages, you can modify your order with Splenda. Just tap Add-In when placing your order and scroll down. You should be able to add any sweetener that you'd like. 🙂 @therealkaterea Aww, thanks for the love, Kate! Enjoy. 💚 @xasia_b We're thrilled you love it! Cheers to the return of favorite Fall flavors! 😍🎃 @Lilyisacutiiie Sounds like you've found your favorite Fall sip! 😋🎃 @DevanKane95 Hope it has made your season better! 🙂🍂 @mkaiyaa Did you get a chance to stop by? @DianaFieldsss So much yum! @kaylaalonzo1 Thanks for sharing this delicious tip! 💚 @Vanessa_Ainsley Hey Vanessa, thanks for your suggestion! We'd love for you to share this with us at https://t.co/1BxewVH8JT. @jennyyily Glad you're enjoying it! @RogerChrista It's definitely gourd! @BohemeAndChella It's all self-care! 💚 @KMontalmant Yes, you're missing out on Fall! https://t.co/1lIQoKCEWZ @izzyjiggy Even better! 💚 @scntuary Have you tried adding Pumpkin Spice Sauce to your Iced Chai Latte? @athenaalayvette Thank gourdness for your delicious tip! @izzyjiggy So you're a grande pumpkin person? 😉🎃 @inmybarbieland OMGourdness 😍😋 @REDice141_ Cheers to that first Fall feeling! 🧡 @nicoleesays 😲 Oh no! Hope you stopped by for another. @dalfonzziebear A delicious twist! 😋 @drewxann The gourd things in life! @AHotMetss You just needed the right brew! @Mythicalsausage Welcome to the gourd life! 🎃 @kayaubrianna https://t.co/nhwh2cuL4F @GurlitsCait Totally Fall in a cup! @m_e215 No worries! You know what you like. 😉 @kaytoe_ttv It's back, Kaytoe! Hope to sip with you soon. 🙂 @Amber_Rose86 That's gourd sipping! 💚 @_trulystephanie Let the gourd times roll! 😋🎃 @KendraKenzie Thanks! 😉 We're happy to hear you love every sip. 🎃 @blushzdh No. 😉🎃 @BuzzkillJilll Pumpkin Cream Cold Brew will be back to bring you some joy. The slow steep time limits the amount our stores can make each day, so it's only available while supplies last. Sorry about that. We're not disagreeing about 2020, we just wanted you to know that all is not lost. 🎃 @itsqueenbitch_1 We're thrilled to hear that! Cheers to a supreme seasonal sip. 🎃😍😋 @chelsea_lena Sounds like you've found your favorite Fall sip! 😋🎃 @lovejpayne We're glad you're falling for new flavors, Jay! 🎃 @koiwonder Straws will continue to be available upon request for Starbucks customers who need or want them. Just ask your barista. @idkimhal Can't wait to be sipping together! https://t.co/J9xALyJeJA @RhoadesMary927 Hi, Mary. When ordering your Americano with the app, under the Espresso &amp; Shot Options you should see a drop down menu \"Blonde or Decaf Espresso\" and Blonde Espresso should be the 4th selection down. @_Sailyoursoul Thanks for the perfect score! We're thrilled to hear you've found your favorite Fall sip! 😋🎃 @nuttdeer Looking forward to sharing that  sweet sip with you! @KingBrad88 Straws will continue to be available upon request for Starbucks customers who need or want them. Just ask your barista. @Mamaevelina Happy Hour will be back. Keep an eye on the Starbucks app and make sure you’re opted into push notifications to find out about the next Happy Hour. @robozippy Cheers! 😋 @Jorgeu5115 They make every day taste like your birthday! 🥳 @Lpadron92 It's an explosion of fall flavor! 🎃 @sweeteningxari Happy to help, Arianne! @kayybeee18 Peppermint syrup is available all year long. Feel free to ask your barista to whip you up the cold brew sip your holiday heart desires. @alexx_hi Looking forward to our next sip together.  https://t.co/ldgVGvZx18 @ri_p_wal Not all Starbucks stores offer delivery, but we do provide delivery to as many customers as possible where Starbucks and Uber Eats are both present. Check availability near you by visiting https://t.co/FT9Kh0PvhK. @robozippy Happy Birthday! 💚🎉 @cvakratsis Right now Starbucks Delivery is available in select cities. Simply download the Uber Eats app and search “Starbucks” to see if it’s available near you! If it’s not, don’t worry, we’re rolling it out nationwide soon! @theforeigngigi Right now Starbucks Delivery is available in select cities. Simply download the Uber Eats app and search “Starbucks” to see if it’s available near you! If it’s not, don’t worry, we’re rolling it out nationwide soon! @SeqouahB It sure is! https://t.co/qMIjCQlXXr @lee_alexus Thanks for the perfect score! 😋🎃 We're happy to hear you loved every sip! @AzraelBloodbane Yum! 😋 @_OhDianna Cheers to a new favorite sip to love! 😋🙌 @smugexhale Treat yourself! @bonnieweidler13 Enjoy! @bonnieweidler13 So good! Try with Cinnamon Dolce, Whipped cream and a Caramel Drizzle. 😋 @cherstinv We like the way you sip! @joiemonet_ Stop by, Joie! We need to talk. 😉💚 @whowantspunch A gourd way to celebrate the pre-weekend! @lariail Prior to beginning every shift, all partners complete a pre-check, including safety precautions such as taking their temperature, to ensure they are ready and able to work. Partners are also required to frequently wash their hands. Read more at https://t.co/WMpwMyUw5f. @DistantLullaby Definitely a plus! @DelnazKazemi1 We're happy to hear you loved every sip! You're a true be-leafer now! 😉🎃🍂 @lilicejaalvarez We're glad to help make it easier for you! @CohoonPaul Peppermint syrup is actually available year-round! 💚 @KnitehawkHD Yes - it's also available in K-Cups. Enjoy! @mjaen94 Your season deserves it! @sageeechristine You're welcome! We hope your day is wonder-fall! 😍🍁🍂 @TayTay_Gravey Happy Birthday! 💚🎉 @DaveyySak Happy Birthday! Let the gourd times roll. 😎🎃 @sageeechristine Happy Birthday! 💚 @HandleWithKerr1 Cheers to life-changing gourd sips! https://t.co/LBqSUBVLJp @jaanessuhh 😘 @jcoriden Straws will still be available for customers who request or require them. @gomezxo_j Cheers to all the gourd things! @j3r1m14h In-store market testing began in the spring of 2020 with a cup that is industrially compostable as well as recyclable in markets that accept hot cups. @muhkell Especially with the pumpkin scone! 😋 @xxxxtien OMGourdness! @seventhchild__ Thank you for your feedback and suggestions! To clarify, the t-shirts were not for sale; they were provided to our partners (employees) at no cost. @IrritatingMr Check https://t.co/FT9Kh0PvhK to see if Starbucks Delivers on Uber Eats is available in your area! @meikruz Starbucks Delivers can help! We partnered with Uber Eats to bring you your pumpkin treats. Just download the Uber Eats app or visit https://t.co/FT9Kh0PvhK for availability. @AriannaOhYeah Enjoy! @Krybtonite Stars expire 6 months after you earn them. You can check your Star Expiration by tapping History→Star Expiration. @fictionalideas Sounds like your Friday is off to a great start! Here's hoping the rest of your day is just as gourd. 🎃 @Being_Marri This warms our heart! 💚 @derregirT 💚 @jaanessuhh Here's hoping your 10000th sip is just as gourd as the first. 💚🎃 @caitlinp33 \"GET IN THE CAR!!!\" https://t.co/J9xALyJeJA @realChrisPalm The most delish way to take it from Friday to FriYAY!  🥳 @9_J85 Cheers to the first sips of fall! https://t.co/sIGlLwiLs1 @kylieblais We can't wait to hear how much you love it!  https://t.co/ldgVGvZx18 @derregirT We like your style! @lymostardently Cheers to cherishing the small things! 💚 @heartbreaakjake Thanking you between sips! 😋 @BedfordKirk Hi Kirk, our Pumpkin Spice Sauce includes dairy. If this is something you'd like to see on our menu, please let us know at https://t.co/1BxewVH8JT. @LovePriceless__ Fall is back! Stop by to celebrate with us. 🙂 @tylerschroed14 Cheers to your season! @hotrodngold The new lids have approximately 9% less plastic than the flat lid and straw combined, and are made from polypropylene, a commonly accepted recyclable plastic that can be captured in recycling infrastructure. @petrichorlauren No, the use of reusable cups is still temporarily paused. @deydreem4 That's it. That's the tweet. 😋 @lbraiz17 The new lids are made from polypropylene, a commonly accepted recyclable plastic that can be captured in recycling infrastructure. @linseylucille Innovative and delicious! @lexadouglass Spoken like a true beleafer! @essiemay83 Correct - not completely! https://t.co/iBST3b9ecq @krice3678148 You just did! 💚 We'll be happy to pass this along to the right team. @Bookdragon_Jay No, we will still have straws available for Frappuccino® drinks. We are currently testing straws made from alternative materials and we will have more to share in the coming months.  https://t.co/sTfQdg0sVK @DavidJSmith93 The new lids have approximately 9% less plastic than the flat lid and straw combined, and are made from polypropylene, a commonly accepted recyclable plastic that can be captured in recycling infrastructure. @_amking ¯\\_(ツ)_/¯ @katiejeanpalmer Prior to beginning every shift, all partners complete a pre-check, including safety precautions such as taking their temperature, to ensure they are ready and able to work. Partners are also required to frequently wash their hands. Read more at https://t.co/WMpwMyUw5f. @EPbeauty13 We are too! If they're curious, they can read more here: https://t.co/iBST3b9ecq @AOdham 🙌 @Brandie1970 We're glad to help you find a way to enjoy your coffee even more than before! @thats0lex Loving two favorites like a pro! @jimenezzz__ Cheers to wonder-fall favorites! @charlesdople You tell them, friend! Nothing better than a salty, sweet sip. 😋 @marlenvortiz Sounds like you have a favorite treat. 😋 @DeasiaaJackson It's definitely the pick of the patch! @_chayluuhh Just hitting your taste buds with everything you love about fall. 🍁 @lexadouglass Having two favorites is the best part of the season! @fraxinee 🎉🎉 @Kat_Zam15 💚💚 @chris_921 That's a good looking sip. 😍 @courtney_marlo We love to hear that! 🎉 @hotmesslex18 So glad to hear this! Thank you for sharing. @luvbadjazz 💚 @TheBitchyGay2 Yes! https://t.co/iBST3b9ecq @NSlouka Straws will still be available for customers who request or require them. @ericka_reardin Glad you've enjoyed the experience! @elewMD 🙌 @OtterLov3r Starbucks cold beverage cups are made from polypropylene and are recyclable in many markets. @spookshowbaby1 Great question! We're currently working to develop a fully recyclable and compostable cup in partnership with Closed Loop Partners through the NextGen Cup Challenge. https://t.co/2Yqa1yWdXd @LadyChips Our commitment to sustainability and doing what's best for the planet remains unchanged, but in accordance with national and local guidance, we are continuing to pause the use of personal cups and “for here” ware in our stores. @Evans7mom The new lids have approximately 9% less plastic than the flat lid and straw combined, and are made from polypropylene, a commonly accepted recyclable plastic that can be captured in recycling infrastructure. @LadyChips Starbucks cold beverage cups are made from polypropylene and are recyclable in many markets. @2stepcannon Splash sticks present the same challenge as straws due to their size and weight. We take our environmental leadership very seriously and are pushing ourselves to find potential solutions that reduce waste, meet our quality standards and can be scalable across our stores. @love_doll11 It's the perfect day for a cozy sip! https://t.co/qMIjCQlXXr @munchkink8 Straws will be available upon request and will come standard with Frappuccino® drinks. @noahjross0121 You're welcome! We are also  testing straws made from alternative materials and we will have more to share in the coming months: https://t.co/sTfQdg0sVK @noahjross0121 Frappuccino® blended beverages and other drinks with whipped cream will continue to have a domed lid made from recyclable plastic and be accompanied by a straw, except where prohibited by local law. @MJacksonFae Straws will continue to be available upon request for Starbucks customers who need or want them. \n\nWe are currently testing straws made from alternative materials and we will have more to share in the coming months. Some markets offer compostable options: https://t.co/sTfQdg0sVK @siacidal It's true that straws will still be available upon request: Informed by discussions with the accessibility leadership community, we will still have straws in our stores for those who need or want them. @lbraiz17 Great question! You'll start seeing the new lightweight, cold drink lids in their market this week, if you haven’t already. The rollout is estimated to be complete by the end of the month. https://t.co/TqDAPDiOmE We're committed to a more sustainable way to sip. 💚\n \nThis month, we will complete our rollout of lightweight, strawless lids to stores in the US and Canada, eliminating an estimated 1 billion single-use plastic straws a year. https://t.co/4847SpjqvQ @isabellee_o We would never try. 😉🎃 Cheers! @_rach513 It's lid-licking good! 😋 https://t.co/hKW8qJC6vu @It_Aint__ME If you don't like it, please let your barista know - we're always happy to make it right or find you something you'll love! @sham_yeezy They're honestly a little taste of heaven. 💚 https://t.co/1KHOr9QkTT @Calabastu We're so glad to hear this! Please let us know here and we'll be sure to share it with the right team. @SnCheeto Looking forward to your delicious reunion! https://t.co/3WkKvBy4Es @jordklotz Frankly, that sounds like a perfect day of self-care. 💚 @Jamie_SheMeHer Looking forward to enjoying one with you!  https://t.co/3WkKvBy4Es @mckennaetherton It's off the charts delish! 😋 https://t.co/1KHOr9QkTT @_giovannaturco Full heart now, full tummy later. 😋 https://t.co/1KHOr9QkTT @Lul_David_ Yes! Join Starbucks Rewards and you can earn Stars that you can redeem for coffee and more: https://t.co/ja8W7A9v5x @SBPorter9987 Happy Birthday! We hope it was awesome! 😍🎉 @_WhoaThere Happy Birthday! We look forward to seeing you! 💚🎉 @LuedkeBrittany Cheers to fabulous fall firsts! 🎃💅 @katie_schulze1 It's a definite hit! 🎃💚  https://t.co/ldgVGvZx18 @Michelle0416 The single-serve Ready-to-Drink Starbucks Pumpkin Spice Latte is not available  this year. This fall, Pumpkin Spice Latte fans can enjoy the ready-to-drink Starbucks Iced Espresso Classics Pumpkin Spice Latte, available in 40 oz. bottles wherever you buy groceries nationwide. @_lexielouu Yeah. We sure did. 😉 https://t.co/WfdbVJpvvK @raeof_sunshiine We know, right? 😉 https://t.co/CfdAgZeSoj @libabeans We don't make the rules. We just make the drinks. 😉 https://t.co/705gHwXkK8 @uviqueroblox Seems like you've really fallen for it. 😉 https://t.co/WymjtZlvlp @GillottSci Some days just need that extra shot. 💚 @Lul_David_ Thanks for starting your day with us. https://t.co/XWUpO7FFxS @uviqueroblox Glad you're enjoying an amazing sip! 🎃 @KarlitAcero Right now Starbucks Delivery is available in select cities. Simply download the Uber Eats app and search “Starbucks” to see if it’s available near you! If it’s not, don’t worry, we’re rolling it out nationwide soon! @cndykhouse You're welcome. 💚 @John_Graham19 Hope you enjoyed your sip! @annawxlsh Your season deserves it! @sxrenaaax Cheers to all the Fall feelings! 🍁 @josieavonell Looking forward to the second time! 😉 @karalianna We're grateFall for the shoutout, Kara. Happy sipping! 💚🍁 @Eric5_7 Live it to the fullest! @kara_mackenziee You made ours! ❤️ @Cojo2017 💚 @fae_jackie It's our pleasure. 💚 @CocoaBabby We hope your whole week is just as wonderful. 💚 @HortynElephant We hope you do too! @lovenenax33 We always look forward to seeing you! @FitBlonde19 That's our new strawless lid! https://t.co/9dQQUf73rB @CocoKisses40 💚💚💚 @thomasjdewarr 🍂🧡 Fall aboooooard! 🧡🍂 @AnjanetteReni You can't fight for those who cannot fight for themselves unless you have an amazing cup of coffee first. @TheTravelMDs Absolutely! 😋 @amanda2012lynn Do you have a favorite one yet? 🤞 @ekjackso_ Go big or gourd home! Way to spice up your season, Em. @soulcondition Gourd way to go! @ps_lovejulie Looking forward to sipping with you! @kayla_chavez1 Fall's most delicious duo! 🍂💚🎃 @thewomanspark 💚💚💚 @classylinda65 Your Pumpkin Spice carriage awaits! 🎃 @cndykhouse We hope the rest of your day continues to be magical. @beckercomedy The Stars you collect towards Rewards will expire after 6 months. Please note this has been the case since 2016. You can see more about Starbucks Rewards Star expiration at: https://t.co/u5X59dak2x. @vincett_thomas When you know, you know. 😉 @supatkelli Thanks for stopping by, Kelli. We hope you have a great day! 💖 @soonergurl8 We had to spice up the season for you, friend. @hollenbeck2NW Thanks for taking us along for the ride! @Rockythefox1 Pick the gourds out of your ears and grab a Pumpkin Cream Cold Brew. @mtgeekchick Sorry, no. The pumpkin spice sauce is not available as sugar-free, however, you can sub the vanilla syrup for sugar-free vanilla syrup in this drink. @theoryofmydead Here's to Fall flavors! 🍂 @thewomanspark Glad we could help brighten your day! ✨ @kwsu44 Definitely the pick of the patch. 🎃 @bsuthe4 Delicious, hard-hitting facts. https://t.co/ji7p8ez2Vy @Patrick96899664 And tastes wonder-fall. 😋🎃 @Backpackjohn1 Linus would be proud of our pump-CAN attitude. 🎃 @vincett_thomas When that first sip feeling hits. 👆 @Neeshole It's unbeleafably delish. 😋 @JakeMikkelson And we hope you'll get it again. 😉 https://t.co/9xIYLGmINZ RT @335isaac: Life is better with a pumpkin cream cold brew in hand @bsuthe4 It slaps exactly as hard as it needs to. 🎃💚 @MsYetta_Boo Hello, fall! https://t.co/qxEaZxUvGB @Never00giveup Can't wait to see you! @classsyladie We beleaf it! 🍂🎃💚 https://t.co/afK8pKRjYS Our sun, moon and rising is pumpkin. 🍂 #PumpkinCreamColdBrew 🍂 https://t.co/2EcKi4RLkr @Mazaratti__ Hello, pumpkin! https://t.co/qMIjCQlXXr @navecchis This is not a drill! https://t.co/qMIjCQlXXr @claud__jennings Yes to all the gourd things! @alexissgeee What a twist! @NeoSpawn Almost too cute to eat! @mildwhore Sounds like it was love at first sip! @_lifeasmelissa_ Summer in a cup! @ppP0tt3r So good! @BugzieLove Glad you love it! @penguinslikcake Love this! @jesspenic We feel this! 🎉 @ChetSeamus We don't mess around when it comes to deliciousness! 😉 @deebxbyyy Perfection! @odd_iggy Delicious choice! @Shilora_Henny Enjoy every sip! @jmelendez_86 Cheers to living your best life! @hauntedpaintinq 🍂 It's just the magic of Fall, Bailey! 🍂 @MasterRoshi__ Now, that's the way to start your season! @Clarke_Kels We'd love to hear what you think! @maleeekuh It wouldn't be a celebration if they didn't! 😉 @josie_ferngrove This is clearly a synonym for delicious! @earthtoalaina Perfect way to start the day! @Live_toRide Happy to hear! @imknva Which sip do you enjoy with this delicious sandwich? @azapata27 See you soon? @SkinnyJasmine You deserve a treat! @YungFlxerDenise A delight! @madzogart Your favorite way to start the day? @TiffanyJ___ So refreshing! @ItsPirrip We look forward to the next Happy Hour celebration and can’t wait to share the details with you soon. @Nycmaj23 It's a game changer. 💚 @Clarke_Kels It's paradise in a cup! You should give it a try. 😊 @TashaKennedyDFW 💚💚 @ItsPirrip Hi friend. There's no Happy Hour this week. Keep an eye on your Starbucks app to stay up to date on Happy Hour news. @srhmyrs Happy sipping! @MaybachBeauty_ We try to tell you! It's around all year so you can catch up on sips. 😉 @MikeLaylow It totally warms our heart! 💗 @alohamel808 Enjoy! @TashaKennedyDFW It is! @2bagsofshrimp Nice! @ahoymayteaa Enjoy! @jo_smith14 It's not a weakness to know what makes you happy. 😋 @Bunny_Gomez_ Sounds like we'll be seeing you soon, friend! @TashaKennedyDFW Hoping you can get that last ✅ soon! @Jukeema_ Extra napkins needed for this mouthwatering sip! @2bagsofshrimp Did you pick up your cup? @amodernkhal The Pumpkin Cream Cold Brew just hits differently! 🙌 @ryhiellejam97 Cheers! 💚 We see plenty more Salted Caramel Mocha sips in your future! 🔮 @vgigi1909 Love you too! 💚💚💚 @vgigi1909 Someone who recognized that you deserve some joy! 💚 @lexcee28 Embrace the pumpkin spice! 🙌🎃 @catboyyeonjun Almost too cute to eat...ALMOST! 🦊 @Goss2Bay Drool-worthy! 🤤🎃 @reghanxo This is a fact! 👏 @mornincoffee Any takers? 👀 @Pur3Div3rg3nt Cheers! Awesome teachers deserve a treat. 💚😋 @TheBurrowsWay Pumpkin Cream Cold Foam + Cold Brew = An iconic duo! 🙌 @xM1stress We see no lies here! 👏 @jinniespurpose Y'all, listen up here! 👏 @Sky_marie23 Who's got this one? 👀 @nic_daniellee Embrace the Pumpkin Cream Cold Brew life! ✨🎃 @ryhiellejam97 Chocolaty, caramelly, salty, and sweet? Yes, please! 😋 @SOPODSTORM Sounds amazing and actually is amazing! May that Salted Caramel Mocha come to you soon. 😋 @heartlvcket You're living your best life! 💚 @soulcondition What did you decide to sip? @pieceofB It's your season! @s_gwinn They're both gourd but we see you've made your choice! https://t.co/851DjpjO9t @emreyurrtt You turn into a Pump-Queen! 👑🎃 @allie3ga You're the real MVP, Allie! 🏆 @willothewoods Yeah, let's  go with coincidence. 😅 https://t.co/z4ihOYa32o @crayonanddirt Yes indeed! https://t.co/QZ0Ih5opAj RT @RedSays: First salted caramel mocha of the year. It’s officially fall and time to start holiday shopping. @alohamel808 There's Fall in your cup! 😉 @lisale24 Sometimes you have to follow your heart! 🧡 @dosesofdemi YAY! 😍 @MegDoty6 Don't forget the boots! 😉 @ADTRChick Happy to help you live your best life! 😉💕 @cortyp7308 This is something you can do now, Cortney! Simply download the latest version of the Starbucks app or order ahead by visiting https://t.co/5C3QXYe968. @haniecarr It's definitely the pick of the patch. @lareen_ElRifaei Good enough to be your fall favorite? 🤞 @ASalmins89 We are launching Starbucks by Nespresso on Nespresso Vertuo Line machines in early 2021, available where you buy groceries. @NationKolton No worries --  hakuna matata, as some would say! The full playlist has almost all of those:  https://t.co/AZn2JDQFPN @bvtgill While we’re no longer sending out physical Gold Cards, you’re still eligible for all the benefits we offer and purchases will immediately count towards earning Rewards. This means you won’t lose your benefits if you don’t earn 300 Stars in a year like before. @queen_anaika It's a definite hit! 🎃 @JesseLulla Here's to remembering. 🎃 https://t.co/ldgVGvZx18 @chirvq23 https://t.co/3toF1v5Fwb @ayonahudson Starbucks Delivers is available on Uber Eats! Check out https://t.co/FT9Kh0PvhK @CodeNameNinaSim Starbucks corporate has no affiliation with Planned Parenthood. It’s our Foundation that matches partner driven 501 (c)(3) contributions. @d_anax Hope that means it will soon be in your cup.  https://t.co/ldgVGvZx18 @jas_02_18 Thanks for the tasty suggestion! Please note there is dairy in the pumpkin sauce, though. @mhmokay6 💙 @ShainaV It's currently at select stores in the Midwest, but we'll let you know if that changes! @CheckEric We apologize for any confusion! Star Expiration for the months of March through June were extended to July 1. This was communicated via email, the Starbucks App and at https://t.co/WMpwMyUw5f. Be sure to opt into email updates for important news about Starbucks Rewards. @rayxsmart Fall sips are sure to bring all the Fall vibes! If you're looking for more, dial 1-833-GET-FALL to hear some familiar cozy sounds that are sure to remind you of the coming season. 🙌🍁🍂 @hannahsitarz It needs you too, Hannah!  https://t.co/Sn9gnhJ0D1 @sailorkea It's eagerly awaiting your reunion.  https://t.co/Sn9gnhJ0D1 @RaisingWyatt__ Right now Starbucks Delivery is available in select cities. Simply download the Uber Eats app and search “Starbucks” to see if it’s available near you! If it’s not, don’t worry, we’re rolling it out nationwide soon! @ThePhoenixRisi1 You can't beat a salty, sweet sip for a morning pick-me-up or afternoon treat. 😋 @jibzhere Looking forward to giving you an unbeleafable sip. @xFrench_Roaches Agreed! 😋 @fuzzycatsocks We'll put your name on it. 😉 @lexydray 💚💚 @ashmardavv 💚💚 @karaisabellaa 💚 @Ketchup_Jr See you soon! https://t.co/ql2DigcB6U @Ketchup_Jr Pumpkin Cream Cold Brew is very motivational. 🎃  https://t.co/ldgVGvZx18 @erinashleyx Apologies for the inconvenience. Due to the brewing process, we’re only able to make a limited amount each day. @karaisabellaa Happy it was a hit! 🎃 @ms_fishscale Glad you're enjoying it! @onufreyonboard 😋 Cool air. Golden light. All right. \n🍂 #SaltedCaramelMocha 🍂\n🍂 #SaltedCaramelMochaFrappuccino drink 🍂 https://t.co/VXXiHKbfxU @maeecapulong Looking forward to sipping one with you! https://t.co/J9xALyJeJA @sskkrrrt We do and it's so gourd! https://t.co/qMIjCQlXXr @chlolabriee Oh my! 😋 @itsmeangelicaf 🍂 It's that Fall mood! 🍂 @ecksophia That's one way of seeing it! 😉 @Rawkillemallah We're sorry for any frustration. Not all of our licensed locations choose to participate in our Starbucks Rewards program. We recommend visiting a company-owned, stand alone location to redeem your rewards. Thank you. @JadeBrooklynn Yes! It's nice to be on the same page with our friends. 💚 @baekprnt ✨ Excuse me, Belle, but you're glowing! ✨ @JadeBrooklynn We sure can! Isn't it spicetacular? @calebpmoore Pro Tip: Listen to Caleb more. (See what we did there?) 😉 @BreElainee Sooo you're lowkey a Pumpkin lover? 😉 @michelleames 😉💚 @michelleames That's wonderFall to hear! @alysin__ It's your season! 🎃 @michelleames Enjoy it all! @aphiil_ It's a gourd start! 😉 @reyesvicky_ Delicious, Fall style! @soprettytcthink Looks like a full moon tonight! 😉🌑 @juliadavis02 🎵 Sometimes parents just don't understand! 🎵 @YoLickMyToe We're sorry to hear that was your experience. Please let your local barista know next time, and they will be happy to make you the drink you prefer. @courtneylyn_4 And the Siren is always right. 😉 @GrifolsDonor Sip, sip hooray! @pointmehome Awesome! @alexadmcpherson That's a whole latte love! 💚 @Onlylizmarie Sounds like you walked right into your Fall destiny! @ConnorLicc Mocha it up, Connor! We hope that you get to try our adorable Fox Cake Pop the next time you stop by. 💚 @AnnavonhP Cute and sustainable. Win, win! @Angelovinq Pink Drink is always a good idea. @kaMIKAze__pilot Mmm yes, please! 😋 @DactaLyct Hope to sip with you today! @breannagammble That's for sure! @BreeCalderon24 Gourd tier! @arelyvaldez21 Your favorite Fall treat? @TaylorHusong Enjoy all Fall moments! @TeniePhd Aww! It's never too early to think about your favorites. Stay tuned for the joy to come. 💚 @URNOTPRECIOUS 😘 @_roccyy The wait will be worth it after that first sip! @cwaldordz Stop by, Christian! We'll brew one up for you. 😉 @lordmemerking What? It's true. @gossiperrrr Anything to leaf a smile on your face! @sjoegriner Don't ever let anybody treat you like a store-bought pumpkin, you're the pick of the patch! @videlless ✨ It totally has a certain glow! ✨ @rafalafaa Thanks! 🧡 @folkloreholland BIG MOOD! 🎃 @rafalafaa Happy Fall! 🧡 @bbbbaaaiiii Gourd deeds always get rewarded! 🧡 @lexydray It's spice-tacular. 🎃 @alexis_peralta1 Now that's how you spice up the season. 🎃 @kinqkristy It's absolutely the pick of the patch. 🎃 @kelseycoles99 Definitely a drink everyone should give a chai. 😋 @shellistevens Pumpkin Cream Cold Brew is the pick of the patch! @chey_chey41 That's so nice! @AwkwardHug They are back in the US and Canada! @courtney_marlo Hooray! We love to hear that. 💚 @oliviamausbach You pump-CAN do anything with that sip! @makingbabylamb Sounds like you are falling in love with that drink. 🍁💚 @andrew__rivers The Nitro Cold Brew Black in a can has about 155 mg of caffeine per serving. @mangamaniacs We hope you enjoyed every pumpkin moment! @KristaIsWinning It's definitely the pick of the patch. 😋 @MusicEffLove The whoa of nitro got you, friend. 😋 @lexxsg_ How about a Pumpkin Cream Cold Brew? @xjewelsss It's a whole mood. 🎃🍁 @vaniwwa Our Pink Drink is the Strawberry Acai Starbucks Refreshers, just made with Coconutmilk instead of water. So we'd recommend sticking with the Pink Drink. @hunterrry0 There's no fear in admitting you love something so tasty! @Sutteki28 Stop by and see us soon! @URNOTPRECIOUS Two delicious choices! @Angelovinq What did you get? @GrifolsDonor Did you love our Pink Drink? @Dmoney424 A perfect pair! @cummin4bey Our Strawberry Acai Starbucks Refreshers is a winning sip! @Counselorchirps So delish! @courtneylyn_4 That husband, he's the sweetest! @LezzyyLee We wanted to give you pumpkin to talk about. @sjoegriner Spice, spice baby! @POISHANOUS OMGourd, enjoy! @dopeymorris So gourd! @TeniePhd Did you have your favorite Fall treat yet? @gossiperrrr That's the sweetest! @bilIieeilish_ Say it louder for the non-beleafers in the back! @Deja_Lynn The feeling is mutual. 💚 @SamuelDodsworth We love gourd connections! @danzjavadog Off the charts! 😋 @YoLickMyToe We can't wait to see you! @Noli_Poli Cheers to that first Fall feeling! @emaillyyy Sometimes gourd love is hard to come by! 😉🧡 @jodiaw It has a special place in our hearts! 🧡 @ryannnhudsonnn So close! @shaniachristii We've all been there. 😌 @LonnaSchaff Enjoy every gourd sip! @KristinaLomeli You've gourd that right! 🎃 @QueenAshley75 Indeed! https://t.co/3mW9jGKw38 @deelongspencer Welcome to gourd sips! @musiclover620 Looking gourd too! @Ringmaster2015 Lean into that Fall feeling! 😉 @MrsJulianna Sounds like you need the coziness of the Pumpkin Spice Latte! @emilyyyy_r Muah! 😘 @AmazingKrew 💚💚 @evothedude It's a sip of cozy! @AnnavonhP OMGourd it's delish! @LonnaSchaff Absolutely! 😋 @_baleighhud Don't sleep on our Pumpkin Cream Cold Brew. @CarlyBardino Gourd hard or go home. @ShainaV Awesome! That makes our day. 💚☀️ @aleahesj What a wonder-fall way to start the day! @milkajenia That looks so gourd! @ghitalrst Spice, spice baby! @lordmemerking Everybody loves our Pumpkin Spice Latte! @c0fym0f Life is gourd in the fall! @YasiQannati That's a delicious thing! @XOXO_LATONYA It's a wonder-fall world when sipping a PSL! @afsha_kasam Hooray! 💚 @AmazingKrew It's a whole mood. 🎃🍁 @SWytovich OMGourdness, we're glad you love it! @nicolepruett1 We're glad you love it, Nicole! @zoobug They are available now! https://t.co/w2gFl08Lht. @Deja_Lynn Can't beat a salty, sweet sip! @MihelichMegan Nothing better than having a seasonal and year-round drink to love! @nduranddd Cheers to finding wonder-fall favorites! @_teensxo It's that gourd, gourd. @theleoladyy It's not being dramatic, you're just telling the truth! @AhFeE Autumn’s up! @_roccyy A pretty tasty life. @ShainaV Oh no! We hope you got the chance to stop by again. 💚 @TeAmoShante We love sipping with you! 💚 @royal_parx Stop by and see us soon! @zanesvlog It's our pick of the patch! @ReynaCabrera_ You're about to have a really gourd day! @YouNeed_Jasmine Sounds like you have a new fall favorite. 🤞 @priscillajunora Happy to leaf a smile on your face. 🍁🎃 @HannaTheHP600 Cheers! We hope you had a wonder-fall Birthday! 😍🍁🍂 @alli_rose90 Letting the gourd times roll with that sip! @afsha_kasam As long as there's a drink to leaf a smile on your face, we're happy. @kbrewww We think go to Starbucks and get a Pumpkin Cream Cold Brew. @katrina_cherise This is beauti-fall. 🙌🍁🍂 @lilgrosado Happy to leaf a smile on your face! @Luceroaavila Happy Birthday! 💚 @ashmardavv A wonder-fall bite. 😋 @MCookiz OMGourdness, that looks wonder-fall. 😍 @lunaticbitx Uber Eats is our exclusive partner for delivery! Download the Uber Eats app and search “Starbucks” to get started. 💚 @holly_halstead OMGourd, now we're blushing. 🥰 @JennCantu86 We're glad you're loving that treat! @Melissa_002 💚💚 @mhumpr Hi friend. You can enjoy decaf espresso drinks by tapping the \"Espresso and shot option\" when ordering that item. Enjoy! @chlroine Hi friend. You can enjoy decaf espresso drinks by tapping the \"Espresso and shot option\" when ordering that item. Enjoy! @supkarina It's clear which wonder-fall sip is your favorite. 😉 @rockxxstar You like what you like and that's what matters! @_Kevinpatel Nothing better than a salty, sweet fall sip! @brenda__26 Sounds like we'll see you soon! @hirajivani OMGourdness that treat is delish. 😋 @Melissa_002 It's definitely the pick of the patch. 😋 @TexasGirl410 Our Pumpkin Cream Cold Brew is unbeleafable! @ericasch7 Very gourd info indeed. RT @LeTipsyLlama: Starbucks decides when fall is here, thus Starbucks releasing pumpkin spice latte again means it’s fall y’all 🥰🍂🍁 @Niala_93 We like your style! @bigballercl3m Always stop and get a PSL first. @Zizzyob We appreciate this kind of commitment! @mvrqo Pumpkin Spice Frappuccino®! @jnowak_asl Yum! @eIisedas Our Pumpkin Spice Latte is now available in the US and Canada. @HottMessySessi Spicetacular! @jimmyaklimowicz We support this new method of measurement. @daydreamrem It's a good time to have a gourd time! @ericasch7 We also have a Pumpkin Spice Frappuccino®. Spice it up no matter the weather! @redlava19 Just take a sip, you won't be mad anymore. 😉 @TexasGirl410 Welcome to the patch! @stylesamours You're all in for fall! @JoleenReyes Life is gourd with PSL! @KayyLadyy Dial 1-833-GET-FALL while you enjoy your Pumpkin Cream Cold Brew to hear some favorite sounds of fall while you sip! 😋🎃🍁 @kiwi_kenna We're thrilled you love it! Speaking of listening... dial 1-833-GET-FALL to hear some familiar cozy sounds that are sure to remind you of the coming season! 😌🍁🍂 @Raesvision Cheers to Fall! We're happy to hear you loved every sip! 😋🎃 @CanadayShaun We're thrilled to hear you love it! 🎃 @HMKhanEsq Cheers! 😋💚 @jessicadiamondf You can use our Store Locator to find stores that sell Starbucks Creamers: https://t.co/1O016irutK @Beauty_Brains19 When it's not around, you can enjoy the Pumpkin Bread! @sailorelijah Get your home-rista on! @leannegraace A sip of Fall magic! @Ge_al_7 We're grateFall for the moments when we get to snack with you! @07cappuccino You should try it with a Pumpkin Scone! @cafeconana Here's to you and your true love! 💚 @ABC7Brittany 💚💚💚 @seokjinswaist 🧡🧡🧡 @RyinWonderland We're so happy you enjoyed it! Excited for your little pumpkin. 🥰🧡 @missxocandice We're happy to hear you love it! Cheers to Fall! 😋🍁 @savouredwords Thinking about only gourd things! @conceiteddejj We're thrilled to hear you love it! Cheers! 😍😋 @xo_juss All Hail the PumpQueen! 👑 @KLF31 We're thrilled you love it! Cheers to that first sip feeling! 🙌😊 @katelynmansell Thank gourdness for wonderFall friends! 🥰 @sheepyhani So adorbs! 💚 RT @lovek_ayy: The salted caramel mocha, no whip, made with almond milk? Mannnn God be movin’ @danielleraaeee Autumn-atically transforms any cup into your Fall favorite! 😋🎃 @bayliesnyder5 Cheers! We love a perfect score! 😋🎃 @jessicadiamondf It's available now nationwide where groceries are sold. 😋🎃 @oliviachristy_ Let's get you in touch with @StarbucksCare @oliviachristy_ In order to receive your Birthday Reward, you need to have earned at least one Star this year. If that’s the case, we’re happy to look into it for you. @AmelPatt16 Cheers to Fall! 😍🎃 @maceywithanE Maybe getting the last one IS karma catching up to you. 💚🎃 @sammistemerman Enjoy every bite! 🎃 @crazycatlady829 Cheers to Fall! 😍🎃 @kodinatorrr Both are sure to elevate any sip. 😋 @spookypancakes Let the gourd times roll! 😋🎃 @Artemis_turtle Looking forward to satisfying that craving with you! https://t.co/KLjtIPyFm3 @Miyyanaaa It sure would! https://t.co/J9xALyJeJA @RobertFBanks1 That's it. That's the tweet.  https://t.co/ldgVGvZx18 @__aliana See you soon. 😉 https://t.co/1KHOr9QkTT @donnctellamoss That's its entire business. And business is gourd. 🎃 @Leauxlaa Hooray for Pumpkin Scones! https://t.co/1KHOr9QkTT @KillahbeeStyle There's plenty of time to fall for each flavor. One for now, and one for later. 🙂 @miami_barbiie A gourd way to start your day! 🎃💚 @BackieEmma Delish! Looking forward to the next time you go to it. 💚 @BrandyJena_ We're excited too! Can't wait to share that first sip with you. https://t.co/qMIjCQlXXr @xoxcris Sounds good. Would taste even better. 😉 https://t.co/qMIjCQlXXr @keeeeeliaa Looking forward to that dream coming true!  https://t.co/qMIjCQlXXr RT @henryacuya: i just wanna love someone the way i love the pumpkin cream cold brew from starbucks @BrittRoemmelt Cheers to Fall! 😍🎃 @brandii_o We'd love to hear what you think! @kodinatorrr Do you have a favorite one? 😋 @_ErinSarahxo Thanks! We're thrilled you love it. 😋 @abruhhlin What a guy! @emily_canto_3 We hope it's just the start of a great weekend! @MichelleTater Dear Michelle, you're awesome times 100! @danicaraturo You inspire generosity all around you! @Brittaniicole How kind of you! @___jaydee It's our pleasure! @MarkVuitton Whoa. @kayla_chavez1 That's the tweet. 😋🎃 @ladyriven Cheers! We're happy to hear you like it! 😋🎃 @Millskelly1 Cheers to the gourd times! 😋🎃 @michelineee_xo We're thrilled you love it! Let the gourd times roll! 😆🎃 @monifairies Cheers! We're glad you love it! 😋🎃 @tiffxnyy9 💚💚💚 @PiermanNicole Cheers! 😍🦊 @smaewest A beauti-fall combination. 😍🍁🙌 @clairemezz Cheers! All in for Fall! 😍🍁 @Michi_carrillo You're welcome! @venecyadiaz Thanks! 😉😋 @itsGsusbitch See you soon! 😋🎃 @angie_prev We're grate-fall you're a be-leafer now. 😉😋🎃 @morgan_h_2427 Cheers to a new favorite sip for Fall! 😍🙌 @venejass We're happy to hear you love it! 😋🎃 @Niala_93 Go big or gourd home! @b3yonce_ Yum! Sounds like you've found your favorite fall treat! 😍😋 @mjayx0_ Bold, super smooth Cold Brew, sweetened with Vanilla syrup, and topped with Pumpkin Spice Cold Foam and dusted with Pumpkin Spice topping... what's not to love? 😍🎃 @ehlexiss Beauti-fall. 😍🙌 @_aboutagrrrl 🎃 @brantlieface Autumn's up! 🎃🍁 @ZukiTV131 If loving pumpkin spice is wrong, we don't want to be right! @gloriaglorieta_ Happy Friday, Gloria! @Olivia_Wright23 There's no wrong way to sip. Try it both ways and discover which one brings you the most joy. 💚🎃 @Michi_carrillo Happy Birthday! 💚 @withjessxo We recommend signing up for Starbucks Rewards to get a free food or beverage item on your Birthday! Just download our mobile app and create an account to get started. 💚 @LeTipsyLlama We don't make the rules, we just make the drinks. 🎃🍂 https://t.co/RWou24v1MP @Xellie20 This is not a drill! It's Fall Menu go time! https://t.co/ELzGaOyASj @_TaeMariee Pair with our Salted Caramel Mocha for a pair to gourd to believe! @Run_Shell_Run Go big or gourd home! @iguessitsana Falling in love at first sip. 💚🎃 @mayiii__ Cheers to love at first sip. We hope you'll be very happy together. 💚 https://t.co/LBYnNr9wDq @afiremanslove There's nothing more delicious than falling for a new favorite. 💚🍂 https://t.co/HAh2frCfWW @shelbs__23 It's a sip you won't want to miss this season! @AllForAwkward Fall’s well that ends well with PSL! @APlatt16 Our Pumpkin Cream Cold Brew is a leaf changing experience! @d011facee That is a way to spice things up! @torresss_01 It's beyond beleaf! @anyaspillowtalk You made a gourd decision this morning! @FearlesslyJulii You're all in for fall! @_aboutagrrrl It's something dreams are made of! @allisunshine5 We've been trying to tell you! @ascee_ Spice, spice baby! @Lanababyyyy Pumpkin spice and easy does it! @itsfleee Something gourd was bound to happen eventually. 💚🎃 @MissDeoll Sipping on Pumpkin Cream Cold Brew is still winning, no matter the size. 😉 @kylieeu_ Looking forward to satisfying that craving with you! https://t.co/3WkKvBy4Es @dmx43k Sounds like a delicious way to start the day! RT @themorganiknew: pumpkin cream cold brew: secured\ncardigan: playing\nrain: falling\nfall vibes: immaculate @HarmoniousMelo We're really not sure how to interpret this dream. @80suburbia Sounds like you've got delicious seasons full of Stars ahead. It's your time to shine! ⭐🎃 @PenTaeBomb YES! https://t.co/qMIjCQlXXr @mayleavestars You can't deny the signs! https://t.co/qMIjCQlXXr @_laurapalacio We don't make the rules, we just make the drinks. 😉🍂 @decafwomen Finally! https://t.co/qMIjCQlXXr @littlemissrebma We're falling for these acts of kindness. 💚 @miiirandaaa_m An actual fun fact would be giving one a try! https://t.co/qMIjCQlXXr @criversssss Clearly, you have a favorite treat. 😉 @kszczepanski_ Everything you love about fall in one cup! @jesss_xo1 We're so glad you liked it! @HugoBoss713 So. Much. Yum! @_ashlyrodriguez We hope it was just the start of an amazing day! @drclevenger You're doing A+ work today! @karenpalumbo1 No, that's not true and was never said. Please do not spread misinformation. @dezzloc That's it. That's the tweet. @SabrinaSalazar With that unBELEAFable sip in your hand, you can accomplish anything. @awksjae_ We're honored! 😋💚 @ja_learning Cheers! We're thrilled you love it! 😋🎃 @Intlerlol You can't beat a salty, sweet sip! 😋 @OhLittleYess Hooray! 🍁🎉 @lionheartchance Wonder-fall! 🍁🎉 @SeahorseSaraa A great way to pump up the spice! 😄 @casmalue 🍁🧡🍁 @Weds1 It's the most wonder-fall season of the year! @Darren45xx Sounds urgent. You better pick up. https://t.co/2M5EospgTH @tiaa1622 See you soon! https://t.co/qMIjCQlXXr @Hucks_mom It's #PSL o'clock! https://t.co/qMIjCQlXXr @frvrkimjisoo When you're right, you're right.  https://t.co/ldgVGvZx18 @Emily06E No argument.  https://t.co/ldgVGvZx18 @casmalue Hi, there! We would suggest a Flat White with toffeenut syrup. And this year we also have a new Maple Pecan flavored coffee in grocery stores. @hitmemasterr If you mobile order, it will come... https://t.co/1KHOr9QkTT @_mariamoralesss How kind of you! 💚 @Rudeboi13_ Autumn's up! @megan_mcquinn We're so glad we can bring you some happiness! 🧡 @h_alestorm Can we thank you now for such a tasty tip? @BRAYCE Never too late to discover something new and amazing! @KristenBeez We're here for you, even when it's way earlier than you were hoping. 💚 @JamesLeuterio Any of our handcrafted espresso beverages can be made with Blonde Espresso. When ordering your drink in the Starbucks app, choose \"Espresso &amp; Shot Options,\" tap \"Blonde or Decaf Espresso,\" and then choose how you want to customize. @AbigailGorrell We hope you'll be up close and personal with one soon!  https://t.co/Sn9gnhJ0D1 @allisonastra Looking forward to satisfying that craving with you!  https://t.co/ldgVGvZx18 @mamabearashley_ You're one sip closer to Friday! @SamSalmon1 Let the gourd times roll! 😍🎃 @SunnyOkie Stores within other establishments are licensed stores that are owned and operated by the establishment they are within. @Jezziedean Yes, we request that you wear a facial covering when visiting our company-owned stores. Thank you! @Chenita91 It needs you too. https://t.co/J9xALyJeJA RT @mackynziehagen: it’s the drinking a pumpkin cream cold brew when its 75 degrees out acting like it’s a crisp fall morning for me @ali_kcgom You're welcome, Ali! https://t.co/FI5F5lDdkB @oamrtn We're falling for this perfect sip! https://t.co/Ey432WJU2r @delaneykalea Cheers! 🎃😋 @kschmidt34 Happy Birthday! We hope you had a great one! 💚😋 @bettervff Uber Eats was made for online life! Right now Starbucks Delivery is available in select cities. Simply download the Uber Eats app and search “Starbucks” to see if it’s available near you! If it’s not, don’t worry, we’re rolling it out nationwide soon! @alexisiyana_ Our new best friend. 😉💚 @Rosysproblems That's the tweet.  https://t.co/ldgVGvZx18 @aliaespinozaa So many delish fall firsts! https://t.co/nD2YS69EpT @AnaKaren0200 Can't wait to sip one together! https://t.co/J9xALyJeJA @MoriahHathaway Hope it's soon out of your dreams and into your cup.  🎃https://t.co/ldgVGvZx18 @ariiiiiiiii___ Cheers to falling for a new fav. https://t.co/TzfooCqTts @NickiFBabyy At least you're not salty about it. Leave that to the Salted Caramel Mocha.  😉\nhttps://t.co/Sn9gnhJ0D1 @stephanieamcm Cheers to the first sip of fall. https://t.co/QMyT9Rw7Yc @Adrians_rep This is not a drill! https://t.co/qMIjCQlXXr @nytorv It's PSL o'clock! https://t.co/qMIjCQlXXr @thirdeyevibee Finally! https://t.co/qMIjCQlXXr @jynellelopez Say less.  https://t.co/ldgVGvZx18 @kennsnowright A LITTLE LOUDER FOR THE PEOPLE IN THE BACK.  https://t.co/ldgVGvZx18 @comolaflorcita Looks like that Caramel Macchiato craving passed.   😂 @obsesswthcoffee We're sure you'd be a great neighbor. 💚 @princesssbatman Apologies for the inconvenience. Due to the brewing process, we’re only able to make a limited amount each day. @CriticalCutiee Enjoy! @ashleeharrrison We love you too! 🥰 @RyinWonderland We hope you give it a try! @ashleeharrrison https://t.co/BJVzcGStXy @RyinWonderland While we love our standard PSL, some of our friends have been adding White Chocolate Mocha! @lilbituin_acnh Yes, please! 😋 @keelyruesa https://t.co/CECscdL9tE @ABC7Brittany 🍂 Happy Fall! 🍂 @TheMaplesMB Cheers to your fave! @CalamityJayne4 Woohoo! 🎃 @Magallaness24 You never know, you might just love it! @ashleeharrrison Is it your new Fall fave? @CARMAPROMO https://t.co/ETw7AMe3PP @seokjinswaist Hope this is a sign of gourd things to come! @hannah60862345 A pop of celebration to round out the day! @therealDahliacx It's definitely a star! @henryacuya We beleaf true love is on its way. In the meantime, enjoy gourd sips! @dolfinz29 Yes because breakfast with you is always the best! 💚 @MommaJay17 That's no fun! We hope you got your favorite. 💚 @goodmoneysniper Partying in Pumpkin! 🎃 @MaxAim5 Our Siren is pretty magical! 😉✨ @johnnyvxo Enjoy every sip! @papabear4angels Started your day the gourd way! @Andreapillot24 So gourd! @cottagecorehaiz So sorry we missed this! Given the season, we would say PSL but what did you go with? @dmcdonald141 Happy to help you start your season! @kristenraves 🤗🤗🤗 @bilibu Can't wait! 💚 @patriglamx Same! Fall is totally our inspiration. 🍂💚 @thelovelyMC He's a keeper. @bilibu Perfect start to the day! @mabelynmermaid We forgive you... but hope to see you again soon. @gigglepowder If you're in the US/Canada, it's back! @Soliee You're off to a good start! @somecloudguy We hope it was a delicious reunion! @MattMetcalf Looking into a delicious future with confidence. 💪 @TruthAboutRo It is! Look for it in grocery &amp; retail stores, or online: https://t.co/ckoLGBVXK2 @KateGIaser Starbucks Delivers is available via Uber Eats! Check it out: https://t.co/FT9Kh0PvhK @johnburke No, sorry, we don't offer decaf iced coffee, but you can order a decaf iced Americano! @elizabethizkool Which flavor did you get? Meowcha? @queenbmommmy You can order a steamed apple juice with cinnamon dolce syrup! @ShauriRMientus Nitro Cold Brew is on the menu year-round! @KaitlynH_ Adding some extra spice to a seasonal favorite like a pro! @SqueeDeeLee Aw, we love that Donna! @danielaarcos21 You pump-CAN do anything with that drink in you hand. @Emilee0088 Spoken like a true beleafer! @TwilightMoon96 😋😋 @lionheartchance Sounds extra delicious. 😋 @OhLittleYess And, did you love it?! @SqueeDeeLee Bonding over a sip is the wonder-fall! @torifisher18 Wonder-fall! We're so happy you have a drink to love. @taymeeech Good enough to be your fall favorite? 🤞 @heyitsjordnn Enjoy! 💚 @_ptvdestiny Your mornings deserve it! @holmessavannahh That's a delicious adventure! @eboutet_ A delicious sip-mphony! RT @amreynolds19: everytime i get in my car it tells me how far i am from starbucks and i think that’s beautiful @Lacie_13 Clearly, it's your favorite. 😉 @sourthenspicey It's paradise in a cup! We can't wait for you to try these goodies. 😊 @LordHaze73rd Did you get a chance to stop by? @moliza_bee Welcome officially to the family! We love our partners' partners. 💚 @__lovelylexi That sounds wonderFall! 😋 @Lacie_13 When you know, you know. 👏👏 @iammarkrius Add in a little toffee nut for extra magic! @jadeysweet For the love of Iced Coffee! @its__alyy It goes perfectly with a PSL, too! @heyyhoneybee Enjoy! @lovleyjessicaa Extra napkins needed for this mouthwatering treat. @laurafee The most wonder-fall pairing! @WitchBarbie A delicious twist on a fall favorite! @figgs_7 Small bite, big impact. Especially for someone who is foxy. 😉 @Lacie_13 They. are. so. DELISH. 😋 @jonesashley__ Even more perfect when paired with your favorite fall drink! @bbyxssi Can you even beleaf how delicious it is? 😉 @samkutza Hooray! We love to hear that. @ChelseaRene_ All the pumpkin treats are here to help you have a wonder-fall season. 🎃🍁 @17frankieavalos 💚💚 @SESims33 We could use the extra joy! @savageisbryan Glad you love it! @katiero__10 You're welcome! @shleepytiger Hey there! Oatmilk is not available as a modifier because it is only available is select markets. We will update you if anything changes. @Moverton8 We would love to see you again! 😃 @samkutza It was meant to be then! Enjoy your wonder-fall drink. @ChelseaRene_ Delicious down to the bite. 🎃😋 @jcaaf77 Hey there! You can order an Iced Americano and modify your espresso option to Blonde espresso. @17frankieavalos We can't wait to hear if you love it, Frankie! @gershom_shom That's star tier! 🌟 @yvetteRHern82 We hope you enjoy every sip! @katiero__10 Hey Katie! Oatmilk is only available in select Midwest and California stores which is why it is not a modifier on the app. If anything changes, we'll let you know! @allexperez_ OMGourd, having a fall favorite is the best! @malaiye Sounds like we'll be seeing you soon for the beauti-fall pairing. 🎃 @TwilightMoon96 Salty, sweet sips are the best! @Est_MarlE95 That's just how it happens sometimes. 😉 @color_blockd Looking forward to our first sip of fall together! https://t.co/qMIjCQ4n5T @carolinee526 Don't let the temperature outside tell you how to sip! Until the weather catches up, you might enjoy a Pumpkin Cream Cold Brew.  https://t.co/ldgVGwh8pI @DanaPatrick1645 The gourd thing is you know now and that's what counts. \nhttps://t.co/qMIjCQ4n5T @mamabearashley_ Cheers to enjoying fall first sips! 🍂💚 @runpfrun It's the must sip of fall!  https://t.co/ldgVGvZx18 @__nessaboo Thanks for the perfect fall sip score! 🍂💚 @MelissaW06 🎼You don't know what it's like to love a sip the way that Salted Caramel loves you. 💚 @HotGirl_Sha 'Tis the season for Salted Caramel bliss! https://t.co/J9xALyJeJA @solarsaber_ Finally! https://t.co/J9xALyJeJA @SHAYC0LE It's a champion sip! @SOSO91687340 Awareness is key. Thanks for helping get the word out.  😉https://t.co/1KHOr9QkTT @devonsangs We sure do and they're a delish taste of fall! https://t.co/1KHOr9QkTT @SICKERSTlLL Fear not. It's here: https://t.co/1KHOr9QkTT @gwennstacyyyy We wouldn't even try. https://t.co/1KHOr9QkTT @vaal_erie Sip happy, Valeria!  https://t.co/Sn9gnhJ0D1 @CrissyLuvz If only every problem was so delicious.  https://t.co/Sn9gnhJ0D1 RT @zandersz_: I literally did a little happy dance when I took my first bite out of @Starbucks pumpkin scone. I literally ate this almost… @sunshinetommo28 Thanks for the most perfect sip score of fall! @catherinesa_ We believe it!  https://t.co/ldgVGvZx18 @_gaabylazz So glad you're enjoying a cool taste of fall!  https://t.co/ldgVGvZx18 @xojamieeeee Looking forward to sharing your favorite with you! https://t.co/qMIjCQlXXr @gasstationnacho One reason to live coming right up.  https://t.co/Sn9gnhJ0D1 @chynnacoffin Answer the call!  https://t.co/ldgVGvZx18 @thejogeorges We love it when you find a new favorite! @hanngrace00 It definitely wouldn't hurt.  https://t.co/ldgVGvZx18 @OhKnina While it's flattered by your devotion, Iced Caramel Macchiato would never ask that of you. 😉 @NCarrasco1231 We love to see you smile!  🎃 @comolaflorcita Can't wait to satisfy that craving with you! @SophsR1 Can't wait to share that first taste of fall with you! https://t.co/qMIjCQlXXr @BBY_JOSEE Looking forward to sharing a sip together!  https://t.co/qMIjCQlXXr @_gaby819_ Smile, Gabriela! 🎃 https://t.co/qMIjCQlXXr @savageisbryan Let your 'friend' know that he can make a similar sip using our Pumpkin Spice Coffee. Paired with the Pumpkin Spice Creamer, you...eh, he can enjoy the flavors he loves! 😊https://t.co/w2gFl08Lht @BrittRKay Sounds incredible! @glamouriella A sip of the gourds! @blvckjckls Enjoy your favorite right at home! @westerninfidel2 How good is it? 😉 @irenelovesdrew It's only right to ring in the new month with a gourd sip! @sydken4 Delish! @juliaax13 Somebody's got a Fall crush! 🎃 @xMandiMusicLove We're happy to hear it! @PaigeCatton Looking gourd! @hannahpara215 Guess you needed to find the right brew! @AshleyCranee Sounds like you've FALLen in love! @vivalaMICKEY_ And sooooooo cozy! @__gensei We hope to see you soon! @IndelibleFink That's the spirit! @Stayingstrongxo How kind of her! @nessgonzales Yum! 💚 @laylerrrr Sounds like you're a Fall kind of girl! It's our season too but sadly, like Fall, the magic of our Pumpkin Spice sips don't last. At least we always have something to look forward to! @xMandiMusicLove Was it everything you dreamed of? @faderoses Can't wait! @nessgonzales We beleaf in you! 🍂 @faderoses We heard it's leaf changing but you should judge for yourself! 😉 @BrunetteJenner How about one of these?\n💚 Salted Caramel Mocha Frappuccino\n💚 Pumpkin Cream Cold Brew\n💚 Kiwi Starfruit Starbucks Refreshers @cuteasabella Wonder-fall! We're glad you liked it. @dawsonjones105 Everything you love about fall in one sip? Game changer. 🎃 @CharlesTStella We try, we try! 😆 @whititandquitit We're pumped to know that you approve! 😍 @WxJoeA 🍂 Autumn's up! 🍂 @sourthenspicey We love chatting with our friends, Amber! You should switch it up with a Salted Caramel Cream Cold Brew. 😋 @ncgraha Thanks for the kind words, Nicki! We'll be sure to pass them along to the store manager. @cdatrain Enjoy! 💚 @CharlesTStella Sounds gourd! @EWatscn Sip sip hooray! @amreynolds19 We love being part of your journey. 💚 @yulaaay4 https://t.co/z5NRA9cGXq @danigirl027 All the feelings! @SayItLikeASag 💚💚💚 @miaorozco967 Mic. Drop. 🎤🎃 @meagannsawyer That sounds delicious! @lil_ole_netty It's the perfect fall topping to your cold drink! @Talhelm_PSH_GME Autumn's up! 🍂 @nathanearle_ Glad we could help brighten your day, Nathan. ☺️ @_xoxomomo We love being part of your day! @DakotaMichael_ We're here for you. 🤗 @notpuxies Buried treasure! @SusanRodriguez7 We're so glad you love it! 🧡 @dianasaurrrrrrr 😊 @jpig1325 The little things can make the biggest difference. 💚 @eternallyinawe Shoutout to divine intervention! ✨ @CharlesTStella She can pre-game with the Pumpkin Cream Cold Brew! 😉 @dianasaurrrrrrr Your mom is the best. 🧡 @Maddie_May7 It's a wonder-fall time of the year!  🍂🧡🍂 @zandersz_ We're happy you're so happy. 😊 @glambycat What a sweetie! 💕 @jvhn_b94 💚💚💚 @TheMANdaLover13 Welcome to the gourd life! @markwluv What Fall dreams are made of! @catholicgaby We would like to clarify this. Please know Starbucks corporate has no affiliation with Planned Parenthood. @kayra0731 It gets the party started! 🎉 @darin_bauguss Happy Birthday, Super Dad! Enjoy all the gourd things. 😉💚 @robotfoxxx Pro Tip: When she finds her favorite, tap the heart next to her order so it's an easy find when she orders again. It will be under favorites. 😉 @thenerdylmt https://t.co/AVDk26g7R2 @ChillDeville Act now. Don't delay! https://t.co/3WkKvBy4Es @noor_alizzy It's the most wonderful time of the year and it's here!  https://t.co/Sn9gnhJ0D1 @xcoxoxe No need to wait. It's back! https://t.co/qMIjCQlXXr @alexa_d6 We're pretty happy about it too. 🙂 https://t.co/qMIjCQlXXr @lcooney We love it when you find a new refreshing fave to enjoy! @malashiacarter Looking forward to sharing a sip with you! @vibewithdye Pretty in pink. 🌸 @_RaquelGuevara Looking forward to our next sip together. @RealBosque It's a champion for sure! @StephanieNLerma They make every day taste like your birthday! @kelsbaker19 The gifts that keep on giving! Happy birthday, Kelsie. @SaidSteph__ The first one of the month is still a first. 😉 @bnanna9 That drink is not returning but we do have a new Maple Pecan flavored coffee in grocery stores and on Amazon. https://t.co/uJ0szCWgG7 @_celestiaal So glad it's back for Fall! @amelb8 Bring on all the Fall! @taidreana15 Glad you think it's a hit! @SaidSteph__ Of course! The 1st is the perfect day for firsts! 🍂🎃 @SubhasiniMishra It's delish! @moliza_bee Oh happy day! 💖 @dluvs2laugh03 It's back! Enjoy a taste of fall. https://t.co/1KHOr9QkTT @lilysworld129 Today will have to be soon enough.  https://t.co/ldgVGvZx18 @WMurphyNews 😉 @insane_Dana Thanks for starting your day with us! @jennie_massey Cheers to fall first sips! https://t.co/B4n9NkQGw2 @insane_Dana Calendar? What calendar? 🍂🎃 https://t.co/qMIjCQlXXr @itsemilycharles At least the research will be delicious. 🎃 @bua_gomez The answers you seek are here: https://t.co/qMIjCQlXXr @Megan_Tran Thanks for keeping the kindness going. 💚 @MarkTaylor Aww-tumn. @elyseltorres We hope you'll be very happy together. 💍💚🎃 @keithdmoses Pumpkin Spice Latte might not be powerful enough to save 2020, but at least it gives us hope for a light at the end of the tunnel. @nora_noranb Gourd big or gourd home. 🎃 @hollyjolenee Timing is everything. 🎃🍂  https://t.co/ldgVGvZx18 @lunaxisle 👀 https://t.co/qMIjCQlXXr @TheCherubGarden Give in to delicious temptation! https://t.co/qMIjCQlXXr @Megs8199 No apologies for enjoying delicious firsts! https://t.co/qMIjCQlXXr @ysldearest Can't wait to see you! https://t.co/qMIjCQlXXr @TMLAROCK See you soon! https://t.co/qMIjCQlXXr @theanjum_ There's no denying the signs. 🍂🎃 https://t.co/qMIjCQlXXr @brav0bitch We think you already know the answer to that. 😉 https://t.co/ldgVGvZx18 @meaniesbeanie Can't wait to see you! https://t.co/qMIjCQlXXr @dyyyla_ Done. 🎃 https://t.co/qMIjCQlXXr @__isabelll We brought it back last week. The weather just needed a chance to catch up. https://t.co/qMIjCQlXXr @MrsAnthropology We’re excited to bring oatmilk to select stores throughout California and parts of the Midwest and look forward to hearing their feedback. @DeetzDaisy No problem that another Pumpkin Cream Cold Brew can't solve. 😉 \nhttps://t.co/ldgVGvZx18 @cdatrain Play it again! 😉🎃 @sourthenspicey What a treat! @AmberrPharm Cheers to Fall joy! @jreneefp You made a wonderFall choice! 😉 @DeizyAlvarez A taste of Fall all year round! @AlyssaWedmore Solid advice! @MarkTaylor Fall's well that ends well. @shaelynavalon Your pumpkin is waiting to be picked! @Evie_Ember Just what Fall called for! @MarkTaylor And then we'll come fall circle. @finnegan_debbie Thanks for keeping the kindness going, Debbie! @sequence04 Thanks for stopping by, Elaina! @MarkTaylor Rake it 'til you make it! @Judelqui 😍 Gorgeous! @PhilStrawn Don't worry, we have it covered! https://t.co/fjvQyiXEG6 @lyndseysmean It's what Fall dreams are made of! 😋 @wi1dfir3wife Back to mocha your season better than ever! @justcallmebai We hope you got your delightful treat! @arijxoxo Happy Fall! 🍂 @jreneefp Come through with the gourdness, hubby! 💚 @Alexandrrriiia You can always have gourd sips right at home! https://t.co/UFQkB12ANs @drnkbleachdaily *Oh my gourd. 🎃 @rebblossoms Spice, spice baby! @Sarah73015815 We hope you get a chance to sip with us this season! @Mariahnicole16_ Let's pumpkin spice things up! @mahoulove Then our Salted Caramel Mocha is for you! @amundred1 OMGourd that looks delish! @evelynnS___ We should be offended by your doubt, but we're going to let the gourd times roll and celebrate the fact you enjoyed our Pumpkin Cream Cold Brew! @S1thgaming Bet your autumn dollar! @Alissa_Gomez4 It's fall coming back to us now! @medullsus There's no party like a pumpkin party! 😉🎃 @riffe_haley The definition of delicious! @CShonteB Thanks for sharing your thoughts, Christina! We'll keep this in mind as we are continuously making changes. In the meantime, we hope you try our Salted Caramel Mocha! @GraveDancer40 It's a gourd day for you, friend! @stinkpie Oh, no. You're too cool for us. @cziriak_ You can do it! Just think of the spice! 🎃 @p0nchy Glory, glory fall-elujah. @Yamscasino Let the haters hate and just enjoy your Pumpkin Cream Cheese Muffin. @mattyalms Everything this season deserves! 😋🎃 @lindseyodena Sip it up, Linds! @phiaflow Happy to hear! @MichelleeSimply What did you decide? @RachaelShuman Noted! It's definitely a gourd treat. 😋 @itsnotmeitsuu Hooray! What sip is making you happy? @CoachMohring Happy birthday, Coach! 🥳 @xoveroniicaaaa Kindness matters. 💚 RT @corksandcoffee: Tried the pumpkin cream cold brew and 😍 https://t.co/lZO7QqDiei @MarkTaylor Foliage is power. @Vanababy_310 Thank you for keeping the kindness going! 💚 @gothbabysam You pump-CAN do anything with that drink in you hand! @emilyjbevans Cheers to that! 🎉🎃 @j3ssucka Need extra Fall feels? Call 1-833-GET-FALL. 🍂 @jjrenaldy Happy birthday! 🥳 @OculusDrip 🧡 @RadiantlyCandle Yes - nutrition info is available on our website: https://t.co/MQ2NZCySKq @rexyoungdotcom No livestream this year but feel free to call our Fall hotline at 1-833-GET-FALL. @xannyphantomm We would love to see you! @HannahHall9 Honestly, sounds delicious! @EmKeene34 Elevating your fall, one sip at a time. @_CaramelGirl Hooray! We're glad you love that drink. @booksnlattes This whole picture is a mood. 🎃 @gabicwikla03 Such a perfect fall pairing! @melvinopolis Happy birthday! @honey_covee Salted Caramel Mocha chooses you! @SunshineFuente5 💚💚💚 @Holly_Rachelle 🙌 @TruReflections We miss you, too. 💚 @ActivePsychosis Cheers to the return of Fall favorites! @hausofkaleb We love Guatemala Casi Cielo paired with lemon loaf too! 😋 @corksandcoffee Was it love at first sip? 😃 @edesimon Hello, thank you for reaching out. I’d love to see what I can do to help you. Can you please send me a DM with the location of the store at this link? https://t.co/ifXnzspJpX -Kevin @hamonsalivia Call 1-833-GET-FALL if you're ready for Fall feels, Alivia! 🍂 @achrose2000 We love to leaf a smile on your face, friend. 💚 @Baileywinters97 You bet your autumn dollar it is! @Kevinyo09400144 We can't wait to see you, Kevin! @Honeypottt Thank you for the feedback. It is true that Stars expire 6 months after you earn them, but please note that has been the case since 2016. You can learn more about your Stars and the Rewards you earn with them at https://t.co/3ktu65gD6c. @elewMD Hi, Dr. Lew! Please follow and DM us when you have a chance. @t_estrellla Hi, Tiffany! When you have a chance, please follow us and send us a DM. 😃 @_adriimarie_ You're ahead of the carve. @ItsNotion It's the pick of the patch! @itsLiviaaa Have a gourd semester! @paciorettys You're all about spicing things up! @Lux_ternity Go big or gourd home! @codylandaker There is still dairy in our pumpkin sauce. @_mirandurrr You better beleaf it! @ryanczech Cheers to your 35th first day of school, Ryan! @_fawwadkhan You're all in for fall! @lewis_beachy One season at a time! @MsMarie206 Life is gourd with a Pumpkin Cream Cold Brew! @Kholddheartedd Stop by and see us soon! @drnkbleachdaily He's a winner in our book. @achrose2000 Hooray! @RyanTonyHernan1 Thanks for making us part of your day. Hope you have a great Monday! @LoveeCloud So many ways to enjoy salted caramel this season! Salted Caramel Mocha (hot or iced), Salted Caramel Mocha Frappuccino blended beverage, Salted Caramel Hot Chocolate... @miranduuhr Moments of kindness are small miracles. 💚 @amey_akayla Add a PSL to your schedule! @Ms_Lady38 We'll pencil that in! 😉 @kfernandz 💚💚💚 @kfernandz He's the real MVP! 🏆 @ShanghaiSix Your technique is spot on. 😄 @sammyd1017_ Thanks for spreading the delicious word, Sammy! @veldadraws You are correct, the beverage cannot be made completely dairy-free due to the pumpkin sauce. @peysaprocky Kindness is everything. 💚 @emilyaloisiah Such a beautiful coffee! We love its smooth body, bright lemon notes, and a lingering cocoa finish. @susiee_mm It's heavenly! @Trepp_Westridge Hi, Miss Trepp. When you have a chance, please follow us and send us a DM. Thanks! @luisemiliolopez Guatemala Casi Cielo is back in stores now! @haugheaven Keep spreading the delicious word, Michelle. 🗣 SALTED CARAMEL MOCHA IS BACK!!!! @SupaaflyyyxD Order ahead with Mobile Order and Pay and you won't have to wait in line! If curbside pickup is available at your local store, that's a great option too. @dylan87007208 Happy to let the gourd times roll. 🎃 @MeganaSadler https://t.co/DqtCJunOyZ @k_turner8 She thinks about you too. @jameslovesfilms Have a wonder-fall day! 😃🍁☕️ @whitney_nicole6 Thanks for making us part of your day, Whitney! @emchosen98 You know what's good, Emily! @mamafearless13 Cheers to the return of your Fall faves! @beckybye Guatemala Casi Cielo is back! And your store may be brewing it today as a featured coffee. @mxmonika Excellent choice. @TheJuliMoreno You can ask your barista to make your Salted Caramel Mocha with non-dairy milk, no whipped cream, and without the caramel drizzle. @Crazygamer360 💚💚 @mtgeekchick Sorry, no. There is not a sugar-free pumpkins spice sauce. @Backpackjohn1 PSLease enjoy every sip! @Crazygamer360 We can't decide. That's why this sip is perfect! @ShilaBui Congrats on finding true love! @Crazygamer360 That drink adds extra spice to the season. 😋 @redranger36 A wonder-fall reminder to enjoy your favorite sip! @achrose2000 Sounds like we'll be seeing you soon! @SamiEmm13 You're absolutely right. 🎃💚 @Unbreakable_mo Cheers to that! Enjoy. Here’s to not knowing the day, but knowing what to order. \n🍂 #PumpkinSpiceLatte 🍂  \n🍂 #PumpkinCreamColdBrew 🍂 https://t.co/Zesgov4GTp @symphwrites We hope you love every drop! @AinsleyHope6 A true beleafer. @kainewed Now you're a true beleafer! @itssmayy We tried to all last week! @iml__ Go all out! We support you. 🎃 @itsmepradatears We're all in for fall! @BeccaLimore It's absolutely not ridiculous. @itscorlababy We've been trying to tell you! @xxRH_potatoxx Pink Drink! @ciderae1 The answer is always Pink Drink. @samiyra_ Is that really a flex though? @AnnikaHopp6 Stop by and see us soon! @SariahTynayah Yes, it is sweeter, but there is also a creamy and tropical taste because of the Coconutmilk. @Dontaezinferno She was ahead of the curve! @poncheezie It happens to the best of us. @ellierose623 Um, yes. @ShyniseMonay We second that! @beau_tiff_fulx3 You're doing a great job, Mama! @VintageeBeauty A refreshing sip of spring no matter the season! @XCandiceJasmyne You deserve it! @konwatsitsiawis Oh how the tables have turned. @nonamerising Come on over! @ElderflowerSoda We're glad you like it, friend! @Rock02013 Perfectly refreshing! @mvribell Our Mango Dragonfruit Starbucks Refreshers is a very popular drink during the summer months. Your local Starbucks should be restocked shortly. @illusionwalls Sometimes you just need a Mango Dragonfruit Starbucks Refreshers. @ShadiyaWilson Adding lemonade is always a good idea! @zoewontstudy That's a good one to get! @ZAINAB_ALMATAR Sorry, no. Your Starbucks Card cannot be used on UberEats. @smeLLyphant37 Happy (belated) Birthday! 🎉🥳 @zyxkatee Happy Birthday Friend! 🎉🥳 @Kaaathaay_ Pumpkin is that important. 🎃 @baconmeggcheese Happy Birthday! We're glad you got to enjoy your favorite drink. @alexis__9728 💚💚 @arb100sf We hope you enjoy every sip, friend! @mer1921 You're very welcome! @GlowbyBrandy That will do spicely! @veldadraws You can request to have our Pumpkin Spice Latte made with Coconutmilk. @brittneymccall Let the gourd times roll! @miaaaanj Yum! @mer1921 Great question, Christine! While blonde espresso drinks no longer have their own button in the app, you can still order them by going to your favorite espresso drink (aka Flat White) and tapping the \"Espresso &amp; Shot Options.\" You'll find blonde espresso there. Enjoy! @Livinoptof 💚🎃🍁 @_kaylaanicole We're all in for fall! @AinsleyHope6 It's time to spice things up! @BackstageBarbie Enjoy! @iIIIicitaffairs Don't sleep on our Pumpkin Scone! @ooochaey We just thought our friends would really love a PSL. @alexis__9728 Sounds delicious! @Livinoptof Hooray! We're glad you like it. @amberlsiciliano The perfect bite of fall! @swiftiebaddie13 Mic. Drop. @juliazhangg There's nothing dramatic about loving what you love. @patrickcmurphy Happy birthday friend! @sxxfls It's an easy treat to fall in love with! @tarynattheseams That's the spirit! @HarmoniousMelo Coffee + friends = the perfect blend! @rachelgreene116 We know, this weather is unbeleafable! @cbabiedollx3 Speaking the truth! @Ian_n_wells Sipping your favorite drink never got easier than this! @LexeiMann Just doing our part to make you happy. 💚 @sakim95 We love when 🧊 drinks are 🔥. @Jessicasuxx Extra spice flavors for extra deliciousness! @Victoriiaxo Adding some extra spice to your fall season. 🍁🎃 @katcroyy It's everything you love about fall in one cup! @yrallee The perfect pairing! @sarahm20 Beleaf us, we'll always have your back. @DamonGallegos_6 Extra napkins for you next time. @Chantylovexx Isn't that exactly what you're supposed to do? 😉 @ryleesmaldone It's the most wonder-fall time of the year. @lizette_arias Happy to leaf you smiling, friend! @mmcarranza21 We missed you! @missshannons It's a treat that's easy to fall in love with! @heyitsjami__ It's called self-care. 😉 @Jae__Murph We're glad you love it a latte! @TanishaShanee 🎃🍁😋 @Leah406tothe509 It's an easy drink to fall in love with. 😉 @ItsReallyPoLo It's an unbeleafable fall treat. 🤤 @Jeano467 We knew you'd agree. 😉 @Leah406tothe509 Wonder-fall-ly delish. 😋 @DumbAsHell1991 https://t.co/2WWJv4OHeT @ChefKour You better beleaf we have your back. @ThePieIsWhy Winning! @MandieIRL Yes, they are! @katrinatputnam EXCITEMENT FOR FALL IS THE WHOLE MOOD. @NakitaHoustonTX Happy dances are necessary. @brisomarriba For the love of fall, it's needed. 🎃🍁 @muanicole27 We do have a Maple Pecan Flavored Coffee you can enjoy at home this fall. https://t.co/7ew8jF7FtK. @SherriBradford7 But, you can enjoy it at home! https://t.co/7ew8jF7FtK. @BunnyBBW You can't sleep on our Salted Caramel Mocha! @kamibobami Try one more time! 😉 @BrandonMiniman Ahh-mazing is right! @Summer_Rayn_ Spice, spice baby! @2ofheartss “I wish there was a way to know you're in the good old days before you've actually left them.” -Andy Bernard @Larrytwelsh We're happy to be there for you any way we can, Larry. Sending love and good vibes. 🤗💚 @Lexi_Risk Sounds like three wonder-fall days. @advlive13 We're glad you're falling in love with that drink. 😉 @jazmyn_monique_ Welcome to the gourd life! @KimAraujo0101 Hi Ms. K! We recommend asking for less sauce, light whip, and/or nonfat milk. @SoWrongItsGina_ They're here! Enjoy all of your Fall favorites. https://t.co/AdT6JJ92p6 @jennifer__rosee Decisions, decisions! @missemilyblunt Fall brings out the magic! @apcvxx Gourd tier! @cerhayes Sorry, we don't have a skinny version of this beverage but you can ask for less Pumpkin Spice sauce, nonfat milk, and light whipped cream. RT @alannahl: This is a PSA that the pumpkin scone from @Starbucks is amazing @davidDOWNPOUR 🎵 You're gon' sip like it's twenty eighteen! 🎵 @CrimsonioRed Leaf your truth! 😉 @StaciaEbelt A gourd way to enjoy your Sunday! @Olivia_Range It totally leaves your taste buds smiling! @lexi_petrak Just so magical! ✨ @DeezSteez_ Have you tried it alongside the Pumpkin Cream Cheese Muffin? 😋 @KOOPlD Cheers to Fall makers and gourd sippers! @lilyroselujan We love the way you sip! @ASHTNSHLTN Way ahead of you! 😉 https://t.co/9ZrY9r6qEW @Sean_Mhd A sip worth celebrating! @itsaustindoes We are grateFall to sip with you! @saguilan94 You can't start your season without it! @desssvv Here to mocha this season bright! @psilocybean_ That's wonderful to hear. Cheers to the brighter days to come! 💚 @cherrysfilmm 🧡🧡🧡 @melag88 Gourd sip-lebrations! 🎉 @stephtbh It's a treasure! 😋 @cherrysfilmm Enjoy it all! 🍂 @psilocybean_ Hope you're having a better day! 💚 @rondankarina_ That's gourd to hear! @tonyisapoet We told you fall has arrived. 😉 @GallFAM4 Enjoy! @zrayUH We're glad you enjoyed it! 🧡 @bowmanannabelle Partners are the best. 💚 @condo69 We're glad you love it a latte. 💚 @vincett_thomas When you know, you know. 😉 @House_of_Kane https://t.co/dLaybz7YjE @flieshigh_dove That's one way to spice up fall. 😉 @LxndrBssn We hope you fall in love with it. 😉 @MouseBrat That first sip feeling put in work. 💪 @RealBussy420 🎵 One day you'll have a window seat and you'll be sipping, happilyyy! 🎵 @lucyrayanneb What a beauty! @time_soulmates It's a sign of the season! 🎃 @lizgarcc Bask in the Fall of it all! 🎃 @AllHailTheGhost We are, Shelby! 🎃 @AllysenKate See you soon? @ItsMeSheilaP253 We love a kind cup! 💚 @jorkehrer Because Fall is a feeling! 😉 @scalaadcaelumm So so good! You should give it a try. 😊 @ijonesss Love you too! 💚 @sxnsativee Such a Fall move! 🍂 @Kimg2323 Thanks for the tip! @_khennessey Nice! @nathandbell Cheers to Fall feelings! @GallFAM4 Fall is in full effect! Stop by for your PSL. 😊 @zrayUH The months are catching up to us! In the meantime, enjoy your favorite sip and give Fall a call. 1-833-GET-FALL @rondankarina_ Found your Fall go-to? @Poco909 Well, hello pumpkin! @heyyimpatty Wow! Thanks for the high marks. 💚 @Mighty_Daisy Maybe you just needed to find the right brew! @annabellasvibes Hi Anna! It is but the Pumpkin Spice sauce does include dairy. We recommend trying our Cold Brew with Cinnamon Almondmilk Foam. Top with Pumpkin Spice Topping for Fall fun! Please note that we can't guarantee that this beverage is allergen free as we use shared equipment. @lilreddani Looking gourd! @nicmeszaros Ooo sounds delish! @TiffanySonterre Hey Tiffany, our Pumpkin Spice Sauce includes dairy but we recommend trying a Cold Brew with Cinnamon Almondmilk Cold Foam. Add Pumpkin Spice Topping and enjoy! @idkalexis Pumpkin Spice brings the best out of our friends! 😉💚 @MollyAnn88 It's the definition of cozy! 🎃 @cubbies9 Cheers to gourd Saturday sipping! @whoistravon We'd love to hear what you think! @InvestorFomo OhMyGourdness! 😋 @whoistravon If you love Pumpkin Spice, The Pumpkin Cream Cold Brew should definitely be your next sip! @Deathwing161 Spice, spice baby! 🎃 @whoistravon That first sip feeling! @carlosvdesigner Happy sipping, friend! 💚 @ijonesss The words of a leader! @michar3llano Did we just become best friends? 😍 @gpheilSS8 It's wonderFall to sip this season's favorite with you! @stepintoURpower Our product locator can help! https://t.co/ckoLGBVXK2. @Meatballhead124 Aw shucks! 💚💚💚 @bvbyboytipsy Hope you grab your gourd sip soon! @jazzyb04_ 😆 @TaylorVivienne1 If this is something you'd like to see, please let us know at https://t.co/SPH9PuUUvR. @ItsLaceyxo_ Enjoy all your Fall moments! RT @AllyssaMarie143: Okay I don’t want to be that person but the pumpkin cream cold brew from @Starbucks really is IT @tiffthehuman Right now Starbucks Delivery is available in select cities. Simply download the Uber Eats app and search “Starbucks” to see if it’s available near you! If it’s not, don’t worry, we’re rolling it out nationwide soon! @unhappygiraffe No need to wait. It's here!  https://t.co/ldgVGvZx18 @bit_dragon https://t.co/fZdR6zSfzu @BootsNHeels176 Soon enough.  😉 https://t.co/IWmtg3WVCv @lanaebougenoy98 You gotta!  https://t.co/ldgVGvZx18 @daydreamwariors It's a delish taste of fall! @MissSummerBaby You can recapture that festive flavor with a Caramel Macchiato made with blonde espresso and extra caramel sauce! @TemporaryLlama Finally! We're glad you're enjoying your first sip feeling. https://t.co/AZKs96xelg @LeslieKauffma13 https://t.co/0SsOC2Gd3V @sabrinapiliero Hello, fall! https://t.co/qMIjCQlXXr @__belleeeeee The wait is over! https://t.co/qMIjCQlXXr @marissaa_04 😘 @kristen52889 Cheers to the first sips of fall! https://t.co/I2xlzH9kbr @vasqueznairobi Hope to see you enjoying one soon! https://t.co/qMIjCQlXXr @astridSilguero Apologies for the inconvenience. Due to the brewing process, we’re only able to make a limited amount each day. @milamilamilaa You're right, though.  https://t.co/ldgVGvZx18 @raysellx That sounds like a delish fall custom creation! 😋 @Dee_garcia7 You totally should.  https://t.co/ldgVGvZx18 @BIG_KRAFTY They're back like delicious little harbingers of fall. https://t.co/qMIjCQlXXr @HayleyBofDE Pics or it didn't happen, so this actually counts as your first. 😉 @kinkybootsss Yesss! We love the way you sip. 😋 @brav0bitch It's delish. We're so happy you're falling for it! https://t.co/ecW4oCC8gE @darkdiamond8989 Awesome! @fowlermads Sounds like birthday bliss! Enjoy! 🥳 @JadeWomack1 It's a perfect taste of fall! @esplanerd It can be autumn in your heart and in your cup even if it isn't on the calendar. Enjoy! https://t.co/2ObOKOKZeO @Alicyn38307021 That sounds amazing! @justagrander Cheers to new love! 💚 @Kimienicoleee https://t.co/8CcotCujiP @gaaabriielleee Sorry, our Pumpkin Spice sauce contains dairy but we recommend trying our Cold Brew with Cinnamon Almondmilk Foam. Ask for Vanilla Syrup and Pumpkin Topping for a little Fall fun! @tannerryan34 Happy Saturdays brought to you by Pumpkin Cream Cold Brew.  https://t.co/ldgVGvZx18 @Bro0okieC0okie We love it when you fall for a new favorite! https://t.co/6EF8WwPpsk @Jennnilove_ We hope you'll be enjoying one soon!  https://t.co/ldgVGvZx18 @cardigan_corie Mentally we're right there with you. https://t.co/qMIjCQlXXr @pinkndlove We can't wait for you to try it! https://t.co/qMIjCQlXXr @cathynyc https://t.co/nqMNHLZ8QV @stephanievrossi That will make any day more beautiful! 💚 @jbk06 You could enjoy the best of both worlds. Why not spice up your Americano with some pumpkin sauce and pumpkin spice topping?  😋🎃 RT @annaedaugherty: A pumpkin cream cold brew AND a compliment from my barista make for a good morning @kierst_S11 Perfect to enjoy anytime. 😋 @madeinHisimage7 We look forward to seeing you. 😉💚 @lawdhavetricey A perfect treat! 😍 @_kattbenitez Yum! 😋🎃 @Maryzavala_ We hope you'll be enjoying one soon! https://t.co/3WkKvBy4Es @cristyk204 It's back and waiting for you! https://t.co/fjvQyiXEG6 @emma_degrandi It's a delicious reality. https://t.co/ldgVGvZx18 @morgggggiee Sounds like you're doing just fine. 😉 https://t.co/rNJe4lYADq @HarmonysMelody_ Good news, Harmony! That taste of fall is part of the menu all year long. No need to wait. 🍎💚 @marissaa_04 https://t.co/GprNh13Fgk @gee_bearr Cheers to love at first sip! 🎃💚 @cloudnialI We’re excited to bring oatmilk to select stores throughout California and parts of the Midwest and look forward to hearing their feedback. @Larrytwelsh We're happy to hear that! Here's to an even brighter season. 💚 @kennedyhill01 Our thoughts exactly! 🥰 @_ShaaayT Live all season, Shay! @DarcyEmt Hope you enjoyed your first sip of the season! @savpeters32 Give it a try! You might just fall in love. 😊 @MaggieOdegaard It's a Fall Icon! 💚 @EricP_14 We are! @KaitlynNobles All you need is your cardigan! 😉 @gracemclellan31 Sometimes a new normal is not so bad. @Ddogx5 So gourd! @justagrander Love at first sip? @tsukiterasu Happy sipping! @Chesapecten Hope you can come back from this some day, Jason. @botellojocelynn You can stop by and see for yourself. 😉😊 @bvbyboytipsy Did you pick your pumpkin yet? @Pumpkin_Mae Thanks, Pumpkin! 🎃 @hayleylorrainee Loving your confidence! 😉 @Sulveytbh It stays on our minds too! @arasellie Season the day! @laurathelord Nothing! 😋 @whereskarennn So sweet! 💚 @lauren_gaw E V E R Y T H I N G @jazzyb04_ If you love Fall, the Pumpkin Cream Cold Brew is autumn-atically your fave! 😉 @damarismarelyn Hope it made your season! @emily_lafave Awesome! If you're ever missing it, Fall is always just a call away. 1-833-GET-FALL @marianalbriceno Enjoy! @jvssrvylenex3 Moms always know. 💚 @d_jayy97 It's everything nice! 🎃 @epay94 That's awesome to hear! @mse_teacher Gourd minds think alike! @thoughtsxcietyy Pro Tip: ⬆️ @Candaleese It's official, Fall has begun! @GalaxyPrismatic Gourd plan! @notmckin Sounds like we struck a gourd with you! 😉 @_paul_loh It's easy to Fall for gourd taste! @myaesposito That's what we call dedication! We hope your cozy cup warmed you up. 😊 @CTCResistance Our partners recognize gourd power! @saralnea Did you Fall in love? @__claudiaperez And in one fall swoop, it was autumn. 🍂 @AllyssaMarie143 Some things can't be Fall-voided! 😉🎃 @brady_thomas30 Our hotline can transport you to a Fall wonderland! 1-833-GET-FALL @loxofgold_ We beleaf you! 😉 @lovekaylaamarie She has gourd taste! @vanessa10ker Cheers to self-care and gourd sips! @camarinroseee Taking Fall up a patch! 🎃 @WhistolKritt The gourds have spoken! 🎃 @jinsonIove Fall in love, all over again: PSL is back! https://t.co/dExTYQ0QZU @Lindsey_Piercy Let the gourd times roll! @flowerpowerlexi https://t.co/b8imdv2kZr @daynabobby That's love! 💚 @nakedjen We'll be here when you're ready. 🧡 @jadaholmess We wholeheartedly believe Black Lives Matter. Our store dress code allows use of Black Lives Matter pins/t-shirts, and we sent Starbucks designed t-shirts to our partners in the U.S. and Canada: https://t.co/LQ6fKsIP10 @Lilulicious You can also try it iced, as a Frappuccino® drink, or get those crucial fall flavors in a Pumpkin Cream Cold Brew! @goodmusiciskey Bet your autumn dollar, it is! @sboesen7 A leaf changing experience! @Butters360 We do have Starbucks Creamers available! https://t.co/HB95LEyrc8 @kimsaidwhaaa Any pumpkin choice is a gourd one! @_uhlexxuss Definitely. @_mpolague Yes, you are awesome. @almafloresxo 🍂🧡 Cheers to true beleafers like you! 🧡🍂 @kyralaurenm If you haven't, then you should. You deserve the joy. 🧡 @aswrittenbyvee It's a match made in autumn! @ShelbsR6 It's your time to shine, Shelby! @christineng3_ Agreed! 😋 @issaIyssa Wrap yourself in only gourd things! @taylor_siebs That's what the Pumpkin Cream Cold Brew is for! 😉 @_abigailhart Now, that's gourd living! @jacquelinesosa_ Pre-weekend pumpkin sips are in order! @xmandiiixx Go big or gourd home! @itshighmeh We don't know how to feel about this. @Ameligatha That first sip feeling is seriously gourd! @froplusfashion Enjoy! @tarynattheseams Just close your eyes and imagine you're on a hay-ride while you're in the Drive-Thru. @jojispoonhq Catch up with the recording while enjoying your cake pop? @dilettantescum 🍂 Live your autumn truth! 🍂 @froplusfashion Sounds delish! @Karaphernelia If you love our Pumpkin Bread, then you'll love our Pumpkin Cream Cheese Muffin! @gannonlauren Then what's the point? 😉 @ash3nflam3 The great pumpkin was on your side. @SeeTurtle3 Yum! @kit_kat_Kaitie Have a pumpkin spice day! @Rumpleswagskn Truth! 🧡 @xmandiiixx You've waited all year for this, don't wait another second! @TheSaintAndre We're all in for fall! @hannahpostles We're not sure either, but at least we have Pumpkin Cream Cold Brew. @noeliac1992 PSL and Pumpkin Cream Cold Brew are back in stores now! \nhttps://t.co/ELzGaOh00L @shrishtii22 That's fall okay with us! @basicjay_ Hope you had a gourd time! @doseofkiii Sounds like you found your sip! @kiimmbbeerrllii Our autumn menu is an explosion of fall flavors! So glad you're enjoying it. @AdelkaRadost Foliage is power! @AllyWentzell We won't say a thing! @AlieFaliee Season the day! @astroariella Glad you're enjoying every drop! @asherbasherr Welcome to easy sipping! @bebe_barrera 3rd time is the charm. 🎃💚\nhttps://t.co/ldgVGvZx18 @kyliehoward_ Of course there is! \nhttps://t.co/2M5EospgTH @HarmoniousMelo That's a way to spice things up! @ashleyegreer All is well. 💚 https://t.co/ldgVGvZx18 @UrviBhandari We do have an Iced Pumpkin Spice Latte! @Veyavalentino We don't mean to disrupt your wallowing, but we thought you might be thrilled to know our Salted Caramel Mocha came back on 8/25. 😉 @avocad0squirrel It does have a certain wow factor. 🎃 https://t.co/ldgVGvZx18 @AnnieMT1212 Most delicious PSA of the day! https://t.co/ELzGaOyASj @Rudegirl_BOO Can't stop, won't stop. Enjoy every drop!  https://t.co/qMIjCQlXXr @Deranged_Insane Can't wait to hear how much you love it! @meagan__norton Tears of joy, we hope. 💚 https://t.co/ldgVGvZx18 @Memoleeeee It's not a drill! Proceed calmly to your closest location! https://t.co/ldgVGvZx18 @PNKAMR We can help with that. Enjoy! https://t.co/2M5EospgTH @Diamonsita_ Looking forward to sharing some with you! https://t.co/2M5EospgTH @melinagalleg0 We hope you'll give it a try and find out! https://t.co/ldgVGvZx18 @katieleighf31 Ok... 😉 https://t.co/3WkKvBy4Es @bugjunki Truly spicetacular! @monseexo Glad you're enjoying it! @Louisb04 Sip, sip hooray! @Gilberyonce13 August slipped away like a moment in time. 🍂 @ambervaters This year was in need of a little gourd news. 😉 Enjoy every sip! @emmaaaportillo It tastes just as good as is sounds and that's the delicious truth!  🎃💚\nhttps://t.co/ldgVGvZx18 @gabbyhubbell Here's to love at first sip! 🎃💚 @jefposk 😂 Has PSL become so predictable?  💚🍂 https://t.co/Tm6li5QvTi @seenvm_ Well make a true beleafer out of you yet! @cosmicluvrr You fall in love with the first sip! @dey_swizzle Let the gourd times roll! @_ninaroni Have you tried our Pumpkin Cream Cheese Muffin? 😋\nhttps://t.co/3WkKvBy4Es @brwnsugar_80 We always have a gourd time together! @HarmoniousMelo We'll have a pumpkin spice time together on Monday! @jessicaw288 If you just pump-can't wait, you pump-can order one now! 🎃\nhttps://t.co/qMIjCQlXXr @AlieFaliee Fall aboard the Pumpkin Cream Cold Brew express! @alannahl Pair with our PSL for some spice, spice baby. @Cool_Breeze_Dre You made a deliciously spicy choice! @Audreeeena Gourd power! See you soon. @alexis_pagan22 https://t.co/CV2exy6BHA @kyararafferty It's a gourd day indeed! 🎃 \nhttps://t.co/ldgVGvZx18 @SingleRider87 Make every sip count, friend! 🎃\nhttps://t.co/ldgVGvZx18 @hollyjeanbauer You don't need an excuse. You need a delicious sip of gourdness. 💚🎃\nhttps://t.co/ldgVGvZx18 @solosrising You've got a gourd streak going. Why stop now? 😉 https://t.co/qMIjCQlXXr @RevEzell @Mamademics Those are the rules. 🍂💚 @moth_jessi All signs point to yes. https://t.co/qMIjCQlXXr @angelicamarie_0 Thanks for the reminder! 😉 Happy Friday, Ang.\nhttps://t.co/ldgVGvZx18 @dbatcswift We can almost taste it! 🎃 https://t.co/2M5EospgTH @tesfayealeee We love it when you fall for a new fav! 💚🎃🍂 @1tsdorag Looking forward to sharing one with you! https://t.co/ldgVGvZx18 @lex46929425 That's it. That's the tweet. \nhttps://t.co/ldgVGvZx18 @desithesavage_ Glad you think it's a hit! @siennalou__ Enjoy every sip of happiness, friend! https://t.co/ldgVGvZx18 @ellenxnyc Happy Birthday! 💚🎉 @grahampatsmith The vault opened 3 days ago. 😉  https://t.co/qMIjCQlXXr @vengefhul If you're ready for it, it's not too early.  🎃\nhttps://t.co/qMIjCQlXXr @its_Jay22 https://t.co/DW2nJCPgyq @CreatedFearless https://t.co/3o0OYlfNNE @500DaysOfErika https://t.co/T6WmhXCKxH @__futureghost Here's to only good things brewing for the rest of this year. 💚 @julialo13 It's a dream come true!  🎃 @YannaImani Is PSL an ingredient in these, or just a delicious way to enjoy them together? @riseofbunny Sorry, we don’t have those this year. You may want to try a Pumpkin Scone or Pumpkin Bread instead. @Srpants16 We've updated the Starbucks app and in order to select Blonde Espresso, please customize your beverage under the \"Espresso &amp; Shot Options\" tab. @Shoes41580 Sorry for the confusion! We've made an update to the Starbucks app. To order a Flat White with Blonde Espresso, please select a traditional Flat White, then under \"Espresso &amp; Shot Options\" choose Blonde Espresso. You can also favorite this item for easier ordering in the future! @jayslav Hi Jess, good news! Blonde Espresso is available all year round. You can substitute Blonde Espresso for Signature Espresso in any beverage. In the Starbucks app, you can find this customization option under \"Espresso &amp; Shot Options\". @tdotxl_ Oh my *gourd. 😉 RT @heidicolburn: Coffee is my love language. And more specifically, from now until they run out, @Starbucks pumpkin drinks 🍁☕🍂💛 @Veyavalentino Our fall menu gives us something to look forward to all year long! @JanHooope Watch us bring the pumpkin and set the night alight! @rachelgreene116 Anything for our fall loving friends! @rachelgreene116 It's a really gourd day! @UrviBhandari Yes, we sure have. @tdotxl_ Our world is fall circle again! @34SS9248 We swear on our favorite flannel, it's delish! @shrutisparkz You can also order Pumpkin Spice Frappuccino® drink! @chanita__ Let the gourd times roll! @Veyavalentino And it's back! Enjoy all season. @HumanBrennapede But in a sweater, boots, and your favorite scarf. @MoMtzz You're all in for fall now! @ItsVic4 Yes, you can! @dizzywagon It's *almost* too cute to eat! RT @StarbucksNews: Starbucks is taking a major step forward to make sure no partner (employee) will have to choose between working their sh… @HunterJRP We must not be doing it right if you have to ask. 😉 @HunterJRP Honestly, you are winning fall! @macbommm 😲 What are you waiting for? https://t.co/qMIjCQlXXr @_carriemeaway_ https://t.co/tR6SE5qkBw @TeraNKOTBLuvr Hope that means we'll be seeing you soon! https://t.co/qMIjCQlXXr @jazgraciee We look forward to sharing one with you! https://t.co/qMIjCQlXXr @leezuspiecee We're glad you think it's a hit! @babyindifera She's back and we're falling for her. https://t.co/ldgVGvZx18 @alisonkate___ We just want to make sure you get to enjoy your #PSL! https://t.co/qMIjCQlXXr @addisonfreemann We all need a little help sometimes. For assistance, click here:  https://t.co/qMIjCQlXXr @__futureghost What even is time? Just go with it. 😉 @_carriemeaway_ Apologies for the inconvenience. Due to the brewing process, we’re only able to make a limited amount each day. @alisonkate___ Right now Starbucks Delivery is available in select cities. Simply download the Uber Eats app and search “Starbucks” to see if it’s available near you! If it’s not, don’t worry, we’re rolling it out nationwide soon! @sailort_8 She's starring in her own fall show and the ratings are soaring. 🌟\nhttps://t.co/Sn9gnhJ0D1 @eelhsAnnA We're still proud of you. We know you'll make it! https://t.co/qMIjCQlXXr @gloestefany_ They can if you pay using the Starbucks Rewards Visa Credit Card or Starbucks Rewards Visa Prepaid Card. You can learn more here: https://t.co/GA5TjXlmsg. @jillianeravell Cheers to a new favorite sip! We're happy to hear you love it! 😍😋 @itsvictorsf Can't wait to see you! @slowjoeee Happy Birthday! 😋🎃 @sloanlynn That's how to celebrate both seasons in style! @pastormelissa Right now Starbucks delivery is available in select cities. Check availability near you by visiting https://t.co/FT9Kh0PvhK. 💚 @_KechaC Happy Birthday! 💚🎉 @GinnyMannnn Happy Birthday! We hope you had a great one! 😋💚 @jillianeravell Happy Birthday! We hope you have a gourd one! 😋🎃 @ItsYaGirlJaee They can. The Starbucks Black Partner Network co-designed t-shirts that have been sent to 250,000+ store partners. You can see the design and learn more at: https://t.co/LQ6fKsIP10 @gabbylkennedy Sometimes that first sip feeling can be life-changing. 💚 @OKCotter20 Apologies for the inconvenience. Due to the brewing process, we’re only able to make a limited amount each day. @AndrewRaposo6 It's a sip that's gourd for your soul! 🎃💚 @_yaajackson Yes, the Starbucks Black Partner Network co-designed t-shirts that were sent to 250,000+ store partners: https://t.co/LQ6fKsIP10 @OKCotter20 The heart wants what the heart wants. https://t.co/ldgVGvZx18 @Jobazzle When that first sip feeling changes you! Life is gourd. 💚 https://t.co/hueJ0VJ3LW @vanesamariii When late summer hasn't quite turned to fall, the Pumpkin Cream Cold Brew is here to bring you a taste of both seasons.  https://t.co/ldgVGvZx18 @debalinaa_ The Great Pumpkin is looking forward to your arrival. 🎃💚 https://t.co/0pQEuAQ355 @talornik Fair enough. 🍂 @bat_MANDA13 There's nothing quite like that first sip feeling. https://t.co/yNPykVSTDb @daniellewise_ Glad you're enjoying that sip of fall! @catttamaya It sure is! Have you had your first sip yet? https://t.co/ldgVGvZx18 @mryalejandro Not to take any of the excitement out of the ride, but we thought you should know that you can enjoy peppermint in your mocha all year long. 🍬💚 @spbloghawaii Cheers to the first sip of fall! https://t.co/Ps204zyCPg @itsvictorsf We hope you'll give one a try. You just might be surprised how gourd it is. 🎃💚https://t.co/qMIjCQlXXr @AnnieMar Seems like you've got the start of a gourd streak going. 💚🎃 https://t.co/qMIjCQlXXr @ymlxx Absolutely nothing. If that's what makes your heart happy, we say go for it! @cjyonan24 It's back! https://t.co/Sn9gnhJ0D1 @Spotting_Up Say less. 🎃💚 https://t.co/ldgVGvZx18 @mikenzia Looking forward to sharing one with you!\nhttps://t.co/ldgVGvZx18 @julialo13 We hope it's soon out of your dreams and into your cup! \nhttps://t.co/ldgVGvZx18 @fr3dddy1 Looking forward to sipping one with you! https://t.co/ldgVGvZx18 @cjyonan24 That too. 😉  https://t.co/Sn9gnhJ0D1 @drshansen Everyone needs to hear this gourd advice.  🎃💚🍂 @sharlynnecruz https://t.co/Go2ZLJusJU @JamieDidlake You're right but we couldn't resist being punny! 😉 @FreckledBeaut So sweet! 💚 @mboylan https://t.co/LKeYpCJq9G @emsplace1 Cheers to firsts! @JamieDidlake @CrawfordCollins @EbenOfficial @bbynezza @franny @Seavey_Chris @Dylan_Statham @williamhadaddin What a grande pumpkin that is! 🎃 @simplysouthbell Sips and determination are what great days are made of! @do_epic_chic_ Sure is! Get pumped. 🎃 @jenn_surrette 🧡🧡🧡 @EmmyTheis Glad we could escort you to class! @oliviacdouglas Autumn’s up! @taryn_nyrat Delish! @kc_baine Happy Fall! 🍂 @cubbies9 All in for Fall! 🍂 @GabbiOliveira0 What else is there to do on the first day of Fall? 😉 @LivTrubiano 😉 @stardewhorizons Love you too! 💚 @GambleBrittany That Pumpkin love is real! @AlayneAllstar Woohoo! @daisyemoryy We know the feeling! @TassiaXOXO He's a keeper! @ruhbeckuh_beck Cheers to all the gourd times! @tayashcroc Thanks, Taylor! @KbyeJaz Oh my gourd! 🎃 @mizvelociraptor Way to start the season! @LernDiamandis Brew friend goals! @LivTrubiano Cheers to gourd living! @ChibiTifa The pumpkin to your spice! @stardewhorizons Awesome! @AlysonEller There's no better way to describe it! @j_espinosaa Can you beleaf it?! @kangle15 Hello, gourdgeous! @kellayoufella The sip that dreams are made of! @issamomvlog Bask in the season! @akathesauce Enjoy the sip-tivities! @alliebrieldyer Happy Fall! @KailaniMcgovern 💚💚💚 @KailaniMcgovern You got it! 😉 @Justlizrenaee Cheers to gourd sips! @KailaniMcgovern Should we get your sip started? @summersilvery You're the only Summer we're acknowledging this season! 😉 @__ahhh__lexx__ Hope your season is brighter! @meganxoxox_ It's magical! @Larrytwelsh Feeling all the Fall feels! @JusSaiyan Cheers to answering the call! @johanna4892 Everything your season deserves! @lesliee_tellez Have a gourd time! 🧡 @chickiebabey Orange you glad it’s fall? @onIyfcns 💚 @al_eggs_andra29 Enjoy every sip! @noreennnn24 Not leafing, that's for sure! 😉🍂 @onIyfcns We knew you were a true beleafer! @Blair9413 When the black candle is lit and the prophecy is fulfilled. @LUVZ_CARMELIZED Time to spice things up! @joccmvm We hope you share this with us at https://t.co/1BxewVH8JT. In the meantime, you should try our Cold Brew with Cinnamon Almondmilk Foam with Vanilla Syrup and Pumpkin Topping. @aliciaannegower See you tomorrow? @ciaomein 🍁 The leaves are orange and yellow all around us, Tom. 🍁 @basicjay_ So mentally, you're here with us! @uwubabybopz You're totally ahead of the carve! @CurtisM40613460 Touché! See you soon. 😉 @angelaxdani It's our season, Dani! 🍂 @kayla_duerr25 Gourd start to the day! @gregoryc7040 PSL on ice is nice! @LonnaSchaff We beleaf this is going to be the best autumn ever. 🧡 @Gloria28815740 🎃🍂🙌 @Noosiekins That sea-salt topping is something else! 😋 @Flobee03 Call 1-833-GET-FALL for Fall feels no matter the weather. @CurtisM40613460 But there are so many crunchy leaves to jump in! 🍂 @KweenKimberly 🧡 @wed_1901 That is so beautiFall! Enjoy. 🎃 @justkelseyelise 🧡🧡🧡 @CurtisM40613460 Fall is a state of mind, Curtis! But don't worry, you will be able to get yours when you're ready. 🎃 @KweenKimberly It's already here, Kimberly! Bask in the gourdness of it all. 😊 @zoeevsuarez Hi Zoe! We love you too. 💚 @ALTY0NG This mocha'd our day! @theashleyhunt Spice, spice baby! @bea_trizg21 Happy Pumpkin Season! @rubyyhernandezz It's just that gourd! @ThatCrazyDogMom Sounds a-maize-ing! Mentally, we are here https://t.co/22vtwhR60S @justkelseyelise 🎃 Welcome to the land of spice: where the season's gourd and the sips are nice! 🎃 @EhmZiv That looks so gourd! @Lupe_Gmz 🧡 @h36150906_jo We'll be here for you when you're ready! @jordaniels77 A delicious reunion! We hope you're just as happy the whole rest of the year. @aewarren3 @dailymemphian We missed you! @yooyoitsana The wait is over! You can enjoy that drink now! @Lvfer Well, it is the best way to cool off so...justified! @michellemfranco Keep it cute, pump-Queen! 😉🎃 @taylorwasnthere A round of applause for the true beleafers! @MarcaylaaImani It's available while supplies last, but some stores may run out faster than others. @NSchremmy Not to worry - it's also available iced, or as a Frappuccino® drink! @andrewbashi That's the spirit! @_Gamer_Princess No, there is dairy in the pumpkin spice sauce. @getjenafied Awesome! @AngieSee21 Looking good! @__xodoll Enjoy all the sips! @whiskyteacup0 We can't beleaf it's finally here... but it is! PSL is back! https://t.co/dExTYQ0QZU @jussmonica Seems like we're falling for each other. https://t.co/j0nP0dZx3r @loveurhairdown Yes and yes. 🙂 https://t.co/qMIjCQlXXr @andrewbashi It's a cozy way to spice up your leaf life. @xime_moreno02 Cue Happy Dance. @magsch___ Sounds like you have a deliciously full day planned! https://t.co/qMIjCQlXXr @saruotoko https://t.co/kcmsJEjn4w @danaxxkelly And that's the gospel according to spice. https://t.co/ldgVGvZx18 @Morganator15 It's a taste of fall and we're glad you love it! @EgyptianLatte Enjoy every sip of fall! 💚🎃 @Hey_littleasian Just doing our best to bring some fall joy. 💚🎃 https://t.co/3WkKvBy4Es @hanybanany96 Hooray! We love to hear that. @kelly_dawn87 Sounds like we'll be seeing you soon, Kelly. 🎃🍁 @xime_moreno02 We're grate-fall that you're enjoying our fall enthusiasm. @janunez18 Thanks for starting fall with us, friend! @rianaventi Hoping thinking leads to happy fall sipping.  https://t.co/ldgVGvZx18 @McGuireSuzette Hooray! 🎃💚 @RyanForEQUALITY https://t.co/R1ThXWyDkB @kenziemacbrown https://t.co/vjXEgAgtPe @CristalMLugo4 True love. 🧡 @tuesdaydreams You're not late. Whenever your first sip is, it's always right on time for fall. https://t.co/WYIxe9zPjB @toadstool_frend Enjoy your first taste of fall! https://t.co/1KHOr9QkTT @MissLaurenL Anything to leaf a smile on your face, friend. @EatMy_Poundcake https://t.co/dC9ofgcxXy @genuinedarling Cheers to all things fabulous for fall! 🎃 https://t.co/ldgVGvZx18 @raj_iyengar It's time for fall! @SadSobble We've done our part. It's in the hands of the Great Pumpkin now. 🎃 @McGuireSuzette Looks absolutely wonder-fall! @treedaaa We hope it leaf-ed a smile on your face! @ngiova Everything is falling into place. 🍂💚🎃 @jussmonica 😘 @callmecrayzee You're sure to fall for it! @dayanna_castle Easy enough fix. 😉  https://t.co/qMIjCQlXXr @dallasreese We can all use a little cozy comfort. 💚🍂 @XboxKaneda See you on Tuesday then? 😉 @ItsReallyPoLo ✅ @Chloe_Masterson That's the tweet. https://t.co/ldgVGvZx18 @NotDiGi1 You could be waiting a while. 😉 @jayblackwell It's the wise thing to do. 🎃 @joeywelsh5 Safety first, Joey! @christynemi It's been a strange year. You deserve to indulge a little early. 🎃 @hanybanany96 Only happy tears can be shed today. Pumpkin Cream Cold Brew is back! @sara_strunk That will do spicely, Sara! Cheers to your first Fall at Starbucks. 💚 @ParasiteElle 🙌 @tanialariosm Cheers to most wonder-fall time of the year! @MegFutej 🎵There's one perfect fit\nAnd, pumpkin, this one is it\nWe both are so excited 'cause we're reunited, hey, hey...🎵 @britlorenrossow Cheers to new favorites! @CocoKisses40 If you haven't already, save PSL as a favorite in the app! https://t.co/qMIjCQlXXr @hollenbeck2NW We love you a latte, Danny! 😘 @tommy_kazie It's time to pump up the spice! @Geekspam Yes, PSL and Pumpkin Cream Cold Brew are back in @starbuckscanada stores too! @madelinegoing https://t.co/cKmwSIeBvm @tialyyMIKayla https://t.co/mFAYYnQ0mF @callmecrayzee It tastes just as good as it sounds and we hope you'll give one a try! https://t.co/ldgVGvZx18 @K_SerranoR https://t.co/kGftF4fbwL @emilyivy_ The power of spice compels you! https://t.co/qMIjCQlXXr @avocat04 See you soon for a PSL or Pumpkin Cream Cold Brew? 🎃 @EatMy_Poundcake Can't wait to share that first sip with you! @amorbeautymua The first of many we hope. Happy Fall! 🍂🧡🍂 @jasstew Thanks for making us part of your morning, Jason. We hope you have a wonderful day! @taylorlezama_ Life is gourd, Taylor! Can't wait to see you for a PSL or Pumpkin Cream Cold Brew. 🧡 @kayla_duerr25 If only all facts were so delicious. @victoriajosmith That's a great suggestion, Victoria! You can always make this request at the register or in the drive-thru, but we'll share your idea with our app team, too. 💡 @kayla_duerr25 Priorities. 🎃 @emmaedcarter Fall has arrived! @ParasiteElle 'Tis the season! https://t.co/HWzoQXIAVV @jasonsyptak No, there is dairy in the pumpkin sauce. @SoSoPriceless If you try it and aren't happy, just let your barista know - we're always happy to make it right or find you something you'll love. @burn_the_ships Sounds like you know what you love and aren't afraid to go get it! 🧡 @HeelStCloud We hope you get to enjoy one! And to answer your other question, Starbucks Delivers is available via Uber Eats: https://t.co/FT9Kh0PvhK @MarieHi11609665 PSL was released yesterday. We hope you and your sisters were able to enjoy one! @yehsf You can get your Pumpkin Spice Latte with a splash of Classic Chai. Just ask your barista when you order! @JinPickle That's the spirit! RT @TaraSoud: Idk who needs to hear this but pumpkin spice lattes are officially back at Starbucks 🥰 https://t.co/kzxWrbqe2j @callhercramer Gotta drink what you love! We hope it's the start of a wonderful day. @Swainylyn See you soon. 😉 https://t.co/qMIjCQlXXr @Night4mares A way to feel all those Fall feels! @ashleyrose2297 https://t.co/aP5E5h8DhO @ValerieChinn Sis knows you well! @Lul_David_ Can't wait to share that first sip of fall with you! @AnthonyCesario4 🍂🧡☕️ @kimkylebk Salted Caramel Mocha is back too! It may not have stepped into the spotlight for these photo shoots, but it's on the menu. 💚 @alextan023 For a twist on PSL, try Pumpkin Spice Latte with a splash of Classic Chai. You could also substitute pumpkin sauce for vanilla syrup in an Iced Caramel Macchiato. @kmhessing Yeah... Nothing to see here. 😉 @jussmonica Cheers to the magical first sip feeling! 🎃💚 https://t.co/ldgVGvZx18 @ashleyrose2297 That's it. That's the tweet. 🎃💚 https://t.co/ldgVGvZx18 @onufreyonboard https://t.co/hGReNT5F7l @_nictro No one's making you do anything. 😉 But just in case you decide on your own, click here for pumpkin goodness: https://t.co/ldgVGvZx18 https://t.co/49aUEGBUa4 @saruotoko Nothing says fall quite like a scone and a latte. 💚🍂🎃 https://t.co/KnFlllLRk6 @karen_dee3 Looking forward to tasting fall with you! https://t.co/ldgVGvZx18 @imjazsmith Ahhhh yeah... https://t.co/tnsvL5faES @hanneycombs You better beleaf it! Happy Birthday! 😋🎃 @mmjr Happy Birthday! 😍🎃 @_malloryward Calendar? What calendar? Pumpkin Cream Cold Brew is the true harbinger of the season. 🎃 https://t.co/ldgVGvZx18 https://t.co/vohUZonrbw @EmilyORonquillo There has been enough struggle lately. Don't fight it. Just ease into that Pumpkin Cream Cold Brew goodness. 😉 https://t.co/ldgVGvZx18 https://t.co/EYG9IiMN01 @tpwkmacie This year is in need of a little gourd news. https://t.co/ldgVGvZx18 @taurusapoIogist It's back and it's a hit! https://t.co/ldgVGvZx18 @Megan76679000 Happy Birthday! 😋🎃 @Darkou1 Technically. 😉🎃🍂 https://t.co/WIz1M30Fcr @JayRad_KC Many husbands too. 💚 @raymalley We'll be here when you're ready! And, PSL is also available iced or as a Frappuccino® drink. @JonSykes19 In March, we began our first market tests of a recyclable and compostable hot cup solution as part of the NextGen Cup Challenge. Read more on the update here: \nhttps://t.co/P0raiQ6HCr @teresapetersen Truly the most delicious season. @jillybean1125 You always make us happy! @tracykoller PSL is available today! Have PSL, will cozy. \n🔥 Call 1-833-GET-FALL for more. 🔥 [4/4] https://t.co/kX6RyxcykX Crisp air, crunching leaves and a #PumpkinCreamColdBrew, please. \n🍂 Call 1-833-GET-FALL for more. 🍂 [3/4] https://t.co/z3gVlPqZ6Z The best part about a virtual hayride? Not needing a cup holder. \n🚜 Call 1-833-GET-FALL for more. 🚜 [2/4] https://t.co/Ok3mRKy5pM Sip back, scroll and relax–Pumpkin Season is here. 🧡 [1/4] @JulesElbaba Gooooooooourd morning! @_aleinlv Cheers to that first sip feeling! 🎃💚 @ghostlyamor Say less. Sip more. 🎃💚 https://t.co/ldgVGvZx18 @bridgette0823 Enjoy! https://t.co/3WkKvBy4Es @witsgelen Cheers to the first sip of the season! 🎃💚 @rebecabby Every sip is a celebration! 🎃💚 @sharlynnecruz Can't wait to share a taste of fall with you! 🎃💚 @biancaleighxo Cheers to first sips of fall! 🍂💚 @dayna_maeder Fox Cake Pop. 🦊🍂💚 https://t.co/t9E7JJlwQL @wastelandbay She's thinking about you too. https://t.co/1KHOr9QkTT @cjm2791 That gets our vote! Peppermint syrup is available for your mocha all year. 🙂 @Livin_in_ORL Pumpkin Spice Latte &amp; Pumpkin Cream Cold Brew are back! 🧡🧡🧡 @freaking_maura Get pumped! 😁 @cxyxbxyx Gourd Dreams, friend! @JaymeLynnEvans1 Happy Fall! 🍁 @PriontiSarker Delicious tip! @getjenafied Found your fave? @adiel03 It totally is! @kaycee_wiedman https://t.co/lcHNsgEXnu @mellygrantham Love you too! 💚 @theminicauldron 🧡🧡🧡 @lydiaharris__ Don't worry, we beleaf you have all season to get punny with us! @theminicauldron Enjoy all the Fall festivities! @theminicauldron That's the spirit! @brandijasmeen Happy Fall! 🍂 @kait_lin85 Oh, we beleaf it! @ivyan11 You deserve to carve out some fun! @BLMC1122 Same to you, Gourd-geous! 🧡 @ItsChristinaW 💚💚💚 @anaiisabelv Falls well that sips well! 😉 @ItsChristinaW Don't worry! The weather is bound to get the memo. 🍂 @Marie_ashxoxo YES! Unless you're holding your Pumpkin Cream Cold Brew. That would be a tragic Fall. 🍂 @klausprotection What a gourdgeous sip! @ohamairany 🎃 May gourd vibes always be with you. 🎃 @RazzleDazzle77 Mocha your day with your favorite sip! @fearlessaubrey We're ready to write your name on your cup! @elisaguayom You're not alone. We're people too. 😁 @CatnipGame He could try a Pumpkin Spice Crème. https://t.co/yyWex0SUpD @chelsarruda_ Time to sip-lebrate! @S8njen The magic is here! 🎃 @pelotonattacker Well, those always make sense! 😋 @xostanxo2 You really struck a gourd with us! @charmaineemason It's 2020. Anything gourds. @Nicolebelleca Have a pumpkin spice birthday! 🎉 @pelotonattacker Thank gourd there's coffee! @KerstenKelsey We can't not sip with you on the regular this season, Kelsey! 🧡 @lydiazdeetz 🎵🍂 Cozy days are here again. PSLs are bringing cheer again. Orange leaves crunch in our ears again. Cozy days are here again! 🍂🎵 @jahhhhhz Thanks for the tip, partner! @thatgirlleslye Just for you! 😊 @kessiahh_ So glad you've made your pick! @simplyLarkin It is officially your season! @BlancaDeBravo You know how to get the party started! @lysssa19xx It's a gourd time to shine! @mellygrantham Welcome to the gourd life! @AliciaMeza_ Life is gourd! @questfire5 Gourd power! 🎃 @lydiaharris__ OMGourd! @elisaguayom You’re our kind of people. 😃 @BlancaDeBravo https://t.co/7oZyHHZXEX @VallesAlissa It's a siplebration! @JessStanton24 You have to fallow your feelings! 🎃 @hayliemille Salted Caramel Mocha and Salted Caramel Mocha Frappuccino blended beverage are back! @laprb YAY! @laprb It's a gourd time to rejoice! @amandaxchin Woohoo! @YahirPatlan It's time to introduce gourd things to your cup! @amandaxchin That's funny! We have Pumpkin Cream Cold Brew. 🎃 @queenhalpal Today's the day: Pumpkin Cream Cold Brew is baaaaack! https://t.co/byyZV2LsMH @_MrsSprinkles_ Pumpkin Cream Cheese Muffin is also back on the menu today too! @pauldalek We'll be here for you when you're ready! https://t.co/kaO9uB6wlt @bthouston11 We're glad you drove. We've heard that flippin' your fins, you don't get too far!\n\nEven with gadgets and gizmos aplenty, a PSL is part of a delicious world. 🧡 @elizalmcmullen Huge, if true. @CrystalR95123 Since July 15, we have required facial coverings whether or not it's locally mandated. Read more at https://t.co/WMpwMyUw5f. @leilani_111 Pumpkin scones are available today too! https://t.co/1KHOr9QkTT @Cookiebandit09 There is dairy in the pumpkin sauce. @fairynymphangel Most stores will still have ingredients, but it's just available while supplies last. @redhead89 Working on it! https://t.co/GO4A7BhNU1 @teresapetersen You sure are! @PrincessBibiRF_ Pumpkin Spice products are back on grocery shelves too. For more info: https://t.co/Y34lSRLhJv @jfunk33 Personally, we feel the same. That's why it's back starting today! @kenzieprincee It's a very gourd day! @ximvna Today! https://t.co/Qvr9o76y6S @MarkTaylor 2020, A Spice Odyssey @ConnieLeonard She can be an app designer for us! 💚 @alyssaluciaaxo You definitely pump-can! https://t.co/Qvr9o76y6S @TorelloSports 🎶 Though we are two worlds apart\nWe’ll reach to your heart\nWhen you say\nThat you want Pumpkin Spice Latte 🎶 @StangTimber 👀 https://t.co/dExTYQ0QZU @katvonB_3 If it helps, you can also get PSL iced or as a Frappuccino® drink! @Harpersarah8 It sure does! https://t.co/dExTYQ0QZU @fatemaalatwanii Yes, Pumpkin Spice flavored coffee is! Fall Blend too. https://t.co/0urHvYNC2W @JoeUFL Today we predict several more weeks of deliciousness! @amybray1 It sure does! https://t.co/HWzoQXIAVV @ligmacheeks Pumpkin spice made you look twice. @xosandhya We're here for all the Ls... 1L, 2L, 3L, PSL. 🧡 @bmizzzle PSL SZN is upon us! https://t.co/dExTYQ0QZU @jontaoht https://t.co/un6f5RbFrE @osnapitzkenzy_ That's available too! Just choose Blonde espresso when ordering your Iced PSL in the app. @jonathoncole Today's the day! https://t.co/dExTYQ0QZU @DrunkonWritin We're up to the task. https://t.co/dExTYQ0QZU @_50shadesofsuck Yes! Pumpkin Scone is back: https://t.co/1KHOr9QkTT @LittlebitofLuke Sorry we couldn't make this happen on your 21st! Just think of this as extending the celebration an extra few days. https://t.co/Qvr9o76y6S @JulianneMTurkel We heard you. https://t.co/ELzGaOyASj @HeyyIts_Jackie Yes! Pumpkin Cream Cold Brew is back: https://t.co/Qvr9o76y6S @victoriarobitai Tell your friend that today's the day. Pumpkin Cream Cold Brew is back: https://t.co/Qvr9o76y6S @Missy_Calkins Let this be the day that turns your year around. Pumpkin Cream Cold Brew is back! https://t.co/Qvr9o76y6S @Allymonbanana It sure will. Pumpkin Cream Cold Brew is back today! https://t.co/Qvr9o76y6S @Too_Whelmed Today! https://t.co/dExTYQ0QZU\n\nAnd if you need to account for the warmer weather, it's also available iced or as a Frappuccino® drink. @phillip_bowling Today's the day! https://t.co/dExTYQ0QZU @maryalb12 Today's the day to feel those Fall feels. https://t.co/Qvr9o76y6S @lizgrumer It sure is! Today's the day! @jordancable We've carved your name into this cup of PSL...see you soon? @DevanKane95 Your patience is being deliciously rewarded: Pumpkin Cream Cold Brew is back on the menu! https://t.co/Qvr9o76y6S @annaolson13 https://t.co/Ynkjv19psO @Laaayyylaw Fall in love, all over again: PSL is back! https://t.co/dExTYQ0QZU @courtlynnx1 Your wait is over, my friend! @lizblizz13 ✨ You're glowing! ✨ @liljazzy10 🍂 Autumn looks good on you! 🍂 @realEduardoChav This year is in need of the Great Pumpkin. https://t.co/xGAZSKK0xt Did you know that PSL cravings are actually called carvings? 🎃 @Karad00d OMGourd, it IS! https://t.co/xGAZSKK0xt @m_labut03 Everyone needs to hear this. Thanks for spreading the gourd word!  https://t.co/ldgVGvZx18 @laraaahha Don't wait too long!  https://t.co/ldgVGvZx18 @wade_burrell This year might have flown by, but at least it's pumpkin spice latte time! @cvakratsis No shame in that game. 🎃 @HunterJRP https://t.co/m507H1UQX3 @denephewcruz It's just a tap away! We suggest maybe sipping more slowly... or trying it iced. https://t.co/dExTYQ0QZU @_linabobina Fall in love, all over again: PSL is back! https://t.co/dExTYQ0QZU @jesmarini6 It sure will!  https://t.co/Qvr9o76y6S @Coneill14 Get out those comfy sweaters and step on some crunchy leaves... it's back. https://t.co/Qvr9o76y6S @Marghetto Today's the day! Pumpkin Cream Cold Brew is back on the menu. https://t.co/Qvr9o76y6S @evelynmcclain_ Great news: Pumpkin Cream Cold Brew is back on the menu. https://t.co/Qvr9o76y6S @maswriter We're happy to give you a taste of those familiar joys. @notjffns The breakdown of chlorophyll has nothing on when you \"phyll\" your cup with a PSL. @Susan62761723 We sure are: https://t.co/Qvr9o76y6S @BarriosLove Here's the joy you've been waiting for! https://t.co/Qvr9o76y6S @briannasaladino Sorry for the delay. We got you! https://t.co/Qvr9o76y6S @Jjrigby23 PSL and Pumpkin Cream Cold Brew are back in one fall swoop! https://t.co/ELzGaOyASj @brebrex29 Cheers to perfect fall sips. Life is gourd. 🎃💚 @leonareliss https://t.co/WT3XwzapkA @lizwut It's a gourd day indeed! https://t.co/H7ZTo29JWn @LuckBEmily Your patience has been deliciously rewarded... it's back! https://t.co/ELzGaOyASj @wil_zoo_ski We sure are. Pumpkin Cream Cold Brew is back on the menu. https://t.co/Qvr9o76y6S @monstergrrl1313 OMGourd! Pumpkin Cream Cold Brew is back: https://t.co/Qvr9o76y6S @xryanmontana Yes! Pumpkin Cream Cold Brew is back on the menu. https://t.co/Qvr9o76y6S @KaleeBee217 We're here for all the fall feels today. https://t.co/dExTYQ0QZU @KellyMarie3126 Today's the day! https://t.co/dExTYQ0QZU @Merlamb02 Cheers to your first sip of fall! 🎃💚 @IndyCrowe Here's today's top headline: PSL is back! https://t.co/dExTYQ0QZU @FearlesslyLaura You both look gourdgeous! @SparklegirlJen But today... today you'll be a beleafer! PSL is back! https://t.co/dExTYQ0QZU @Geoffsabtchange This will leaf a smile on your face: PSL is back! https://t.co/dExTYQ0QZU @bestdj15 Woot! Go big or gourd home! 🎃💚 @nefariousjessi You better beleaf it is! https://t.co/qMIjCQlXXr @mssanderstweets Can confirm. The intel is gourd. https://t.co/qMIjCQlXXr @Gracie_VG PSL is back today! https://t.co/dExTYQ0QZU\n\nPumpkin Cream Cold Brew too. @cjm2791 We've done our part. It's all up to the Great Pumpkin now. 🎃 @ashlee_em Pumpkin Cream Cold Brew is back today! https://t.co/Qvr9o76y6S @meagan_m84 We can't beleaf it's finally here... but it is! PSL is back today! https://t.co/dExTYQ0QZU @KireiPeony We hope every sip leafs a smile on your face. 🍂💚🎃 @kaerwyns It's here! https://t.co/ELzGaOyASj @LadyR111 Those aren't coming back this year but we do have pumpkin scone, pumpkin cream cheese muffin, pumpkin bread, and a new fox cake pop for fall. @nutmeg330 We can't help it, we are PUMPED. 😄 @FearlesslyLaura Even wearing a flannel! You are all in for fall. 🍂 @Chimyo PSL x Pumpkin Cream Cold Brew is twice as nice! @QueenChyXII 🧡☕️🧡 @clairec345 How about a Salted Caramel Mocha? @cjuned81 It can be Fall in your heart and Summer outside! @atremzz The wait is over! The Pumpkin Cream Cold Brew has arrived! @LaraWatson1313 This will leaf a smile on your face: PSL is back! https://t.co/dExTYQ0QZU @swiftsfolkIore Always. 🎃💚 Every time a PSL is sipped, a leaf gets its orange. 🍁 @likeitsmayrason Happy Birthday! 😋🎃 @_MadisonMcGill Gourd Morning! 😍🎃 @StefKunkel We look forward to seeing you! 😊 @_jmac95 Uber Eats is our exclusive partner for delivery. Download the Uber Eats app and search “Starbucks” to get started. 😋🎃 @namjoonssocks You better be-leaf it! 😍🎃🍁 @5Izzythecutie 🍁🎃💚 @en_crane OK! This should help: https://t.co/dExTYQ0QZU @osnapitzkenzy_ Fall in love, all over again: PSL is back! https://t.co/dExTYQ0QZU @KiaMarie_Duh OMGourd, it is! https://t.co/ldgVGvZx18 https://t.co/ilwFzO9oIn @DenommeWill We here you, and we understand! @serephita That's here too! @emily_malkowski You better beleaf it. 😎🍁 Happy Birthday! 🎉 @CorndoggMcGraw Good morning! https://t.co/ELzGaOyASj @LindseyCope1983 You better beleaf it! 🍂 Happy Birthday! 😋🎃 @brittttburke You bet your gourd there is! https://t.co/KLjtIPyFm3 @nataly_delcid Today! https://t.co/qMIjCQlXXr @brklynedwards Season the day! @Celesteguzman__ Happy Birthday! 😍🎃 @love___liv But now, we have both! https://t.co/dExTYQ0QZU @jessicaamygm Thanks for stopping by! @itsterrib1tch Gourd morning to you! https://t.co/qMIjCQlXXr @TarotCassandraS We hope someone makes this happen for you today! @exhalebriana YES! https://t.co/qMIjCQlXXr @crystalvaldess Happy Birthday! 😋🎃 @m_elena223 Which fall favorite are we putting your name on? @velo760 When you're ready, we'll be here for you! @LucGroot We take pride in conducting business responsibly and supporting communities where we do business, from bean to cup. https://t.co/GoyXsyVrEW @Jadams679 Sorry, no, the pumpkin sauce does contain dairy. @KurtLyle It is! @DovaQueenx The whoa of nitro with the power of pumpkin spice? Pure fall perfection. @109Krys Can't. Calm. Down. Without. PSL. 🎃 @MrsIrksome Oh my gourdness, such beauty! @lalypop24 Trading Stars for pumpkin is the best! ⭐🎃 @swiftsfolkIore https://t.co/3PHXzQpIxj @times_awastin This treat is the pick of the patch. 😋 @onlysunnyskies We can't wait to hear how much you fall in love with those drinks! @PolishGirl82 Time to spice up your season! @ThePhoenixRisi1 We totally beleaf you! @RebelScum324 Otherwise known as Trick and Treat. 🎃 @brwneyedgrl23 Ahm. *Wonder-fall* time of year. 😉 @c0ld_fire Seat belts before PSLs. @sabrrrinnaz Right now Starbucks Delivery is available in select cities. Simply download the Uber Eats app and search “Starbucks” to see if it’s available near you! If it’s not, don’t worry, we’re rolling it out nationwide soon! @ireneh1821 See you soon! @ToyaBro44919504 Cheers to wonder-fall seasonal favorites! 🎉🎃💚 @bwmetts If pumpkin's not your thing, you may want to try a Salted Caramel Mocha. @SherylNantus Cue happy dance! @_kelite That wonder-fall sip is waiting for you to start the season! @kvreen We do it all for you! @VertigoDragon Really and truly! Tap the app now to order your PSL. \nhttps://t.co/ELzGaOyASj @cheatdayeats It's going to be a wonder-fall day! @07Julia12 For fall, we have Starbucks Pumpkin Spice Latte Creamer as well as a new Salted Caramel Mocha Flavored Creamer. https://t.co/0urHvYNC2W @meselianne Hello gourd-geous! ✨ @deharza https://t.co/SyoEI29RRO @RealJoseph123 It's unbeleafable how delish these fall drinks are! @lisa_woodstock Twice as pumpkin spice nice! @musical__mary Have a beauti-FALL day! 🎃 @idkcaleb_ @Okemilyv Enjoy every sip, friends. 😋 @kathrynnnmariee We love to leaf a smile on your face! https://t.co/AlfPguNsdq @jjewelj22 https://t.co/l6cIdyLid2 @cede23 See you soon! @mrmikeMTL https://t.co/eml1O06vdW @kfen1970 Time to celebrate with your favorite fall drink! https://t.co/PmEgg9BgW3 @5Izzythecutie OMGourd this is the best day ever! @__dracarys We hope this is a wonderful day! @opheliafl Road trip time! @dontgobackeddy 🧡 @KanyeSWest1 Today's the day! https://t.co/rNQxr8KKob @FreckledFaceMJ Fall is calling! https://t.co/KsK76FBcDp @kittyangelz805 Try this: https://t.co/ELzGaOyASj. @SJfinfan29 Can't wait to see you! @kenziemasten Truly! @alyssa_casas Pumpkin Spice Latte &amp; Pumpkin Cream Cold Brew are back to spice up your life! @Geekspam The wait is over! Pumpkin Spice Latte &amp; Pumpkin Cream Cold Brew are back in stores today. https://t.co/ELzGaOyASj @_CallieJoy You pump-can do anything with a sip like that in your hand. 😋 @kvreen That's right! Fall is back! @lizzryals Absolutely! @linalorrainepr We'll be succinct: Yes. https://t.co/Qvr9o76y6S You’re a pump-CAN, not a pump-CAN’T. 🎃🧡 @mikesipplejr PSL and Pumpkin Cream Cold Brew are back today. @LoSchlimm 🍂🍂🧡 Fall aboooooard!  🧡🍂🍂 @umaycallmejess OMGourd! Pumpkin Cream Cold Brew is back: https://t.co/Qvr9o76y6S @APtwitta ~you do you~ @mickeyfreak1971 PSL makes everything a little nicer. 😊 @MegNicolecConk Today's the day! https://t.co/E8K70D7drB @jmachinex Today's the day: Pumpkin Cream Cold Brew is baaaaack! 🧡 https://t.co/Qvr9o76y6S @BreeanaNoel_ IT'S PSL SZN https://t.co/dExTYQ0QZU @hannajayyy https://t.co/UT6IObYP98 @Dogedadogo Only one way to find out. 😉 Try a Pumpkin Spice Latte, Pumpkin Cream Cold Brew, or Pumpkin Spice Frappuccino blended beverage! @iTS_EHMEE https://t.co/NSeqY5hTxU @SophieKearing Our sources say it comes out today. https://t.co/qMIjCQlXXr @mmkayalderson Pumpkin Cream Cold Brew has returned! Tap to order: https://t.co/Qvr9o76y6S @BrookeNotAshley The rumor was not true -- but the good news is, today's the day! https://t.co/dExTYQ0QZU @thefloresmama Right meow! https://t.co/dExTYQ0QZU @Loki_Dovahkiin PSL is back today! https://t.co/dExTYQ0QZU @amytaylerp We can't beleaf it's finally here... but it is! PSL is back today! https://t.co/dExTYQ0QZU @alyssalucero You can make it happen when you click here: https://t.co/ldgVGvZx18 @melbro007 Good news, Melissa... Pumpkin Cream Cold Brew is back today! https://t.co/Qvr9o76y6S @calminthechaos1 Let the gourd times roll! @KaeYugen Patience is overrated. 😉 https://t.co/qMIjCQlXXr @lilbean1997 See you in 7 days, Haley! @jocysweatshirt Don't mind if we do! https://t.co/Qvr9o76y6S @kevintjustice Supplies will vary by location - we suggest using your mobile app to confirm availability at your local store. @jroushkolb Thanks for stopping in, John. Have a gourd day! 😄 @naasheey Right here! https://t.co/dExTYQ0QZU @StephAndThangs How about a Salted Caramel Mocha? 😉 @rowan_sea Iced PSL, Pumpkin Spice Frappuccino drink, or Pumpkin Cream Cold Brew are great cold options! @slujan5 We hope this week goes better for you, because today's the day! https://t.co/dExTYQ0QZU @hallsclass1 This will leaf a smile on your face: PSL is back! https://t.co/dExTYQ0QZU @TheNormaJeane Both Pumpkin Spice Latte &amp; Pumpkin Cream Cold Brew are available today! \nhttps://t.co/rNQxr8KKob @twps It's a gourd-geous day for a PSL! 🎃 @kateegeorge We have a super important answer: No! https://t.co/Qvr9o76y6S @Sixd7even That's right! Today's the day. https://t.co/dExTYQ0QZU @mbayer79 https://t.co/7L67ruoTqD @rn_katie We can't beleaf it's finally here... but it is! PSL is back today! https://t.co/dExTYQ0QZU @MissToria4 This looks unbeleafably good! @EstGallarday We can't beleaf it's finally here... but it is! PSL is back today! https://t.co/dExTYQ0QZU @angelstar2 Yes, you do! 🙌 @metallica1331 The Pumpkin Cream Cold Brew is officially back and ready to be ordered! https://t.co/pRHm6OPcAM @oliviablack001 That's the spirit. 🍂 @miss_gianicole7 Pumpkin Cream Cold Brew is back in stores today! @chelseanikole93 Fall in love, all over again: PSL is back! https://t.co/dExTYQ0QZU @kevintjustice When you're ready, we'll be here for you! PSL is also available iced, as a Frappuccino® drink, or as a Pumpkin Cream Cold Brew. @tyfullbright Fall is a state of mind, and you're feeling all the right feelings. @HeyJackay 😘 Repeat after us: I am Pumpkin. I am Spice. I am nice. 🍂 @kellylynnjanson True love! 💚 @cate_cod A PSL in hand is a great icebreaker! @means_tweets We do! @i_yam_cassie What a delicious way to make it your favorite! 💚 @_amandamacneil 👀 https://t.co/Qvr9o76y6S @edwardbulfango Let's give 'em pumpkin to talk about! @nathanplatt Fall is calling. https://t.co/4katMuzx17 @decolours Stop counting and start sipping. https://t.co/ldgVGvZx18 @harmonydiazzz Prayers answered. 💚 https://t.co/ldgVGvZx18 @deidrecamilla Can't wait to see you today. 😉 https://t.co/ldgVGvZx18 @MorganIsabelly That is a tasty tip! @the_lainakay Today's the day! PSL is here! @Swiftie4Lyfe27 We like that one about the Starbucks lovers. ;) @emilylikesbacon Wake up. Your pumpkin alarm is ringing. https://t.co/ldgVGvZx18 @cede23 Any day now... https://t.co/ldgVGvZx18 @HeyJackay In the year 2020, only the power of Pumpkin Cream Cold Brew can save us. https://t.co/ldgVGvZx18 @TamsenFadal https://t.co/QaPSV1EU1r @magenalexa Have you checked yet today? 😉https://t.co/ldgVGvZx18 @naaat_xoxo Yes, the pumpkin spice sauce can be added to other drinks as well! @williamskel96 The spice must flow. https://t.co/qMIjCQlXXr @reggie_pet No, the PSL sauce does contain dairy. @thattugglife With a PSL in hand, you'll look gourd-geous! @barlowdabs Sorry, they won't be back on August 28th. Because they're back TODAY! https://t.co/qMIjCQlXXr https://t.co/6zmCLvIQPv @br0baf3tt Some rumors are true. We hope you're gourd and ready for it because it's here! https://t.co/ldgVGvZx18 @FearlesslyLaura We hope it will leaf a smile on your face. https://t.co/15XWXXCBH7 @lateleeliz It's also available iced, or as a Frappuccino® drink! @samiasaucey PSL is back! https://t.co/dExTYQ0QZU @Jourdie3 Gotta drink what you love! We look forward to seeing you soon. 💚 @Kasey_Posa 💚 @dangerousweirdo Sorry, no, the PSL sauce does contain dairy. @xtinawinfrey We hope the rest of your day is just as awesome! @DuarteFam2012 Gourd morning! 😍🍂 @SarahHeeren We'll never lie to you: Pumpkin Cream Cold Brew has returned! Tap to order: https://t.co/Qvr9o76y6S @danjpatt Fall aboard! @StatuesqueSasha Not this year, but it's what's inside that counts! @kayla_forgues Mood. @TritonBruin Today is PSL day! @edwardbulfango You're a true beleafer! @gatlic1974 We did. OMGourd! @debbiewire Let the gourd times roll. @BrittanyZ_ Thanks for spreading the word! @Official2Felipe It's our pleasure! @veronicaxxxooo Yes! PSL and Pumpkin Cream Cold Brew are back! https://t.co/Z2jPSDLs5G @Msstefanii Today's the day, Stephanie... PSL is back! https://t.co/qMIjCQlXXr @Divine_T1 Pumpkin Cream Cold Brew is back today! https://t.co/Qvr9o76y6S @kenziebelusar 🙌 @_amandamacneil The alarm clock said it's time to Fall in love, all over again. https://t.co/dExTYQ0QZU @brunette1babe It's perfectly rational! @girlygirl242 It sure does! Pumpkin Cream Cold Brew is back on the menu. https://t.co/Qvr9o76y6S @leslye_gallegos Confirming Pumpkin Cream Cold Brew! https://t.co/Qvr9o76y6S @KateWWMT It's true - today's the day! https://t.co/dExTYQ0QZU @DTR_BOSS At long last - today's the day! Welcome home, Pumpkin. \n🍂 #PumpkinSpiceLatte and #PumpkinCreamColdBrew are back. 🍂 https://t.co/nUaPHcwFK3 @ZacharyZWA 😍 @ZacharyZWA We do love you a latte! 💚 @khaiyel_mom Looks wonderful! @rimasmulti 💚💚💚 @ZacharyZWA We can't deny the spice between us! @Sarahliz2612 We have all the gourd sounds you're looking for! @Authority_Taker We're happy you're happy! @luvaislinn Merchandise varies by location. Make sure to ask your local barista what fun options they have! @afarley08 Yes, potential winners will receive a verification email to the email address associated with your account. @mMarsala46 It's here while supplies last, which can vary from store to store. @JordanHerron_ It means you'll be ready when it is! @Porshachanell We'll thank you now for such a tasty tip! @sfwarriorsfan So glad you're enjoying it! @addzerall Follow your heart, even when others may try to lead you astray. 💚 @rxfitaa It's our last sip of the summer, but it's staying on the menu year-round. @zahirahanafi Best time to sip-lebrate! 🍂🎉 @BlakeSolmi Thanks for paying it forward! @__kcl 🙌 @casonn We always look forward to seeing you. 💚 @nothlngswrcng We hope it's the start of an awesome week. @Emperor_Goon Was it a satisfyingly summery sip? @WhoaBrianna Thanks for trying it out! It's here to stay on the menu, so it'll be available year-round. @Pansetta_ Thanks for trying it out. We're glad you have a favorite! @Deana_Mccoy What did you think? @DangerCupcake And... it's here to stay! @majesticmesha So glad you love it! @LiviBoPeep 💚 @a2goblu We're glad to help you fall into the season! @HunterJRP Snapped your taste buds awake with delicious flavors. 😉 @rimasmulti That autumn-atically makes us friends! @vende_l Hay there! @ZacharyZWA We can't beleaf it's so close! @BreeHood You're making us blush. 🥰️ @pennyman777 Everyone is welcome at Starbucks. @nicoleosorto1 Hooray! 🎉💚🎉 @sierraputnam01 Give us a call for a Fall pick-me-up! 1 (833) 438-3255 🍂 @gabriellem1995 🍂 We felt the connection! 🍂 @ImHis2015 Cheers to new faves! @gabriellem1995 That's the spirit! 😉🍂 @benswisher We're grate-fall for your support! @MaryGCarlos 😉 @Chadpitt For today, check out 1-833-GET-FALL! @MissToria4 For today, we just want to help you tap into fall feels no matter the weather or where you are. @reylostrawberry We're glad to hear it'll leaf you smiling. @JROCKDETROIT Guaranteed to leaf a smile on your face. 😉🍂 @slimkittytv Please reach out to Uber Eats customer service at 1-800-253-9377, or @Uber_Support, or go to the Help section in the Uber Eats app to report any issues. @CoffeeAndHoops The hotline will be available during the fall season for a limited time. Give us a call anytime you need some fall feels. @dora91607 You better be-leaf it! 😍🍁 @BeachAddict40 A true beleafer. @Drob0312 We're happy to help you fall into the right mindset! @runningwithc You're a true beleafer! @_unenthused This is to bring you the comfort and coziness of fall. 🍂 @NataliaMichelle Calling 1-833-GET-FALL will help you fall into the season no matter the weather! @AlbaArango007 🎶 Let's give 'em pumpkin to talk about! 🎶 @m_yezenia 😉 @MuseumThoughts This really struck a gourd! For those looking to spice up their leaf life, dial 1-833-GET-FALL to hear the favorite sounds of fall. @Nickhaywardshea What did the leaf say to autumn? \n\nI’m falling for you! @g8terbyte For now, dial 1-833-GET-FALL to hear some familiar cozy sounds that are sure to remind you of the coming season. @mrmikeMTL You bet your autumn dollar we do. @Melbi_C Let's tap into those Fall feels: 1-833-GET-FALL @jayhawknj We're here to help you get ready for Fall. 🍂 Fall is so close you can hear it. \n📞 1-833-GET-FALL 🍂 [US + Canada] @keelyCaldwell13 Let us know what you think! 🥝💚 @GBB_520 We're happy to hear you like it. Cheers! 😍🥝 @JaneHumen You've got great taste! @BreeHood We like your style. @GuraundoNoZero Solid life decision. @erickamay96 If you loved our Irish Cream Cold Brew, we recommend giving our Salted Caramel Cream Cold Brew a try! @BreeHood Say it louder for your friends in the back! @Marruccaaa Come and see us tomorrow! @alisinailalio You're ready for anything now! @snrxoxo Oh yes, listen to your friend! @mandyjrc Have fun with it! A delicious sip to celebrate with is the Mocha Cookie Crumble Frappuccino®. 😊 @ceciliavega92 Enjoy! @kduque068 Happy to sip-lebrate with you! 🎉 @amandacbeltran Let us know what you think! @coastaln8v73 Look at the star power! 🌟 @cakedupleena What are you going to sip? @arastetter_ Enjoy every sip! @backporchpisser There's UberEats for that! @sadsausha Thanks for the love. We love you a latte right back! @Coffee_LawBlog Yum! @sanamagentakhan Salted Cold Foam is always a good idea. @__jannet Our Salted Caramel Cream Cold Brew might just be your new favorite! @sara_strunk So sweet! 💚 @amandacbeltran We hear you, Amanda! We will consider this moving forward. In the meantime, you can always add Vanilla Sweet Cream Cold Foam by tapping 'Toppings.' @_jordan_grace_ Hey Jordan! While Sweet Cream is not a modifier on the app, you can always get Vanilla Sweet Cream Cold Foam on your coffee beverage by going to 'Toppings' in your order. We appreciate your suggestion and will consider this for the future. @caringschnapp Cheers to your fave! @AchimientHunter Our Mango Dragonfruit Starbucks Refreshers is a delicious place to start! @mynotetome Maybe not everything, but definitely a lot of things. 😉 @nicoleosorto1 We're so glad you love it! Does that make it your new favorite? @nelsonempro We'll cheers to that! 💚🥝💚 @MekaLuvsYou All amazing choices! @sluttycherrys Well, we couldn't let you walk around without knowing how good our Iced Caramel Macchiato is. 😉 @MSVirginia4 💚 @itboyhj It's a very popular beverage during the summer months. Your local Starbucks should be restocked shortly. @KateSnider_412 Correct, our Mango Dragonfruit Starbucks Refreshers is here to stay. @Erinb4USC It's always fun to try something new. Our Mango Dragonfruit Starbucks Refreshers is a delicious fave! @sluttycherrys Oh, yeah. It's really good, you'll have to trust the Siren on this one. @rachelgreene116 What did you try this time? @trouble841317 Congrats to the happy couple! @luvaislinn Welcome to the bright side! @ALLumENati It's impossible to not love this bite. 😉 @sadsausha We mean, it's what you asked for. 😉 @MSVirginia4 We always love it when you stop by! @BASH_yupp Fiscally responsible and delicious! 😉 @OfficialKingRae Thanks for stopping by! @arb100sf That looks delish! @chknboob That's a yummy recommendation! @LargeFryLogan Thanks for stopping by. 😘 @anxgj_ We already know this is the tweet. @Daniekrisya_ It's one of our all time favorites! @skylarsinger1 We've got your back. @dlctrveb Yes, it's here to stay! @larosa_shelton Cheers to new favorite drinks! 🎉🎉 @dlctrveb Sounds like you found a new favorite drink, friend. @Laineyyyhooker Doesn't get any *cheddar* than that. 😉🧀 @kaitb1915 It's here to stay! 😋 @alwaysforskyler 🤝 A dynamic duo. 😋 @x0kimrivera We're happy you love it. Cheers to the Iced Guava Passionfruit Drink! 😍😋 @delaneykalea Yum! 😋 Is it your go-to sip today? @Aksents_DCR The Iced Golden Ginger Drink is here to stay. 💚 @morgan990912 Yum, yum, and yum! 😋 @kelvz8 🎵 Summer, summer, summertime! 🎵 @bbygissy_ That's the sip! @dezmarsh Perfection! @adesrevenge We're ready to sip with you! @valenlae Cheers to that! 💚 @valenlae Have you fallen in love? @ricxrdomtz Perfect for a summer day! @angoldd We'd love to hear your thoughts on it! 😊 @ArielxGray Yet so refreshing! 😉 @pixiedsts It's even easier to grab your new favorite drink! @yvttfl Happy to see that you've found your sip! @LEISTEEZEY_ You should! It's delightfully bright and refreshing. 😋 @khaiyel_mom Follow your heart! 💚 @yungdeala It's delicious and unique! @ShakyraMcduffie We're thrilled you love it! 😍🙌 @itsmaryjanee__ Should we get your cup ready? @dimplesmarie17 That's what we heard too! 😉 @gabriellaemilie See you soon? @whitneyyleshayy 🤝 A perfect match. 😋 @Maria_Maldona18 Aww. 😊💚 @littlesamiam Hi Sam, because Oatmilk is only available in select stores it isn't available as a modifier. Stay tuned for any changes, as we are always updating the app. @Ry_Ry1977 You're welcome! @emma_huebel We're glad you like it! We love seeing a perfect score. 😊💚 @KKullerkupp Thanks for your suggestion, Kim! As we are continuously updating the app, we will keep this mind. @Ely_Monetti We'd like to hear what you think! @saveyourwalls We'd love to hear what you think! 💚 @jsweezyx That's the best way to do it, honestly. 😉 @pulvinator No shame in that game. 😉 @Alexandra12509 Sounds like a party to us. What sips are you going to get? 🎉 @Mthibodeaux We'd love to hear what you think! 💚 @a4_asia Yes, and let us know what you think! 😍 @aireslatae We're glad you like it! @kelssssoo We're thrilled you love it! 😍😋 @Cathy91766070 Cheers! 😋 @amandagself Our baristas always want you to enjoy your perfect sip. 💚 @onlyangelstyls Whatcha waiting for? 😉 https://t.co/I4xinUVNOm @SWEETKIEE It's a flavor explosion! @hailcar It's impossibly delicious! @methdguez You know now and that's what counts! https://t.co/CCV7hGuZ3q @kkarlin9494 Yes! We're happy you love it! Try your next one with Sriracha. 😍😋 @RochelleTPS That's the tweet. 🙂 @zach_cordrey It slaps you right in the taste buds! 😉 @marli_cauthen Looking forward to it! 🙂 @sheabutterbabya Looking forward to enjoying one with you soon! \nhttps://t.co/JUvpnFVYIB @bassariyahna We love sipping your favorites with you! @CONFIDENTHOWELL Looking forward to sharing a sip with you! @vampiebunny Looking forward to satisfying that craving with you! @marli_cauthen See you soon! 😉 @amey_akayla 😋 @EcuaRican216 What are you waiting for? 😉  https://t.co/HYb0YPIqqH @pawmom__ Hope you got your birthday treat! @juliemarier17 Hope you enjoyed it! @flor_azul_mis You're welcome! @KKullerkupp Sorry Kim, those directions were for Hot Tea. While 'Toppings' isn't an option for Iced Tea, you can add Cinnamon Dolce under Flavors for the spiced flavor that you are looking for. @xtrippyhippie Hi Roxy, we're sorry you weren't able to use your offer. It appears you were purchasing one handcrafted beverage. In order to use the Happy Hour BOGO offer in the future, you have to order two handcrafted beverages. @flor_azul_mis We partnered with Uber Eats so that you can enjoy your favorite treats! Just download the app or visit https://t.co/FT9Kh0PvhK to view availability. @CYLUSOfficial YAY! 💚 Did you fall in love? @Mommamel_13 Hope you enjoyed your birthday sip! @ReynAmazing93 Woohoo! What did you celebrate with? @mydeira There's cozy in the air! 😉 @SeptemberAcres Well, this photo is definitely a win! 😍 @_amorsade You deserve it all! ✨ @JazelynRogers 🎵 Happy Birthday to youuuu! 🎵 @izzeyxo Cheers to convenience! 😉 @prfctcalum Awesome! @halfhaunted Thanks for your feedback, Jennifer. We're glad you found your favorite way to enjoy this beverage. You can always ask your barista to leave out the inclusions the next time you pick up this sip. 😊 @pipsqueakprins It adds a pop of excitement to your day! 🎉 @okayfineluis The best way to start your weekend! @youreWithHannah It glows! 😉 @AbdulJuhaina The stars were aligned for your big day! 🌟 @nikki_wong23 You know we have to sip-lebrate with you! 💚 @itsjessepg Even though it's our last sip of the summer, it's staying on the menu year-round. 🙌 @ricd6 Thanks for making us a part of your summery adventures. 💚 @tori_ray_ Yesss! Or, save this order to your favorites in the app: https://t.co/HVKFITGcpe @ivanxmillan We think you'll enjoy it! (PS: Starbucks does not get involved in national political campaigns.) @jennayfar 🙌 @xoGiaxo_ Thanks for spreading the word! @GiveMeYourMiIk_ So glad to hear it! You can order that on the app and save it to your favorites too: https://t.co/HVKFITGcpe @chaneygirl_ So glad you love it! You can also order it with lemonade in our mobile app: https://t.co/HVKFITGcpe @XLovequelz Good news: Unlike summer, Kiwi Starfruit is here to stay! @andrewbrian33 Not to worry - it'll be here year round! @sabett Sorry, it is not sugar-free. Nutrition info is available in our mobile app: https://t.co/4ovecKuVPf @itsjessepg What a great colleague! @xMagicalMoonx We love a perfect score! 🙌😍 @UFCorDEATH Anything for our friends! 😉 @Rih_Anya We can't wait to see you! @JAquinooo There's nothing wrong with that! @JustinLaem Come on over! @KELLYdoNumbers No, but we do have Frappuccino® Blended Creme Beverages that do not contain coffee. @Rih_Anya Sounds like a good time to us! @STARTERMAGE Come on over! @UFCorDEATH It's okay, friend. Your local barista will be happy to help you find the perfect beverage! @Trizzy_Trek Duh. @ghostgliitch Fall starts in your heart. 😉 RT @nadders11: The new kiwi starfruit refresher from @Starbucks is very yummy, but more importantly, it’s ~aesthetic~ 🥝⭐️ https://t.co/tS90… @KaranbhaiSharma Hi, Karan. Yes, we do -- please visit https://t.co/g68E1b6k8Q. @calilivin90210 A grande Kiwi Starfruit Starbucks Refreshers has 70 calories. https://t.co/I4xinUVNOm @HeyJudeusa How thoughtful! Please ask her to check with the manager at her local store and they'll do their best to help out. @ThomAtHome We hope it helps turn your day around - and theirs too. @bunheadusagii We do not. Starbucks has a zero-tolerance policy on prison and forced labor globally. https://t.co/5wh12bIQVm @WhadHeSay85 Yes, the Kiwi Starfruit Starbucks Refreshers! https://t.co/I4xinUVNOm @LettiLexi It just came out this week! We look forward to seeing you soon. @saajeeta Here's hoping thinking leads to sipping! @awkpixie It's definitely a winning sip! @LizYuhas21 Not to worry! If your store is out of the Southwest Veggie Wrap it will be restocked soon. Please check the Starbucks App to confirm product availability. Thanks! @MzLinda04 It's the sip that shines! @cesarouppercutt Sounds like the Kiwi Starfruit Starbucks Refreshers is perfect for you! @Jaceliaaa See you soon? @alanalorraainee Nice! What's the star plan? @Ry_Ry1977 Hey there! It is only available in select markets so we it is not on the app as a modifier. If anything changes, we'll let you know! @JordanPerry25 Hey Jordy, because oatmilk is only available in select areas it is not available as a modifier in our app. We'll keep you updated if anything changes. @KKullerkupp Hey Kim, just choose the tea that you'd like to order and tap 'Toppings.' Scroll down to find the toppings that you are interested in, including Cinnamon Powder! @mikaladaneile Thank you for sharing your thoughts! 💚 @briannabribri_ Sharing kindness with friends is always the best! @yt_kaayla You tell us! 😉 @____fallon You should see it in person! 😍 @marissalenoble Marissa approves! 💚 @_fogweaver Perfection! 💚 @missjoyCeejois Vanilla Sweet Cream isn't a modifier in our app but you can top your favorite drink with Vanilla Sweet Cold Foam. Just tap Toppings in your order and scroll down! @_guilleee Aw shucks! 😊 @JackieFralick You can transfer the balance from one card to another on your account by going to Scan. Tap Manage under the card that you'd like to transfer the balance from. Go to Transfer Balance and find the card that you'd like to transfer the balance to. Tap Transfer and you're good to go! @_maddiex3 Definitely the sun in our sky! ☀️ @AndrewMoody_ We're saying, it's a drink that sparkles! ✨ @AdoringCaIder 💚💚💚 @CYLUSOfficial You should stop by! @lolstaymad So, so good! 😋 @CariCatastrophe While it is automatically loaded to your account, it has to be applied to your order prior to completing it. If you are ordering with a barista, just let them know that you'd like to use your Happy Hour offer or tap it on the Review page if placing a mobile order. @_justicepaige_ So glad you've found true love! @_guilleee We believe in you! 🌟 @tweetswithabby We're just as excited! 😊 @nerfsage Glad you love it! @Xo_queencee Sip sip hooray! @peralesliz_ Tastes like a dream! 😋 @AdoringCaIder Hope it is the star of your summer! 🌟 @chelseakrueger6 It's true. 🥰 @Xboyston It's staying on the menu! 🙌 @Izzetrix Cheers to you. 💚 @bro_shidaker You can also try it with coconutmilk - that's the Star Drink!  https://t.co/4ovecKuVPf @hannahc0ulter Tastes even better! 😉 @HerGrandDuchess 🙌 Thanks for trying it out! @yikesj0 Let us know what you think! You can also get it with lemonade, or as the Star Drink (with coconutmilk). @daphneriverx It's our last sip of summertime, but it'll stay on the menu 365 days! @AngieBerens Please let your grandma know that her granddaughter has great taste, and that it is staying on the menu year-round! 💚 @chelseakrueger6 It's OK - we're always happy to make it right or find you something you'll love. ✨ @geraldine__jc We're a fan of you! @ajm7788 🙌 @LuedkeBrittany You're amazing! 💚 @trt1989 Thanks for trying them out! @bobbysabi Happy to help! Did this have caramel drizzle? If so: Ask your barista for for a double grande vanilla and caramel drizzle Espresso Frappuccino® drink. @TL_Strickland Honey Citrus Mint Tea. 👍 https://t.co/I0rn8k6Qf4 @WilliamMaranci While Kiwi Starfruit is our last sip of the summer, it'll stick around on the menu all year. @the_real_Ms_M Really! This tastes like bold kiwi meets starfruit, a sweet fruit with mild flavor and floral finish. @NevaNotSmilin 14g in a Tall, and you can use our app to look up nutrition info or customize your drink. It's available in Houston today! https://t.co/I4xinUVNOm @judjenot Since July 15, we have required facial coverings whether or not it's locally mandated. https://t.co/WMpwMyUw5f @nicklin84730599 Not to worry! Even while it's the last sip of the summer, it'll stick around on the menu year-round. @internalheights Thank you for the feedback. West Java and Anniversary Blend coffees were both released this summer - be sure to keep checking the mobile app and your email for news about new and returning coffee favorites. @jonathan_shen7 While we’re no longer sending out physical Gold Cards, you’re still eligible for all the benefits we offer and purchases will immediately count towards earning Rewards. This means you won’t lose your benefits if you don’t earn 300 Stars in a year like before. @tbhlukas No judging here. You do you. @hanniesky It contains real pieces of kiwi, along with natural kiwi and starfruit flavors in the Starbucks Refreshers base derived from real kiwi and starfruit. @AdrianDIB_Ortiz Not for the cash portion: You'll receive 2 Stars per $1 spent using the app or registered Card. @maybe_ed And thanks to Happy Hour, you have twice as many to love! @NaciaSGS Good news: It's here to stay! @cute__doughnuts We were wondering what you thought! 💚 @MichaelALevin There's nothing more delicious than a perfectly timed Happy Hour! @nandamatzue We hope to see you soon! @jasmin3mia 🙌 @EnigmaPop95 We love that you love it! @phuckn_dillon Yes! Star Drink is here to stay too. https://t.co/4ovecKuVPf @alexduarte1574 The nerve! @1n_amelian We appreciate your kind gesture even if it didn't quite work out as planned! @NyiaaLovee_ Today we do! @maybe_ed No one said you had to share. 😉 @melisanicolecx Let us know what you think! @BtSquared2 With coconutmilk, we call it the Star Drink. Either way, it's here to stay! @MichaelALevin Good thing it starts about... now. 😉 @GiveMeYourMiIk_ It's here to stay! RT @MsKariba: The new Kiwi Starfruit refresher from @Starbucks is wonderful! Flavorful party on your tastebuds. 🥝💚 https://t.co/eHfC0SXCSJ @spookynotgothic That looks like a very happy Happy Hour haul! @itsnotmeitsuu Thanks for visiting! @questioningsoup We love to hear it. RT @StarbucksNews: Just launched: Meet the people and see the places behind your bag of Starbucks coffee with our new Digital Traceability… @Kayla_Patriceee So imaginative! We like that. 😉 @heavydirtyhobi Is it on your go-to list? @londonnco It's a sign! @_JohanaGarcia_ Follow your heart! @ylomeli__ Can't wait! @ylomeli__ You definitely should! @RBtheARTISAN Good news: Star Drink is here to stay! Even though it's our last sip of the summer, it'll stay on the menu year-round. 💚 @brianagrzy1 Glad you liked it! While it's our last sip of the summer, it'll stay on the menu year-round. @maiyajambalaya 💚 @genesisgracee Oh no! Next time, please let your barista know - we're always happy to make it right or find something you'll love. @Serena_23_ 💚 @Irisgarciaa20 🙌🥝 Glad to hear it! @OMGitsPOOH It's staying on the menu, so you'll have plenty of time to try one out! @h_a_l_l_e_g Good news: It's here to stay. 💚 @AlijahStorm Great pic! @HeatherSchultz Glad it helped cool you off! 💚 @justtl0vely We did! Bold kiwi meets starfruit, a sweet fruit with mild flavor and floral finish. @bmariee21 🙌 @genesisgracee What did you think? @Steph_I_Will Thanks for giving it a try! With coconutmilk, you can order it as the Star Drink! Or, save this to your favorites in the app: https://t.co/4ovecKuVPf @Irisgarciaa20 What did you think of your Kiwi Starfruit Starbucks Refreshers? @ataylo35 What a tasty tip! Good news: Star Drink is here to stay. While this is our last sip of the summer, you'll be able to order it all year round! 🙌 @jeffrowash Such a refreshing combo! 💚 @xoZer0 That's a great idea! We'll share this with the right teams. 💚 @MeganPatsel Hi Meg! Sorry, Oatmilk is not yet available as a customization option in the Starbucks app. For stores that do carry Oatmilk, you can order a featured beverage that includes Oatmilk by default, such as the Oatmilk Honey Latte, via the Starbucks app. @TiffanyGosling No worries - we're always happy to make it right or help you find a drink to love. @CoachKoenig The Kiwi Starfruit Starbucks Refreshers is now available in US &amp; Canada stores now. Please check the Starbucks app to confirm an individual store’s product availability. Thanks! @Jennife00267679 @StarbucksCare @starbucksusa1 @starbucksprtnrs 🙌 @ersah0ntas You're our new favorite! 💚 @__MissGiGi We've missed you, but look forward to our reunion soon! @miichellegamez We hope to see you soon! @TrillDealJenn It's here to stay, and just a tap away! https://t.co/I4xinUVNOm @dionlisle No delusions! 😉 @Greatest_Ever1 Good news: It's here to stay! @NayyDimples It's a vibrant blend of fruit juice with kiwi and starfruit flavors, green coffee extract and kiwi fruit inclusions mixed with water and shaken over ice. 💚 @cryslynnnn You can save it to your favorites in your app for easy ordering: https://t.co/HVKFITGcpe @ChriseChristina Hooray! Check out the Star Drink too: https://t.co/4ovecKuVPf @nieceam0re It's just a tap away! https://t.co/4ovecKuVPf @tiya_tequila 🙌 @talasavvy Kiwi Starfruit is here to stay, so there's plenty of time to get to know and fall in love with a new fave. 💚 @KariBethReilly It's our pleasure! @ashcash_marie We wholeheartedly believe Black Lives Matter. Our store dress code now allows use of Black Lives Matter pins/t-shirts and we sent Starbucks designed t-shirts to our partners in the U.S. and Canada. https://t.co/LQ6fKsIP10 @RyanMarsan Thanks for trying it out, and for sharing your feedback! We're glad to hear you have a go-to you love. @NancyLovesMJ Yes, this Starbucks Refreshers drink is lightly caffeinated with green coffee extract. @Lynds_Sobkowiak Everyone listen to Lyndsey! @jaz_fabulous52 Dear Jaz, thank you for the suggestion! We are glad you have found a new drink to love. Kiwi Starfruit is here to stay. 💚 @RdotSpoon Good news: It's here to stay! Thanks for giving it a try. @KrisD11 A great way to enjoy a summery sip! @Omfgitscitlaly We'd love to hear what you think! Also try it as the Star Drink (Kiwi Starfruit with coconutmilk). @VitoLiranzo Let us know what you think! @diannaeanderson We hope it was just the start of a wonderful day, Dianna. Thanks for stopping by! 💚 @eluise2018 Hooray! @Makaila_Ann 🙌 @NicoleShep Kiwi Starfruit and Star Drink are available in stores now! https://t.co/I4xinUVNOm @ttucker331 Sorry for the delay - Kiwi Starfruit is available now! https://t.co/I4xinUVNOm @smalltalkmktg Can't wait to hear how much you love it! @eluise2018 Did you love it? 🤞 @jslii That may be a temporary outage - the drink is not seasonal; it's here to stay. @__sarahhxo Just one more reason Friday can't get here soon enough! @parkermcnerney Another time then. @Oh_Its_Crystal If you just can't wait for the holidays, you can recapture the festive flavor of the Chestnut Praline Latte with a Caramel Latte made with blonde espresso and almondmilk. You can also add a pump of toffee nut syrup! @super_sophia11 🥝🥥😋 @Maddiedamuffin1 Coconut and kiwi flavors together? Perfection. 😋 @ThePhoenixRisi1 It may be our last sip of summer, but it will be here for you to enjoy in every season! @galaxi3_ Happy Birthday! 💚🎉 @jessicaa_her Happy Birthday! 😋🎉 @lavibradepablo To redeem your Birthday Reward, you must join Starbucks Rewards at least 7 days prior to your birthday, provide your birthday in your Starbucks Rewards account information, and have made at least one Star-earning transaction prior to your birthday. The all new Star Drink is here. Enjoy the fresh flavors of kiwi, starfruit and coconutmilk. 🥝 🥥 Pure summer refreshment. (US + Canada) https://t.co/kknPQEsSCE @April_Sparkman This magical sip is here to stay! @xoNiurkaBaby Cheers! @Erin_Tommy This made our day! 😍 @cdotjdot_ We can't wait! @ItsKelseyElise No plans to! @madeapromise Yes, this beverage is lightly caffeinated with green coffee extract. @RavenIbrahim The perfect mid-week plan! @All4NoVA It's always good to keep smart sippers around you! 😉 @JenMcCreery88 Yes! We're so thrilled you loved it. Cheers! 💚 @deluxeIipa Today's the day! @steffannie_c so you're saying you liked it @fuckyouRoochi You can ask your barista for a Kiwi Starfruit Starbucks Refreshers Lemonade or order it via the Starbucks app here: https://t.co/HVKFITGcpe @karinahhs Tell 'em! @anthonymartii Yes! We're always happy to make it right or help you find something you'll love. @lastgreatalex We're here for you. https://t.co/I4xinUVNOm @MeleaVanOstrand It's here to stay! You can also try it with coconutmilk and order it as the Star Drink. https://t.co/4ovecKuVPf @Briauna_Arion So glad you loved it! @jslii Kiwi Starfruit is here today - Star Drink too! https://t.co/I4xinUVNOm @aaliyuuuuuh Only one way to find out! https://t.co/I4xinUVNOm @_Jaquelineanaya We think you'll love it! But if you don't, please let your barista know. We're always happy to make it right. @SGianna199 You were right! @mimixn_ 💚 @_cperrusquia We'd love to hear your thoughts! 💚 @kadieocon Everyone listen to Kadie! @BiltzGabrielle We definitely think you'll love it! @DravenCorvinus Hello, thank you so much for reaching out to us. I'm so sorry we dropped the ball on that drink. I'd love to look into this for you. Could you please DM @StarbucksCare with the address of the store you visited? -Adam @serenarenaaa Excellent choice. 💚 @Shimalicious It's just a tap away! https://t.co/I4xinUVNOm @HotBlooded_8 That's all that needs to be said. 🙌 @hayybee27 See you soon! 😉 @MariTaggart Kiwi Starfruit is here to stay! (Star Drink too.) @JustLikeeIsaac Where would you put it on a scale from 1 to 💚🥝🙌😍? @mikkitbh It's here to stay, all year round. https://t.co/I4xinUVNOm @smashasaur 💚 @BRYNNTRILL2 Thanks for stopping by! @josuellms You got it! 😉 @gvbynyc 🥰 @SummaWitMiami Kiwi Starfruit Starbucks Refreshers is available in US &amp; Canada stores now. Please check the Starbucks app to confirm an individual store’s product availability. Thanks! @raybohny Have you tried it as the Star Drink too? Kiwi Starfruit Starbucks Refreshers, but with coconutmilk instead of water. 🙌 @josuellms It's here to stay. Happy sipping! @_conisbomb Thanks for trying it out! @skippiebanana Kiwi Starfruit Starbucks Refreshers! A blend of fruit juice with kiwi and starfruit flavors, green coffee extract and kiwi fruit inclusions mixed with water and shaken over ice. https://t.co/I4xinUVNOm @KhaAdham We hope your friend is having a much better day today. 😉 @nestorsoriano11 We're so glad you did! @ZoelsMom18 Let us know what you think! 😊 @clairemarion97 You can always check pricing before placing an order by using our mobile app: https://t.co/I4xinUVNOm @Home_Expert1 You should try the Star Drink too! @jeffrowash Found your favorite way to enjoy kiwi? @HeyJuicy_ Yes, we wholeheartedly believe Black Lives Matter. Our store dress code now allows use of Black Lives Matter pins/t-shirts and we sent Starbucks designed t-shirts to our partners in the U.S. and Canada. @sweeteningxari @CrimMinds_CBS Looks absolutely amazing! @2020isnotfine We love your energy! Just let your barista know what you'd like and they'd be happy to assist! @shanalikeanna Kiwi Starfruit is available today! @josecanyousee We love your willingness to go the extra mile for something small but meaningful. We'd love to help out -- can you please DM us? @AydrienneRose Thank you for sharing how we've been a part of your healing journey. We hope you're fully recovered soon! RT @GiGiHadid: Person in front of me in the Starbucks drive thru just payed for my order 🥺🥺 so kept it going and hope it continues &amp; spread… @MishellAraujo92 Kiwi Starfruit is out today! https://t.co/I4xinUVNOm @acatalepsy_2 The Kiwi Starfruit Starbucks Refreshers is available in US &amp; Canada stores now. Please check the Starbucks app to confirm an individual store’s product availability. Thanks! @jessischlosser It's true. https://t.co/I4xinUVNOm @lisbeth_torres9 We got you: https://t.co/I4xinUVNOm @RamiACFan Yum! @danaNmiville The Kiwi Starfruit Starbucks Refreshers is available in US &amp; Canada stores now. Please check the Starbucks app to confirm an individual store’s product availability. Thanks! @maritzamed13 Glad you were able to find it. Let us know what you think! 💚 @mmdisney200 🙌 A satisfyingly summery sip! @ivanawestt Thanks for giving it a try! @morganagolli It's here while supplies last, though some stores may run out before others! @Briannaaa_J Can't wait to see you! @stefung16 Kiwi Starfruit is available today! https://t.co/I4xinUVNOm @Briannaaa_J It's here, friend! https://t.co/LRr82G0VVU. @GiGiHadid A little kindness can go a long way. 💚 @SweetMrgrta10 The wait is over! You can enjoy this drink today. https://t.co/I4xinUVNOm. 🥝 @anthropologybby The feeling is mutual. 💚 @sweeteningxari 💚💚 @_codez The Kiwi Starfruit Starbucks Refreshers is here to help you enjoy all 35 of 'em! @keanaa_l This tastes like bold kiwi meets starfruit, a sweet fruit with mild flavor and floral finish. It contains real pieces of kiwi, along with natural kiwi and starfruit flavors in the Starbucks Refreshers base. @Kevinyo09400144 Fingers crossed you love it! 🤞 @ThePINKlilypad And, it tastes even better than it looks. 😋 @Mannijpg Sounds familiar. 🤔 @babybellme And - it's here to stay! Many more satisfying sips in your future. @ItsMaribellll 😋😋😋👋 @vystwrt Thank you for spreading the word! 💚 @_rocioesmeralda 🙌 @Gigix4Jin We miss you too! @anthropologybby Ogres are like onions, not kiwis. @melly_s08 Your patience has been deliciously rewarded! @madelinepaiges This might help! https://t.co/I4xinUVNOm @GreenEyes4Music With coconutmilk, you can order it as the Star Drink! https://t.co/4ovecKuVPf @KNF1257 You're just a tap away: https://t.co/I4xinUVNOm @MjHolland_Xo Agreed! 😋 @its_linda14 A tasty twist! We also have the Star Drink available: Kiwi Starfruit Starbucks Refreshers with Coconutmilk - https://t.co/4ovecKuVPf @hinapuff Extra summer vibes. ☀️ @smbaran1 The important thing is that you've found a drink to love! And while Kiwi Starfruit is our last sip of the summer, you'll be able to order this all year round! @QueeeenSae 😏 https://t.co/cqmtNFBDKC. @DMSgrp 🥝🥝 @jennifer_lol_ Can't wait! @sweeteningxari Looking forward to putting your name on this drink! @QueeeenSae Looks like we'll be seeing you soon. 😉 @jenfrmthblck Cheers! 😍🥝 @JenMcCreery88 If you love kiwi, this is your sip! 😍 We look forward to hearing what you think! 😋🥝 @FrijolesMinnie 😍🥝🎉 @dahnpham1983 Tastes amazing! Bold kiwi meets starfruit, a sweet fruit with mild flavor and floral finish. 😋🥝 @BrittanyScheler Let us know what you think! @PricheSmith Hi friend! Yes, you pay for your purchase using your Starbucks App in order to get plays. Plays can take up to 24 hours to arrive. Please let us know if you don't receive them after that. @xmellymel33 You deserve it. 😉 @serenarenaaa Spend or save? ⭐⭐ @puebloparrot You're welcome! 💚 @codecrumbs_ We look forward to seeing you whenever the next time is. 💚 Say hello to the all new Kiwi Starfruit Starbucks Refreshers. Cool off. Summer on. 🕶 (US + Canada) https://t.co/z6fD8L6Eef @Amyaaaaah Joy loading... @jesimink Sounds like it's time to reconnect! @stfuimnickkk Hope your day was filled with strawberry joy! @heyolicity23 Awesome! We do appreciate you sharing this delight with us. 💚 @ZoelsMom18 Especially with a cup of Salted Caramel Cream Cold Brew! 😋 @KarelyVee Hoping your breakfast wishes came true! @Brenda92M That's gourd to hear! @victorivdvy You know what's good! @I_amYat We can get one started for you! @heyolicity23 Hello, deliciousness! 😋 @ThisisAseefa See you soon? @nadeennsalehh Sounds amazing! @flaurest Sketching with sips! 😍 @yobeebz Nice! @babygirljournal Y U M @DavidHepburnIII Hi David, Thank you for sharing your feedback so this can be quickly addressed. We will share this with the store leadership team to ensure our mask protocols are being followed by all partners. Would you please DM @StarbucksCare with the address of the store you visited? -Adam @BrockLanders41 Cheers to perfection! @Catt_Sanchezz We miss you too, and look forward to future study sessions! @Horchata256 That's our strawless lid! It's made from polypropylene, a commonly-accepted recyclable plastic that can be captured in recycling infrastructure, unlike straws which are too small and lightweight to be captured in modern recycling equipment. https://t.co/9dQQUf73rB @start2levitate 🙌 @lil_stephsters That's no fun! Well, we hope we get to see you soon. 💚 @RidiculouslyRy A little kindness can go a long way! 💚 @heycasserole Happy Sipping! 😀 @waynexavierreid 💚 @brxyton Hello Monday joy! @heycasserole Just download Uber Eats! We've partnered with them to bring your favorite treats to you. View availability here: https://t.co/FT9Kh0PvhK @GalbavyJenny Yum! @lemonade_ferret It can be arranged! 😉 @lil_stephsters Did you get a chance to get your treat? @poutyfacesway Hope you've had your cup of joy, today! @Musicinme24_7 Vanilla Latte understands that sometimes you need to branch out but love will always bring you back to your sip mate. 🤗 @therealHallie That's the best thing we've heard all day! 😊 @abrrril5 Iced Chai Tea Latte with Coconutmilk sounds delish! @jhennie__ Add your local Starbucks to the list! @Jisochic Not really sure, but you should stop by. @puebloparrot Happy Birthday! 😋🎉 @_maybeKate This is so nice! 😍🙌 Aww. @sweeetbri_ Happy Birthday! 💚🎉 @katebowerss Happy Birthday! 😋🎉 @Ms__Jyoung Happy Birthday! 💚🎉 @Koko_french Happy Birthday! 🎉 @HalHigdon And we love our friends like you! 💚 @daisiessquared Run, run as fast you can! @YolandaVega It's at select stores in the Midwest, but we'll let you know if that changes! @RealInnerBoyz Please reach out to Uber Eats customer service at 1-800-253-9377, on Twitter via @Uber_Support, or go to the Help section in the Uber Eats app to report any issues. @Newmie 💪 @Ramona_W Sticking with the legends! Always a good choice. @iBaz66 Please reach out to @starbuckscare and our team will be able to help you out. Thanks! @Le_Frenchyy Gloves are optional for our partners (employees). We have hand washing practices in place that help protect you and our employees from the spread of germs while performing tasks or preparing drinks and food. @Fanase121 No judging here. You do you! @HalleBallet He looks like a very good boy! @THUGGINSHYT It's a tea-rrific sip! @_l4mb Having multiple favorites is a pro move! @Anakain10 We're glad it's making your taste buds happy! @Grumpyguy1959 This is not true and was never said. Everyone is welcome at Starbucks. @spdoggo Toasted with extra love. 💚 @LifeOfLexx There's nothing weak about liking what you like! @IfAramisWas It's not silly if you love it! @HalHigdon You're off to a great start, Hal! @OhHoneyy_i Oh, no! We hope you find it soon! @StoneheartKee That's it. That's the tweet. @RRoyer21 We love that you found your perfect at-home sip! @4NANDO7 Hooray! We're glad you like it! @tumblrseavey We're glad you found the perfect drink for you friend! @lanicolee__ We're thrilled you love them! @redranger36 We hope to see you soon! @Unikorny1 💚💚💚 @EDeeDoubleYou Sounds like you found a fave! @Jay_Shinez We're glad you did too! 😊 @onufreyonboard A power move! @metallica1331 Yes! The next Happy Hour is this Thursday, August 20th and will be available in participating U.S. and Canada stores. 🎉 @sincerelygagan That's okay, you're just very thorough! 😉 @abbie_jay_ Um, every sip feeling! 😍 For thousands of Starbucks partners (employees), the college dream is becoming reality as they return to school this week with 100% tuition coverage through the Starbucks College Achievement Plan and @ASUOnline. \n\nGood luck, partners! 💚 Learn more at https://t.co/SLKAtgdaIk. https://t.co/XcUVAGshMf @jackie_xo We're proud of you for trying something new! @boxsuukoi Never. 😉 @maeeelan No denying you know what you like! @jackie_xo Yes, and it's so yum! @jybrro Seeing you made our day! @kyexoe Your Starbucks order is delish! @ic3dmatchalatte That sounds so refreshing! @rdmcd2 Our Cloud Macchiatos have the same number of shots as our other Macchiatos! @jennifersotooo Stop by soon! @kagiyuus It's one our favorite things, too. @Gods_So_Belle Hooray for finally trying and loving the Pink Drink! @Jhen_Paiz It's a whole mood. @cheesluna Our Pink Drink is so delish. @iambernard92 The perfect summer drink! @BootlegDrake Pink sips are just perfection. 😋 @moonnjellies What took you so long? @doughty_kaitlin It's what we need every day! @LunarRaindrop You're welcome! @LunarRaindrop Our Dragon Drink is our Mango Dragonfruit Starbucks Refreshers made with Coconutmilk, and a perfect summer choice! @mattsdamons Totally friends. @VickyLynnLovey If it's got to be one drink, our Dragon Drink is a perfect choice! @mega__dyke It's the perfect drink for a warm summer afternoon! @hijerrburr Yes, just brewed differently. You can learn more here: https://t.co/oi6fORqqxg. @zoIdyck Yummy! @jennnyyyag Our Nitro Cold Brew rightfully earns all the recommendations! @chitownspinster Hooray! We're glad you like it. @Raaven_ The perfect sip, anywhere you want it! @J_Arena351 We love when 🧊 are 🔥. @Boonxin Our Nitro Cold Brew with Sweet Cream is still available. @Mahrya19 We're glad it's making your taste buds happy! @mattsdamons We've been trying to tell you! @KCkristin_d Clearly you have a favorite. 😉 @SweetMrgrta10 The launch date hasn't been revealed yet, but stay tuned! @sumi_luvv “You are welcome to substitute any dairy or nondairy option in your cold foam, but the texture may vary. @lizalettersbe Do you. 😉 @rachatrixkiddo Magic is a perfect word for our At-Home Starbucks Nitro Cold Brew. @klo318 Now you've got us wanting one! @brissagatos Oh, no! We recommend giving our Salted Caramel Cream Cold Brew a try! @nouhlew Our Salted Caramel Cream Cold Brew. @Binstarot Oh, no. @herpreet_ We're glad you like it. 😋🏆 @diaannaap Not a bad start to the day. 😉😋 @oliviaabbottx Cheers! We're happy to hear you love them. 😋💚 @MissHolly_ Time for a coffee break! @bxbyjacks We're happy you love it. 😋💚 @__Chelebrity Welcome to the world of mobile ordering! 😉 @R_Espinal25 Well worth it! 💚 @hollyed06 Yum! 😋 Is it your favorite sip today? @_theenewedition Great choice! 😉 @SaltRiverAmy Cheers! 😍🙌 @MVUKADINOVIC39 Get s'more float on! 😉 @muckentgrad Aww! Happy Belated Birthday. 💚 @spallinoaj That's the way to do it! @_WhitneyAnn_ That's awesome! 💚 @ChrisBedell Enjoy every sip! @Connie61426953 Love at first sip! 😊💚 @mjsgc_ So good! @cozysuperkick That's the sip! 😋 @Emma_LaFlair It's a sign! @goldentoxicity_ Your mom's the best! @noor26_ Thanking you now! @soshylah For sure! @CeeReyez7 Started the weekend on a delicious note! @_WhitneyAnn_ Did you get a chance to treat yourself? @ShanPxo Floating on an oatmilk cloud! @Kelizs It's okay to love them both equally! @onnibunz That always makes our day! @DouxKTH That's our kind of sip! @DouxKTH It sounds amazing! @AfrocentrkGypsy It takes off! 😉🐉 @Spicy_Noki You totally deserve Saturday treats! @shesjustdivinee We can't argue with that! 😉 @Stfu_Anajai Happy our new friend is smiling! 💕 @_alejaanndrraa = happy us. 💚 @haircutfw Awesome! @haircutfw New fave? @_yasmeaaan_ So much yum! @amanndajewel We're thrilled you love it. 😍🏆 @lricha1991 Cheers! We're thrilled you love it. 😋 @Dako1r A delicious duo. 😋💯 @ThatBoyJohnD We're thrilled you like it. 😍 @juanito_flaco Cheers! 💚 @JeremyMoses85 Nice! @Tsherrill_ Thanks. 😋🥐 @zelenacuellar We'd really love to hear what you think of the Iced Guava Passionfruit Drink. 😋 @jayusog_ We're thrilled you love it. 😋🧀 @therealcinnamom 💚💚💚 @xo_5cassidy We'll keep this in mind as we're always updating the app. In the meantime, you can always order the Vanilla Sweet Cream Cold Brew or ask your barista for Vanilla Sweet Cream in the beverage of your choice! @_theenewedition Cheers to that! Are you going to keep saving or spend them? ⭐ @corduroyblanca Hoping thinking leads to sipping. https://t.co/sym0XRHwgc @itspaola_yoo It would definitely taste as good as it sounds rn. 🙂 https://t.co/TZ87aiMINQ @MeganMasters97 We're glad you liked it, friend! @MadridFederer Thanks for the recommendation and the perfect sip score! @Chirpme2 Nailed it. 💅 @mikatayumie Cold Brew! @juanito_flaco 😍😋🍪 @Coleman240 Sooo good. 😍🍫 @summerchic45 Cheers! 😋💚 @Kay819 What did you think? @prettygalljae Delicious anytime. 😋🍓 @OVERTON152811 That's always a tough call.. which one did you choose? @chillinmychucks A classic. We like your style. 💚 @ozunasbieber Yum! 😋 @ashley_cuyun Looking forward to enjoying one with you soon! @HigglyWiggly9 Not to worry! If your store is out of Very Berry Hibiscus Starbucks Refreshers it will be restocked soon. Please check the Starbucks App to confirm product availability. Thanks! @mmithxwalls Glad you think they're a hit! @ariandretti You can never go wrong with a classic summer sip! @JaelynnGee__ 😘 @CarlosA54649378 *Chef's Kiss* 😙👌 @_johaaa_ Aww. 💚 @kidrauhlz_wifey That's a great kickoff to the weekend! 😊💚 @CarlosA54649378 A delicious start to the day. 😋 Do you have a favorite? @yhtvc_ We're thrilled you love it! 😋🏆 @Black_magicat Also yes. 😋💚 @jaszminemobley We're happy to hear you love it! Cheers! 😋💚 @SaraNoH15 We approve of this message. 😋💚 @theselfiequeen_ We'd love to hear what you think! @codecrumbs_ We're thrilled you love it! Have you tried it with Sriracha? Next level delicious. 😍 @broookitaaa We're happy to hear you love it! Have you tried it with Sriracha? 😍🙌 @itsbetcube And ever! 🙌 @therealcinnamom Yes, you deserve to sip-lebrate on your big day! @brrraulio Nice! 😊 @ChrisBedell Friday free-lings! 😉 @TeachMrATeach Sorry no, at this time there's no way to request it on the app. We will keep this in mind as we are continuously making updates. In the meantime, we do have some awesome reusable straws available at our stores. @carelesspricing Sounds like it's going to be a Starbucks kind of weekend! @xo_5cassidy You can always add the Vanilla Sweet Cream Cold Foam to your favorite coffee beverage in the app. Just tap 'Toppings' and scroll down to find the cold foam you'd like! @dopeitstwann 🎵 Sometimes you wanna go where everybody knows your name! 🎵 @nikki_romane He doesn't realize the star power that he holds. It's up to you to enlighten him, Nikki. 🌟 @MillyySummer_ On Emily Day everything you do is gold! 👑 @pixieyoongs It's your day! Get someone to bring it to you. 😉🎉 @brrraulio What did you add to your cup collection? @LokoLinds See you soon. 😉 @casaofballoons Understandable. It's delish! @s_laurenm That sweet sip is a definite hit! @pizzaonyourface Whoa! Cheers to that delish sip! 🙂 @ashleyzosa Cheers to keeping that Friday feeling going all day! 🙂 @Katarinahughes_ Soo yummm. Glad you like it! @lexiixo_ Give it a try and let us know. https://t.co/NybdfQPlNN @Tiffany_Gilley Yes! We have Cold Brew with Salted Honey Cold Foam and Salted Caramel Cream Cold Brew. @monjkika 😋 @Limmidy We'll consider it for the next one! @MKNZsays You're right! It's definitely delicious. 😊 @GraceT_101 Innovation at its best! @dreaminmrozak You got it! @MKNZsays What's it going to be?! @milkteaxrose Hey Aria! While we love serving our customers in their favorite cups, we are not accepting reusable cups at this time. When this changes, we will let you know. @stfu_itsgianna The perfect accessory! @zairahhid Yep, that's why we have to be extra careful around our dragon friends. 😉🐉 @_justicepaige_ Hi friend! We're excited to bring that drink to the US soon. The launch date hasn't been revealed yet, so stay tuned. @lexx_ayonn Don't worry, your secret is safe with us. 😉 @trt1989 Double Star day is worth it. ⭐⭐ @amelanin59 Small bite, big flavor! @BlackWingedCas Looks doubly delicious. 😉 @MandiMiller Yum! Great choices, friend! @JoeTaussig Glad we got to hang with you! @blinksloverxse You should try a Salted Caramel Cream Cold Brew with a Mocha Drizzle to switch it up! @cakefacetaty Thanks for paying it forward! @sevenpendejos Stay tuned to your app for updates on upcoming offers and events! @JulianChanFlor1 When you know, you know. 😋🍓 @bxttyarchie Cheers! Strawberry, passion fruit, açai, coconutmilk.. what's not to love? 😍 @CassidyTassart The more you play, the more likely you are to win. May the odds be ever in your favor! @carehm That's a good choice. Smooth and delicious. 😋💚 @kenl0re How about yes? @MarkDeLaGarza6 Cheers to Cold Brew! @LaurenValliere Yum! Delicious anytime, anywhere. 💚 @iAmLynn81 Cheers! 😋🍓 @lexximellor We're thrilled you like it! Try your next one with Sriracha. 😍🤤 @2hard2hate We're happy you love them. 😋🏆 @MOONDUSTLAWLEY Delicious anytime. 😍 @Steph6Fowler We love you too! @CoolerDakota We do not. Starbucks has a zero-tolerance policy on prison and forced labor globally. https://t.co/5wh12bIQVm @GlittersJessie Nutrition info is available on our website or mobile app. A grande Pink Drink has 24g of sugar (19 in a Tall). @MulhatAbdalla We're happy to hear you love it! 😋 @plebcy You've made your voice heard! 🙌 @enicoles33 New Starbucks Coffee with Essential Vitamins is our balanced, flavorful House Blend that is specially crafted with vitamins B1, B3, B5, B12 and biotin. @_kynderella 😉 @RuthAnomaly We'll thank you now for sharing this tasty tip! @awomul The judges will allow it! @Gatesy_Kait Pink Drink is our Strawberry Acai Starbucks Refreshers with coconutmilk instead of water! https://t.co/LC0nZrH6kt @MeganaSadler Getting through a difficult thought exercise deserves a Cold Brew. @madison_burns That's a big question. How can you choose? 😅😋 @Jennaaaaaaaaay_ Happy Birthday. 😉🎉 @lucyrayanneb It'll have a strong showing as a write-in candidate. 💚 @_lorenaaa14 Caramel brings everything to the next level. 😍 @ohhaytori The perfect combination of flavors! 😋🍓🥥 If you could only drink one Starbucks drink, which would it be? @DonnercreekDon Hello Don, Each store may modify their operations based on national and local health &amp; safety mandates, store formats and understanding of the impact of COVID-19 on both our partners (baristas) and the community. https://t.co/3r53zArgb3 Thank you @JoeTaussig So, see you soon? @mstephaniiie You guys need to listen up! 😉 @aireebeartv Because you deserve some joy in your cup! @alissaDAkissa We haven't announced a date yet, but stay tuned for more delicious ways to enjoy your favorites. 💚 @Sophies_Realm So happy to hear! @flore_clarissa Love you too! 😍 @joyninaaa That's the plan! @gawrdo Clearly, you have great taste! @STADIUMARCADIA Please reach out to @starbuckscare and our team will help you out! @Nbritton8 Nutrition info can be found on our website or in our mobile app. @All_TSwift13 Yes! Just ask your barista - or choose \"Blonde or Decaf Espresso\" when ordering through the mobile app to select 1/2 decaf. @GeneralJLaw That's the essence of what we do, but it hardly tells the whole story... https://t.co/2Os87ozMFj @PrincessK80___ Skinny Mocha Sauce is no longer available for purchase. We found this sauce was no longer as popular with customers and removed it from the menu. Try a regular Mocha with non-fat milk and no whip! @okay_jw It's always a treat to see you! @XxoViva 🤩👋 Hello! @MaribelsTweet You may redeem as many Stars as you want at any given time and there is no limit to how many items you can use Star Rewards on. When ordering ahead with the Starbucks app, you can only use one Star Reward in a transaction. 💚 @Jennaaaaaaaaay_ How sweet. 😋 Happy Birthday! 🎉 @nancrzzz Love this. Cheers, Dad! 🤩 @ThatsPrissy 💚💚 @SuperRobotKing There might still be time! Check with your barista for availability while supplies last and enjoy one before they're gone. @s_chad In order to receive your Birthday Reward, you need to have earned at least one Star this year. If that’s the case, we’re happy to look into it for you. @leesuhhmarie Happy to help make your dreams come true! @AnthonyDeon It's hard work making every day taste like your birthday. 😉 @VivaLaAdriana Cheers to that first sip feeling. 💚 @ksquinlann We hope you'll soon be more than thinking about it! https://t.co/wowMNhvWhF @ThisIsNotJardy Not to worry! If your store is out of Very Berry Hibiscus Starbucks Refreshers it will be restocked soon. Please check the Starbucks App to confirm product availability. Thanks! @flore_clarissa Of course! 💚 @MblaqCrymp3 Practice makes perfect! You can also stop by to sip with us. 😉 @flore_clarissa So much yum! @saritam31 We can get one started for you! @ReggieRegSW Answer the call! 😉 @suesobad Did you get a chance to stop by? @StrizzyP AKA Deliciousness @MrComical_L2daJ Everything your taste buds want to hear! @RATED_DMV_SWAGG Hope you got a chance to visit us! @AndreaZuchora 💚💚💚 @TheRaeee You deserve it! @Shmittee Sounds good! You can always add mocha to your latte or try our Caffe Mocha. 😉 @AndreaZuchora Feeling all the feels. 🤗 @Sophies_Realm What a beauty! @wrapIine That's the way to enjoy your day! @JayBabeee_ Thanks, Jay! @honeytwiti It's about time you rewarded yourself! 😉 @J0nathanSanchez Just one of those days. @J_Quizzy Will do! Thanks. 😊 @J_Quizzy Sounds like you found a go-to! @Toshifox Cheers! @xoxosabrinaa Which one are you eyeing? @soytraicy So sweet! 💚 @thedailymilli That's it. That's the tweet. @julihighroller_ The perfect at-home sip! @joyninaaa Welcome to summer! ☀️ @Nightskyre While that isn't available in the app, we recommend an iced decaf americano. @TheRealArturK It's the woah factor! @gabby_burns99 We got you! 😉 @esmeralda_mua 😉💚 @esmeralda_mua Napkin, please! @ThatsPrissy Sounds like you found your new favorite bite. @gabby_burns99 This recipe will give you all of the barista vibes! https://t.co/dGjCD2CORM @LD56k https://t.co/Oaxpv9HFsJ @Kingg_Q Apologies for the inconvenience. Due to the brewing process, we’re only able to make a limited amount each day. @LD56k Cheers to finding new favorites! @vlexv__ You're welcome. We hope you love it! @taylsperrone_ Thanks! We're pretty happy with it. 😉 @CindyOlson If only every problem had such a delicious solution. 🙂 @nappinassnick You have to be prepared for second breakfast. 🙂 @TheeAcePAIGE_ You know now, and that's what matters! @__harleigh Happy Birthday! 🎉💚 @vchan04 How attached to him are you? 🙃 @_zombeee Not to worry! If your store is out of Very Berry Hibiscus Starbucks Refreshers it will be restocked soon. Please check the Starbucks App to confirm product availability. Thanks! @KaylahCesai We love this. Cheers, Dad! 😊💚 @she_laaa94 Anytime is the perfect time for your favorite sip! 💚 @Rae_TheBoss 😎 Delicious. Cheers! @yt_dianna9 Happy Birthday! 🎉😊 @Summaaah_ Happy Birthday! 🎉 @kevinforch We're delighted that you're enjoying it! @__AmberNoRose https://t.co/bbgsztZiaA @13aalexiss Thanks for the perfect sip score! @markeugirl We love sipping your favorites with you! @vlexv__ Try our Nitro Cold Brew with Salted Honey Cold Foam! https://t.co/iP0rDyHgIL @sunkailunn Not every Thursday, but Happy Hour will be back. We look forward to the next Happy Hour celebration and can’t wait to share the details with you soon. Be sure to keep an eye on the Starbucks app for more information! @Ayee_elyy We hope you'll be enjoying one soon! @kaitlynlucass There might still be time to enjoy s'more of them! Check with your barista and sip happy while supplies last. @So_let_it_be_ An Old-Fashioned Glazed Doughnut + Your Favorite Drink = 💚 @osnapitztaz You can always stop by for both! @spudmcqueen Cozy knows no season! @DePHIn3Gravity Hope you stopped by! @ashleyysamm Fall in a cup all year round! @kellyelaine54 Just the pick-me-up you deserve! @TheLiesSheTells Yup! 😋 @SpedMrs We hope you had an amazing day in the sun! ☀️ @anndroo Delish! @ambrielmc We have and they're all amazing! 😉 You should try our Iced Pineapple Matcha Drink. @_juliettteee Yes please! 😋 @AnwarHussein03 Seems like a fair trade! 😉 @jeanmobilia A great day, indeed. 💚 @demonicqueef It stays on our minds too! 😍😋 @vitela9 Def. makes Mondays better! @Sharonvirgo12 Delicious way to start your day! @alexisxmcleod Pair them together for a delightful taste experience! @Bint_Ahlee Did you get a chance to stop by? @_jaaychinna One of the best ways to get through Monday! @Elizzynguyen 😉 @_OliviaBrooke Cheers! 😋🍓 @jazzy_claus You can say that again! 😋 @dejaxo__ Let's hear it for self-care! 💚🎉 @Muva_Ash7 Delicious! 😋 A perfect duo of guava and passionfruit paired with creamy coconutmilk. @nicholasdehler Monday priorities. 😋 @minimeeer We approve. 😋🍪 @lilbabyzooted Come on over! @HOLLYatme_ We knew you'd love it! @MakkuMoon That's a delicious customization! @spaceyfalling It's still one of our favorites! @bcctk_gh An iconic duo. 🙌 @RealAlizabelle Enjoy! @dreita__ You can't go wrong with a Caramel Frappuccino®! @kfern305 Sometimes you just need a Caramel Frappuccino®! @drea_5x2 Come and visit soon! @CALlllSTA Iced Caramel Macchiato! @Elizzynguyen We hope you got the Pink Drink, too. @jayydeemoreno Stop by and see us soon! @diandiz_ What a nice way to start the week! 💚 @EMTBryanUwU Cheers to a great interview and a delicious sip! 🎉 @jaackie_d Happy Birthday, Jackie! What drink did you enjoy? @Rae_TheBoss Do you need to? 😋 @brittttburke It's delicious either way! Let us know what you think if you try it iced! 😋💚 @mikaylaquiros You won't regret ordering our Pink Drink! @seui___ Sip, hair flip, goodbye! @MeganPatsel Hi Megan! On the app, tap \"Starbucks Reserve Latte\" and then the \"Espresso &amp; Shot Options.\" Under \"Shot Type\", tap \"Reserve Espresso Roast\" dropdown. You'll see, and be able to select, the \"Starbucks Reserve Decaf Espresso Roast.\" Enjoy your latte! @jcxrew We think so, too. @NeshaUnknown The perfect sip for any day! @tinynosferatu You're going to rock today! @DeniseRochelle_ Fuel for the second half! @missmelblatte Your favorite brew has your back! @J_Thizzle Give our Decaf Iced Americano a try! @SirCarlyle_Sway The perfect summer sip! @maribelwould How fun and delicious! @OnlyOneAji_ For sure! @not_so_Lo_key But we are the boss of Pumpkin Cream Cold Brew. @hello_atl Happy Birthday! 💚 @not_so_Lo_key Be patient! @ninamurdahh Tart and sweet with notes of mango, citrus and dragonfruit - what's not to love? 😍😋 @pagekilcoin It happens to the best of us. 😉 @snakeboiloki Right now Starbucks delivery is available in select cities! Check availability near you by visiting https://t.co/FT9Kh0PvhK. 💚 @cristiiina___ Happy Birthday! 💚 @_AllhailqueenK 😍 Cheers! @MBELANOVA Enjoy! @garrisonsquad Cheers to trying something new! @TheNEWGURU Prices vary by region. We recommend checking prices in your area through the Starbucks Mobile App. @ashleeluv7 It's cute is always a good enough reason. @alliealvarezz A perfect way to start the week! @welldamnMa 😍 RT @StarbucksNews: With impacts of COVID-19, as many as 54 million people may experience hunger in 2020. Starbucks is continuing our long-s… @SuriGhostgarden Cheers to favorites! 🎉 @summaglow Hooray! 🎉 @summaglow We're glad it's making your at-home sip perfect! What flavor did you try? @Kckhani88 What a wonderful way to start a Monday morning. 💚 @SuriGhostgarden The perfect way to start your week! What sip did you pair with the Cheese Danish? @welldamnMa It's always better when we see you in person! 💚 @Dw_wonie That's awesome! 💚 @Statuesque__XOX Sounds extra delicious to us, friend! 😋 @bry_anni22 A deliciously crunch sip! 😋 @_lovelyjmp_ Sounds like you found your perfect at-home sip, friend! @EMTBryanUwU Good luck! We hope the first sip feeling of your Cold Brew is everything you are looking for. 💚 @anahbelxo Yum! Cheers. 💚😋 @judy__flores They are the best way to get your day started right! Which is your favorite? @KatieTaniguchi Sounds like the perfect way to start the day! @sacatelaschichi Small bite, bit impact. 😋 @_enviedd Hooray! We're so glad you found a drink to love. 🎉 @Saucelyn_ There's nothing better than the ooey, gooey bite of a Crispy Grilled Cheese Sandwich. 😋 @M_Khan_9 Sounds like you found the perfect veggie option for you! 😉 @chrislbm55 Little twist, big flavor! @aesthetlcmenace Thinking outside the box for a delicious sip! @gabbyblackburn That's it. That's the tweet. @glonoriegaa We love it when 🧊 sips are 🔥. @jason_nature Looks positively delicious! 😋 @ninethirteenn 💚💚 @Brendaa831 Or find your favorite Starbucks At-Home Coffee at the grocery store and fill it up. 😉 @peterbrianb We always love it when you stop by. 💚 @ashleyyrossi There's nothing better than a salty, sweet sip. 😋 @yesimttrouble Mic. Drop. @boptarts Egg-cellent tweet. @ninethirteenn Toasted with extra love, just for you. 💚 @swimvhoff We're glad you loved it! @genesis_sivoney Cinnamon and coffee were made for each other. 😋 @sillykoko118 Cheers to new favorites! @YvetteMonetXx We hope you loved it a latte. 😋 @_LiciaaaBishaaa Sounds like you have a new favorite, Lillian! @laurarobbinzz16 Both? Both sounds good to us. @TheNEWGURU Your reusable cup does not have to be Starbucks brand. @HadiaYounger Come check out the merchandise at your local Starbucks store! @peterbrianb We're sorry to hear that was your experience. Next time, let your local barista know and they'll happily make you the beverage you prefer. @akechi_ebooks Well that's rude. 😉 @beckiiful The barista is within you! @kassxcmb 💚 @alizakv_ Have you tried our delicious Salted Caramel Cream Nitro Cold Brew? @kaitmarinnn There's nothing wrong with knowing what you want! @cheyennabelle That's what friends are for! Feel better. 💚 @AnuGajee Happy sipping! ✨ @Dw_wonie Happy to hear! @stygracie Hello, deliciousness! @mviera_ What a morning! @KeelyxBridget Pair with a Mango Dragonfruit Lemonade Starbucks Refreshers! 😋 @xCrysMarie_ Sorry, we don't offer our merchandise online but we recommend stopping by your local store or checking your mobile app for cup availability. @docKev_ Wives always know. 💚 @_goalgettaaa So sweet! 💚 @morgangrace7 Woohoo! 🎉 @welldamnMa Hope your favorite finds its way to you! @morgangrace7 A whole new world! 💚 @ColeneTessier8 Happy Birthday! 🎉 @RealDavidTropp Sounds like a plan! 🧡 @hypebeastgroup1 Which one made your Saturday happier? @RealDavidTropp Did you fall in love? @Shahryar66 You can do anything with your favorite by your side! @Enrique85341504 Say less! 💚 @susansidun You're very welcome! @omma2agj Enjoy every relaxing sip! @Enrique85341504 Which one do you have your eye on? @shantanub The perfect partner! @NadineManson Looks so cozy! @starfish0524 Let's have a sipping Sunday, Natalie! @susansidun Hi Susan!  You can find out when your Stars expire by going on the App, tapping your Star balance number, and scrolling to the bottom. There you will find recently expired Stars and Stars expiring soon. @vanillakush_ We’re excited to bring the Kiwi Starfruit Starbucks Refreshers and the Star Drink to US stores. An arrival date has yet to be revealed, stay tuned! @linakalam Hope we get to sip with you! @humzxi You're favorite's always there for you! @nogray_jose So, see you soon? @ArranHeron2 Ummm can we be your crush? 😍 @iLoveKellina Which one do you love most? @TheWorldsMyShip Cheers to that! @ProBendingChamp Congratulations! 🎉 @allie_tastic Priorities. 😉 @sharlynnecruz Here's hoping that we could have another study session soon! 💚 @childofchaoss It's just right! @suri_qasim Delish! @ruby_i_am New go-to? @xoairam13 Welcome to the woah of Nitro! https://t.co/Dxs0gyFjpu @MR_PERFECT6 We got your back, Joel! Did you pick a sip yet? If not, you should try a Vanilla Sweet Cream Cold Brew. @lucytahh Woohoo! @duhhope Thanks for always sipping with us, friend. 💚 @luvrkoobi Absolutely! @extrayakult 💚💚💚 @luvrkoobi Hello, Saturday sips! 😋 @MR_PERFECT6 What's your go-to? @victoria_haas98 Awesome! @extrayakult Cheers to fun with Dad! @duhhope We just want to sip with you! @jacobrod Kindness adds a little magic to your cup! ✨ @Evangeline1219 Mmm! 😋💚🥥"}