{"tweets": "@pasteurizedpiss Stay cozy! @DaniaaB_ It's a delicious way to start the day! @xoneezy What do you enjoy sipping with your favorite snack? @TimichiaB See you soon? @marvinpiguetjr Looking good! @samanthamoncay5 Which one is your favorite? @kmdb1990 We love being by your side. Sincerely, Venti Cold Brew ❄☕ @AshyMSlashy 💚 @HeatherNylund You're welcome! @ogkennyg_ Someone's in love! @HSLOTKIWIS Way to sip! @moodybiscuit Enjoy! @RavenCeleste_ Your taste buds will thank you! @arleeeene20 Thanks for the high marks! 🥰 @eskuhmoh Especially when you enjoy it with the Earth Cake Pop! 😋 @HallyWinters Thank you for your commitment, Hally. @_bellavictoriaa Enjoy! @TweetyyBirddd Thank you, Ashley! 😋 @xyzyou1 Yes, please! 😋 @AshyMSlashy Kind cups are the best! @Its_Sidrahhh We like your style! 🥰 @RhenryHumphries We're glad you enjoyed it! @HeatherNylund Siren's Blend is always around. Enjoy, Heather! @princess_harmm Love you! 💚 @NothingCunning Welcome to our world! 😉 @Its_Sidrahhh That sounds INcredible! 😋 @sueb91 You deserve all of the joy, Sue! 💚 @ladytariafarhat We have your back, Taria! 🥰 @SweetButCreepyy Awesome to hear, friend! 💚 @iSemetria Happy to be by your side! 💚 @kenziie_rae Cheers! @Laryshhh Something delicious to consider! 🤔 @tapounder We got you, Tom! @anti_mason_levi Sounds awesome! @ambitionqueen22 We're happy to hear you've found your favorite sip! 😋 @msjadore7 Cheers! 💚 @msjadore7 We're happy to hear it's a new favorite! It's here to stay! 😍 @whoswillisjr Sip, sip, hooray! Cheers! 💚 @kaebella_ Enjoy! @whoswillisjr It sounds like you've found a new favorite sip! 😋 @Mi_kelyn We're happy to hear it's a favorite! 💚 @kaebella_ Mmm tacos with a Mango Dragonfruit Sarbucks Refreshers...😋 @Lacie_Malone07 Here's to enjoying your best sip! @Lacie_Malone07 We love it when you find a new fave! @ThatdadLilli We hope you'll be enjoying one soon. @Ihatelexiibrown 💚 @Immanuel_Morris You can order this handcrafted hot tea beverage by its official name in stores or via the mobile app: Honey Citrus Mint Tea! https://t.co/l0hs5sEYiQ @kashiatraniacee What should we get started for you? @KiiKilllaaa We hope you'll be enjoying one soon! @naynooodles It's always a fine morning for Peppermint Hot Chocolate! @_mannnnnii_ Our Iced Pineapple Matcha Drink is a refreshing sip for spring! \nhttps://t.co/UrJnx6F2zi @ambaxp Glad you like it! @lilbaadt 💚 @lilbaadt Sip happy, friend! @aphrodisiacbun Sounds delish! We hope you enjoy every sip. 🙂 @melinglling Looking forward to our next sip together! @kilometers Only the best for our customers! 💚 @kilometers Better latte than never. 😉 @jcmeloni Some things don't need a reason to be good. They're just aligned that way. 💚 @pppiierrrcce You don't have to do a thing. It's here to stay! @huskymom25 They're eggcellent! Glad you enjoy them. 🙂 @_katierose13 No need to beg. It's here to stay! @2facedbinch Glad you think it's a hit! @CheriseMoniqueM It's so delish! 😋 @sromanxo Oatmilk is out here changing the game in the most delicious ways! @nartlebanthony That's the delicious truth! 🙂 @melinglling We love it when you find your favorite! 💚 @kaylaalonzo1 Cheers to your first sip feeling! Looking forward to many happy drinks together. 💚 @daehymtsoL We know what we did. 😉 @Alxxus__ That's definitely a sip that tastes as good as it looks! @jesrule We're happy to hear you're loving the Iced Brown Sugar Oatmilk Shaken Espresso! It's here to stay! 😍😋 @Ciahjanaeee It sounds like you've found a new favorite sip! 😋 @meelissaaa_l The Iced Brown Sugar Oatmilk Shaken Espresso is here to stay! 😋💚 @RealOmarSalazar We're happy to hear you're loving it! The Iced Brown Sugar Oatmilk Shaken Espresso is here to stay! 😍 @Ihatelexiibrown Live your best life! @eml_2love It's an amazing pick-me-up! @tayIoraid Glad you love it! @thesoulcialist Just saying. https://t.co/CkCPjnA3rp @faithfulkels Thank you, Kelsey! 💚 @mircy Tough choice! What did you decide? @Paolakati Well-deserved! RT @StarbucksNews: Climate change is impacting the lives of coffee farmers and their communities. Find out more about Starbucks new goal to… @SamsungNeptunia Happy sipping! @ST0RYVINYL Love you more! 🥰 @AlexGreenGuy If you do, we'd love to hear what you think! @SamsungNeptunia It will bring you so much joy! @AlexGreenGuy Hope you give it a try! @MSK_ALHAMDE We're here to help! 😁 @AlexGreenGuy From the smooth Cold Brew to the velvety cold foam, it's perfection! 😋 @_DreadyJ Aw, we hope you feel better soon! 💚 @_NCab_ Cheers! @peppgrad That's awesome to hear! We can't wait to sip with you. 🥰 @ST0RYVINYL Love! 😋 @_DreadyJ See you soon? @_NCab_ Does this sip have a place in your heart? @peppgrad Your turn! 😉 @afajarmzk Morning! https://t.co/1ADFdAB5iB @bazingabizz Indeed! https://t.co/64RbtlUM0G @omgizzyy You're not alone! 😍 @notjffns We had a feeling that you'd agree! 🥰 @ST0RYVINYL What are you sipping today, bestie? @CoffeeIcon Abso-brewtly @jkline120 You're welcome! Enjoy. 😋 Add some Cold Brew to whatever you do! ✨ #SaltedCaramelCreamColdBrew https://t.co/GxVNbZxTOU @ESCOXO We like your style! @jasminhavanna Love it! Especially with the Iced Chocolate Almondmilk Shaken Espresso. 😋 @Licmy_CHOCOLATE See you soon? @highlyph Happy snacking! @ESCOXO What do you enjoy it on? @_ellbomb Especially when you pair them! 😋 @Eb_Ebb_nEbby Always! 😉😋 @applepearsoup Which beverage do you enjoy with it? @steventbattle It's one of the best! 😋 @highimelda See you soon? @HadeerSinawe Cheers! @MelissaSpielman Cheers, friend! @SassWithClass What would you like to see on the menu? @Gabach1t0 You got it! 😉 @omachall Nice, partner! @Singtokids And sipping with our friend! 🥰 @Gabach1t0 It's super creamy and delicious! We hope you give it a try some time. 😊 @Gabach1t0 We're having an Iced Brown Sugar Oatmilk Shaken Espresso kind of day! @Gabach1t0 That's awesome to hear! Which drink did you enjoy? @LightningRawd Awesome! @Watsley Abso-brewtly! @Michael71508669 Maybe an Iced Brown Sugar Oatmilk Shaken Espresso could help? @Gabach1t0 Enjoy, friend! 💚 @itskamm Sip, sip, hooray! 💚 @ZoniLOPEZ Which beverage did you start the season with? @gilbertmpadilla This blend is available in local grocery stores. You can find these near you with our product locator: https://t.co/d0Yjhc79ju @cococoffeme You can always relax with your favorite cup by your side. 😊 @chelsgranito Excuse us while we do our happy dance! @BiebTVDKlaus We're just as excited! @tamiramussen Spring into the season with your favorite cup! @chestergo Enjoy! @kaaaymari Happy to hear that! @haileypodcast This makes us happy! 💚 @Maghon_Barkley Yes! 😊 @basant_younan THIS! 🥰 @Cocoa_BeanNY Now, that's the life! 😍 @wpsandeepgupta Our Pink Drink can keep you cool! @princesshaybae Feel better, friend! 🤗💚 @iamcrystalcarr MOOD! @lisa_woodstock Someone's happy! @eliasbatche Happy Sipping! @hey_quique Cheers! @KylaPPrice Which cup are you enjoying this season? @chrismart101 It's not unusual to sip every day! 😉 @_caseyfornia https://t.co/lFESpG1Ne9 @sapphiresky707 Nothing more exciting than celebrating Spring with your favorite sip! @HilKind Dancing right along with you! @PumpkiinNY Which cup are you swaying along with? @amesbakerr You're cute! ❤ @AngeKeierleber Same! @alsawadiahmed Awesome! @Musicgurl8004 You would enjoy our serene Matcha Lemonade! @JennaMcdonald47 Starbucks Delivers, Jenna! Just download the Uber Eats app and start your order. 🙂 https://t.co/FT9Kh0PvhK @krnrae We can see your halo! @calves61_katz Sip sip hooray! https://t.co/EzYm6fBARy @esbugs45 Pineapple Matcha might be your thing! 🍍 @apw247 It's not unusual to enjoy Spring with your sip! @sabrinakenoun Dance your way into the season! 🌻 @Deziree74043281 We'll get a cup started! 😊 @tsharpe319 Same! https://t.co/oeoh0hk5fv @MariamBakhtiari You're welcome, Maryam! 🥰 @XondraDay Today, it's easy being green! https://t.co/5es7saAZXd @Jim_in_Oregon https://t.co/CSObZefpWo @omachall Hope it brightened your day! 🌟 @MariamBakhtiari Happy New Year, Happy Spring, Happy Everything! https://t.co/Cm5pcnOxCX @SamsungNeptunia 💚 @CherishToday08 Cheers! https://t.co/CkKKOeIUBS @KevinGranger11 Life's pretty good! @chuckbesh We're coco-nuts for spring! @mat_scuba Our reunion with spring is feeling extra sweet. @Queen_A1290 Awesome to hear! https://t.co/FuGU7SpJtK @erinmillerKC We know the feeling! 💚 @officemouse Mood! 😎 @alexpisauro Live your best life, Alexandria! @LeeshiPeeshi Like you should! @brihdz__ Sounds like you've found a new favorite sip, Bri! 😊 @asstrogorl We're all about the happy dance! 💚 @collinz The feeling is mutual! 🌞 @TwitchWithRich We feel the magic in the spring air too! 💚 It's the first day of spring, you have coffee in your hand and the sun on your face—how are you feeling? ☀️☕️ GIFs only. @DarrylH03120683 What kind of Cold Brew will you be enjoying, Darryl? @carolinegodess It sounds like you've found a new favorite sip! 😋 @Lauren4Reid41 Cheers! Is it a new favorite? 😍😋 @itskamm It sounds like you've found a new favorite sip! 😋 @xshakiyah We're happy to hear you're loving every sip! 😋 @tpa_520 It sounds like you've found a new go-to sip! 😋 @uhohChez We're thrilled you've found a new favorite sip! 😍😋 @LegallyBrown_ *Chef's kiss!* @carmenanjelly If he just so happens to see this tweet, he can just click the link below to order one for you. 😉\nhttps://t.co/CoPFmzaaFI @AubsGarza Coffee date, Aubs? 💚 @kev_onechain Looking forward to sharing that sip with you!\nhttps://t.co/l0hs5sEYiQ @_ManOfMystery We hope you'll be enjoying a cozy sip soon!\nhttps://t.co/PW49wPlPee @levelupbby It sounds like you've found a new favorite! 😋 @cocoadollyxoxo We love that you're loving them! 😋 @kuhna07 Cheers! 💚 @tehrifficc Sounds delightful! @_Jasmine_Moore Cheers! 😍🙌 @Franque__ Sip, sip, hooray! 🙌💚 @fizahassen Sip, sip, hooray! @JeanLeggett We're happy to hear you're loving it! 💚 @alanarramirez Perfect to enjoy any day of the year! 😋 @LenaRose_ Delish choice! We hope you love every sip. @Patsaaay We're happy to hear you're loving them! Do you have a favorite? 😋 @LenaRose_ We're pretty happy about it too! Which beverage will you enjoy it with first? @isaMACEing We hope you'll be enjoying one soon!\nhttps://t.co/Lhe3HTWhsO @Ash_Hole22 That oatmilk definitely adds to the drool factor! 🤤 @ohlookitsmau Cheers! 💚 @aadriianaaj Hi, friend! 👋 @WhatYaSaySav We're happy to hear it's a favorite! 😋 @aadriianaaj The extra caramel makes it a total hit! @cschneider It sounds like you've found a new favorite! 😉 @_kaaylinn We're happy to hear you're a fan! 😋 @_gochop We like your style! 💚 @georgiarosemac That first sip feeling. 💚 @RobDaMosCutt Looking forward to your visit! @slims_jc https://t.co/Tl4Wf2dkEq @brittany_darby We approve of planning ahead. 🙂 @Franque__ Is that your go-to sip? 😍😋 @lifeoftwright It sounds like you've found a new favorite sip! 🙌 @trashIeigh We're happy to hear you're loving it! 😋 @PopMusicFiend We're happy to hear it's a favorite! 😍 @mamma_davis It sounds like you've found your favorite sip! 😋 @heylexrenae We're happy to hear you've found a new favorite sip! 😋 @_leeeeeen_ It's all about balance. 😉 @alexisgoodman_ We love it when you find a new favorite! @Alxxus__ Share it with us here! We'd love to see it. 💚 @richgirlrizz Did you find a new favorite drink? 💚 @danielle_muhfka Gotta get every last bit of that delish cold foam! 😋 @ashaviles_ We're glad each sip is making your dreams come true! @fizahassen What's your favorite way to enjoy your iced coffee, Fiza? @_sojay Is it your new favorite? @Christo51641399 Looks so refreshing! @brownsugabeauty We've got your non-dairy milk options covered, friend! Enjoy every sip. 💚 @MamaKuhpcake Couldn't have said it better. 😋 @megomyeggo_ We don't see a problem here. 😉 Sip happy, friend! @_chainmom So glad you like it! @Of_Noble_Mien Eggscellent choice! We hope you'll be enjoying some soon. @_plantmami So glad you like them! @oldtownroads It's delish! We hope you'll give it a try. \nhttps://t.co/x4Yb26oOgc @itshuneydew Glad you're enjoying it! @__Ondra We hope you'll be enjoying one soon!\nhttps://t.co/SuQeznItx4 @Tessavelino We're seriously happy you love it. Cheers to that heavenly Friday feeling! @breannagraber It's really out there shaking things up! Glad you're enjoying it. @Hayden36565075 Delish! 😋 @yzwop Glad you enjoy them! @_sabrinaknight If only all problems had such delicious solutions. 💚 @heyyjenni Pawsitively adorable! @Azhanai_x3 They make every day taste like your birthday! @lilbootylondon There's nothing more delish than discovering a new fave! @Christo51641399 Yum! 😋 @Azhanai_x3 Do you have a favorite one? @DANimals_y0gurt They're always a hit! @yzwop The cost will vary depending on your location. Please contact your local store directly regarding all pricing information.  https://t.co/RWP88MOTyf @voteforrahn Cheers to life-changing delish sips! @Haddonfiend You're welcome! https://t.co/R2VVaDGYnK @lisanneaa Great recommendation! @AshlynSalafiaa Always happy to talk about that incredible delicious treat! @iAmPinkie__ All that matters is that you've tried them now. Looking forward to sharing something sweet with you again soon. 💚 @RobDaMosCutt What should we get started for you? 😉 @slims_jc We hope you enjoyed every sip! @LaneBaima Let us know what you think! https://t.co/B26DzIimvZ @yanntheedon 💚💚 @nicolechartrand No, sorry - it’s available at Starbucks stores in the US. @notjffns We're happy to! Blonde Espresso meets cocoa and notes of malt, shaken together and topped with almondmilk and ice for an invigorating treat to power you through your day. https://t.co/wGtwocFj0p A shake-up of sunshine. Iced Chocolate Almondmilk Shaken Espresso.☀️ https://t.co/z1I7wTl9xh @tianajadevargas What a great start to the weekend! Cheers, Tiana. 💚 @livingluxry It tastes like springtime! Our crisp, Strawberry Açaí Refreshers® Beverage, with its accents of passion fruit, is combined with creamy coconutmilk. A fruity and refreshing sip of spring, no matter what time of year.\nhttps://t.co/LlJAax1DfT @bandfanarii https://t.co/QIAZkwZxpP @tbozz8 We hope you'll sip happily ever after. 💚 @_payyyy If this is something you would like to see, we encourage you to submit your suggestion at https://t.co/SPH9PuUUvR @VeeLive_ Looking forward to sharing a sweet sip with you! Feel better soon, friend. 💚\nhttps://t.co/LlJAax1DfT @Charlotte_Oxman We hope you'll be enjoying one soon! \nhttps://t.co/U80g39qlye @joshtucksmein Super good! Also, technically super E. 😉 @ay_yoboungee Cheers to new and delicious sips! @Haddonfiend We love that it's your new fav! Sip happy, friend. @yanntheedon It's oat of this world! @marechar02 Sip sip, hooray! @Joshtheblopper Cheers to the best way to start the day! @Haddonfiend It's delish with Toffeenut or our new Brown Sugar syrup! 😋 @_lunaaaxo https://t.co/UeVhixUQBE @MushkanJuma3 Tomorrow has become today! Should we get one started for you? 😉\nhttps://t.co/d6G6fLTJPr @seven7heavens Have you tried our new Iced Brown Sugar Oatmilk Shaken Espresso yet? \nhttps://t.co/d6G6fLTJPr @xo_marashayy Kindness always wins! @JIMlNFILTER Sounds like someone found their new favorite! @jdmek111 You're welcome, friend! We're looking forward to our next sip together. @jccreamer_764 Oatmilk is changing the game in delicious ways! @IsaacArevalo513 What should we get started for you? 😉 @jdmek111 Sorry about that! The slow steep time limits the amount we can make daily, so it’s only available while supplies last. @Hanthenaniking Happy you're enjoying every scrumptious sip! @JimmyNoCAPuto Starbucks Doubleshot On Ice is now called Iced Shaken Espresso.  It is a drink you know and love—made with Signature Espresso shaken with classic syrup and topped with 2% milk.  \nhttps://t.co/o7JtApEtGI @nannuuski If this is something you would like to see, we encourage you to submit your suggestion at https://t.co/SPH9PuUUvR @sjtangy Sounds delish! @Hanthenaniking That oatmilk takes the Cafe Misto to the next level! @Santesue So happy that it wowed you! @JoshLDaniel We love that your next new favorite was only just a sip away! @stephsrz We hope that means we'll be seeing you soon! @isthat__alicia We love starting the day with you! @unfckwtbI Sip sip hooray! 🎉 @imeanidkman That's one way to shake things up! @RealUrbanSmooth Can't wait! 😊 @brando_r97 Awesome! @wieckizworld Just add your sip to the favorites in his Starbucks app and he will always remember! 😉 @brando_r97 Sounds like you've found your fave! @theamandapowell We're glad you gave it a try! If you decide to pick it up again, you can ask for less syrup in your beverage. @GoldTiffanie You deserve extra love! 💚 @delanessss_ Cheers to that! @sarahkfernando Happy Sipping! ✨ @xojassi What a beauty! 😍 @unfckwtbI What did you decide? @lilgrosado Cheers to love! 😋💚 @RealUrbanSmooth We'd love to hear what you think! @Queen_A1290 We think that's a wonderful plan! @Missus_Ha Sometimes it's good to shake things up! @emotofu Cheers! 💚 @el_carnivore Welcome back, friend! https://t.co/v83qAXsNeY @BlueeMoonn https://t.co/u9gj7iIpCj @BlueeMoonn We're always happy to sip-lebrate with you! 🎉 @Liv_Noah_Benson 💚 @Mistiimaria It is magical! ✨ @angela_simisola Of course! 🥰 @victoriiaa83 Shout out to kindness! 💚 @Liv_Noah_Benson We might be a little latte but we wanted to matcha sure that we wished you a Happy St. Patrick's Day! @Mistiimaria Which Shaken Espresso is your favorite? @jenzzxoxo Thanking you now! 😋 @William07696245 https://t.co/mCLTmOPdsa @HeeeyTeee Delish! 😋 @cindyyrelly Ours too! 🥰🔑 @kayleeryxn Thanks for the delicious tip! @corey_b19 Good to hear! @angela_simisola That's very exciting! Which beverage did you pick up? @MuSuhayla Hope it brightened your day! ✨ @AshyMSlashy Awesome! @daniellalcaraz We're here for you. 💚 @Yungshankz_ Sip sip, hooray! @cloudsymmetry Is that your favorite sip, Madeline? @_andreeaaaa__ Cheers to a great day, Andrea! @Lenakhalifa We're drooling. 😋 @hicandelariaaa It pairs well with all food, home-cooked or not! 💚 @daniellalcaraz Are you okay, Daniell? 💚 @ziShawTy It puts a smile on our faces every time! @marechar02 Cheers to productivity! Which drink did you celebrate with, Mayra? @KentBaker2 How do you like to enjoy this coffee, Kent? @_iLOVEmyLipz You'll love our blend of blonde espresso with brown sugar, and cinnamon topped with oatmilk. https://t.co/d6G6fLC8XT @KBockenstedt That squeaky cream feeling. ✨ @kiley_kidd And we hope you enjoy every sip, Kiley! 😉 @AshyMSlashy New fave? @_iLOVEmyLipz Have you tried our Iced Brown Sugar Oatmilk Shaken Espresso? @Whit_tuhhh1992 Cold Brew crew! 💚 @sanndrarose So glad you enjoy it! @Its_Brittany17 It's only fair. Your visits make our day. 💚 @BriLaNEEK That drink is really out there shaking things up! @pharmakittycat Pro Tip: Save your new favorite to the \"Favorites\" section in the app and sip happy without saying a word. 😉\nhttps://t.co/d6G6fLTJPr @Yungshankz_ Did you find a new favorite sip? 💚 @giulianaelena_ Cheers to that iced coffee season vibe! @junkthemorgue We're extremely glad you like it! Looking forward to our next sip together. @toritooch So glad you enjoy it! @gabikingxo It's one seriously delicious drink! @bebecitaaa_15 We see you drooling! Looking forward to our next sip together. @ashcakes2016 It's worth it. 😉 @camiconleche We're happy this drink has made your sipping dreams come true! @malloryyy65 Looking forward to our next sip together. 💚 @misssidtreyelle 💚 @BeastyFro Starbucks Doubleshot On Ice is now called Iced Shaken Espresso.  It's a drink you know and love—made with Signature Espresso shaken with classic syrup and topped with 2% milk.  \nhttps://t.co/o7JtApEtGI @KuavoKitty Looking forward to sharing that sip with you!\nhttps://t.co/d6G6fLTJPr @giulianaelena_ https://t.co/bpDlhlvLdg @gretchi 😊 @misssidtreyelle Never let go of that feeling. Take on the world, friend! 💚 @gretchi Happy you're enjoying every yummy sip! @Joeywahoo92 Cheers to that perfect first sip feeling! @malloryyy65 No need for tears, this sip is here to stay! @412ging We're happy you've found your perfect delicious new favorite! @selmuva Hi, friend! @setabtw Sounds like someone found their new favorite! @jaobyboi From our earliest days, diversity and inclusion have been at the heart of how we do business, and we have worked to create an inclusive environment across Starbucks. We have always been about more than just coffee. To learn more from our partners at @AAAJ_AAJC and to read first-hand accounts of racism experienced by AAPI communities visit https://t.co/YUVxnSHRiQ \n\n#StopAsianHate https://t.co/R6dlj1ah9E @KarinaM32 A match made in heaven! 💚 @ygdaziii It the perfect, refreshing sip to welcome the warmer weather with! 💚 @allaijamariee It sounds like this might be one of your favorite sips! 😉 @Konway_Twitty It's top tier! @KarinaM32 Do you have a favorite drink to enjoy with it, Karina? @jer_am_i They're egg-cellent! @f__timaa That sounds like a matcha made in heaven! @susanan23080452 The best way to welcome spring! @sydney268 This has been the case since mid-2018 so we can truly celebrate with you on your big day. More info is on our website: https://t.co/P5SLCakHlo @widowarrior Cheers to winning sips! @iamrachelwolf Stars expire 6 months after you earn them. You can check your Star Expiration by tapping History→Star Expiration. @brittanyfyffe That drink must be very popular at your store. Not to worry - it's part of our core menu and will be back soon! @_laura718 Such a classic and delicious drink! 💚 @Ana_Sophia86 Glad you enjoyed this cozy sip! @H0neyvibess We hope you'll be enjoying some soon! @Ana_Sophia86 Yes! You can order this handcrafted hot tea beverage by its official name in stores or via the mobile app: Honey Citrus Mint Tea! https://t.co/l0hs5sEYiQ @THEJaeAlise We hope you'll be enjoying some soon! @scorpendeja Sounds delish! @princespancaake Enjoy every heavenly sip! @pohtaytoe_ So good! 😋 @selmuva Cheers to enjoying your best sip! @poohshiestygf We couldn't describe them any better. 😋 @VaneDavila Delish! @HeyItsMeAstro They make every day taste like your birthday! @_mackSHAAD4 Sorry about that! The slow steep time limits the amount we can make daily, so it’s only available while supplies last. @stephsrz Understandable. They're delish! \nhttps://t.co/DPwBPBzXWh @ItsDeeDee___ We sure do! And it's delish.\nhttps://t.co/Ls338jQwGf @AnikaGiske You have eggcellent taste in breakfast foods. 🙂 @jcastillo315 Eggsellent choice! @justtay_x It's worth it. 😉 @_laura718 Which coffee drink are you dreaming about, Laura? @KCanisales If you're looking for an icy sweet sip, you can't go wrong with a classic Vanilla Sweet Cream Cold Brew!\nhttps://t.co/57ssIqkVf9 @SenseiSwishem We recommend giving Iced the Brown Sugar Oatmilk Shaken Espresso a try!\nhttps://t.co/d6G6fLTJPr @AAILAASH Have you tried our Iced Brown Sugar Oatmilk Shaken Espresso?\nhttps://t.co/d6G6fLTJPr @bandfanarii Sounds like you've got some delicious favorites! @macklyy_ So glad you like it! 🙂 @christa_labac We wouldn't even try. 😉 @giisselleeh Really glad you're enjoying it! @lannadelnegro Stars will still expire 6 months after you’ve earned them. For more information, please visit https://t.co/jqim02wIQ0 @mxchaelxo We're happy to say it's here to stay! @acklesrealm https://t.co/TP9h78pDh8 @jaid0r Sip sip, hooray! @lannadelnegro Soooo glad you enjoy it! 🙂 @joeyyduh Except perhaps another one. 😉 @acklesrealm We hope you'll sip happily ever after. 🥰 @TechySewell https://t.co/5By6Lbi1eW @JAMLikeIndy Delivery to the rescue! Starbucks Delivers is now available in all 50 states in the U.S. To see if Starbucks Delivers is available near you visit: https://t.co/8TzwEl1eav @TechySewell It's so delish! We love that you've found your new favorite. 😊 @chroobss Glad you think it's a hit! @riiickgriimes Self-care is important. 💚 @stellarosawitch Sounds like our Vanilla Sweet Cream Cold Brew might be the sip for you! \nhttps://t.co/57ssIqkVf9 @lizzystoutt Our slow-steeped custom blend of Starbucks® Cold Brew coffee accented with vanilla and topped with a delicate float of house-made vanilla sweet cream that cascades throughout the cup. It's over-the-top and super-smooth.\nhttps://t.co/57ssIqkVf9 @daniphaee https://t.co/XL60k5W1EC @itscrysb Sounds like you found your favorite! @glo___xoxo Come sip with us! 💚 @Dani_Marie_15 You can never be too dramatic when it comes to declaring the deliciousness of cold brew! @jaid0r What's your favorite drink to pair with it, friend? @chloandchaos It's oat of this world! @KFerqOfCourse Glad you like it! @jordanliz2000 Thanks for the perfect sip score! @HeatherLesz We always look forward to seeing you! @_iWear20Pearls So happy to hear that your love has been rekindled! 🥰 @hajinnn We hope you enjoyed every sip! @isthat__alicia We hope you'll be enjoying one soon! \nhttps://t.co/q1iH39FDTP @KrisssyNicole Sounds like you found your favorite! 💚 @alexisgriggs Big day! @astrock111 On the app go into your Orders, then to your History and then find the order you wish to tip. The tipping option is available for a limited time after the order has been placed. @clairoluvr Until recently, oatmilk was only available in certain areas. Sounds like you were one of the lucky ones! Now you have to share with the rest of us. 😉 @Jetta_Jameson Cheers to the sips that change our lives for the better! @chelseadesirae Glad you think it's a hit! @xodessanie Glad you're enjoying every delicious drop! @Alexis_Arcade Cheers to a sip that ignites your day! @carriemmckenna That's the tweet and that's the tea! 🙂 @TIARABYRD88 We've missed you. 💚 Looking forward to our next sip together. \nhttps://t.co/d6G6fLTJPr @ShelbieDalton For an iced drink, it sure brings the heat! @Chanharp Of course we do! 😉 @Steffannie__ You've got that right, Steffannie! 😊 @SeduceN_Destroy Self-care is important. 💚 @Christian__24_ Glad you enjoyed every amazing sip! @interstella_777 Glad you think it's a hit! @ahhhhunagii Sounds like you've found your favorite! 🙂 @jamie_eats That's a pretty delish tradition! 😋 @badxandra You've tried it now and that's what's important. 😉 @nicolebittle It makes extra points. 🙂 @bfremm We're excited for you! Hope you love it. 🥰 @Chanharp Oatmilk takes it to the next level! @rashelagc It tastes as good as it sounds and we hope you'll love it!\nhttps://t.co/d6G6fLTJPr @kayniebla We know what we did. 😉 @_ETNOM Here's to sipping happily ever after. 🥰 @KelleyWhitehous That's the tweet and that's the sip! \nhttps://t.co/zwpGjsaUp2 @jess_hanner We're glad you found your one and only. 💚 @tyramekel Glad you found your perfect sip! @_ETNOM Sounds like love at first sip. 💚 @k3zt1n We did. We absolutely knew. 😉 @ggspillthetea Glad you think it's a hit! @synisterrr Cheers to happy taste buds! @melvinis20 Which beverage will you customize with it first? @BEENTHABOSS It's always a hit! 😋 @Paraadis3 Looking forward to sharing that sip with you!\nhttps://t.co/LlJAawK2ol @gladerella We're glad you can taste the love in every sip! 💚 @anna_raye_ We are opening new stores globally every year, so we recommend submitting your location suggestion to https://t.co/SPH9PuDjEj @beccstorres We love sharing all your favorites with you! Pack a pick-me-up. 🚲 \n#VanillaSweetCreamColdBrew https://t.co/YYtTGsdGhf @Always_Jae Three cheers for life-giving sips! @Unbothered18___ What should we get started for you? 😉 @wholesomeKyers Looking forward to your visit. 💚 @beccstorres We're happy to discuss that delish sip! Is it your new favorite? @Nakia_Amya It's a delish hit! @tucsonvirgo https://t.co/tbCZT3OFhM @tucsonvirgo We're happy to say this sip of deliciousness is here to stay! 🙂 @wholesomeKyers We know what we did. 😉 @_thatbreezy So glad you like it! @LLNYCMook We're glad you think it's a hit! @nastyy_gal_ Cheers to life-giving sips! @spookifie You're welcome! We hope you enjoy it. 🙂 @AyYoItsO It sounds like you've found a new favorite sip! 😋 @Abraham_F Sip, sip, hooray! 😍🙌 @mandykristiii We're happy to hear it's a new favorite! 😋 @oliviagracecox_ Cheers to new favorites! 😋💚 @JULIEJETSON We're happy to hear you're loving every sip! 😋 @aijuswanna_syng Happy to sip with you! 💚 @Sonialvarez38 Hi Sonia, I'm so sorry for the delayed response and the disappointing drinks! Would you mind sending me a PM so I can gather some additional information https://t.co/zRl8IziadD @aijuswanna_syng Not sure but we do hope to sip with you soon! 🥰 @likechicag0 Starbucks Delivers is available on Uber Eats in all 50 states: https://t.co/FT9Kh0PvhK @angelstar2 🙌 @rrezzzy We can hear the m-egg-lody! 🎶 @sietesavone It sounds like you have great taste. 💚 @Chabelis_Sienna You're so welcome. Happy birthday! 💚 @sietesavone Which coffee drink are you dreaming about, friend? @rrezzzy Which one speaks to you? @Maritza_M28 Sip sip hooray! @CashAlexLock92 That's awesome to hear! @_Scrapp6 💚 @IvelisseRoCo While we don't offer a hot version, you might enjoy a Blonde Vanilla Latte with Brown Sugar Syrup, topped with cinnamon. @_Scrapp6 Hope it brightens your day! @CashAlexLock92 Sounds like you found a fave! @LifewithKeeks_ YAY! 🎉 @adam_turecek Glad to hear that you're loving it! @seoudi_ That sounds like the perfect moment! 💚 @westsxde_ Cheers to love! 🥰 @SnowK9 Yes! Last year, teams from our Accessibility Office, Store Design and Tryer Center came together to conduct research and consult with inclusive design experts, Starbucks partners, and the disability community with a goal of designing with accessibility as the standard. @Mel_Ks333 We're sorry for the delay. It looks like @StarbucksCare has reached out and we're sure you'll be taken care of shortly. 💚 @RealMarkD Thanks for the support! Aira has also proven to be helpful for customers navigating the protocols and physical changes implemented in stores during COVID-19. @wi_dust_nd Venti hot drinks are 20oz, and venti cold drinks are 24oz. Brown sugar syrup is not the same as caramel. Hope this helps! @FAKEBESTFRIEND https://t.co/AfrKmWRshp @BlakeDeVore4 Yes, it's available in participating stores across the US! Starting today, Aira—a service that connects blind and low-vision people with remote visual interpreters through an app—is available for free in our US stores.\n\nLearn how we use Aira and inclusive design to create a more accessible customer experience. https://t.co/YNucHJQ7if https://t.co/cJZ8UsljrZ @seoudi_ How do you like to enjoy your coffee, Mostafa? @jrdnpwll You've got that right! 💯 @courtsloger https://t.co/NROXt1bbCO @westsxde_ In love? @Nicocobean Agreed! @ultves That sounds A M A Z I N G! 😍 @L_stray Cheers! @Haggard_girl Someone's a lover of this sip! 😉💚 @asthriel 💚💚💚 @courtsloger Cake Pops + Space = Stellar ✨ @jasminetarin Woohoo! 🥰 @shelbzzzxxx Glad you love it; whatever it is! 😉 @Salmero68052659 Sounds like you've found a favorite! @ParissAdair_ The perfect way to start the day! Which ones are your favorite? @_Jennifer_E_ Cheers to that! @FAKEBESTFRIEND Get your taste buds ready! @steelydamnnn Can confirm that you are right! 😉 @asthriel You know we love you! 🥰 @Jason_n_Pardise It is enchanting! ✨ @Nikomuhtoes Enjoy your sip-cation! 🌴 @lordsukhjot Taste buds rejoice! https://t.co/01X02DwuJv @sassyMickey43 Cheers! @YARIVILLARREAL Say less. @__araaa_ Naturally! 😉 @dopeitsnellz Happy ordering! @Z_Huber1992 Don't worry, we have no plans to! @ahmeezzyy Thanking you between sips! @LadyDeath13 Enjoy! @beethanggg_ What do you enjoy snacking on with it? @tempsz_xo And we're super excited about it! 😊 @emilyg33112 Glad you found the right blend! @ashbee__x 👏👏👏 @Aaroncabrera_ Thanks for the love, Aaron! 💚 @ememechan We think you have great taste! @helencrisel You were our inspiration! 🤗 @mariluzxo_ We like your style! 👏 @ExquisiteLady_ We think that's a magnificent idea! @hannnoel12 Thanking you now! 😋 @Andrew_113 We just wanted to decorate your cup! ✨ @_Antoinetterrr We're shaking things up, Antoinette! @just_dom__ Especially when paired with the new Iced Chocolate Almondmilk Shaken Espresso! 😋 @Abraham_F Cheers! Is it a new favorite? 😋 Longer days mean more time for the things that make you smile. ☀ #DaylightSavings https://t.co/tv86TNsMt0 @richmcintyrejr Thanks for the delicious tip! @LilGuppy92 We know the feeling! 😍 @Extra_ordinayry Sounds like someone's in love! 🥰 @hey_delisa We love when that happens! 🥰 @DafantasicP 💚💚💚 @DafantasicP Cheers to all the Spring things! https://t.co/ASchXSmVIo @sarahahmadhejab https://t.co/gM558VOYou @DafantasicP Which beverage brought joy to your day? @Inja_DDN Your cup of joy is here to stay! @terrilee63 Kind cups are the best! @KelseyFrazier_ Sip, sip, hooray! Cheers! 💚 @KelseyFrazier_ We're happy to hear you're loving it! Is the Iced Brown Sugar Oatmilk Shaken Espresso a new favorite? 😋 @regginaldd Happy to share this cup of joy with you! ✨ @Irishgirl34 So many fun ways to sip! @drifressh Happy to be by your side! @disneydarling22 That's the plan! @kennaNOhope Sounds amazing! @sarahahmadhejab Spring vibes all year round! 🌷 @SaraBeee93 Thanks for the yummy tip! @Mmryaam_ Thank you for always sipping with us! 💚 @OfficialJazmynM Starbucks Delivers! Just download the Uber Eats app or visit https://t.co/FT9Kh0PvhK for availability in your area. 🙂 @Virymel We love you! 💚 @TrendyTrey We'd love to hear what you think! @tessaleighgray We're oat-ually happy to hear that! 😉 @KishtotheL We're happy to hear you've found a new favorite sip! 😋 @uhheysam Cheers to the perfect sip! @madiilex We're thrilled you're loving every sip! 😍😋 @kaytaarabella Hi, Kayta! 💚 @MeganAronson Happy Birthday, Kanon! You deserve to be celebrated yesterday, today, and every day. 🎉 Megan, would you mind following us so we can continue the celebration? @XaphanFire Not at this time, but thank you for the suggestion! @Graziellajune Hi, can you please follow back so we can send a DM? Thanks! RT @laceyalleman: That oatmilk brown sugar espresso from Starbucks living rent free in my mind @XaphanFire Orders placed through Uber Eats can earn Stars if you pay using the Starbucks Rewards Visa Credit Card or Starbucks Rewards Visa Prepaid Card. You can learn more here: https://t.co/3hVVi5qJPY @onescoop It tastes like rich layers of espresso, cinnamon, and brown sugar.  Give it a try! https://t.co/d6G6fLTJPr @celestelauryn You're welcome! We're really glad you liked your first sip of cold brew! @cea22 We do if you're a Starbucks Rewards member and have made at least 1 purchase! Visit https://t.co/3ktu65gD6c to learn more. @deedee2025 We'll be here for you. @miahman98 Prices can vary by size and location, but you can always use the Starbucks app to check the prices before you place your order. @celestelauryn Our Cold Brew is handcrafted in small batches daily, slow-steeped in cool water for 20 hours, without touching heat. It has a lower acidity and a naturally sweet taste that we hope you'll love. \nhttps://t.co/WwSfeC9kpA @Aishakhannn If this is something you would like to see, we encourage you to submit your suggestion at https://t.co/SPH9PuUUvR @_MissMeganxo You know now, and that's what really matters. 🥰 @Ellary87688588 Happy Friday, friend! 🥰 @jdodson86 Come to the dark side. We have cold brew. 😎 @kaylairl So glad you enjoy it! @Q8LuLu Cheers to your best sip! @HHHAAA22222 We're actually pretty glad you're enjoying it. 😉 @__Bvni It tastes as great as it sounds and we hope you'll give one a try!\nhttps://t.co/d6G6fLTJPr @_GoogleGabi So glad you enjoy it! @Just_Aly_ Go on. Give in to temptation. 😉\nhttps://t.co/5jkqourEpE @sarontherocks https://t.co/APW5xf8FGE @KellyKEditing Hey, Kelly! We got you. No need to remember what it's called. You can save it as a favorite in your app! So happy you're loving the Iced Brown Sugar Oatmilk Shaken Espresso. 💚\nhttps://t.co/d6G6fLTJPr @ohbellabizzle We hope you'll love it!\nhttps://t.co/d6G6fLTJPr @adrianac_19 We appreciate the perfect 10! Glad you're enjoying every sip. 💚 @GeraldDalere Cheers to love at first sip! 💚 @TrishaKArora We love that you found your new favorite! @queensnthrones We're glad you think it's a hit! @J_MMejia Always a pleasure. 😉 @Bananna_Bea Sounds like you've found your non-dairy bliss! 😍 @hopeusc1 Cheers! @hopeusc1 You should give this at-home coffee a try! https://t.co/y6BO9zzpIs @natashassight The heart wants what it wants! @MaskOfSANADA Happy sipping! 💚 @_sammmbam Coffee date soon, Samantha? 💚 @hopeusc1 Notes of rich cocoa and lush dried fruits make this at-home brew the perfect spring sip! ☕💚 @omairaguz_ Each sip has us on cloud 9! 😍 @faithypooo It's heaven in a cup! 💚 @uhheysam Which drink will you be celebrating with, Sam? @m_ariachristina 💚💚 @esenel95 💚💚 @tsunhanyako It's the sip of the season! @risenshadow86 Cheers to the perfect sip! @DashLashae It's the perfect way to celebrate the start of a new season! @wkendsatcarries It's top tier! 💚 @jvonthedaily We hope every visit is as perfect as the first. 💚 @ZaeaJae We couldn't be more excited to be partnered with Oatly! 💚 @libralater Glad you're enjoying every amazing sip! @risenshadow86 How do you like to enjoy your coffee, Ben? @gypsymama34me Cheers to finding a new favorite sip, Erika! @JParks31429918 These decisions are made on a store-by-store basis. Our local leadership teams are fully equipped with the appropriate tools &amp; resources; making decisions based on facts and science to meet or exceed CDC guidelines. @Jeepdude6 Please note you can view our Q1 Fiscal 2021 results on our website. https://t.co/ZBIIKxYiLO @likahNasir Knowing this just made our day! 🥰 @misenogle We're glad it helped to brighten your day! @m_ariachristina Cheers to refreshing and delicious! @jenn4razorbacks Exactly. Priorities. 😎 @DontAsk_x2 You're welcome. 🙂 @kesa__ Glad you enjoy this comforting sip. 💚 @CloudEllieYoung It's a delish favorite! @jenn4razorbacks Priorities. 😉 @warkentin_ We hope you'll be enjoying that cozy sip soon! @harucix We look forward to sharing a sip with you! @chatney12 We love that you found your new favorite! 💚 @spookifie Have you tried the new Iced Brown Sugar Oatmilk Shaken Espresso?  😋https://t.co/d6G6fLTJPr @braceletss__ Happy to hear it rates a 10 with you! @chatney12 Is this delish sip your new favorite? @DontAsk_x2 We see you've found a new favorite! Enjoy! @okagacam The game has never been more delicious! @MagnificentVee We hope you'll be enjoying one soon! @sapphicskylar It says you have great taste, for starters. 😉 @AshBlair22 https://t.co/VWSCjeSbmE @skyebunnyyy Cheers to new favorites! @skyebunnyyy Is it your new favorite? @kapp_n So happy you found your perfect sip, Mollie! @bbyReverie That delish new sip is shaking things up! We hope you'll love it. @1_ksteen Enjoy every heavenly sip, friend! @mirrorbal1 We hope you're enjoying every sip! @lillyantran Sounds like someone found a new favorite! @_GabriellaDB Glad you like it. Thanks for the perfect sip score! @_GenisessOnee Glad you like them! @bbyReverie Which favorite beverage will you bless with oatmilk first, Melody? @J_MMejia Sometimes it's nice to go where everybody knows your name and they're always glad you came. It's a nice way to start your day. 💚 @Fall_OnLove Happy you're enjoying it! @denvernicole You're welcome. So glad you're enjoying them! @zeffiroart Delish breakfast choice! @gladdis_baybee We're glad you finally gave it a try. 😉 @airicuh1 We see that look in your eyes. 😍 @itzmelovelylu We hope you'll be sipping and smiling soon. 💚 @ThatDamnRobbie Ain't no shame in that explosive combo! @goldenfluffs Thanks for the confirmation. 😉 We're glad you're enjoying it! @jphandom You're welcome! Which favorite sip are you enjoying with it first? @brookewitzy Sounds like you have a new favorite! Looking forward to our next sip together.  💚 @princesssdianan Sounds like you found a new favorite! @brookewitzy Which delish new sip are you enjoying, Brooke? @sarasolnick We're happy to serve you through curbside pickup! @clcarpio It's our Iced Brown Sugar Oatmilk Shaken Espresso. We can't wait for you to give one a try! \nhttps://t.co/d6G6fLTJPr @fookintomlinson Thank you for this suggestion! @mamamorgann We've missed you! We hope you'll give our new Iced Brown Sugar Oatmilk Shaken Espresso a try. \nhttps://t.co/d6G6fLTJPr @maryalhh Glad you enjoy it! @_bajonw See you soon. 😉 @yung_mikal We're glad you found your perfect sip. Thanks for the recommendation! @ZacharyZWA A whole new level was created just to accommodate it. @FatGirlWindy It's never too cold for cold coffee! 💚 @ashleydecker_ The facts have never been more delicious. 💯 @KristinYaquinta We love that you love it! @__xavi16 Glad you're enjoying it! @RealBlackBrat Yay! Can't wait to see you! @JParks31429918 Thank you for the feedback. It is our responsibility to protect our partners and exceed CDC guidelines. @RealBlackBrat Tomorrow has become today! Are you on your way? 😉 @rornronrnron https://t.co/81mqBDRkN2 @BCool_E We hope you'll be enjoying one soon! @xPudgyyyy Cheers to enjoying new and delicious sips this season! @johnnyl0ver We can't get enough of this new sip! @avoxo_tati We'll be sipping this new drink all season long! 💚 @MNFox88 Come sip with us, friend! @sharinicole042 For community health and well-being, we respectfully request that you wear a facial covering the next time you visit a U.S. company-operated store. @Jeepdude6 Since the beginning of the COVID-19 pandemic, we have consistently made decisions based on the facts and science, with partner and customer safety at our core. That commitment remains true to this day. @KristinYaquinta We're happy that it's giving you all the cozy fall vibes. 🥰 @rocketslifting We will continue to pause indoor seating in most stores and assess the situation locally. Please contact the store you plan on visiting beforehand. @MrMidh We are strongly encouraging our partners (employees) to receive the COVID-19 vaccine as soon as they are eligible. We will provide up to two hours of paid time off for partners to receive each dose, up to two doses. https://t.co/WMpwMyUw5f @esenel95 Did you find a new favorite sip? 💚 A lot has changed, but our commitment to the safety of our partners, customers and community remains the same. While we can't wait to see your smiles again, help us take care of each other by wearing a facial covering and practicing physical distancing in our stores. 💚 https://t.co/h2j44Ba1Qj @courtney8698 Glad you think it's a hit! @kxrivx We're glad it's got your taste buds exploding with happiness! @AlyMoody123 We recommend our Iced Brown Sugar Oatmilk Shaken Espresso and Honey Oatmilk Latte! 😋 @sydnizzll Most delish PSA of the day! Which favorite sip will you enjoy with oatmilk first? @rornronrnron See you soon! 😉\nhttps://t.co/d6G6fLTJPr @CaraRi0t13 So happy to finally be reunited. We hope you loved every sip! @0heyjayjay No tears, Jess. We're happy to say, this sip is here to stay! @mmary_jay Hi, can you please follow back so we can send a DM? Thanks! @graceyhanderson Cheers to finding new and delicious favorites! 💚 @GlendaaGomez Sip sip, hooray! @bbbymel They're the perfect sip to celebrate spring with! @GlendaaGomez Did you find a new favorite sip, Glenda? @Joc_Esparza Which sip will you be ordering next, Jocelyn? @AmberJ36__ That sounds like the perfect pairing! 💚 @artbyflwrrgirlg Cheers to delicious! 💚 @Trilly_Ano They're pretty egg-cellent! @AmberJ36__ What's your favorite sip to pair it with, Amber? @DestinyNesenya It's so creamy and delicious! 💚 @queeno1994 We're so glad you found a new favorite sip! @MahaliaSBM See you soon! @Drakehern Hi! Can you please follow back so we can send a DM? Thanks! @bri_dubs Never fear, our app is here! No worries about saying a mouthful, just tap and enjoy! 😉\nhttps://t.co/d6G6fLTJPr @Aprizzle_ It's one serious sip! 🙂 @adfink_thinks We're pleased to say it's here to stay! Glad you're enjoying every sip. 🙂 @sweetx0love25 Looking forward to our next sip together. 💚 @colleliz https://t.co/8CZH0aZCBx @sweetx0love25 Sip happy, friend! @MahaliaSBM It needed to be done. 😉 Looking forward to our next sip together. @colleliz Great recommendation. Thanks for the perfect sip score! @ArlenArmageddon Cheers to finding new favorites! @genevagigi210 We can't wait for you to give it a try! \nhttps://t.co/d6G6fLTJPr @erin_go_bruh Cheers to the sips that change our lives for the better! @bigb0ss_sha Happy it rates a 10 with you! @karissamedina_ We hope thinking leads to sipping. 😉 @brittsbeeee Delivery to the rescue! Starbucks Delivers is now available in all 50 states in the U.S. To see if Starbucks Delivers is available near you visit: https://t.co/8TzwEl1eav @Jlachae_ They're the breakfast champion! @cursedminmo They've been thinking about you too. 😉 Can't wait until you're together again. @magnanimitea Cheers to a day full of good news! @TeKarl_ We know what we did. 😉 @tinyheart077 Glad you're enjoying every delicious drop! @Sippin_Soup_ Happy ordering! @harryjcrowley Enjoy every sip! @kelzwritestuff_ That's awesome! 💚 @gurlitscait It's the best way to shake things up! 😉 @stephlandaverde Yes, it oat-ually is! 😉 @kelzwritestuff_ What do you think of our new drink? @pensudar YAY! 👏 https://t.co/uXsJLRrbBj @_shannm Shannon approves! 🙌💚 @babe_cheeks Sounds like a fave! @devondietlin It's still around, Devon! Starbucks Doubleshot On Ice is now called Iced Shaken Espresso. https://t.co/QfgOjLK52F @ffrckk Sounds like your Spring is off to a gr-oat start! https://t.co/SdCu29EBrB @Teyajasminee_ox Wow, indeed! 😍 @soxgaff Thanks for the tip! @rosieeee31 You never know what you might fall in love with! @KianaGodleyy Live it up with your favorite cup! @_AmberWolf You're welcome. We're glad you're enjoying every sip. @amayaaloveee Glad you think it's a hit! @AshleySobel We like your style. Cheers! 💚 @nataliedj98 Cheers to finding love in every sip! 💚 @na_naboukaff Amazing recommendation! 🙂 @AshleySobel We're happy to hear you're loving them! Do you have a favorite? 😋 @anniewinehouse Sip, sip, hooray! 💚 @onepeloton We'll see you on the leaderboard! 🤚 @maarciniegamo Cheers! 💚 @anniewinehouse We're happy to hear you're loving it! 😋 Is it a new favorite? @chembromo We're happy to hear you've found a new sip to love! 💚 @jinchvrik It smacks just as hard as it needs to. 😉 We're glad you think it's a hit! @nataliaglaub Cheers to the sips that change our lives for the better! @telisayancy We hope it's just the start of a beautiful day! @ChristiMusonda It's our premium matcha green tea shaken with flavors of pineapple and ginger along with coconutmilk and ice for a delicious beverage to uplift your day. Let us know how you love it! @Ryan85869100 Mom knows best. @glteach Everyone's diet is different! To decide if it's right for you, take a look at the nutrition information: https://t.co/uqxUwtYCUh Fresh air. Delicious sips. 💛💚 \n#IcedPineappleMatchaDrink https://t.co/lIKipl7fa7 @Qui_Monroe Sip, sip, hooray! 😍 @hourlyduo_tr https://t.co/BuZixiJaTa @Jawss__ Cheers to finding love at first sip! 💚 @ayaabdeen__ We love that you love it! 💚 @angieeglzz Run, Angie. RUN!!! \nhttps://t.co/d6G6fLC8XT @badluckzee Thanks for the perfect sip score! @ivanalacole Cheers to new favorites! @ikvros Yes! https://t.co/5Pr4KB370G @EmmaDanielle No need to apologize. When something changes your life, it's only natural you want to tweet about it. 😉 @_AmberWolf Since you said please. 😉 We're pleased to say it's here to stay! @kennnblack We know what we did. 😉 @angelcay_ Cheers to the sips that change our lives! @yaasjungwoo So glad you're enjoying it! @justinlamont_ Looking forward to our next sip together. 🙂 @mill23_ 😘 @SydNatash We're thrilled you're loving every sip! 😋 @yesiverastigue We're happy to hear it's a favorite! 😋 @amethystqveen We're happy to hear you're loving it! Is it a new favorite? 😍 @rocioxjh Cheers! 💚 @paigepauline_ We're happy to hear you're a fan! 😍 @jayt415 Cheers to finding your new favorite sip. 😉💚 @twister_blister We're thrilled you're loving every sip! 😋 @Qui_Monroe It sounds like you may have found a new favorite sip! @biology_belle We're happy to hear you're loving every sip! 😍😋 @j_nuge Looks like you have a new fave! @xluhvn It's the perfect sip-cation! 🌴 @NikNastay_ Woohoo! 🎉 @concerned_pony Glad you've been enjoying this sip! @vernonugh Love you, honey! 💚 @emmasglasses Looking good! @ChadCur28 Have fun sipping! @twtofzeus Happy Sipping! @SocraTetris Good news! 🎉 @QHELLAFLY What a delicious way to start the day! @kelli__west A delight! ✨ @DuchessChanel So good! @Mwrightnuknowit Woah! You have some delicious plans. 😋 @HeyItsMoog We're pleased to say it's here to stay! @Justinpgh118 So glad you're enjoying it! @KelliePriceless We've got your sip for every occasion. 💚 https://t.co/526syPi7s3 @mamalifewithme Super Moms always know best! 🥰 @_leahmccue We hope you'll be enjoying one soon! @Staceeymariexo Glad you like it! Thank you for making us part of your day. 💚 @JaayAaliyah_ https://t.co/TYb6JbZfic @marysantomin We always look forward to starting the day with you. 💚 @JaayAaliyah_ We love starting the day with you and your favorite blend. 💚 @mofo809 Happy International Women's Day! 💚 @SamsungNeptunia Awesome! @SamsungNeptunia Yum! Let us know what you think. 🙂 @JoJoe89309852 Yum, indeed! 😋 @Mwrightnuknowit We're happy to bring it to you! Which beverage are you looking forward to enjoying with oatmilk? @Hudson_Lhp Awesome! @MrMidh Coconutmilk is delish too! @NarvesenConnie We agree! @Hudson_Lhp Sounds like you found your new go-to! @JulesOfficial_ 🙌 @gabyaguilar1 Yes! https://t.co/grluE1jILm @DjNightChild Cheers to finding a new fave! @SamsungNeptunia It's a creamy way to customize your sip! The wait is over. Now ask for creamy Oatly oatmilk in all your favorite drinks. 🙌 https://t.co/bAH10BN16f @emilioangel_ Glad to know our latest flavor explosion rates a 10 with you! @LindZ_k Definitely the way to sip on a Monday! @shaelyn98x Love you, bestie. 💚 @raniamerchak https://t.co/XwUdcY2GEK @mill23_ It slaps just as hard as it needs to. And we care. A lot. 😉 @OhhhLyss We're happy to say that this delish sip is here to stay! @raniamerchak Glad you're enjoying every yummy sip! @SnickerzBites Cheers to discovering new favorites! @DYetti_ We're glad you can taste the love in every sip! @NatassiaDiggs You don't have to get over it. It's here to stay. 🙂 @sarasueee Enjoy every wonderful sip, friend! @Jenjennnn1995 Facts! 💯 @authorsarahmoor Thanks for keeping us by your side while you write! 💚 @crazy4lefties We won't! 🥰 @twtofzeus It's here to stay! @fearlessaubrey Awesome! 🥰 @authorermurphy You deserved it! 💚✨ @sgtpeppers99 That's awesome to hear! @LoriMumford Our kind of sipper! 💚 @julia_anne_XD Hope your cup made your day brighter! @aebthestyleicon Sounds good! @Mayrahernandex1 MOOD! @hearjustice Always! @tracijadlos For sure! @quach_mitchie Happy to hear that! @Ilamaran39gmai1 Same! @MYCOFFEEQUOTES We see you! @khrnnjng Cheers! @shaelyn98x This is Shae. Shae got the new sip and was able to sing nursery rhymes with her students. Be like Shae. ☕ @KaeSuell Definitely a keeper! @stephhoxxo Awesome! @Heart_Healthy1 It's the perfect coworker! @freakinireth Definitely stick to coffee! 😉 @AzureSky45 Sipping is always better! 😋 @aebthestyleicon Is it your new favorite? @lananimitch You know we do! 💚 @jocelynpaigey Sometimes you have to switch it up! @xxkatielunAA So are we! 😊 @EmelyMontiel2 It's everything! 😋 @deemichelle915 Cheers! @SteveSchrader96 Love you too! 🥰 @LisaYanet Live it to the fullest! @Deb79622222 That's the best way to go! @Raysammy Great to hear! @cthenewclassic Cheers to ordering your favorite! @thatguyjoshw Abso-brew-tly! @DallTheDon You're talking about our Strawberry Acai Starbucks Refreshers! It's a wonderful blend of strawberry and acai flavors with passionfruit notes. It includes green coffee extract for a delightful pick-me-up! https://t.co/h2zzsUQUvM @m0tivatedaf We thought it was time to shake things up! 😉 @dani_dayzz We're thrilled you're loving every sip! 😍 @MendozaMychelle YAY!🎉 @GonzalezEffy We're happy to hear you've found a favorite! 😋 @presleyallise We love that you're loving them! 😋 @gabywhiteelise We're happy to hear you're a fan! 💚 @snichols4799 We're happy to hear it's a favorite! 😋 @aubreyanndan We're happy to hear you're loving every sip! 😋 @BamaKay91 It sounds like you've found a new favorite sip! 😋 @nat__v We're happy to hear you're loving it! The Iced Brown Sugar Oatmilk Shaken Espresso is here to stay! 😍 @TunstallTamara We're happy to hear you're loving every sip! 😋 @sparklebitxh We believe you! 😉 @UrTimeSio So beautiful that it glows! 🌟 @ST0RYVINYL Love you, bestie! 🥰 @aydild7 We're shaking things up! 😉 @arii_ambitious We have a standing sip date! 😉 @The_Omikron We're glad you enjoyed it! @B2utyfulEXOtic Thanks for the love! 🙌 @baileyaleece To all the dreams that come true! ☕✨ @o_keefechris Always happy to shake things up! Thanks for the love, Chris. 😊 @Raegan_33 Of course, it is! @tiniest_bean Dear tiniest, you're our favorite bean! 😉💚 @Egyptchristos You're welcome, friend! 💚 @B2utyfulEXOtic We love this deliciously spiced cup too! 😋 @DunPlayin That's such a spring thing to do! 😉 https://t.co/0DiS3fLtFf @Leesie_Lu We're glad that you've been enjoying it, Elise! @_gabigail Happy to add some joy to your cup! @DunPlayin Sounds wonderful! @DunPlayin What do you enjoy pairing with this beverage? @krosenlund We're pretty excited too! 😉 @C_Gullible_Esq Pistachiyum choice! 😋 @CMichaelDavid Good to hear! @lekhamehtaa Coffe always has a way of drawing us in! 😍 @MaggieAnnHallum Enjoy! @gabby41varado Happy Sipping! 💚 @jc_swift13 Happy that you let the sunshine into your cup! 🌞 https://t.co/3yeyv8KT4P @ruth_delemos The Honey Citrus Mint Tea is such a cozy sip! @sunchallaj Coffee pairs best with kindness! Thanks for sharing. 💚 @_Ree11 Sip, sip, hooray! 😍 @FloralCrissy We're happy to hear you're loving every sip! @briannamarie__K Sounds like you've found a new favorite sip. 😋 @DENsQuared We're happy to hear you're loving every sip! The Iced Brown Sugar Oatmilk Shaken Espresso is here to stay! 😍 @sadhiyamoolji Sip, sip, hooray! 😍🙌 We're happy to hear you're loving it! @taylor624 Sorry for the delay, but we're happy to share it's available now! @thisBIRDisword Cheers! 💚 @thisBIRDisword We'd love to hear what you think! 😍 @thisBIRDisword We're happy to hear you loved every sip! Is it a new favorite? @BrodyRyan Cheers! 😋 @Sabrina_Annnnnn Sip, sip, hooray! 😍 @melaniebriannaa Sounds like you've found a new favorite sip! 😋 @melaniearmelim We're happy to hear you think it's perfect! @sarrahberkery SIp, sip, hooray! 😍 @haleeybrooke_ Cheers! 😋 @kellyjean512 We're happy to hear you're loving it! 💚 @MellyyLove Sounds like you've found a new favorite sip! 😋 @akatsmarki Cheers! 💚 @HoldemMedia_Dan Sip, sip, hooray! 😍 @AlayneAllstar Sounds like you've found a new favorite sip! 😋 @__okaykatie We're happy to hear you're loving every sip! 😋 @maddy_jane_ Cheers to finding a new favorite sip! 💚 @maddy_jane_ It's here to stay! 😍 @maddy_jane_ We're happy to hear you think it's perfect! 😋🙌 @itsaudreyyy We're happy to hear you're loving every sip! 😋 @alexisBaybe_ Yes it does! @nikkicorrine17 We're happy to hear you're loving it! Sounds like you've found a new favorite! 😍 @_jodielu_ Sounds like someone found a new favorite! We're happy to let you know that our Iced Brown Sugar Oatmilk Shaken Espresso is here to stay. 🙂 @_danagraham So glad you're enjoying it! @allisson_xo So happy that it rates so highly with you! 💚 @woosaniast We hope you'll love it! \nhttps://t.co/d6G6fLTJPr @Aiyraw_ We see that look in your eyes. 😍 @chellebearr An entirely new level had to be made to accommodate its greatness! @MSBYMlYAS We're just trying to do our part towards filling this year with all the good things. 💚 @darlizae Looking forward to sharing a sip with you this weekend! @allys_sun You can't win 'em all, but you're still winning. 😉 @radiocarissa It can make any day feel like Fri-Yay! @WitchyGoth https://t.co/q09olIiDJ7 @Camarillo17K Sooo glad you're enjoying it! @JNoble__ We know what we did. 😉 @abbylefler Cheers to the best sips! @Thisswifttbeat New year, new sips. Better latte than never! 😉 @melisssaaaa97 Never lose that feeling. 💚 @mightymidwest Cheer to the sips the make our days better! @gcmovesworld Better latte than never. 😉 @melisssaaaa97 Glad you're enjoying every amazing sip! @HeyItsDiana 😘 Which one are you? (GIFs only)\n\nStopping to smell the flowers.🌸\n\nStopping to smell the coffee.☕️ @_AmberWolf Glad you think it's a hit. 💚 @nunezec_ We see you drooling. 😉 @brandi_devine We were due for some good news. 😉 Sip happy, friend! @kmariemessinger You're welcome, Kels! Enjoy every sip of happiness. 💚 @Maria_24p Enjoy every perfectly balanced sip of goodness, friend! 💚 @mochutofu Thanks for the perfect sip score! @internalnoises We are thrilled to have oatmilk join our lineup of non-dairy milk options! 😊 @sleepynstressed Cheers! @sleepynstressed The Iced Brown Sugar Oatmilk Shaken Espresso is a part of our core menu, so it's here to stay! 😊 @sleepynstressed We're happy to hear that you're loving this non-dairy drink! 💚 @TeuschKarise Sounds like you've found your new go-to sip! 😊 @AshEntrek3 Thank you for your patience: Oatmilk is available now in the Starbucks app! https://t.co/yM8wLkDDdt @chanelly37 Cheers to our fave Starbucks sips! @chanelly37 Sounds like the Iced Shaken Espresso is your new go-to sip! @chanelly37 💚💚 @sortanightblind Hi there! Can you please follow so we can send a DM? TYSM 💚 @SmileForKayla Hello! Could you please follow us so we can send you a DM? Thank you. 💚 @_PATonthebackk Can you please follow us so we can send a DM? Thanks! ☺️ @HeyArnold920 Cheers to new and delicious sips! 💚 RT @thatvegangirl_: so I tried the oat milk espresso drink at Starbucks...\n\nBelieve the hype. @shelbyleinbach So glad you've given it a try and found a delicious new fave! @QueenAshley75 Our new, non-dairy espresso beverages might change your mind! (Or if not, we'll always be happy to help you find a drink you love.) https://t.co/7WDSsLrEiD @SVTV20 Yes! Starbucks® Blonde espresso, brown sugar and cinnamon shaken together and topped with oatmilk. https://t.co/d6G6fLTJPr @CaitlinDineen Thanks for trying it out! @NerdyAndNatural Yes! We just added it this week at participating stores in the U.S. https://t.co/yM8wLkDDdt @kaitlinlexiexx We think so too! First Starbucks baristas shake Starbucks Blonde espresso, brown sugar and cinnamon together with ice, and then top it off with oatmilk for a cool lift to power you through your day. @AmayaReneee Thanks for that perfect sip score! @josephsortiz Yes! We now have oatmilk at participating U.S. stores. https://t.co/yM8wLkDDdt @earthsigngirl Victory has never been so delicious! @shibbybrooks Cheers to life-changing sips! @UwUXPMXUwU On March 4, Starbucks Rewards members who use the Starbucks app to order ahead any handcrafted beverage (grande or larger), will be sent a coupon for a free drink redeemable March 10-12. Download the Starbucks app and sign up for Starbucks® Rewards to get the offer. @DanielScarn We're glad you love it so much! @joycilleee It's a top tier sip! @miyxni_ Sip sip, hooray! 💚 @torres_ari28 We're so glad you found a new favorite, Ari! 💚 Shaking things up with the new Iced Brown Sugar Oatmilk Shaken Espresso. ☀️ #IcedShakenEspresso #Oatmilk https://t.co/sstq0vrxkp @Anita_Realtor1 Cheers to new favorites! 💚 @MarisaLeeMartin Sounds like someone found their new favorite. 😉 @Dear_Min_Yoongi 💚 @hollywoodbIues We hope you'll love it! Looking forward to starting the day with you. 💚 @_livingdeadgxrl The most delish PSA of the day! 🙂 @Dear_Min_Yoongi Sounds like someone might have just discovered a new favorite sip! @lisayee We love it when you find a new fave! 💚 @abilley8 Glad you like it! Looking forward to our next sip together. @chanelly37 The Iced Shaken Espresso is next-level cold coffee bliss. 😍 @haylauryn_ Happy to make your taste buds happy! 🥰 @m3raha Enjoy! 😋 @emmawhinnie Very true! We're glad that you enjoyed it. 🙂 @emmawhinnie Exciting! What did you snack on with it? @_mayrraa Woohoo! Thanks for the high marks. 🥰 RT @benzenehan: Can’t talk rn, too busy planning my entire day tomorrow around going to Starbucks and trying their new oatmilk drink @tiarajamie191 Enjoy it all! 😋 @ummmkayyy_ Love you too, Kay! 🥰 @ummmkayyy_ We're all for sipping and shopping! @_jambell_ Both! 😋 @caitlinp33 Good news. It's here to stay! 🙂 @caitlinp33 That's the tweet. That's it. That's the sip! @vanessaguzwoman https://t.co/Y0m8BkM8S3 @adoregldn https://t.co/0rMlMXwgkl @victoria_evelyn All happiness is necessary. 💚 @JasonMOBrien That's its entire business. And business is good. 😎 @PlNKANGEL You're welcome. 💚 @nyusicheng Cheers to enjoying your best sip! @Pucca4lyf We see you drooling. 😉 @supermangotang0 🎵Sweet dreams are made of this. Who are we to disagree? 🎵 @p1umeriass So glad you like it! @cheyennemikala We know right? Better latte than never! @WitchyGoth Honestly, when is it not though? 😉 https://t.co/akm3MUD5xR @Brayan_Gto https://t.co/jX2s1oB75w @sluice_gate On Wednesdays, we sip pink! 😎\nhttps://t.co/LlJAax1DfT @_janxo Yes. 😉 @sad1754872066 Treat yourself. You deserve it. 💚 @fit_princess93 For the best experience of the beverage, we only offer tall and grande Nitro Cold Brew. With larger sizes, the Nitro cascade leaves the beverage before it can be consumed. @bhadbratzz1 Can't stop, won't stop. Sip happy, friend! @monniehope https://t.co/om8gEJWZYp @vanessaguzwoman Sounds like one delicious checklist! @smoknP We'll thank you now. That sounds delish! @bhadbratzz1 We know what we did. 😉 @monniehope Can confirm! Glad you're enjoying every incredible sip! @adoregldn See you soon! 💚 @adoregldn It's a pretty safe bet. 😉\nhttps://t.co/d6G6fLTJPr RT @noitskatelyn: I wish everyone a very oat milk at starbucks @AbdulJuhaina Better latte than never. 😉 @fongo2 It knows what it does. 😉 @lady_hyperbole Cheers to delicious new favorites! @ashkay823 We're so happy that you gave one a try and it exceeded your expectations! @mariaaadeniceee That's the delicious truth! @Simply_Bia See you soon!\nhttps://t.co/d6G6fLTJPr @hansolsgem We're happy that it rates a perfect sip score with you! @VelvetMobius We're all about sharing the good news! 😊 @jennandrewss Just wanted to say we're really glad you enjoyed it. 😊 @mozelle24 Look no further. Cheers to your perfect sip! @karlarachellem Glad you enjoyed every delicious drop! @celestenavv Cheers to life-changing new fave sips! 😊 @VelvetMobius Can confirm. It's here to stay! @itsnorayareli We're glad your sip rated a 10! 😊 @Jladolcee Answer the call! 😉\nhttps://t.co/d6G6fLTJPr @itsBEBE__ Can't wait to share that sip with you! @itsmekaylap 🙌 @uhhashlyyn_ Just for you, Ash! 🥰 @toriimariaa Woohoo! 🎉 @itsmekaylap Iced Brown Sugar Oatmilk Shaken Espresso is officially here! @mrdavidortega We're aware that some customers are experiencing issues ordering select items through the Starbucks app. We apologize for the inconvenience and encourage you to visit our drive thru and store for your order. Thank you. @karenxbasulto Thanks for the perfect sip score! @nikkiiiiann Cheers to finding new favorite sips! @tiffanyaknox We love it when you find a new favorite! @meggbenson Thanks for sharing this! 😋 Spring is here! Jump into the season with our new game, Sip, Smile, Spring—powered by your smile! Check it out on Instagram. https://t.co/tQPdmYZi0B https://t.co/UyEFWzvpHz @AshAllen350 It's your time, Ashley! How was your drink? @topazkat We were thinking of you! 😉 @Notabumbleb88 Happy to make you happy! 🥰 @KTMaviglia Look at that glow! Cheers.✨ @lysscalv So much yum! @EmilyTFord And it's here to stay so enjoy! 😉🥰 @ChelleMoraga Enjoy! @Jacksters685 We're always happy to serve you your cups of joy! 💚 @CoralAngele A pick-me-up that you deserve! @RussDeCastro221 That's a delicious way to sip! @RussDeCastro221 You'll love our new Iced Brown Sugar Oatmilk Shaken Espresso! https://t.co/d6G6fLTJPr @t_slns Cheers to new faves! @yadirapaxton It sounds like you've found a new favorite sip! 😋 @Albert_347 Cheers to finding another sip to love! 😍 @FSUmanager Aw, shucks! 😊🥰 @Albert_347 We're happy to hear you're loving it! 😋 @itskristind Now you can customize your sip any way you'd like! @xoedialma Yes and yes! 😋 @falatyn A sip changer, for sure! 😉 @zonazanga Exciting!  🥰 @Lo_wee We'd love to hear what you think! 💚 https://t.co/B26DzIimvZ @bahiehhh Thanks for the delicious tip! @danicaam2201 We're happy to hear you're loving every sip! Is it a new favorite? 😍 @CLGagnon86 It is, indeed! Thanks for siplebrating with us. 🥰🎉 https://t.co/UoyJ7DN1D4 @nursedani23 Cheers! @nabrathhhh We're happy to hear you're loving it! 😍 @Maine_Char Sounds like it should be in your cup! @Lo_wee We're happy to hear you're loving it! 😋 @Eleytwun Yum! How was it? @mmary_jay 💚 @mmary_jay Tears of joy for all those sweet happy sips! RT @luceroicantu: got the new @Starbucks brown sugar oat milk latte and it is, to the shock of no one, divine @mariquinteros_ No kidding! It's delish! @ktsurly So...how was it? 😊 @_Nessss Sip, sip, hooray! 😍🙌 @margmaes Truly the best month. @DavidProia Yes! The new Chickpea Bites &amp; Avocado Protein Box is available in U.S. stores.  A fully plant-based portable box—with 15 g protein—delivers chickpea bites, snap peas, mini carrots, dried cranberry and nut mix, and avocado spread for a perfect on-the-go moment. @RobertPoser Today you can! Oatmilk is available at participating U.S. stores. @powderedmilkk Goooood morning and happy Oatmilk day! @ivydreamlands We hope it's just the start of an amazing week. @Ian_n_wells Cheers! 🙌💚 @nicpaige_ https://t.co/71Vq65o7fC @silkleia Starbucks Doubleshot On Ice is now called Iced Shaken Espresso.  https://t.co/QfgOjLstE5 @tynie_boo We're happy to hear you think it's perfect! 😍 @Heather_Burdo Yes, you can customize this drink with decaf espresso shots. @lucyyrios_ We're thrilled you're loving every sip! 😍 @marissaaAnthony Sounds like you've found a new favorite sip! 😋 @JustLikeeIsaac So glad you're enjoying it! @0hanasorry Cheers, friend! So glad you're enjoying it. @nicpaige_ See you soon, friend! We hope you'll love every sip. 😊 @HelloMandyO Cheers! 😍🙌 @belieberx2369 Starbucks Doubleshot On Ice is now called Iced Shaken Espresso. Just ask for it with our Blonde Espresso and sip happy! @cantsleepsyd Yes! Just ask your barista for decaf espresso. Sip happy, friend! @bfremm Or stay in bed and order in. 😉 Starbucks Delivers is now available in all 50 states in the U.S. To see if Starbucks Delivers is available near you visit: https://t.co/8TzwEl1eav @birkclogs Glad you enjoyed every magnificent mouthful! @elaineskennedy It's here to stay! Enjoy every delicious sip, friend! @jazminelopeez Sounds like you've found a new favorite sip! 😍 @kjmelvin3 You are correct it was renamed. A venti Iced Shaken Espresso has 4 shots. https://t.co/QfgOjLstE5 @MatchaBobaFett It's here to stay and make your day. @kforbs Not to worry: It's been renamed to Iced Shaken Espresso. https://t.co/QfgOjLstE5 @briannazakyra Oatmilk is here today! https://t.co/yM8wLkDDdt @firstdayofhome Thanks for celebrating with us! @realxoxoethan Not to worry: It's renamed! Look for the Iced Shaken Espresso. @RaeWhitlock @rhymeswvictoria We apologize for an earlier, inaccurate tweet. A tall Iced Shaken Espresso is served with 2 shots, a grande has 3, and a venti has 4. @sofrito_mami Good morning and happy Oatmilk day! @vntgebutterfly Tastes delish, too! @RyanHufton Glad you enjoyed it! @94dru We didn't have oatmilk nationwide until today! It's available now in participating U.S. stores, and in our app. @0hanasorry Starbucks Doubleshot On Ice is now called Iced Shaken Espresso. It's a drink you know and love—made with Signature Espresso shaken with classic syrup and topped with 2% milk. @sarahkotss Good morning, it's oatmilk day! @RyanHufton We're pretty excited about it, too! Which oatmilk sip will you try first? @adamssadnler If you say so. 😉 Cheers, friend! @Ghetticashedout As of today, Oatly oatmilk is on the menu and in our app! @tudorgirl21 We hope you enjoy every sip! @DubQueenAbs We have Oatmilk today (in US stores)! https://t.co/yM8wLkDDdt @jennamariesch No more tears - it's true! https://t.co/yM8wLkDDdt @escapefromseI Today's a big day. @Shannan_WR We hope today is the most delicious day of the whole week! @mandamakesmusic Check your app! We're excited to offer Oatly oatmilk starting today in participating US stores. @bibidibalba 🙌 @Outsider0utcast We did it all for you! Glad you enjoyed every amazing sip. 💚 @a_lank Oh, happy day! 🥳 @Tylerhartling Better latte than never. 😉 @greenthumbleo Oatmilk is available today! @Cinmer13 We still don't mind if you tweet us, but you should check out the app today - Oatmilk is available at participating US stores! @bibidibalba OK https://t.co/yM8wLkDDdt @ALICEreevas Oatmilk is now available in participating US stores! https://t.co/7WDSsLrEiD @murielm1031 You know what, you're absolutely right! https://t.co/yM8wLkDDdt @lighttkylo You got it: Oatmilk is available today! https://t.co/yM8wLkDDdt @tereee_u We love you too! 💚 @LiteBriteMs Today's the day! @Katie_Misuraca Not to worry! Starbucks Doubleshot On Ice is now called Iced Shaken Espresso. @lehungster Which one will you go for first? @aaaldape It's a similar build, but extra delicious! First Starbucks baristas shake Blonde espresso, brown sugar and cinnamon together with ice, and then top it off with oatmilk for a cool lift to power you through your day. @Britney4Trump Sorry, it's not available as a Frappuccino® drink. @mrdavidortega Starbucks Doubleshot On Ice is now called Iced Shaken Espresso. @p0esiedanslarue Oatmilk is here! @whirlwindjenn Cheers to delicious new favorites! @breanna_miranda The Iced Brown Sugar Oatmilk Shaken Espresso is available today! @aluskee See you later today! And tomorrow... @adelvecchio8 ¯\\_(ツ)_/¯ @hotynation Today's the day! @LabanZReeves We're happy to help everyone enjoy Oatmilk in participating US stores starting today! Let the sunshine in. Introducing the all-new Iced Chocolate Almondmilk Shaken Espresso and the Iced Brown Sugar Oatmilk Shaken Espresso! ☀️ (US only) #IcedShakenEspresso #Oatmilk #Almondmilk https://t.co/zIR1UMB63h @Nad_Bho We love you too! We have no plans to remove it from our menu. Happy sipping! RT @LostInStereoLiz: STARBUCKS FINALLY GETTING OAT MILK LETS GO @brightiiC You're welcome! @brightiiC We don't have plans to bring them to our menu but feel free to let us know what you'd like to see at https://t.co/1BxewVH8JT. You never know what might show up! @brightiiC Thank YOU for sharing your feedback. It makes a difference. 💚 @kariari21 Sounds amazing! @Jen_Murray70 It's oat for you, Jen! 😉🥰 @kariari21 What are you excited to sip with oatmilk? @jamezshea Thanks for helping us introduce the delicious oatmilk to your fellow sippers! 😉 @jensized We appreciate your patience, Jen! 😊💚 @norrrrtz March 2nd in the US! @becca__xoxo_ https://t.co/w3eSkKSa6I @kfreshyo You're in for an amazing celebration! @Shot0fDepresso Yes, oatmilk will be available on the app starting tomorrow. @conor_murrayy Oatmilk. At Starbucks. What a great way to start March! https://t.co/yM8wLkDDdt @TexasRud Can't wait! @Md1819 Yes! It's available as ground coffee and K-Cup Pods. Find it near you: https://t.co/d0Yjhc79ju @TexasRud See you tomorrow? @becca__xoxo_ Prepare your taste buds for even more deliciousness! @brightiiC Can't wait for you to see what we have in store! 😋 @ColleenIsChill It'll be at participating U.S. stores March 2, so most stores will offer it. @iDREWonyou An 8 oz serving of Oatly oatmilk has 7 grams of sugar per serving. @dontshootskrlx Best sister ever. @neportuqua It'll be at participating U.S. stores! @JessieMackie You got it: We’re excited to partner with Oatly to bring oatmilk to participating Starbucks stores in the US tomorrow, March 2. @NMarley1128 We’re excited to partner with Oatly to bring oatmilk to participating Starbucks stores in the US. @mymusemyflaaame You're not the only one! 🥰 @IsolationActivi Starbucks dates with the one you love are the best! @coolgrey Please visit https://t.co/uYzFgFCdKD to learn more about Oatly carton recyclability and to find out if your community recycles the cartons. @GalacTrisSquad We're looking forward to it! @DieRenaissance It's at participating U.S. stores - which will definitely include many stores in Seattle &amp; Tacoma. @xangbar Yes! Starting March 2, you'll be able to  choose oatmilk as your milk option at participating US stores. When you open our app tomorrow, choose your beverage, tap “Milk,” and then pick “Oatmilk.” @hotynation SAME! What drink are you going to try first? @linklyx3 We heard you, Kelly! Can't wait to sip with you. 🥰 Your patience will be deliciously rewarded March 2! https://t.co/IolObCK8Ek @christinaginesi Seeing you is the highlight of ours! @sadieeehdz We're glad you're enjoying it! What drink did you get with oatmilk today? @btallsalt3 On day 1, no less! We hope it's just the start of an amazing month. @Mary81bjc Awesome! @phiIsthiccbooty We sure are! 💚 @For_Butlers Seriously! https://t.co/yM8wLkDDdt @justkittenya It will be at participating US stores tomorrow. All company-owned, and many licensed stores will offer it. @Bailey_Waltman We hope it's just the start of an amazing week! @Bailey_Waltman It will be at participating U.S. stores tomorrow, and many licensed locations will offer it as well! @F_R_Odo Please visit https://t.co/uYzFgFCdKD to learn more about allergens and certifications. @GloriaRodrii Yes! And starting tomorrow we'll have 2 new iced shaken espresso drinks to help you fall in love with oatmilk: https://t.co/7WDSsLrEiD @dezzloc Starting tomorrow, March 2nd, you'll be able to choose oatmilk as your milk option in your favorite Starbucks drinks! @Eleytwun Hawaii too! Participating stores all over the U.S. @alyssa_coop Here's to a delicious new future together. 💚 @nygauth It's true! Tomorrow, we'll have the Iced Brown Sugar Oatmilk Shaken Espresso as well as the Honey Oatmilk Latte. https://t.co/yM8wLkDDdt @cinnamongrlfrnd hello. https://t.co/yM8wLkDDdt @stxphvniev Agreed. We're making it happen tomorrow. https://t.co/yM8wLkDDdt @voIcanicloves 🙌 @hopelesspaopu (They are not kidding https://t.co/yM8wLkDDdt) @hello_Adriana You got it (tomorrow). https://t.co/yM8wLkDDdt @LJamesP1991 Tomorrow at participating US stores! https://t.co/yM8wLkDDdt @emilymepham1 You're going to love it with oatmilk! RT @missbossladykai: Starbucks is finally rolling out oat milk nationwide and my day is made 🥰 @dawn_horan Happy sipping! @kkupksy Now you can enjoy your favorite drink anywhere you sip! @randykender That's awesome to hear! @aragooon_ You have a latte to enjoy! @OSCARViSiON13 There's always a reason for Iced Coffee! 😉😋 @emilymepham1 Yay! What's your usual? @kessiejane11 Tomorrow! https://t.co/yM8wLkDDdt @SpaceCa53326233 Participating Starbucks stores in the U.S. will serve it, and many licensed stores (that's the term you were looking for!) will as well. Please check with your barista when you arrive tomorrow morning. ☺️ @cheryl_tweeedy Sorry for the late response, but to answer your question: Yes! 😉 @Violetworld Happy sipping! @LuvingMrsKasha Delicious choice! Love you too, btw. 💚 @davebarish You never know! 😉 @87Chill_ Of course! @SteveCallaway2 Enjoy! @meganmccluskeyy Hope it brightens up the day! @tppfreestyle It will be available starting tomorrow, March 2! @itsemilyduude Thank you for spreading the word! @joshGrana2 We hope your year just gets better from here. @rrmtexasboi We're writing this down. 😍 @_JordiePoo It's true! It'll be at participating U.S. stores tomorrow, March 2. @Ruffles421620 So glad you've already found a delicious way to enjoy it! 💚 @devonmcfeeley 💚 @kelsie_leia98 We look forward to your daily visits! https://t.co/yM8wLkDDdt @tonyystankk We will have Oatmilk tomorrow! https://t.co/yM8wLkDDdt @1017BrooksSquad 🤔 https://t.co/yM8wLkDDdt @devonmcfeeley We're just one day away! @oxxxll It's true. https://t.co/yM8wLkDDdt @l0vetinabell Oatmilk will bein our U.S. stores starting March 2nd! https://t.co/yM8wLkDDdt @samanthabelle41 No more tears starting tomorrow, OK? https://t.co/yM8wLkDDdt @Phoenixs_Flame_ We're looking forward to how much you enjoy it! @prasannaaaa_ 🙌 @sarahinkc Which drink are you most excited to add it to, friend? @urmomrosh We'll actually have it on March 2nd! @Hudson_Lhp Let us know how much you love it! @Hudson_Lhp What's going to be your first Oatmilk drink? @Grouchosauras We cannot guarantee that any of our beverages and foods are allergen free as we use shared equipment to store, prepare and serve them. @Phoenixs_Flame_ Yes! Starting March 2nd, you'll be able to choose oatmilk as your milk option in your favorite Starbucks drink. @cvakratsis Coffee date soon, Chrissy? 💚 @captainmorggaan Same. @tayymariee02 It will soon! We're adding it to all U.S. stores on March 2. https://t.co/DqipJgzTBp @bribriforthewin How about... tomorrow? https://t.co/DqipJgzTBp @savfranzdorf We can't wait to hear how you enjoy it! @Kestrel_Rose We're happy to hear you've found some favorites! We welcome you to share your feedback at https://t.co/SPH9PuUUvR. @Ruffles421620 We are excited to offer it tomorrow! Which drink will you try it in first? @emilykub_ It will tomorrow! We're launching in US stores on March 2. @kaycee_345 Thanks for sharing the Oatmilk love! @nygauth What drink are you going to try it in first? @PartiikiddJay 💚 @luxtides We're here for you whether you need a shoulder to cry on or a creamy and delicious plant-based milk made with oats. @c_delarosa21 SAME! @selinashiny A lot has been building up to this day, and we're happy to share the special occasion with you. @SweetButCreepyy It’s creamy and delicious and pairs perfectly in your favorite Starbucks beverage including the new Iced Brown Sugar Oatmilk Shaken Espresso and the Honey Oatmilk Latte. @Grimes_Gurl We’re excited to partner with Oatly to bring oatmilk to participating Starbucks stores in the US. @taylorhuling *hands you a tissue* we'd never joke about something so great! https://t.co/DqipJgzTBp So we heard you wanted oatmilk... Oatly is available at Starbucks starting March 2—add it to all of your favorite drinks! (US only) https://t.co/kPNnwtLN9V @_haileighhhh 💚💚 @Brizzlefizz Sip sip, hooray! @tereee_u We can't wait to see you! 💚 @evenparadise Cheers to the perfect start to the day! @87Chill_ What's your go-to drink to pair with it? @explosive_blood We love you too! 💚 @jchowardSPEAKS Welcome, friend! 💚 @ImThatKLA Now that's the color of love! @Rascal5623 Hope you had fun! 💚 @davebarish Enjoy your sip down memory lane! @misteeybar Its true, it's truuuueee! 😉 @LuvingMrsKasha What did you decide? @bellarosecasas We hope you got your refreshing cup! @sydlovessean It's definitely the perfect time to relax with your cup! @misteeybar Sounds like you have a winter favorite! @willsharksmith Enjoy! @scorzzz Cheers! 💚 @mhmokay6 https://t.co/a6BHAhcpsm @shenani_gann Exactly! 😉💚 @sydlovessean Cheers to weekend sipping! @allisonha5 True and true. 😉🥰 @AmazingICT_Paul Sometimes we have to pause and appreciate our favorite cups! @beeplayswow Glad you found the perfect sip to stay cozy with! @Darth_Sonia Happy to hear! @Kestrel_Rose What's your go-to sip? 😋 @sortaprettycool Some delicious things just can't wait! 😉 @im2qut They know what you're capable of! 😉🌟 @beeplayswow What did you decide to sip? @Dame_Champagne We appreciate your feedback, Lindsay! We'll keep this in mind. @alexadorstt Cheers! 😍🙌 @rudeboiiromeo Cheers! 😋 @PureAshanti We'd love to hear what you think! 😋 @mandaa_v7 Happy Sunday! 💚 @TashaThoinks We're happy to hear they're a favorite! 😋💚 @ciarafinnegan_ Cheers! 😍🙌 @MissSpoiledGirl We're happy to hear you're loving every sip! 😍 @ALI_YOUNGMOULA Delish! @NyawiraNjoroge All delicious favorites! Cheers! 🙌💚 @NyawiraNjoroge Sip, sip, hooray! What's your go-to? 😍 @TaymarBianca_xx Have you tried an Iced Caramel Macchiato with hazelnut added? @NyawiraNjoroge Happy ordering! 😉💚 @mollyk1996 We're thrilled you're loving every sip! Is it a new favorite? 😍 @lianett03 We like your style. 💚 @cash_lun Awesome to hear! 💚 @ALI_YOUNGMOULA Nice! What did you enjoy? @swiftchampagne3 Enjoy! 💚 @amanda13wall Happy to serve you! 💚 @yumsterx3 We happen to speak that language! 😉 @EverydayShevine Awesome to hear! @Janetfyb Especially when paired with a delicious Cinnamon Dolce Latte! @Just_Raine Kind cups are the best! @heymrosario https://t.co/dFFoXXZPrg @Dame_Champagne Hey Lindsay, you can order decaf espresso beverages on the app by choosing the beverage you're interested in and changing the shot option to decaf espresso. Hope this helps! @scorzzz Oatmilk will launch in all U.S. stores later this year! @yimmyashi We're happy to hear you enjoyed Nitro Cold Brew! 💚 @HelloSmitty_ Sounds like you've found your favorite sip! 😍😋 @ceciliamramire1 We're happy to hear you're a fan! 😋 @cheyennejael Sounds like you've found a new favorite sip! 😋 @harmonicwavez Not as cute as you! 🥰 @arb100sf Looks awesome! @OnlyNathan Sounds perfect! @ruthsarahi31_ What a treat! @harmonicwavez Thanking you now! 😋 @OnlyNathan What's your favorite snack to enjoy with it? @skookiee1013 Sounds like you've found a new favorite sip! 😋 @maegankyla Is that your favorite sip, Maegan? @lawlpap We like your style. 😋 @paigeguerrero3 Aww! 💚 @Dracofav We'd love to hear what you think! 💚 @Dracofav We're happy to hear you're loving it! Are you enjoying the Pistachio Latte hot or iced? @alisa2089 We're happy to hear you're loving it! 😋 Though seasonal favorites will come and go, we'll always have something delicious for you to try with your favorite sip! @Brizzlefizz What's your favorite drink to add it to, Bri? @averymariecx They're heaven-sent! @LaBelleShanell It's creamy, dreamy pistachio perfection! 💚 @_haileighhhh Was it love at first sip? @carencera_ We're happy to hear you're loving it! 😋 @cas_ste15 Come sip with us, friend! 💚 @KatieGreenTrib Yes! 😍🙌☀️ @E_Roqq We're happy to hear you're loving it! @diibydesign We like your style! Cheers! @diibydesign We're happy to hear you loved every sip! 😍 Is your favorite Pistachio Latte hot or cold? @OhYOUButterball Yum! Cheers! 💚 @Copy_failed We're happy to hear you're a fan! 😋 @OhYOUButterball Sip, sip, hooray! What is it? 😋 @yagirlya__ Sounds like you've found your favorite sip. 😍😋 @luvvjack Do you have a favorite? 😋 @kd0llas We're happy to hear you think it's out of this world! 😋🌎 @babyycakessxo Sounds like you've found your favorite sip! 😍 @navajoweeb Sip sip, hooray! @OhHelloMedusa We 💚 you too! @fadedsuh We're happy to hear you're loving them! 😋 @GabbySteele3 Cheers! 😋💚 @ScooterbugFaw Happy Birthday! 💚 @mayyyrrra_ Yum! 😋 Cheers! 💚 @mayyyrrra_ Always! 😊 What's your sip? @srayanne_ Cheers! @PrettyLittleMo_ Sounds like you've found your favorite sip. 😋 @TionnaLashae__ What is it? 😋 @fernandotl Cheers! 💚 @jaymarlow_ We offer all kinds of ways for you to enjoy great Starbucks coffees at home! Check them out at https://t.co/mU47fw4rFv @PenyChristopher Cheers! 💚 @rundeirun That is wonderful to hear! Thank you so much for sharing your positive experience with us. 💚 @cathyylu We're happy to hear it's a favorite! 😋 @haIosxangeI We're happy to hear you've found a new sip to love! 💚 @GailzHurst Yes, Starbucks Delivers is available on Uber Eats in all 50 states. Check to see if it's near you: https://t.co/FT9Kh0PvhK @rachelzaas Boss move! @lindacaughman Both delish choices! @KristenMcPeekTV Thanks for stopping by! @rhyyan_ We're happy to hear you're loving them! 😋 @ayohvnna Sounds like you've found your favorite sip! 😋 @Laye_La_Ali We're happy to hear you're loving it! 💚 @xox_jessss We're thrilled you're loving every sip! 😍 Is it a new favorite? @vibrant_elocin Sounds like you've found your favorite sip! 😍😋 @PostOpPrincess We're happy to hear it's a favorite! 💚 @PenyChristopher We're happy to hear you're loving it! Is it a new favorite? 😋 @pomegranatesky_ Starbucks Delivers is now available in all 50 states in the U.S. To see if Starbucks Delivers is available near you visit: https://t.co/8TzwEl1eav @mmoonniikkaaaa We're happy to hear you're loving it! 😋 @tardnum Looking forward to our next sip together. 🙂 @tardnum Some days you need a Frappuccino® drink, some days you need a cold brew. 😉 @tardnum Both excellent choices. Let us know which one you choose! @Sweetweet64 Sipping your favorite is a great way to start your day! @emsplace1 Your secret is safe with us. 😉 @caruiz516 Yesss! 🙌 @jenchirpchirp The math checks out. @smilesisdope It sounds like you'd enjoy our Caffè Mocha! Our rich, full-bodied espresso combined with bittersweet mocha sauce and steamed milk, then topped with sweetened whipped cream. The classic coffee drink that always sweetly satisfies. https://t.co/xwfUVRSDEg @MaddieMLG To be fair though, it's never too cold. @helenelizabethx There's nothing boring about sipping your favorite. 💚 @elliieexoo We love sharing a cozy sip with you. 💚 @niaaaaax_ You can order this handcrafted hot tea beverage by its official name in stores or via the mobile app: Honey Citrus Mint Tea! https://t.co/l0hs5sEYiQ @theefiresign We know what we did. 😉 @_whitners_ Looking forward to our sweet reunion. 💚 @MeImJames There we go! @kaitlineliza4 Mother nature doesn't decide what's delicious! @EliseMichelle We recommend a decaf Iced Americano instead! @Kiesey78 We're here for you! 💚 @Sauda_Malkia Based on the replies... nobody @IsrealCasiano Cheers to favorites no matter the weather! @Kiesey78 We are suggesting that it can never be too cold for iced coffee, using Twitter features to joke about how fans of the drink enjoy and celebrate it no matter the weather. @rchlwg We see you drooling. 😉 @dogmomx2_1989 Correct! @KARLA_F0RNIA When you find the one, you know. Cheers to love in every sip. 💚 @iiesme111 We hope you'll be enjoying one soon! @blametaryn Let us know when we need to get that order started. 😉 @usetocook 🤨 @GregoryMarrufo That's the spirit! @ronnockoch Ice cold? @Dev_thecreator No chance! @charlisrae Ever. @k_ockout We can't wait for you to give one a try!\nhttps://t.co/6kSCBONUq5 @DanicaDavid_ There's nothing more delicious than discovering a new fave. Cheers, friend! @coolcatcris Can't wait to see you! Reply if you think it's too cold for iced coffee. 👇😉 @joooceyyy https://t.co/fSueiF5EfS @rundeirun We're happy to hear that our partners can put a smile on your face! 💚 @rowena42 We're happy to hear that our partners can always make you smile! @lwarren89 Sounds like you're having a berry good day! 🍓 @hmancentipede 🚨 New Starbucks fave found! 🚨 @senia_garciaa White Cheddar and mozzarella cheeses on sourdough bread, topped with a Parmesan butter spread...it's the ultimate bite! 😍 @JuliannaSeide We're always happy to put a smile on your face! 😊 @JoeGig83 We're thrilled to hear that we could put a smile on your face! @Karen757Norfolk Now that is a brew-tiful sight! 😍 @KatieBethJ It's the perfect day for some Cold Brewing and some Spring blooming! 🌸😊 @BorgheseAmira We hope that you had a fa-brew-lous day! 💚 @AmitSharmadel We're happy to be your workday companion! @cy_rus23x You're so welcome! 😉 @its_kayli_b You really are amazing! 💚 @InfusedGeek We 💚 you! @LifeAfteRob We do it all for you! 💚 @misssummerrrr You + green tea = a matcha made in heaven! 💚 @bominful 💚💚 @katyinbloom Coffee date soon? 💚 @bominful We hope you enjoyed every sip! 💚 @christineladera Delicious! 💚 @christineladera What's your favorite kind of bagel, Christine? @VannyG_303 We're pretty nuts about it too! 😉 @pr1ncwss Cheers to finding the perfect drink! 💚 @navajoweeb Is that your new favorite sip? @pr1ncwss That sounds like quite the sip! 😍 @violetmartinezz Coffee date soon? 😉 @TheTimiRay That sounds like a matcha made in heaven! 💚 @amc1563 That sounds like a wonderful way to start the day! 💚 @IAMHARVAY Come sip with us! @jungeuliet No question. 😉 @byhapppyal We'd love to see you again! 💚 @blldgshockey11 We love it when you find a new favorite! @YD5Racks Answer that call. 😉\nhttps://t.co/l0hs5sEYiQ @qyyyyyra We hope you'll be enjoying some soon. @nicahprz @drwnbautista Cheers, friend! We hope you enjoyed every sip.💚 @ItsAriCampos Sip sip, hooray! @bareftessa It's pretty dreamy! 😍 @MedusaOfTheSea You're so welcome! We hope you enjoyed every sip! @hiddenalchemy_ It's perfection in every sip! @NoTixNoLaundry We do it all for you. 💚 @Evani_Atheris That definitely sounds like something worth celebrating! 💚 @denae1c The feeling is mutual! 💚 @denae1c The Honey Almondmilk Cold Brew is definitely a magical Cold Brew sip! @joooceyyy Looking forward to your visit. @kaleyymichelle We hope you start each day with a smile. 💚 @joooceyyy What should we get started for you? 😉 @jaynieleavy Cheers to sipping on our favorites! @schlarbae Neither will seeing you smile. 💚 @clashyVR6 We hope you enjoyed every sip! @cillaann_mtz Some of the best plans are the ones we didn't make. 😉 @beautiful9195 Thank you for making us part of your day. 💚 @sierradouglasc It sounds like you're winning! 💚 @JustYourGinger_ That sounds like a wonderful way to start the day! @ChihiroKasa Cheers to finding a new favorite sip! @knnxs_ Cheers to delish new favorites! @dogqueenv It's so delish! @my_cosmic_chaos Glad you enjoy them! @ChavezSarena Each bite has us on cloud 9! 😍 @UncleKhi What's your favorite kind of bagel, friend? @ElizabethhhLynn Sorry about that! The slow steep time limits the amount we can make daily, so it’s only available while supplies last. @byhapppyal *Chef's kiss!* @xlhottie It's creamy, dreamy, pistachio perfection! @tiaa1622 Cheers to delicious! 💚 @Taiii_Taiiii Give it a try and let us know what you think! @cherrybabbyyy It's a match made in heaven! @aashleylizette4 Sorry about that! The slow steep time limits the amount we can make daily, so it’s only available while supplies last. @fleurpixi Enjoy every sip of happiness! @strooooh We're glad you've discovered this today! @myobviousmotive 400 Stars may be redeemed for a packaged coffee item such as whole bean coffee, or select merchandise up to $20. Packaged coffee and merchandise availability may vary by store location. @garner_erik Cheers to enjoying every sip! 💚 @tiaa1622 Is that your new favorite sip? @ColdBoy__Vic02 Cheers, friend! We hope you enjoy every sip. @angiejanicek Seasonal flavors come and go, but we'll always have delicious new drink for you to discover! @tfoxster You're in the right place! Please share the details in a DM and we'll be happy to pass it along to the right team. 💚 @kalifkoen21 If you just can't wait for the holidays, you can recapture a touch of festive flavor with a Caramel Macchiato made with blonde espresso and extra caramel sauce. @markyarm What a throwback! @mooshdraws Our Siren has a special story! You can read about it here: https://t.co/bmVACf56sC @yousaforce Now more than ever, we must come together to affirm specifically that Black lives matter and confront racism in our communities. @Rinzler1836 Not at all. 💚 @TherealShy___ Peppermint syrup is available year-round to mint up your mocha! @_lrhx It's the perfect treat to pair with your favorite sip! 💚 RT @StarbucksNews: Join The @Starbucks Foundation in supporting the American Red Cross Disaster Relief. Your donation will help the Red Cro… @garner_erik What's your favorite drink to enjoy with it, Erik? @GiullianaVz It's a winning sip! 💚 @Spoileddee_ It's a top tier sip! 💚 @Keep_YaEye_OnMe Enjoy! @danixla_ They're so creamy and dreamy! Do you get yours iced or hot, Daniela? @Cescbe Sorry, since it is currently only a regional beverage oatmilk is not available as a modifier in the Starbucks App. @brianna63191921 Starbucks Delivers is now available in all 50 states in the U.S. To see if Starbucks Delivers is available near you visit: https://t.co/8TzwEliPz5 @fxhmidx Can't wait to share that sweet sip with you! @madeline_west_ Yes! @jvarvel74 Almost. 😉 @haleyvictoria13 Next month! @hunterbear1303 💚 @MELNCOMPANY It's a par-tea for our tastebuds! @hunterbear1303 That sounds like a match made in heaven! @__TheJoeGallery 💚💚 @hunterbear1303 They're the perfect treat to pair with your favorite sip! @gfx_kid Come sip with us! 💚 @__TheJoeGallery Cheers to the perfect matcha! 💚 @brothercaramel Come see us, friend! @lilysworld129 Thanks, friend! What's your favorite kind of Cold Brew? @itsyoncaee It's a top tier sip! 💚 @jazmyn_mallory We couldn't agree more! Cheers to the perfect sip, Jazmyn! 💚 @adreaglz What's your favorite sip to pair with it, friend? @mollysabine We love it when you find a new favorite! @mollysabine It's a pistachio flavor explosion! @goldenyenn Cheers to that first sip feeling and finding new favorites! @maarrrrrre It's delicious any way you say it. 😉 @brwneyesblktea Vanilla Sweet Cream Cold Brew with some caramel! \nhttps://t.co/EHFQ1D1Tjz @SamsungNeptunia Thanks, friend. We'll keep your feedback in mind. Enjoy! @chaiporfavor We hope it put a little smile in your heart. 💚 https://t.co/I6nsuGB6z7 @moonquarius https://t.co/YvaTFWh8qa @marianariosrmz1 You're welcome. Sip happy, friend! @SamsungNeptunia Is it your go-to? @FatimaaaTorress Resistance is futile. See you soon? 😉 @marianariosrmz1 Here's to a year full of delicious firsts. https://t.co/PRsmWV1Uj5 @Mosseyroc If any game needed a change, it would be Monday. 😉 @JoJoe89309852 You rang? 😉 @moonquarius Can't wait to see you! @tuckyy_ Cheers to pistachio perfection! 💚 @katiemcknightt Delicious! 💚 @katiemcknightt What's your favorite kind of muffin, Katie? @prettyshonniee That sounds like the perfect daily routine! 😍 @Karin36509214 We encourage you to reach out directly to the local stores in your country regarding their available menu items. @VoraNoKie What's your favorite drink to order with them? @diibydesign Give it a try and let us know what you think! 💚 @JocelynJoon That Honey Citrus Mint Tea is always a hit! @AbPasillas Looking forward to sharing an amazing sip with you! @briasimoneeee Cheers to love at first sip! @emilybasquiat Cheers to life-changing sips! @My7Suns Cheers to your peachy perfect sip! @coche1234 We love it when you find your perfect matcha! @tiaraamacoleee That sip is an overachiever and proud of it! @JosePratts5 We hope to see you soon! Frosty feels. ❄️ #ColdBrew https://t.co/SoXotuimwh @alyssa_bananas Glad you enjoyed it! 😊 @moms2ontwittter https://t.co/moPOHB6kqR @VanessammmSmith Sorry about that! The slow steep time limits the amount we can make daily, so it’s only available while supplies last. @tabriajai We hope you enjoy every sip! @aoiarubam Looking forward to satisfying that craving with you! @alyssa_bananas Have you tried our Vanilla Sweet Cream Cold Brew yet? \nhttps://t.co/EHFQ1D1Tjz @madisonmdd No judgement today or any day. Sip happy, friend! 💚 @AshleySandborn Wednesday doesn't stand a chance. @TheDivineMrsCM You're welcome. We're glad you're loving every sip! @moms2ontwittter We hope you loved every sip! @cameroncalder13 I am so sorry to hear one of your favorites has been discontinued. However, if you'd like to see it back on our menu, please leave us feedback at https://t.co/SPH9PuUUvR. Thank you. -Kevin @miwa_nchu 💚 @grisellex3 We do in select Midwest stores, and will have it nationwide next month! @Marisol_mari1 Our mobile app is the best place to check store hours near you, or the store locator on our website: https://t.co/KK8sA8lD1k @_Cecilialazo Happy Birthday! 💚 @taylscoughlin That's a pretty delicious level up. 🙂 @Taylorschott14 Sip, sip, hooray! 😍💚 @miwa_nchu The best part of the day is sipping with you! @DiDisthename_ Always a winner. We hope you enjoy every sip! @melodyzimm1 https://t.co/DeTmEutK8w @LifeofJordie We're thrilled you're loving it! @suitercul We love that you're loving it! Do you have a favorite sip to pair with it? @trinityeugenio We're happy to hear you're loving it! 😍 @midtorred Cheers! @melodyzimm1 Glad it brought some joy to your day. Cheers to that first sip feeling! @ans_lane18 We know what we did. 😉 @Super_McToaster Sounds like love at first sip! 😋 @tvjames Yes, just let them know you've made a mobile order when you arrive! @kaatieegiibson Glad you found your perfect sip! 💚 @JaysenGold It's never too early to start the #PSL countdown. @JoshJuache01 We're happy to hear you're a fan! 😋 @gymgrl98 We are opening new stores globally every year, so we recommend submitting your location suggestion to https://t.co/SPH9PuUUvR @justambsss We're happy to hear it's a favorite! 💚 @bay112747 Sorry, since it is currently only a regional beverage oatmilk is not available as a modifier in the Starbucks App. @tianaleiii Cheers! 😍😋 @_Tianaxoxo We're happy to hear you're a fan! 😍 @_shelby_rose 💚💚 @Karin36509214 Good news, Karin. Toffeenut syrup is available all year round! @249be35thst Starbucks Delivers is now available in all 50 states in the U.S. To see if Starbucks Delivers is available near you visit: https://t.co/8TzwEl1eav @sarah_sullins19 Sounds like you've found a new favorite sip! @serahloreine It's entirely lovable. 💚 @tamarcia99 Glad you found your happy place. 🥰 @shawniebe1 Not a thing. 😉 @trentajess We're happy to hear you're loving it! 😍 @badbvthkim Cheers! 💚 @skylar_106 Starbucks Delivers is now available in all 50 states in the U.S.! To see if Starbucks Delivers is available near you visit: https://t.co/8TzwEl1eav. @flimflamxx Looks like we're on the same page! 🥰 @vtozil Happy to hear that! @JMcBride6 A delicious way to start the day! @goldensbiebs Enjoy! @dogmamasrock It will change the texture of the foam, but yes, you can have it with your choice of soymilk, almondmilk, or coconutmilk and add a flavored syrup to it as well. @1revor Thanks for visiting - we're glad you enjoyed this Starbucks Reserve coffee! @C0RALINEj That's correct, but we'll always be happy to help you find a new drink to love! @renzovaldezzz What's your favorite kind of refresher, friend? @flimflamxx Since you're a festive sipper, the Birthday Cake Pop sounds like the right one for you! @miwa_nchu 💚💚💚 @ChanelJett What's your favorite sip to enjoy with it, friend? @sunfl0wersunday You're so welcome! @sunfl0wersunday Cheers to enjoying our favorites! @flimflamxx Of course, friend! That's wonderful to hear. If you let us know your favorite drink, we can help you find the right cake pop. 😊 @lacey_nielsen98 That's awesome, Lacey! Thanks for being a part of it. 💚 @pendragonly Awesome to hear, bestie! 💚 @nurahzaidi We can't wait to see you! 💚 @hayatxdoll Coffee date soon? 😉 @sunfl0wersunday What's your favorite drink to enjoy with this? 💚 @alwaysforskyler That sounds like the perfect way to start the day! @_1kmarie Welcome back! 🥰 @Always_Jae See you soon? @neeyuhhh And we're the type to say yes and happily walk you through our menu! 😉💚 @HeMoansNik What did you sip? @lacey_nielsen98 We love kind cups! @astoldbyMIKA We look forward to hearing what you think! @rvniya What do you enjoy with your sip? @0NLYDIESEL91 Sounds like an amazing cup! @SinceMCMXCIV The perfect Sunday sip! @astoldbyMIKA Our Pistachio Latte combines espresso with steamed milk, real pistachio and a brown buttery topping for a creamy, comforting and cozy beverage. @pendragonly Your winter go-to? @brefromthepack That's awesome to hear! @carlaadefreitas Okay but you're right! 😋 @LegacyofGena 💚 https://t.co/6mbCOkPAJJ @OfficialMarinaX We hope you got your cozy cup! @miwa_nchu We love your taste! @MrSoprano21 Good morning, indeed! 🌞 @TeAmoShante 💚 @TeAmoShante Enjoy what you hear! @KittyAceAzula15 Cheers to that first sip feeling! 😋🙌 @vivizares Do you have a favorite? 😋 @caneswagg Cheers! @ThePsyence It's definitely a fave! 😋 @jailenelopez560 Currently, oatmilk is available regionally in U.S. stores. It will launch in all U.S. stores later this year! @TheKawaiiSora Cheers! 😍 @kenia_wyd Have you tried the Honey Almondmilk Cold Brew? 😋 https://t.co/DZcTgtmtk6 @AHartofFire Cheers! 💚 @FernandoMichhel Cheers! 💚 @seaofchocolat Cheers! 💚 @sabittariuss We're happy to hear you're a fan! 😍😋 @badbvthkim What are your favorites? 😋 @alicia_garvey Cheers! 😍🙌 @_nimaaibrahim Yum! 😋 Cheers to finding a new sip to love! @NaazNazzz We're happy to hear it's a favorite! 😋 Is there a sip you like to pair it with? @forevertaeh Cheers! 😍😋 @_nimaaibrahim Sip, sip, hooray! What is it? 😍 @hidingsolo Yum! Sounds like you've found a new favorite sip! 😋 @kingdavib Sounds like you've found a new favorite sip! 😍 @fashion_kween69 😋💚 @b_colunga3 Yum! 😋 Sounds like you've found a new favorite sip! @YooyaaLu Cheers! @bvgaa Sounds like you've found a new favorite sip. 😋 @pbasedd We're thrilled you're loving it! Are you enjoying yours hot or iced? 😋 @GiveEm_Buckets What's your go-to sip? 😍 @bbyflack0 We're happy to hear you've found your favorite sip! 😋 @elizughhbeth Sounds like you've found a new favorite sip. 😋 @veroholley Cheers! 💚 @loveIanguaqe Sounds like you've found a new favorite! 😍 @ayeebria We're happy to hear it's a favorite! 😋 @JonathanHorswel Enjoy the day! 🌞 @nashal_y We love sipping with you! 😍 @ZackKusnir Brewtiful! ✨ @ItsMeAshDee We're happy to hear you're a fan! 😋 @aleeciaxx Cold Brew is a cold coffee concentrate that baristas top with water and ice. Nitro Cold Brew is infused with nitrogen to create a velvety-smooth finish. https://t.co/lQcBS8Rj2J @HashJelani Do you have a favorite? 😋 @heidilaw16 We like your style! 😋 @_itskimchii Sounds like you've found your favorite sip! 😋💚 @veroholley We're thrilled you're a fan! Are you loving the Pistachio Latte hot or cold? 😋 @jaebeomXD 💚💚💚 @flimflamxx This depends on what you're sipping! @hattie0220 Happy Birthday! 🎉 @Reetzy830 Love this! 💚 @sixfootdee Hope to sip with you soon! @tctphoto Sip sip, hooray! 😍 Cheers to new favorites! @squidlife_ What's your go-to? 😋 @maj0641 Cheers! 💚 @jaebeomXD We're happy to hear you're a fan! 😋 @Bt35Good Yep. https://t.co/TJBLVomdqd @skylar_106 Sounds like you've found your favorite sip! 😋 @jewelsxt We love that you're loving it! 😍💚 Is your favorite Matcha Green Tea Latte hot or iced? @Perez14Lauren Sounds like you've found a new favorite sip! 😋 RT @Kevin_Johnson: We stand in support of our AAPI partners and communities in condemning the rise in racist attacks. This is our shared re… @brizhane_ We love that you're loving it! 😋 @megaanwyn We're happy to hear they're a favorite! 💚 @nanalyn303 Yum! 😋 @merzmurphy Cheers to that first sip feeling! 😊💚 @stillgold3 Cheers to finding your favorite sip! 😍😋 @ashley_rusch We'd love to hear what you think if you try one! 💚 https://t.co/TJBLVomdqd @RealQueenBrie Love it! 😍 Cheers! @bbyzxs You can't go wrong with a simply classic sip! @shahadhismath_ We hope you'll soon be reunited with this sweet sip! @Moumin_Quazi The Cold Brew love is real! 🥰 @duhitsdar It had to be done. 😎 @BreeLouIn It's a foolproof way to summon all your favorites. 😉 @ashley_rusch Have you had a chance to try the Salted Caramel Cream Cold Brew? 😍 @RealQueenBrie What's your go-to Cold Brew? 😋 @JaziDes Cheers! 😍 @ageguyera21 Do you have a favorite? 😋 @ChurtHurt What's your go-to Cold Brew? 😋 @Leah406tothe509 💚💚 @nguygie Cheers! 💚 @Leah406tothe509 We like your style! 🙌 Cheers! @ParkerUwaiz Do you have a favorite Frappuccino? 😋 @mkay_larshayy What is it? 😋 @dtb11 We like your style! 😍 Cheers! @sklrari Cheers! 💚 @sklrari We're happy to hear you've found your favorite sip. 😋 @_AniyaMaria We're happy to hear you're loving it. 😋 @AriannaYtselle We're happy to hear you're a fan. 😋 @OhThatGirlAngel Cheers! 💚 @OhThatGirlAngel Sip, sip, hooray! What is it? 😍 @ParkerUwaiz Have you had a chance to try the Honey Almondmilk Cold Brew? @nandron Do you have a favorite? 😋 @emmywallace84 Cheers to finding your go-to sip! 😋 @Leah406tothe509 What's your go-to Cold Brew? 😍 @dtb11 How do you love your Cold Brew? 😋 @celenaleonn A favorite sip is a favorite sip no matter what. 😋 @KaylaZampino Sip, sip, hooray! 😋 @shhherecomesmom We're happy to hear you're loving it! 😍 @ashleysparkle Delicious choice! @caffeinatedwif1 Cheers! 💚 @marianeck293 A favorite sip is a favorite sip. 😉 @danielleaboud Cheers! 😍 @soggycheesefry Delicious choice. 😋 https://t.co/TJBLVomdqd @finnelljenny1 Yum! 😍 @nessacelio A delightful duo! 😋 @aluskee What's your go-to Cold Brew? @LBuckeye77 Cheers! 😋 @cancer_warrior7 We like your style! 😍 @Mooflower Cheers! 💚 @GeFicha Cheers! @terriannereed14 Sounds like you've found some new favorites! 😋 @lilbratjanelle Cheers! 😊💚 @jason_frierson We're happy to be part of your day! 💚 @lopestka Sounds like you've found a seasonal favorite! 😋 @Yehitsgaby_ We're happy to hear it's among your favorites! 😋 @RyanLordan7625 We're happy to hear you've found your go-to sip! @geminibtsvt Cheers! 😋 @specialjay150 Cheers! 😍🙌 @stripedpacific Cheers! 💚 @cmissana7 We're happy to hear it's a favorite! 😋 @CaydencesMommy We like your style! 😋 @LindseyOlin Cheers! 💚 @Pestrada1010 We're happy to hear you've found a sip to love! 💚 @hdano15 We're happy to hear you've found some favorites! 😋💚 @abxgvil Hey, bestie. 🥰 @al3xandriaaaa Glad you think they're a hit! @GretchenVB Dad's always bean brewing these ways to espresso themselves. @desideeznutss Glad to see you reunited with your favorite sip! 🥰 @AiyanahStewart We're happy to hear they're your favorite! 😍😋 @arlette_gomezz That first sip feeling! 😊💚 @MarieSunflowerr We hope you'll be enjoying one soon! @AbooMikaeel Cheers! 💚 @ashy_314 Cheers to finding love in every sip. 💚 @_kelsi__ Is that your go-to sip? 😍 @MNISNI We're happy to hear you're a fan! 😋 @Lizzifeth We're happy to hear you're loving them! 💚 @AbooMikaeel What's your go-to? 😋 @opinionatedINTJ We're happy to hear you loved it! 😍 Is it a new favorite? @lilbratjanelle Do you have a favorite? 😋 @mclovenxoxo Sounds like you've found your favorite sip! 😋 @fs_4710 Do you have a favorite? 😋 @mrskingle Cheers to that! 💚 @sammieorosco We're happy to hear it's a favorite! 😋 @_Yinng We love a lemonade addition! 😋 @jareli__ Cheers! 💚 @SamsungNeptunia https://t.co/xk6yubee02 @benootie https://t.co/OBbXRUbWtE @ItsMeNeachelle Delish! Glad you're enjoying it. @elainerfarah Stay powerful, friend! @benootie https://t.co/ZCliDp1Owd @SamsungNeptunia Get ready to catch that cold brew Friday feeling! 🥰 @SamsungNeptunia Looking forward to enjoying one with you! @ShalisaLaSha You can order this handcrafted hot tea beverage by its official name in stores or via the mobile app: Honey Citrus Mint Tea! https://t.co/l0hs5sEYiQ @SoleilCo3 On it!\nhttps://t.co/TJBLVomdqd @_Kriistiie Click to send. 😉\nhttps://t.co/TJBLVomdqd @MikeyYeilding89 Coming right up!\nhttps://t.co/ogx0qcwc8U @Catrina_Marie9 Yum! 😋 @benootie Salted Caramel Cream Cold Brew send order: \nhttps://t.co/TJBLVomdqd @elainerfarah Knowledge is power! 😉 @TessG07 We hope you'll be enjoying one soon! @desideeznutss Looking forward to your visit! @han_brem Coming right up! \nhttps://t.co/3UVyYA0o8x @lovelylexibee Quest lines don't need to be linear. Unlock the achievement in your most delicious way! @SamsungNeptunia Tweet received. Click to receive Cold Brew order:\nhttps://t.co/KBuIr2sp2v @JustBein_Neisha Enjoy that sweet sip! @jkline120 We're so glad you love it! @reneelaaurenn We hope you'll be enjoying one soon! @tiffunfiltered Wanting coffee is reason enough. 😉 @summerchic45 Happy cold brew sips will always warm your heart regardless of the outside temperature! @29Altaird Click to send. 😉\nhttps://t.co/TJBLVomdqd @summerchic45 https://t.co/28sYdLRdyQ @Badd_Assets It's just a click away!\nhttps://t.co/KBuIr2sp2v @BarnabasRanaya It could be waiting for you! \nhttps://t.co/3UVyYA0o8x @mosko_l Coming right up! \nhttps://t.co/ogx0qcwc8U @hackeychicken Let us know when to get that started for you! \nhttps://t.co/ogx0qcwc8U @godsgirlkarennn Delish! @minngolf You can use the app to summon it. 😉\nhttps://t.co/KBuIr2sp2v @frogprof And now we wait... @summerchic45 We're glad you can taste the love! 💚 @babyycakessxo We're happy to make it for you. See you soon! @raychel71 That's it. That's the tweet. 😎 @doanutfactory Welcome to the Cold Brew Crew!  😎 @jessicagriffin_ It's definitely a hit! @mskimkelley Stay warm. Order in. It's okay. 💚 @frogprof Try it and find out. 😉 @niicaaxo Yes! @SmichaelH971 it works @kristiceratops 🙌 @elenakellow nailed it cold brew send tweet @jaypxx23 That's a delish duo! That's it, that's the tweet. 💚 @CSmithsonian19 Cheers to that Friday feeling! 💚 @smb_akaSMB The Siren and cold brew are there for you! @v_carmenn 🥰 @JenaLang It's always a good time for a cozy hot chocolate! 😊 @WhoKali We'll get one started for you! https://t.co/oVuFMFOjqj @thiamorisuke 💚💚 @adelleh2o *Chef's kiss*! 💚 @thiamorisuke What's your favorite sip to enjoy with it, friend? @_xrameah Coffee date soon? 😉 @karinaaaa___m Looking forward to sharing a sip with you! @samluvgood You're welcome! @samluvgood For the best experience of the beverage, we only offer tall and grande Nitro Cold Brew. With larger sizes, the Nitro cascade leaves the beverage before it can be consumed. @ashfineness So glad you enjoy it! @berthaperez101 It's a flavor explosion! @ashfineness We couldn't have described it any better. 😋 @zaysuaveee 🥰 @dae__g We look forward to sharing that cozy sip with you! @CandeeCANDII_ Your bae sounds like a keeper! 💚 @NickCribari It's creamy, dreamy, pistachio perfection! 💚 @Sarahj1919 Enjoy that sweet sip! 😋 @erikaawebster Delish! 😋 @_Deleonn It's everything! 💚 @Menier11 Sorry, this one is just here for a limited time. We hope you're enjoying every sip while it lasts. @erniechiara You're welcome. 🙂 @stephjean_louis Cheers to life-changing sips! @dianaalicia26 We're so happy that you've been reunited with your favorite sip! @erniechiara Our Flat Whites have ristretto shots vs. espresso shots. Ristretto shots use less water and due to this, the final shot is more intense and a bit sweeter than a traditional espresso shot. In addition, there's no foam on our Flat Whites, whereas our latte beverages do have foam. @RylieNicoleL We're so happy to hear that we could put a smile on your face! @RylieNicoleL Aw, shucks! 🥰 The feeling is mutual. @grewyourwings If you just can't wait for the holidays, you might enjoy a Caramel Macchiato made with blonde espresso and extra caramel sauce. @skyxbluesilk Cheers to love at first sip! @FabulousShake They make every day taste like your birthday! 🥳 @JammiRacca3 We hope your wish comes true soon! @raytheegreat Delish! Looking forward to your visit. @jaredais Hi, friend! @SimplyErika__ Cheers to the Vanilla Sweet Cream Cold Brew life! @jaredais We hope you'll think it tastes as good as it looks!\nhttps://t.co/AeCDuzspKR @Mrs_Ramirez94 https://t.co/DzI46I63xK @MissSneed Looking forward to it! 💚 @MayaaaaGs Cheers to the love in every sip! @MissSneed Can't wait to share a sip with you! @lisadanaemusic Enjoy every sip of happiness. 🥰 @Mrs_Ramirez94 Good news, Sammi. That Peppermint Mocha isn't going anywhere. Peppermint syrup is available all year long! @jaylohh https://t.co/uswGBZ3Qm4 @ShawnaL33w Cheers to life-changing sips! @_RubyyyN We hope you'll be enjoying one soon! @emchantment 😘 @esterlla94 Looking forward to our next sip together. @XSenseiSavageX Coming right up! 😉 @kelly_nimmo1 Delish! 😋 @Jadealexus_94 That's the tweet and that's the tea! \nhttps://t.co/l0hs5sEYiQ @Raph_Escoe That's a delish way to customize a cozy sip! @dejajezell Answer the call. 😉\nhttps://t.co/KBuIr2sp2v @emchantment New high score! Glad you're enjoying every amazing sip. 😊 @NekaLovesSky Looking forward to sharing a cozy sip with you! @esterlla94 We love it when you find a new fav! @krystda We hope your wish comes true soon. 💚 @Marta_Monkeys It would taste even better. 😉 We hope you'll be enjoying one soon. @_AllysSunshine We hope we'll be sharing a sip together soon. 💚 @ashtheearthling Here's hoping thinking leads to sipping. 😉 @jessiebarco We love it when you find a new favorite! @LazyChick_83 https://t.co/zb5jgBLldl @Tasja75 Happy to sip-lebrate with you! 💚 @moms2ontwittter 🙌 @C_Boogieee_ Hi Cari, while this beverage is made with honey derived from bees, it does not contain any dairy. @GGArnoldwrites Cheers to velvet sips! @estherbower_tv That's awesome to hear! ✨ @chrissy7661 Happy Sipping! @bruceblackford https://t.co/q1zk3P9fqd @michell83766826 Classic syrup contains Sugar, Water, Natural Flavors, Potassium Sorbate, Citric Acid. You can find these details within the ingredients list found on our website or via the Starbucks app. Here's an example: https://t.co/gVQGzRtorp @ShannonArrighi How do you customize your cold brew with white mocha? @lorax313 Yum! We'll keep that in mind. 🙂 @LaurenA723 You're welcome. Good luck! 🙂 @KennethCassel11 Awesome! We would love to hear what you think. 😍 @LaurenA723 In most states, you must be at least 16 years old (14 in Montana) to work for Starbucks. We recommend checking with your local store as well as viewing https://t.co/rRWz8nwuCx  for more details. @_femme9 We hope you'll be reunited with this savory sweet beverage soon!\nhttps://t.co/TJBLVomdqd @Samma6652 Always delicious! @LaurenA723 Sure! @anetmarie1986 For extra coziness! @bruceblackford Get ready for favorite overload! We're planning to launch oatmilk in all U.S. stores this year. @LaurenA723 Love you too! 💚 @LaurenA723 We like the way you sip! @anetmarie1986 Hot or iced? @LazyChick_83 We do have hot chocolate all year! We look forward to sharing a cozy white hot chocolate sip with you soon. 💚 @_haileighhhh Indeed! 😋 @Target A venti Starbucks with a grande Target inside, with a tall Starbucks inside that. \n\nAnd extra caramel drizzle. 😍 @dogmamasrock Our Flat Whites have ristretto shots vs. espresso shots. Ristretto shots use less water and, due to this, the final shot is more intense and a bit sweeter than a traditional espresso shot. In addition, there's no foam on our Flat Whites, whereas our latte beverages do have foam. @mamaasquishy We're happy to hear you're loving every sip! 💚 @xmoondreams A favorite sip is a favorite sip. 😋 @queenieq79 It's a pistachio flavor explosion! @juhlissuhh You're welcome! We'd love to hear what you think! Hot or cold, do non-dairy your way. The Honey Almondmilk Flat White and Honey Almondmilk Cold Brew are here. 🍯 https://t.co/zaI0dsCku2 @leftyman231 Yum! @theswartzfam13 We knew you'd understand! 💚 @QueenAshley75 Cheers to true brew love! @FrostbiteFist Yum! @bay1497 Delicious twist! @Animal_Nurse Cheers! @medinajames Glad you love it! @MsCrysStl Agreed! @KennethCassel11 Brewtiful! How was your sip? @dorothy_kylie Delicious choice! @juhlissuhh If you're loving the Pistachio Latte you may like it iced or as a blended Frappuccino® beverage! We also have a variety of Cold Brew that you could add the Pistachio sauce to. 😋 @TessG07 We knew you'd agree! 😉 @smaewest Sometimes a cold cup is coziest! @juhlissuhh We're happy to hear it's a new favorite! 😍 Are you loving yours hot or iced? @LyndseyBerta Awesome! @alllextaylor It's a wonderful holiday treat! @ploofff Enjoy! @LyndseyBerta Nice! Have you tried our Nitro Cold Brew with Cinnamon Almondmilk Foam? @ploofff Our Decaf Iced Americano can help! @aareavis Snow brewtiful! 😍 @_haileighhhh Ohhhh yes! 😍 @JoJoe89309852 Which one is your go-to? @davidbrunelle ~ you do you ~ @leen2417 Lovin' your style! 😋 @manofsteel83 We're glad you found your favorites! 😊 @kmarvay 💚 @dawgsindahouse1 Can't wait to sip with you! https://t.co/r0CbULHFNp What's your favorite drink and why is it Cold Brew? @pretttyyyt Cheers to enjoying every sip! @gremlinprobably Enough said! @dynds Cheers! @attack_moose While we don't have a 1000 star tier, you can shoot for taking home a cup, your favorite at-home coffee, and a delicious handcrafted sip! @bombasshonesty Which cold brew did you get cozy with today? @extravicious Sounds like the perfect Valentine's Day sip! 💚 @kmarvay https://t.co/mlqn2sx5IO @caica_ayamizuki We love you! 💚 @90feetfromhome We're happy to hear you're loving it! 💚 @hallrsc Sip, sip, hooray! 💚 @dreadelarosa We recommend using your Starbucks app to check store hours near you. 💚 @MissEricaCC We're thrilled you're loving it! 😍 Ask your barista to try your next one with Sriracha if you're looking to kick it up a notch! 😋 @_jflowers We're happy to hear you're loving them! 💚", "bag_of_tweets": ["@pasteurizedpiss Stay cozy!", "@DaniaaB_ It's a delicious way to start the day!", "@xoneezy What do you enjoy sipping with your favorite snack?", "@TimichiaB See you soon?", "@marvinpiguetjr Looking good!", "@samanthamoncay5 Which one is your favorite?", "@kmdb1990 We love being by your side. Sincerely, Venti Cold Brew ❄☕", "@AshyMSlashy 💚", "@HeatherNylund You're welcome!", "@ogkennyg_ Someone's in love!", "@HSLOTKIWIS Way to sip!", "@moodybiscuit Enjoy!", "@RavenCeleste_ Your taste buds will thank you!", "@arleeeene20 Thanks for the high marks! 🥰", "@eskuhmoh Especially when you enjoy it with the Earth Cake Pop! 😋", "@HallyWinters Thank you for your commitment, Hally.", "@_bellavictoriaa Enjoy!", "@TweetyyBirddd Thank you, Ashley! 😋", "@xyzyou1 Yes, please! 😋", "@AshyMSlashy Kind cups are the best!", "@Its_Sidrahhh We like your style! 🥰", "@RhenryHumphries We're glad you enjoyed it!", "@HeatherNylund Siren's Blend is always around. Enjoy, Heather!", "@princess_harmm Love you! 💚", "@NothingCunning Welcome to our world! 😉", "@Its_Sidrahhh That sounds INcredible! 😋", "@sueb91 You deserve all of the joy, Sue! 💚", "@ladytariafarhat We have your back, Taria! 🥰", "@SweetButCreepyy Awesome to hear, friend! 💚", "@iSemetria Happy to be by your side! 💚", "@kenziie_rae Cheers!", "@Laryshhh Something delicious to consider! 🤔", "@tapounder We got you, Tom!", "@anti_mason_levi Sounds awesome!", "@ambitionqueen22 We're happy to hear you've found your favorite sip! 😋", "@msjadore7 Cheers! 💚", "@msjadore7 We're happy to hear it's a new favorite! It's here to stay! 😍", "@whoswillisjr Sip, sip, hooray! Cheers! 💚", "@kaebella_ Enjoy!", "@whoswillisjr It sounds like you've found a new favorite sip! 😋", "@Mi_kelyn We're happy to hear it's a favorite! 💚", "@kaebella_ Mmm tacos with a Mango Dragonfruit Sarbucks Refreshers...😋", "@Lacie_Malone07 Here's to enjoying your best sip!", "@Lacie_Malone07 We love it when you find a new fave!", "@ThatdadLilli We hope you'll be enjoying one soon.", "@Ihatelexiibrown 💚", "@Immanuel_Morris You can order this handcrafted hot tea beverage by its official name in stores or via the mobile app: Honey Citrus Mint Tea! https://t.co/l0hs5sEYiQ", "@kashiatraniacee What should we get started for you?", "@KiiKilllaaa We hope you'll be enjoying one soon!", "@naynooodles It's always a fine morning for Peppermint Hot Chocolate!", "@_mannnnnii_ Our Iced Pineapple Matcha Drink is a refreshing sip for spring! \nhttps://t.co/UrJnx6F2zi", "@ambaxp Glad you like it!", "@lilbaadt 💚", "@lilbaadt Sip happy, friend!", "@aphrodisiacbun Sounds delish! We hope you enjoy every sip. 🙂", "@melinglling Looking forward to our next sip together!", "@kilometers Only the best for our customers! 💚", "@kilometers Better latte than never. 😉", "@jcmeloni Some things don't need a reason to be good. They're just aligned that way. 💚", "@pppiierrrcce You don't have to do a thing. It's here to stay!", "@huskymom25 They're eggcellent! Glad you enjoy them. 🙂", "@_katierose13 No need to beg. It's here to stay!", "@2facedbinch Glad you think it's a hit!", "@CheriseMoniqueM It's so delish! 😋", "@sromanxo Oatmilk is out here changing the game in the most delicious ways!", "@nartlebanthony That's the delicious truth! 🙂", "@melinglling We love it when you find your favorite! 💚", "@kaylaalonzo1 Cheers to your first sip feeling! Looking forward to many happy drinks together. 💚", "@daehymtsoL We know what we did. 😉", "@Alxxus__ That's definitely a sip that tastes as good as it looks!", "@jesrule We're happy to hear you're loving the Iced Brown Sugar Oatmilk Shaken Espresso! It's here to stay! 😍😋", "@Ciahjanaeee It sounds like you've found a new favorite sip! 😋", "@meelissaaa_l The Iced Brown Sugar Oatmilk Shaken Espresso is here to stay! 😋💚", "@RealOmarSalazar We're happy to hear you're loving it! The Iced Brown Sugar Oatmilk Shaken Espresso is here to stay! 😍", "@Ihatelexiibrown Live your best life!", "@eml_2love It's an amazing pick-me-up!", "@tayIoraid Glad you love it!", "@thesoulcialist Just saying. https://t.co/CkCPjnA3rp", "@faithfulkels Thank you, Kelsey! 💚", "@mircy Tough choice! What did you decide?", "@Paolakati Well-deserved!", "RT @StarbucksNews: Climate change is impacting the lives of coffee farmers and their communities. Find out more about Starbucks new goal to…", "@SamsungNeptunia Happy sipping!", "@ST0RYVINYL Love you more! 🥰", "@AlexGreenGuy If you do, we'd love to hear what you think!", "@SamsungNeptunia It will bring you so much joy!", "@AlexGreenGuy Hope you give it a try!", "@MSK_ALHAMDE We're here to help! 😁", "@AlexGreenGuy From the smooth Cold Brew to the velvety cold foam, it's perfection! 😋", "@_DreadyJ Aw, we hope you feel better soon! 💚", "@_NCab_ Cheers!", "@peppgrad That's awesome to hear! We can't wait to sip with you. 🥰", "@ST0RYVINYL Love! 😋", "@_DreadyJ See you soon?", "@_NCab_ Does this sip have a place in your heart?", "@peppgrad Your turn! 😉", "@afajarmzk Morning! https://t.co/1ADFdAB5iB", "@bazingabizz Indeed! https://t.co/64RbtlUM0G", "@omgizzyy You're not alone! 😍", "@notjffns We had a feeling that you'd agree! 🥰", "@ST0RYVINYL What are you sipping today, bestie?", "@CoffeeIcon Abso-brewtly", "@jkline120 You're welcome! Enjoy. 😋", "Add some Cold Brew to whatever you do! ✨ #SaltedCaramelCreamColdBrew https://t.co/GxVNbZxTOU", "@ESCOXO We like your style!", "@jasminhavanna Love it! Especially with the Iced Chocolate Almondmilk Shaken Espresso. 😋", "@Licmy_CHOCOLATE See you soon?", "@highlyph Happy snacking!", "@ESCOXO What do you enjoy it on?", "@_ellbomb Especially when you pair them! 😋", "@Eb_Ebb_nEbby Always! 😉😋", "@applepearsoup Which beverage do you enjoy with it?", "@steventbattle It's one of the best! 😋", "@highimelda See you soon?", "@HadeerSinawe Cheers!", "@MelissaSpielman Cheers, friend!", "@SassWithClass What would you like to see on the menu?", "@Gabach1t0 You got it! 😉", "@omachall Nice, partner!", "@Singtokids And sipping with our friend! 🥰", "@Gabach1t0 It's super creamy and delicious! We hope you give it a try some time. 😊", "@Gabach1t0 We're having an Iced Brown Sugar Oatmilk Shaken Espresso kind of day!", "@Gabach1t0 That's awesome to hear! Which drink did you enjoy?", "@LightningRawd Awesome!", "@Watsley Abso-brewtly!", "@Michael71508669 Maybe an Iced Brown Sugar Oatmilk Shaken Espresso could help?", "@Gabach1t0 Enjoy, friend! 💚", "@itskamm Sip, sip, hooray! 💚", "@ZoniLOPEZ Which beverage did you start the season with?", "@gilbertmpadilla This blend is available in local grocery stores. You can find these near you with our product locator: https://t.co/d0Yjhc79ju", "@cococoffeme You can always relax with your favorite cup by your side. 😊", "@chelsgranito Excuse us while we do our happy dance!", "@BiebTVDKlaus We're just as excited!", "@tamiramussen Spring into the season with your favorite cup!", "@chestergo Enjoy!", "@kaaaymari Happy to hear that!", "@haileypodcast This makes us happy! 💚", "@Maghon_Barkley Yes! 😊", "@basant_younan THIS! 🥰", "@Cocoa_BeanNY Now, that's the life! 😍", "@wpsandeepgupta Our Pink Drink can keep you cool!", "@princesshaybae Feel better, friend! 🤗💚", "@iamcrystalcarr MOOD!", "@lisa_woodstock Someone's happy!", "@eliasbatche Happy Sipping!", "@hey_quique Cheers!", "@KylaPPrice Which cup are you enjoying this season?", "@chrismart101 It's not unusual to sip every day! 😉", "@_caseyfornia https://t.co/lFESpG1Ne9", "@sapphiresky707 Nothing more exciting than celebrating Spring with your favorite sip!", "@HilKind Dancing right along with you!", "@PumpkiinNY Which cup are you swaying along with?", "@amesbakerr You're cute! ❤", "@AngeKeierleber Same!", "@alsawadiahmed Awesome!", "@Musicgurl8004 You would enjoy our serene Matcha Lemonade!", "@JennaMcdonald47 Starbucks Delivers, Jenna! Just download the Uber Eats app and start your order. 🙂 https://t.co/FT9Kh0PvhK", "@krnrae We can see your halo!", "@calves61_katz Sip sip hooray! https://t.co/EzYm6fBARy", "@esbugs45 Pineapple Matcha might be your thing! 🍍", "@apw247 It's not unusual to enjoy Spring with your sip!", "@sabrinakenoun Dance your way into the season! 🌻", "@Deziree74043281 We'll get a cup started! 😊", "@tsharpe319 Same! https://t.co/oeoh0hk5fv", "@MariamBakhtiari You're welcome, Maryam! 🥰", "@XondraDay Today, it's easy being green! https://t.co/5es7saAZXd", "@Jim_in_Oregon https://t.co/CSObZefpWo", "@omachall Hope it brightened your day! 🌟", "@MariamBakhtiari Happy New Year, Happy Spring, Happy Everything! https://t.co/Cm5pcnOxCX", "@SamsungNeptunia 💚", "@CherishToday08 Cheers! https://t.co/CkKKOeIUBS", "@KevinGranger11 Life's pretty good!", "@chuckbesh We're coco-nuts for spring!", "@mat_scuba Our reunion with spring is feeling extra sweet.", "@Queen_A1290 Awesome to hear! https://t.co/FuGU7SpJtK", "@erinmillerKC We know the feeling! 💚", "@officemouse Mood! 😎", "@alexpisauro Live your best life, Alexandria!", "@LeeshiPeeshi Like you should!", "@brihdz__ Sounds like you've found a new favorite sip, Bri! 😊", "@asstrogorl We're all about the happy dance! 💚", "@collinz The feeling is mutual! 🌞", "@TwitchWithRich We feel the magic in the spring air too! 💚", "It's the first day of spring, you have coffee in your hand and the sun on your face—how are you feeling? ☀️☕️ GIFs only.", "@DarrylH03120683 What kind of Cold Brew will you be enjoying, Darryl?", "@carolinegodess It sounds like you've found a new favorite sip! 😋", "@Lauren4Reid41 Cheers! Is it a new favorite? 😍😋", "@itskamm It sounds like you've found a new favorite sip! 😋", "@xshakiyah We're happy to hear you're loving every sip! 😋", "@tpa_520 It sounds like you've found a new go-to sip! 😋", "@uhohChez We're thrilled you've found a new favorite sip! 😍😋", "@LegallyBrown_ *Chef's kiss!*", "@carmenanjelly If he just so happens to see this tweet, he can just click the link below to order one for you. 😉\nhttps://t.co/CoPFmzaaFI", "@AubsGarza Coffee date, Aubs? 💚", "@kev_onechain Looking forward to sharing that sip with you!\nhttps://t.co/l0hs5sEYiQ", "@_ManOfMystery We hope you'll be enjoying a cozy sip soon!\nhttps://t.co/PW49wPlPee", "@levelupbby It sounds like you've found a new favorite! 😋", "@cocoadollyxoxo We love that you're loving them! 😋", "@kuhna07 Cheers! 💚", "@tehrifficc Sounds delightful!", "@_Jasmine_Moore Cheers! 😍🙌", "@Franque__ Sip, sip, hooray! 🙌💚", "@fizahassen Sip, sip, hooray!", "@JeanLeggett We're happy to hear you're loving it! 💚", "@alanarramirez Perfect to enjoy any day of the year! 😋", "@LenaRose_ Delish choice! We hope you love every sip.", "@Patsaaay We're happy to hear you're loving them! Do you have a favorite? 😋", "@LenaRose_ We're pretty happy about it too! Which beverage will you enjoy it with first?", "@isaMACEing We hope you'll be enjoying one soon!\nhttps://t.co/Lhe3HTWhsO", "@Ash_Hole22 That oatmilk definitely adds to the drool factor! 🤤", "@ohlookitsmau Cheers! 💚", "@aadriianaaj Hi, friend! 👋", "@WhatYaSaySav We're happy to hear it's a favorite! 😋", "@aadriianaaj The extra caramel makes it a total hit!", "@cschneider It sounds like you've found a new favorite! 😉", "@_kaaylinn We're happy to hear you're a fan! 😋", "@_gochop We like your style! 💚", "@georgiarosemac That first sip feeling. 💚", "@RobDaMosCutt Looking forward to your visit!", "@slims_jc https://t.co/Tl4Wf2dkEq", "@brittany_darby We approve of planning ahead. 🙂", "@Franque__ Is that your go-to sip? 😍😋", "@lifeoftwright It sounds like you've found a new favorite sip! 🙌", "@trashIeigh We're happy to hear you're loving it! 😋", "@PopMusicFiend We're happy to hear it's a favorite! 😍", "@mamma_davis It sounds like you've found your favorite sip! 😋", "@heylexrenae We're happy to hear you've found a new favorite sip! 😋", "@_leeeeeen_ It's all about balance. 😉", "@alexisgoodman_ We love it when you find a new favorite!", "@Alxxus__ Share it with us here! We'd love to see it. 💚", "@richgirlrizz Did you find a new favorite drink? 💚", "@danielle_muhfka Gotta get every last bit of that delish cold foam! 😋", "@ashaviles_ We're glad each sip is making your dreams come true!", "@fizahassen What's your favorite way to enjoy your iced coffee, Fiza?", "@_sojay Is it your new favorite?", "@Christo51641399 Looks so refreshing!", "@brownsugabeauty We've got your non-dairy milk options covered, friend! Enjoy every sip. 💚", "@MamaKuhpcake Couldn't have said it better. 😋", "@megomyeggo_ We don't see a problem here. 😉 Sip happy, friend!", "@_chainmom So glad you like it!", "@Of_Noble_Mien Eggscellent choice! We hope you'll be enjoying some soon.", "@_plantmami So glad you like them!", "@oldtownroads It's delish! We hope you'll give it a try. \nhttps://t.co/x4Yb26oOgc", "@itshuneydew Glad you're enjoying it!", "@__Ondra We hope you'll be enjoying one soon!\nhttps://t.co/SuQeznItx4", "@Tessavelino We're seriously happy you love it. Cheers to that heavenly Friday feeling!", "@breannagraber It's really out there shaking things up! Glad you're enjoying it.", "@Hayden36565075 Delish! 😋", "@yzwop Glad you enjoy them!", "@_sabrinaknight If only all problems had such delicious solutions. 💚", "@heyyjenni Pawsitively adorable!", "@Azhanai_x3 They make every day taste like your birthday!", "@lilbootylondon There's nothing more delish than discovering a new fave!", "@Christo51641399 Yum! 😋", "@Azhanai_x3 Do you have a favorite one?", "@DANimals_y0gurt They're always a hit!", "@yzwop The cost will vary depending on your location. Please contact your local store directly regarding all pricing information.  https://t.co/RWP88MOTyf", "@voteforrahn Cheers to life-changing delish sips!", "@Haddonfiend You're welcome! https://t.co/R2VVaDGYnK", "@lisanneaa Great recommendation!", "@AshlynSalafiaa Always happy to talk about that incredible delicious treat!", "@iAmPinkie__ All that matters is that you've tried them now. Looking forward to sharing something sweet with you again soon. 💚", "@RobDaMosCutt What should we get started for you? 😉", "@slims_jc We hope you enjoyed every sip!", "@LaneBaima Let us know what you think! https://t.co/B26DzIimvZ", "@yanntheedon 💚💚", "@nicolechartrand No, sorry - it’s available at Starbucks stores in the US.", "@notjffns We're happy to! Blonde Espresso meets cocoa and notes of malt, shaken together and topped with almondmilk and ice for an invigorating treat to power you through your day. https://t.co/wGtwocFj0p", "A shake-up of sunshine. Iced Chocolate Almondmilk Shaken Espresso.☀️ https://t.co/z1I7wTl9xh", "@tianajadevargas What a great start to the weekend! Cheers, Tiana. 💚", "@livingluxry It tastes like springtime! Our crisp, Strawberry Açaí Refreshers® Beverage, with its accents of passion fruit, is combined with creamy coconutmilk. A fruity and refreshing sip of spring, no matter what time of year.\nhttps://t.co/LlJAax1DfT", "@bandfanarii https://t.co/QIAZkwZxpP", "@tbozz8 We hope you'll sip happily ever after. 💚", "@_payyyy If this is something you would like to see, we encourage you to submit your suggestion at https://t.co/SPH9PuUUvR", "@VeeLive_ Looking forward to sharing a sweet sip with you! Feel better soon, friend. 💚\nhttps://t.co/LlJAax1DfT", "@Charlotte_Oxman We hope you'll be enjoying one soon! \nhttps://t.co/U80g39qlye", "@joshtucksmein Super good! Also, technically super E. 😉", "@ay_yoboungee Cheers to new and delicious sips!", "@Haddonfiend We love that it's your new fav! Sip happy, friend.", "@yanntheedon It's oat of this world!", "@marechar02 Sip sip, hooray!", "@Joshtheblopper Cheers to the best way to start the day!", "@Haddonfiend It's delish with Toffeenut or our new Brown Sugar syrup! 😋", "@_lunaaaxo https://t.co/UeVhixUQBE", "@MushkanJuma3 Tomorrow has become today! Should we get one started for you? 😉\nhttps://t.co/d6G6fLTJPr", "@seven7heavens Have you tried our new Iced Brown Sugar Oatmilk Shaken Espresso yet? \nhttps://t.co/d6G6fLTJPr", "@xo_marashayy Kindness always wins!", "@JIMlNFILTER Sounds like someone found their new favorite!", "@jdmek111 You're welcome, friend! We're looking forward to our next sip together.", "@jccreamer_764 Oatmilk is changing the game in delicious ways!", "@IsaacArevalo513 What should we get started for you? 😉", "@jdmek111 Sorry about that! The slow steep time limits the amount we can make daily, so it’s only available while supplies last.", "@Hanthenaniking Happy you're enjoying every scrumptious sip!", "@JimmyNoCAPuto Starbucks Doubleshot On Ice is now called Iced Shaken Espresso.  It is a drink you know and love—made with Signature Espresso shaken with classic syrup and topped with 2% milk.  \nhttps://t.co/o7JtApEtGI", "@nannuuski If this is something you would like to see, we encourage you to submit your suggestion at https://t.co/SPH9PuUUvR", "@sjtangy Sounds delish!", "@Hanthenaniking That oatmilk takes the Cafe Misto to the next level!", "@Santesue So happy that it wowed you!", "@JoshLDaniel We love that your next new favorite was only just a sip away!", "@stephsrz We hope that means we'll be seeing you soon!", "@isthat__alicia We love starting the day with you!", "@unfckwtbI Sip sip hooray! 🎉", "@imeanidkman That's one way to shake things up!", "@RealUrbanSmooth Can't wait! 😊", "@brando_r97 Awesome!", "@wieckizworld Just add your sip to the favorites in his Starbucks app and he will always remember! 😉", "@brando_r97 Sounds like you've found your fave!", "@theamandapowell We're glad you gave it a try! If you decide to pick it up again, you can ask for less syrup in your beverage.", "@GoldTiffanie You deserve extra love! 💚", "@delanessss_ Cheers to that!", "@sarahkfernando Happy Sipping! ✨", "@xojassi What a beauty! 😍", "@unfckwtbI What did you decide?", "@lilgrosado Cheers to love! 😋💚", "@RealUrbanSmooth We'd love to hear what you think!", "@Queen_A1290 We think that's a wonderful plan!", "@Missus_Ha Sometimes it's good to shake things up!", "@emotofu Cheers! 💚", "@el_carnivore Welcome back, friend! https://t.co/v83qAXsNeY", "@BlueeMoonn https://t.co/u9gj7iIpCj", "@BlueeMoonn We're always happy to sip-lebrate with you! 🎉", "@Liv_Noah_Benson 💚", "@Mistiimaria It is magical! ✨", "@angela_simisola Of course! 🥰", "@victoriiaa83 Shout out to kindness! 💚", "@Liv_Noah_Benson We might be a little latte but we wanted to matcha sure that we wished you a Happy St. Patrick's Day!", "@Mistiimaria Which Shaken Espresso is your favorite?", "@jenzzxoxo Thanking you now! 😋", "@William07696245 https://t.co/mCLTmOPdsa", "@HeeeyTeee Delish! 😋", "@cindyyrelly Ours too! 🥰🔑", "@kayleeryxn Thanks for the delicious tip!", "@corey_b19 Good to hear!", "@angela_simisola That's very exciting! Which beverage did you pick up?", "@MuSuhayla Hope it brightened your day! ✨", "@AshyMSlashy Awesome!", "@daniellalcaraz We're here for you. 💚", "@Yungshankz_ Sip sip, hooray!", "@cloudsymmetry Is that your favorite sip, Madeline?", "@_andreeaaaa__ Cheers to a great day, Andrea!", "@Lenakhalifa We're drooling. 😋", "@hicandelariaaa It pairs well with all food, home-cooked or not! 💚", "@daniellalcaraz Are you okay, Daniell? 💚", "@ziShawTy It puts a smile on our faces every time!", "@marechar02 Cheers to productivity! Which drink did you celebrate with, Mayra?", "@KentBaker2 How do you like to enjoy this coffee, Kent?", "@_iLOVEmyLipz You'll love our blend of blonde espresso with brown sugar, and cinnamon topped with oatmilk. https://t.co/d6G6fLC8XT", "@KBockenstedt That squeaky cream feeling. ✨", "@kiley_kidd And we hope you enjoy every sip, Kiley! 😉", "@AshyMSlashy New fave?", "@_iLOVEmyLipz Have you tried our Iced Brown Sugar Oatmilk Shaken Espresso?", "@Whit_tuhhh1992 Cold Brew crew! 💚", "@sanndrarose So glad you enjoy it!", "@Its_Brittany17 It's only fair. Your visits make our day. 💚", "@BriLaNEEK That drink is really out there shaking things up!", "@pharmakittycat Pro Tip: Save your new favorite to the \"Favorites\" section in the app and sip happy without saying a word. 😉\nhttps://t.co/d6G6fLTJPr", "@Yungshankz_ Did you find a new favorite sip? 💚", "@giulianaelena_ Cheers to that iced coffee season vibe!", "@junkthemorgue We're extremely glad you like it! Looking forward to our next sip together.", "@toritooch So glad you enjoy it!", "@gabikingxo It's one seriously delicious drink!", "@bebecitaaa_15 We see you drooling! Looking forward to our next sip together.", "@ashcakes2016 It's worth it. 😉", "@camiconleche We're happy this drink has made your sipping dreams come true!", "@malloryyy65 Looking forward to our next sip together. 💚", "@misssidtreyelle 💚", "@BeastyFro Starbucks Doubleshot On Ice is now called Iced Shaken Espresso.  It's a drink you know and love—made with Signature Espresso shaken with classic syrup and topped with 2% milk.  \nhttps://t.co/o7JtApEtGI", "@KuavoKitty Looking forward to sharing that sip with you!\nhttps://t.co/d6G6fLTJPr", "@giulianaelena_ https://t.co/bpDlhlvLdg", "@gretchi 😊", "@misssidtreyelle Never let go of that feeling. Take on the world, friend! 💚", "@gretchi Happy you're enjoying every yummy sip!", "@Joeywahoo92 Cheers to that perfect first sip feeling!", "@malloryyy65 No need for tears, this sip is here to stay!", "@412ging We're happy you've found your perfect delicious new favorite!", "@selmuva Hi, friend!", "@setabtw Sounds like someone found their new favorite!", "@jaobyboi From our earliest days, diversity and inclusion have been at the heart of how we do business, and we have worked to create an inclusive environment across Starbucks. We have always been about more than just coffee.", "To learn more from our partners at @AAAJ_AAJC and to read first-hand accounts of racism experienced by AAPI communities visit https://t.co/YUVxnSHRiQ \n\n#StopAsianHate https://t.co/R6dlj1ah9E", "@KarinaM32 A match made in heaven! 💚", "@ygdaziii It the perfect, refreshing sip to welcome the warmer weather with! 💚", "@allaijamariee It sounds like this might be one of your favorite sips! 😉", "@Konway_Twitty It's top tier!", "@KarinaM32 Do you have a favorite drink to enjoy with it, Karina?", "@jer_am_i They're egg-cellent!", "@f__timaa That sounds like a matcha made in heaven!", "@susanan23080452 The best way to welcome spring!", "@sydney268 This has been the case since mid-2018 so we can truly celebrate with you on your big day. More info is on our website: https://t.co/P5SLCakHlo", "@widowarrior Cheers to winning sips!", "@iamrachelwolf Stars expire 6 months after you earn them. You can check your Star Expiration by tapping History→Star Expiration.", "@brittanyfyffe That drink must be very popular at your store. Not to worry - it's part of our core menu and will be back soon!", "@_laura718 Such a classic and delicious drink! 💚", "@Ana_Sophia86 Glad you enjoyed this cozy sip!", "@H0neyvibess We hope you'll be enjoying some soon!", "@Ana_Sophia86 Yes! You can order this handcrafted hot tea beverage by its official name in stores or via the mobile app: Honey Citrus Mint Tea! https://t.co/l0hs5sEYiQ", "@THEJaeAlise We hope you'll be enjoying some soon!", "@scorpendeja Sounds delish!", "@princespancaake Enjoy every heavenly sip!", "@pohtaytoe_ So good! 😋", "@selmuva Cheers to enjoying your best sip!", "@poohshiestygf We couldn't describe them any better. 😋", "@VaneDavila Delish!", "@HeyItsMeAstro They make every day taste like your birthday!", "@_mackSHAAD4 Sorry about that! The slow steep time limits the amount we can make daily, so it’s only available while supplies last.", "@stephsrz Understandable. They're delish! \nhttps://t.co/DPwBPBzXWh", "@ItsDeeDee___ We sure do! And it's delish.\nhttps://t.co/Ls338jQwGf", "@AnikaGiske You have eggcellent taste in breakfast foods. 🙂", "@jcastillo315 Eggsellent choice!", "@justtay_x It's worth it. 😉", "@_laura718 Which coffee drink are you dreaming about, Laura?", "@KCanisales If you're looking for an icy sweet sip, you can't go wrong with a classic Vanilla Sweet Cream Cold Brew!\nhttps://t.co/57ssIqkVf9", "@SenseiSwishem We recommend giving Iced the Brown Sugar Oatmilk Shaken Espresso a try!\nhttps://t.co/d6G6fLTJPr", "@AAILAASH Have you tried our Iced Brown Sugar Oatmilk Shaken Espresso?\nhttps://t.co/d6G6fLTJPr", "@bandfanarii Sounds like you've got some delicious favorites!", "@macklyy_ So glad you like it! 🙂", "@christa_labac We wouldn't even try. 😉", "@giisselleeh Really glad you're enjoying it!", "@lannadelnegro Stars will still expire 6 months after you’ve earned them. For more information, please visit https://t.co/jqim02wIQ0", "@mxchaelxo We're happy to say it's here to stay!", "@acklesrealm https://t.co/TP9h78pDh8", "@jaid0r Sip sip, hooray!", "@lannadelnegro Soooo glad you enjoy it! 🙂", "@joeyyduh Except perhaps another one. 😉", "@acklesrealm We hope you'll sip happily ever after. 🥰", "@TechySewell https://t.co/5By6Lbi1eW", "@JAMLikeIndy Delivery to the rescue! Starbucks Delivers is now available in all 50 states in the U.S. To see if Starbucks Delivers is available near you visit: https://t.co/8TzwEl1eav", "@TechySewell It's so delish! We love that you've found your new favorite. 😊", "@chroobss Glad you think it's a hit!", "@riiickgriimes Self-care is important. 💚", "@stellarosawitch Sounds like our Vanilla Sweet Cream Cold Brew might be the sip for you! \nhttps://t.co/57ssIqkVf9", "@lizzystoutt Our slow-steeped custom blend of Starbucks® Cold Brew coffee accented with vanilla and topped with a delicate float of house-made vanilla sweet cream that cascades throughout the cup. It's over-the-top and super-smooth.\nhttps://t.co/57ssIqkVf9", "@daniphaee https://t.co/XL60k5W1EC", "@itscrysb Sounds like you found your favorite!", "@glo___xoxo Come sip with us! 💚", "@Dani_Marie_15 You can never be too dramatic when it comes to declaring the deliciousness of cold brew!", "@jaid0r What's your favorite drink to pair with it, friend?", "@chloandchaos It's oat of this world!", "@KFerqOfCourse Glad you like it!", "@jordanliz2000 Thanks for the perfect sip score!", "@HeatherLesz We always look forward to seeing you!", "@_iWear20Pearls So happy to hear that your love has been rekindled! 🥰", "@hajinnn We hope you enjoyed every sip!", "@isthat__alicia We hope you'll be enjoying one soon! \nhttps://t.co/q1iH39FDTP", "@KrisssyNicole Sounds like you found your favorite! 💚", "@alexisgriggs Big day!", "@astrock111 On the app go into your Orders, then to your History and then find the order you wish to tip. The tipping option is available for a limited time after the order has been placed.", "@clairoluvr Until recently, oatmilk was only available in certain areas. Sounds like you were one of the lucky ones! Now you have to share with the rest of us. 😉", "@Jetta_Jameson Cheers to the sips that change our lives for the better!", "@chelseadesirae Glad you think it's a hit!", "@xodessanie Glad you're enjoying every delicious drop!", "@Alexis_Arcade Cheers to a sip that ignites your day!", "@carriemmckenna That's the tweet and that's the tea! 🙂", "@TIARABYRD88 We've missed you. 💚 Looking forward to our next sip together. \nhttps://t.co/d6G6fLTJPr", "@ShelbieDalton For an iced drink, it sure brings the heat!", "@Chanharp Of course we do! 😉", "@Steffannie__ You've got that right, Steffannie! 😊", "@SeduceN_Destroy Self-care is important. 💚", "@Christian__24_ Glad you enjoyed every amazing sip!", "@interstella_777 Glad you think it's a hit!", "@ahhhhunagii Sounds like you've found your favorite! 🙂", "@jamie_eats That's a pretty delish tradition! 😋", "@badxandra You've tried it now and that's what's important. 😉", "@nicolebittle It makes extra points. 🙂", "@bfremm We're excited for you! Hope you love it. 🥰", "@Chanharp Oatmilk takes it to the next level!", "@rashelagc It tastes as good as it sounds and we hope you'll love it!\nhttps://t.co/d6G6fLTJPr", "@kayniebla We know what we did. 😉", "@_ETNOM Here's to sipping happily ever after. 🥰", "@KelleyWhitehous That's the tweet and that's the sip! \nhttps://t.co/zwpGjsaUp2", "@jess_hanner We're glad you found your one and only. 💚", "@tyramekel Glad you found your perfect sip!", "@_ETNOM Sounds like love at first sip. 💚", "@k3zt1n We did. We absolutely knew. 😉", "@ggspillthetea Glad you think it's a hit!", "@synisterrr Cheers to happy taste buds!", "@melvinis20 Which beverage will you customize with it first?", "@BEENTHABOSS It's always a hit! 😋", "@Paraadis3 Looking forward to sharing that sip with you!\nhttps://t.co/LlJAawK2ol", "@gladerella We're glad you can taste the love in every sip! 💚", "@anna_raye_ We are opening new stores globally every year, so we recommend submitting your location suggestion to https://t.co/SPH9PuDjEj", "@beccstorres We love sharing all your favorites with you!", "Pack a pick-me-up. 🚲 \n#VanillaSweetCreamColdBrew https://t.co/YYtTGsdGhf", "@Always_Jae Three cheers for life-giving sips!", "@Unbothered18___ What should we get started for you? 😉", "@wholesomeKyers Looking forward to your visit. 💚", "@beccstorres We're happy to discuss that delish sip! Is it your new favorite?", "@Nakia_Amya It's a delish hit!", "@tucsonvirgo https://t.co/tbCZT3OFhM", "@tucsonvirgo We're happy to say this sip of deliciousness is here to stay! 🙂", "@wholesomeKyers We know what we did. 😉", "@_thatbreezy So glad you like it!", "@LLNYCMook We're glad you think it's a hit!", "@nastyy_gal_ Cheers to life-giving sips!", "@spookifie You're welcome! We hope you enjoy it. 🙂", "@AyYoItsO It sounds like you've found a new favorite sip! 😋", "@Abraham_F Sip, sip, hooray! 😍🙌", "@mandykristiii We're happy to hear it's a new favorite! 😋", "@oliviagracecox_ Cheers to new favorites! 😋💚", "@JULIEJETSON We're happy to hear you're loving every sip! 😋", "@aijuswanna_syng Happy to sip with you! 💚", "@Sonialvarez38 Hi Sonia, I'm so sorry for the delayed response and the disappointing drinks! Would you mind sending me a PM so I can gather some additional information https://t.co/zRl8IziadD", "@aijuswanna_syng Not sure but we do hope to sip with you soon! 🥰", "@likechicag0 Starbucks Delivers is available on Uber Eats in all 50 states: https://t.co/FT9Kh0PvhK", "@angelstar2 🙌", "@rrezzzy We can hear the m-egg-lody! 🎶", "@sietesavone It sounds like you have great taste. 💚", "@Chabelis_Sienna You're so welcome. Happy birthday! 💚", "@sietesavone Which coffee drink are you dreaming about, friend?", "@rrezzzy Which one speaks to you?", "@Maritza_M28 Sip sip hooray!", "@CashAlexLock92 That's awesome to hear!", "@_Scrapp6 💚", "@IvelisseRoCo While we don't offer a hot version, you might enjoy a Blonde Vanilla Latte with Brown Sugar Syrup, topped with cinnamon.", "@_Scrapp6 Hope it brightens your day!", "@CashAlexLock92 Sounds like you found a fave!", "@LifewithKeeks_ YAY! 🎉", "@adam_turecek Glad to hear that you're loving it!", "@seoudi_ That sounds like the perfect moment! 💚", "@westsxde_ Cheers to love! 🥰", "@SnowK9 Yes! Last year, teams from our Accessibility Office, Store Design and Tryer Center came together to conduct research and consult with inclusive design experts, Starbucks partners, and the disability community with a goal of designing with accessibility as the standard.", "@Mel_Ks333 We're sorry for the delay. It looks like @StarbucksCare has reached out and we're sure you'll be taken care of shortly. 💚", "@RealMarkD Thanks for the support! Aira has also proven to be helpful for customers navigating the protocols and physical changes implemented in stores during COVID-19.", "@wi_dust_nd Venti hot drinks are 20oz, and venti cold drinks are 24oz. Brown sugar syrup is not the same as caramel. Hope this helps!", "@FAKEBESTFRIEND https://t.co/AfrKmWRshp", "@BlakeDeVore4 Yes, it's available in participating stores across the US!", "Starting today, Aira—a service that connects blind and low-vision people with remote visual interpreters through an app—is available for free in our US stores.\n\nLearn how we use Aira and inclusive design to create a more accessible customer experience. https://t.co/YNucHJQ7if https://t.co/cJZ8UsljrZ", "@seoudi_ How do you like to enjoy your coffee, Mostafa?", "@jrdnpwll You've got that right! 💯", "@courtsloger https://t.co/NROXt1bbCO", "@westsxde_ In love?", "@Nicocobean Agreed!", "@ultves That sounds A M A Z I N G! 😍", "@L_stray Cheers!", "@Haggard_girl Someone's a lover of this sip! 😉💚", "@asthriel 💚💚💚", "@courtsloger Cake Pops + Space = Stellar ✨", "@jasminetarin Woohoo! 🥰", "@shelbzzzxxx Glad you love it; whatever it is! 😉", "@Salmero68052659 Sounds like you've found a favorite!", "@ParissAdair_ The perfect way to start the day! Which ones are your favorite?", "@_Jennifer_E_ Cheers to that!", "@FAKEBESTFRIEND Get your taste buds ready!", "@steelydamnnn Can confirm that you are right! 😉", "@asthriel You know we love you! 🥰", "@Jason_n_Pardise It is enchanting! ✨", "@Nikomuhtoes Enjoy your sip-cation! 🌴", "@lordsukhjot Taste buds rejoice! https://t.co/01X02DwuJv", "@sassyMickey43 Cheers!", "@YARIVILLARREAL Say less.", "@__araaa_ Naturally! 😉", "@dopeitsnellz Happy ordering!", "@Z_Huber1992 Don't worry, we have no plans to!", "@ahmeezzyy Thanking you between sips!", "@LadyDeath13 Enjoy!", "@beethanggg_ What do you enjoy snacking on with it?", "@tempsz_xo And we're super excited about it! 😊", "@emilyg33112 Glad you found the right blend!", "@ashbee__x 👏👏👏", "@Aaroncabrera_ Thanks for the love, Aaron! 💚", "@ememechan We think you have great taste!", "@helencrisel You were our inspiration! 🤗", "@mariluzxo_ We like your style! 👏", "@ExquisiteLady_ We think that's a magnificent idea!", "@hannnoel12 Thanking you now! 😋", "@Andrew_113 We just wanted to decorate your cup! ✨", "@_Antoinetterrr We're shaking things up, Antoinette!", "@just_dom__ Especially when paired with the new Iced Chocolate Almondmilk Shaken Espresso! 😋", "@Abraham_F Cheers! Is it a new favorite? 😋", "Longer days mean more time for the things that make you smile. ☀ #DaylightSavings https://t.co/tv86TNsMt0", "@richmcintyrejr Thanks for the delicious tip!", "@LilGuppy92 We know the feeling! 😍", "@Extra_ordinayry Sounds like someone's in love! 🥰", "@hey_delisa We love when that happens! 🥰", "@DafantasicP 💚💚💚", "@DafantasicP Cheers to all the Spring things! https://t.co/ASchXSmVIo", "@sarahahmadhejab https://t.co/gM558VOYou", "@DafantasicP Which beverage brought joy to your day?", "@Inja_DDN Your cup of joy is here to stay!", "@terrilee63 Kind cups are the best!", "@KelseyFrazier_ Sip, sip, hooray! Cheers! 💚", "@KelseyFrazier_ We're happy to hear you're loving it! Is the Iced Brown Sugar Oatmilk Shaken Espresso a new favorite? 😋", "@regginaldd Happy to share this cup of joy with you! ✨", "@Irishgirl34 So many fun ways to sip!", "@drifressh Happy to be by your side!", "@disneydarling22 That's the plan!", "@kennaNOhope Sounds amazing!", "@sarahahmadhejab Spring vibes all year round! 🌷", "@SaraBeee93 Thanks for the yummy tip!", "@Mmryaam_ Thank you for always sipping with us! 💚", "@OfficialJazmynM Starbucks Delivers! Just download the Uber Eats app or visit https://t.co/FT9Kh0PvhK for availability in your area. 🙂", "@Virymel We love you! 💚", "@TrendyTrey We'd love to hear what you think!", "@tessaleighgray We're oat-ually happy to hear that! 😉", "@KishtotheL We're happy to hear you've found a new favorite sip! 😋", "@uhheysam Cheers to the perfect sip!", "@madiilex We're thrilled you're loving every sip! 😍😋", "@kaytaarabella Hi, Kayta! 💚", "@MeganAronson Happy Birthday, Kanon! You deserve to be celebrated yesterday, today, and every day. 🎉 Megan, would you mind following us so we can continue the celebration?", "@XaphanFire Not at this time, but thank you for the suggestion!", "@Graziellajune Hi, can you please follow back so we can send a DM? Thanks!", "RT @laceyalleman: That oatmilk brown sugar espresso from Starbucks living rent free in my mind", "@XaphanFire Orders placed through Uber Eats can earn Stars if you pay using the Starbucks Rewards Visa Credit Card or Starbucks Rewards Visa Prepaid Card. You can learn more here: https://t.co/3hVVi5qJPY", "@onescoop It tastes like rich layers of espresso, cinnamon, and brown sugar.  Give it a try! https://t.co/d6G6fLTJPr", "@celestelauryn You're welcome! We're really glad you liked your first sip of cold brew!", "@cea22 We do if you're a Starbucks Rewards member and have made at least 1 purchase! Visit https://t.co/3ktu65gD6c to learn more.", "@deedee2025 We'll be here for you.", "@miahman98 Prices can vary by size and location, but you can always use the Starbucks app to check the prices before you place your order.", "@celestelauryn Our Cold Brew is handcrafted in small batches daily, slow-steeped in cool water for 20 hours, without touching heat. It has a lower acidity and a naturally sweet taste that we hope you'll love. \nhttps://t.co/WwSfeC9kpA", "@Aishakhannn If this is something you would like to see, we encourage you to submit your suggestion at https://t.co/SPH9PuUUvR", "@_MissMeganxo You know now, and that's what really matters. 🥰", "@Ellary87688588 Happy Friday, friend! 🥰", "@jdodson86 Come to the dark side. We have cold brew. 😎", "@kaylairl So glad you enjoy it!", "@Q8LuLu Cheers to your best sip!", "@HHHAAA22222 We're actually pretty glad you're enjoying it. 😉", "@__Bvni It tastes as great as it sounds and we hope you'll give one a try!\nhttps://t.co/d6G6fLTJPr", "@_GoogleGabi So glad you enjoy it!", "@Just_Aly_ Go on. Give in to temptation. 😉\nhttps://t.co/5jkqourEpE", "@sarontherocks https://t.co/APW5xf8FGE", "@KellyKEditing Hey, Kelly! We got you. No need to remember what it's called. You can save it as a favorite in your app! So happy you're loving the Iced Brown Sugar Oatmilk Shaken Espresso. 💚\nhttps://t.co/d6G6fLTJPr", "@ohbellabizzle We hope you'll love it!\nhttps://t.co/d6G6fLTJPr", "@adrianac_19 We appreciate the perfect 10! Glad you're enjoying every sip. 💚", "@GeraldDalere Cheers to love at first sip! 💚", "@TrishaKArora We love that you found your new favorite!", "@queensnthrones We're glad you think it's a hit!", "@J_MMejia Always a pleasure. 😉", "@Bananna_Bea Sounds like you've found your non-dairy bliss! 😍", "@hopeusc1 Cheers!", "@hopeusc1 You should give this at-home coffee a try! https://t.co/y6BO9zzpIs", "@natashassight The heart wants what it wants!", "@MaskOfSANADA Happy sipping! 💚", "@_sammmbam Coffee date soon, Samantha? 💚", "@hopeusc1 Notes of rich cocoa and lush dried fruits make this at-home brew the perfect spring sip! ☕💚", "@omairaguz_ Each sip has us on cloud 9! 😍", "@faithypooo It's heaven in a cup! 💚", "@uhheysam Which drink will you be celebrating with, Sam?", "@m_ariachristina 💚💚", "@esenel95 💚💚", "@tsunhanyako It's the sip of the season!", "@risenshadow86 Cheers to the perfect sip!", "@DashLashae It's the perfect way to celebrate the start of a new season!", "@wkendsatcarries It's top tier! 💚", "@jvonthedaily We hope every visit is as perfect as the first. 💚", "@ZaeaJae We couldn't be more excited to be partnered with Oatly! 💚", "@libralater Glad you're enjoying every amazing sip!", "@risenshadow86 How do you like to enjoy your coffee, Ben?", "@gypsymama34me Cheers to finding a new favorite sip, Erika!", "@JParks31429918 These decisions are made on a store-by-store basis. Our local leadership teams are fully equipped with the appropriate tools &amp; resources; making decisions based on facts and science to meet or exceed CDC guidelines.", "@Jeepdude6 Please note you can view our Q1 Fiscal 2021 results on our website. https://t.co/ZBIIKxYiLO", "@likahNasir Knowing this just made our day! 🥰", "@misenogle We're glad it helped to brighten your day!", "@m_ariachristina Cheers to refreshing and delicious!", "@jenn4razorbacks Exactly. Priorities. 😎", "@DontAsk_x2 You're welcome. 🙂", "@kesa__ Glad you enjoy this comforting sip. 💚", "@CloudEllieYoung It's a delish favorite!", "@jenn4razorbacks Priorities. 😉", "@warkentin_ We hope you'll be enjoying that cozy sip soon!", "@harucix We look forward to sharing a sip with you!", "@chatney12 We love that you found your new favorite! 💚", "@spookifie Have you tried the new Iced Brown Sugar Oatmilk Shaken Espresso?  😋https://t.co/d6G6fLTJPr", "@braceletss__ Happy to hear it rates a 10 with you!", "@chatney12 Is this delish sip your new favorite?", "@DontAsk_x2 We see you've found a new favorite! Enjoy!", "@okagacam The game has never been more delicious!", "@MagnificentVee We hope you'll be enjoying one soon!", "@sapphicskylar It says you have great taste, for starters. 😉", "@AshBlair22 https://t.co/VWSCjeSbmE", "@skyebunnyyy Cheers to new favorites!", "@skyebunnyyy Is it your new favorite?", "@kapp_n So happy you found your perfect sip, Mollie!", "@bbyReverie That delish new sip is shaking things up! We hope you'll love it.", "@1_ksteen Enjoy every heavenly sip, friend!", "@mirrorbal1 We hope you're enjoying every sip!", "@lillyantran Sounds like someone found a new favorite!", "@_GabriellaDB Glad you like it. Thanks for the perfect sip score!", "@_GenisessOnee Glad you like them!", "@bbyReverie Which favorite beverage will you bless with oatmilk first, Melody?", "@J_MMejia Sometimes it's nice to go where everybody knows your name and they're always glad you came. It's a nice way to start your day. 💚", "@Fall_OnLove Happy you're enjoying it!", "@denvernicole You're welcome. So glad you're enjoying them!", "@zeffiroart Delish breakfast choice!", "@gladdis_baybee We're glad you finally gave it a try. 😉", "@airicuh1 We see that look in your eyes. 😍", "@itzmelovelylu We hope you'll be sipping and smiling soon. 💚", "@ThatDamnRobbie Ain't no shame in that explosive combo!", "@goldenfluffs Thanks for the confirmation. 😉 We're glad you're enjoying it!", "@jphandom You're welcome! Which favorite sip are you enjoying with it first?", "@brookewitzy Sounds like you have a new favorite! Looking forward to our next sip together.  💚", "@princesssdianan Sounds like you found a new favorite!", "@brookewitzy Which delish new sip are you enjoying, Brooke?", "@sarasolnick We're happy to serve you through curbside pickup!", "@clcarpio It's our Iced Brown Sugar Oatmilk Shaken Espresso. We can't wait for you to give one a try! \nhttps://t.co/d6G6fLTJPr", "@fookintomlinson Thank you for this suggestion!", "@mamamorgann We've missed you! We hope you'll give our new Iced Brown Sugar Oatmilk Shaken Espresso a try. \nhttps://t.co/d6G6fLTJPr", "@maryalhh Glad you enjoy it!", "@_bajonw See you soon. 😉", "@yung_mikal We're glad you found your perfect sip. Thanks for the recommendation!", "@ZacharyZWA A whole new level was created just to accommodate it.", "@FatGirlWindy It's never too cold for cold coffee! 💚", "@ashleydecker_ The facts have never been more delicious. 💯", "@KristinYaquinta We love that you love it!", "@__xavi16 Glad you're enjoying it!", "@RealBlackBrat Yay! Can't wait to see you!", "@JParks31429918 Thank you for the feedback. It is our responsibility to protect our partners and exceed CDC guidelines.", "@RealBlackBrat Tomorrow has become today! Are you on your way? 😉", "@rornronrnron https://t.co/81mqBDRkN2", "@BCool_E We hope you'll be enjoying one soon!", "@xPudgyyyy Cheers to enjoying new and delicious sips this season!", "@johnnyl0ver We can't get enough of this new sip!", "@avoxo_tati We'll be sipping this new drink all season long! 💚", "@MNFox88 Come sip with us, friend!", "@sharinicole042 For community health and well-being, we respectfully request that you wear a facial covering the next time you visit a U.S. company-operated store.", "@Jeepdude6 Since the beginning of the COVID-19 pandemic, we have consistently made decisions based on the facts and science, with partner and customer safety at our core. That commitment remains true to this day.", "@KristinYaquinta We're happy that it's giving you all the cozy fall vibes. 🥰", "@rocketslifting We will continue to pause indoor seating in most stores and assess the situation locally. Please contact the store you plan on visiting beforehand.", "@MrMidh We are strongly encouraging our partners (employees) to receive the COVID-19 vaccine as soon as they are eligible. We will provide up to two hours of paid time off for partners to receive each dose, up to two doses. https://t.co/WMpwMyUw5f", "@esenel95 Did you find a new favorite sip? 💚", "A lot has changed, but our commitment to the safety of our partners, customers and community remains the same. While we can't wait to see your smiles again, help us take care of each other by wearing a facial covering and practicing physical distancing in our stores. 💚 https://t.co/h2j44Ba1Qj", "@courtney8698 Glad you think it's a hit!", "@kxrivx We're glad it's got your taste buds exploding with happiness!", "@AlyMoody123 We recommend our Iced Brown Sugar Oatmilk Shaken Espresso and Honey Oatmilk Latte! 😋", "@sydnizzll Most delish PSA of the day! Which favorite sip will you enjoy with oatmilk first?", "@rornronrnron See you soon! 😉\nhttps://t.co/d6G6fLTJPr", "@CaraRi0t13 So happy to finally be reunited. We hope you loved every sip!", "@0heyjayjay No tears, Jess. We're happy to say, this sip is here to stay!", "@mmary_jay Hi, can you please follow back so we can send a DM? Thanks!", "@graceyhanderson Cheers to finding new and delicious favorites! 💚", "@GlendaaGomez Sip sip, hooray!", "@bbbymel They're the perfect sip to celebrate spring with!", "@GlendaaGomez Did you find a new favorite sip, Glenda?", "@Joc_Esparza Which sip will you be ordering next, Jocelyn?", "@AmberJ36__ That sounds like the perfect pairing! 💚", "@artbyflwrrgirlg Cheers to delicious! 💚", "@Trilly_Ano They're pretty egg-cellent!", "@AmberJ36__ What's your favorite sip to pair it with, Amber?", "@DestinyNesenya It's so creamy and delicious! 💚", "@queeno1994 We're so glad you found a new favorite sip!", "@MahaliaSBM See you soon!", "@Drakehern Hi! Can you please follow back so we can send a DM? Thanks!", "@bri_dubs Never fear, our app is here! No worries about saying a mouthful, just tap and enjoy! 😉\nhttps://t.co/d6G6fLTJPr", "@Aprizzle_ It's one serious sip! 🙂", "@adfink_thinks We're pleased to say it's here to stay! Glad you're enjoying every sip. 🙂", "@sweetx0love25 Looking forward to our next sip together. 💚", "@colleliz https://t.co/8CZH0aZCBx", "@sweetx0love25 Sip happy, friend!", "@MahaliaSBM It needed to be done. 😉 Looking forward to our next sip together.", "@colleliz Great recommendation. Thanks for the perfect sip score!", "@ArlenArmageddon Cheers to finding new favorites!", "@genevagigi210 We can't wait for you to give it a try! \nhttps://t.co/d6G6fLTJPr", "@erin_go_bruh Cheers to the sips that change our lives for the better!", "@bigb0ss_sha Happy it rates a 10 with you!", "@karissamedina_ We hope thinking leads to sipping. 😉", "@brittsbeeee Delivery to the rescue! Starbucks Delivers is now available in all 50 states in the U.S. To see if Starbucks Delivers is available near you visit: https://t.co/8TzwEl1eav", "@Jlachae_ They're the breakfast champion!", "@cursedminmo They've been thinking about you too. 😉 Can't wait until you're together again.", "@magnanimitea Cheers to a day full of good news!", "@TeKarl_ We know what we did. 😉", "@tinyheart077 Glad you're enjoying every delicious drop!", "@Sippin_Soup_ Happy ordering!", "@harryjcrowley Enjoy every sip!", "@kelzwritestuff_ That's awesome! 💚", "@gurlitscait It's the best way to shake things up! 😉", "@stephlandaverde Yes, it oat-ually is! 😉", "@kelzwritestuff_ What do you think of our new drink?", "@pensudar YAY! 👏 https://t.co/uXsJLRrbBj", "@_shannm Shannon approves! 🙌💚", "@babe_cheeks Sounds like a fave!", "@devondietlin It's still around, Devon! Starbucks Doubleshot On Ice is now called Iced Shaken Espresso. https://t.co/QfgOjLK52F", "@ffrckk Sounds like your Spring is off to a gr-oat start! https://t.co/SdCu29EBrB", "@Teyajasminee_ox Wow, indeed! 😍", "@soxgaff Thanks for the tip!", "@rosieeee31 You never know what you might fall in love with!", "@KianaGodleyy Live it up with your favorite cup!", "@_AmberWolf You're welcome. We're glad you're enjoying every sip.", "@amayaaloveee Glad you think it's a hit!", "@AshleySobel We like your style. Cheers! 💚", "@nataliedj98 Cheers to finding love in every sip! 💚", "@na_naboukaff Amazing recommendation! 🙂", "@AshleySobel We're happy to hear you're loving them! Do you have a favorite? 😋", "@anniewinehouse Sip, sip, hooray! 💚", "@onepeloton We'll see you on the leaderboard! 🤚", "@maarciniegamo Cheers! 💚", "@anniewinehouse We're happy to hear you're loving it! 😋 Is it a new favorite?", "@chembromo We're happy to hear you've found a new sip to love! 💚", "@jinchvrik It smacks just as hard as it needs to. 😉 We're glad you think it's a hit!", "@nataliaglaub Cheers to the sips that change our lives for the better!", "@telisayancy We hope it's just the start of a beautiful day!", "@ChristiMusonda It's our premium matcha green tea shaken with flavors of pineapple and ginger along with coconutmilk and ice for a delicious beverage to uplift your day. Let us know how you love it!", "@Ryan85869100 Mom knows best.", "@glteach Everyone's diet is different! To decide if it's right for you, take a look at the nutrition information: https://t.co/uqxUwtYCUh", "Fresh air. Delicious sips. 💛💚 \n#IcedPineappleMatchaDrink https://t.co/lIKipl7fa7", "@Qui_Monroe Sip, sip, hooray! 😍", "@hourlyduo_tr https://t.co/BuZixiJaTa", "@Jawss__ Cheers to finding love at first sip! 💚", "@ayaabdeen__ We love that you love it! 💚", "@angieeglzz Run, Angie. RUN!!! \nhttps://t.co/d6G6fLC8XT", "@badluckzee Thanks for the perfect sip score!", "@ivanalacole Cheers to new favorites!", "@ikvros Yes! https://t.co/5Pr4KB370G", "@EmmaDanielle No need to apologize. When something changes your life, it's only natural you want to tweet about it. 😉", "@_AmberWolf Since you said please. 😉 We're pleased to say it's here to stay!", "@kennnblack We know what we did. 😉", "@angelcay_ Cheers to the sips that change our lives!", "@yaasjungwoo So glad you're enjoying it!", "@justinlamont_ Looking forward to our next sip together. 🙂", "@mill23_ 😘", "@SydNatash We're thrilled you're loving every sip! 😋", "@yesiverastigue We're happy to hear it's a favorite! 😋", "@amethystqveen We're happy to hear you're loving it! Is it a new favorite? 😍", "@rocioxjh Cheers! 💚", "@paigepauline_ We're happy to hear you're a fan! 😍", "@jayt415 Cheers to finding your new favorite sip. 😉💚", "@twister_blister We're thrilled you're loving every sip! 😋", "@Qui_Monroe It sounds like you may have found a new favorite sip!", "@biology_belle We're happy to hear you're loving every sip! 😍😋", "@j_nuge Looks like you have a new fave!", "@xluhvn It's the perfect sip-cation! 🌴", "@NikNastay_ Woohoo! 🎉", "@concerned_pony Glad you've been enjoying this sip!", "@vernonugh Love you, honey! 💚", "@emmasglasses Looking good!", "@ChadCur28 Have fun sipping!", "@twtofzeus Happy Sipping!", "@SocraTetris Good news! 🎉", "@QHELLAFLY What a delicious way to start the day!", "@kelli__west A delight! ✨", "@DuchessChanel So good!", "@Mwrightnuknowit Woah! You have some delicious plans. 😋", "@HeyItsMoog We're pleased to say it's here to stay!", "@Justinpgh118 So glad you're enjoying it!", "@KelliePriceless We've got your sip for every occasion. 💚 https://t.co/526syPi7s3", "@mamalifewithme Super Moms always know best! 🥰", "@_leahmccue We hope you'll be enjoying one soon!", "@Staceeymariexo Glad you like it! Thank you for making us part of your day. 💚", "@JaayAaliyah_ https://t.co/TYb6JbZfic", "@marysantomin We always look forward to starting the day with you. 💚", "@JaayAaliyah_ We love starting the day with you and your favorite blend. 💚", "@mofo809 Happy International Women's Day! 💚", "@SamsungNeptunia Awesome!", "@SamsungNeptunia Yum! Let us know what you think. 🙂", "@JoJoe89309852 Yum, indeed! 😋", "@Mwrightnuknowit We're happy to bring it to you! Which beverage are you looking forward to enjoying with oatmilk?", "@Hudson_Lhp Awesome!", "@MrMidh Coconutmilk is delish too!", "@NarvesenConnie We agree!", "@Hudson_Lhp Sounds like you found your new go-to!", "@JulesOfficial_ 🙌", "@gabyaguilar1 Yes! https://t.co/grluE1jILm", "@DjNightChild Cheers to finding a new fave!", "@SamsungNeptunia It's a creamy way to customize your sip!", "The wait is over. Now ask for creamy Oatly oatmilk in all your favorite drinks. 🙌 https://t.co/bAH10BN16f", "@emilioangel_ Glad to know our latest flavor explosion rates a 10 with you!", "@LindZ_k Definitely the way to sip on a Monday!", "@shaelyn98x Love you, bestie. 💚", "@raniamerchak https://t.co/XwUdcY2GEK", "@mill23_ It slaps just as hard as it needs to. And we care. A lot. 😉", "@OhhhLyss We're happy to say that this delish sip is here to stay!", "@raniamerchak Glad you're enjoying every yummy sip!", "@SnickerzBites Cheers to discovering new favorites!", "@DYetti_ We're glad you can taste the love in every sip!", "@NatassiaDiggs You don't have to get over it. It's here to stay. 🙂", "@sarasueee Enjoy every wonderful sip, friend!", "@Jenjennnn1995 Facts! 💯", "@authorsarahmoor Thanks for keeping us by your side while you write! 💚", "@crazy4lefties We won't! 🥰", "@twtofzeus It's here to stay!", "@fearlessaubrey Awesome! 🥰", "@authorermurphy You deserved it! 💚✨", "@sgtpeppers99 That's awesome to hear!", "@LoriMumford Our kind of sipper! 💚", "@julia_anne_XD Hope your cup made your day brighter!", "@aebthestyleicon Sounds good!", "@Mayrahernandex1 MOOD!", "@hearjustice Always!", "@tracijadlos For sure!", "@quach_mitchie Happy to hear that!", "@Ilamaran39gmai1 Same!", "@MYCOFFEEQUOTES We see you!", "@khrnnjng Cheers!", "@shaelyn98x This is Shae. Shae got the new sip and was able to sing nursery rhymes with her students. Be like Shae. ☕", "@KaeSuell Definitely a keeper!", "@stephhoxxo Awesome!", "@Heart_Healthy1 It's the perfect coworker!", "@freakinireth Definitely stick to coffee! 😉", "@AzureSky45 Sipping is always better! 😋", "@aebthestyleicon Is it your new favorite?", "@lananimitch You know we do! 💚", "@jocelynpaigey Sometimes you have to switch it up!", "@xxkatielunAA So are we! 😊", "@EmelyMontiel2 It's everything! 😋", "@deemichelle915 Cheers!", "@SteveSchrader96 Love you too! 🥰", "@LisaYanet Live it to the fullest!", "@Deb79622222 That's the best way to go!", "@Raysammy Great to hear!", "@cthenewclassic Cheers to ordering your favorite!", "@thatguyjoshw Abso-brew-tly!", "@DallTheDon You're talking about our Strawberry Acai Starbucks Refreshers! It's a wonderful blend of strawberry and acai flavors with passionfruit notes. It includes green coffee extract for a delightful pick-me-up! https://t.co/h2zzsUQUvM", "@m0tivatedaf We thought it was time to shake things up! 😉", "@dani_dayzz We're thrilled you're loving every sip! 😍", "@MendozaMychelle YAY!🎉", "@GonzalezEffy We're happy to hear you've found a favorite! 😋", "@presleyallise We love that you're loving them! 😋", "@gabywhiteelise We're happy to hear you're a fan! 💚", "@snichols4799 We're happy to hear it's a favorite! 😋", "@aubreyanndan We're happy to hear you're loving every sip! 😋", "@BamaKay91 It sounds like you've found a new favorite sip! 😋", "@nat__v We're happy to hear you're loving it! The Iced Brown Sugar Oatmilk Shaken Espresso is here to stay! 😍", "@TunstallTamara We're happy to hear you're loving every sip! 😋", "@sparklebitxh We believe you! 😉", "@UrTimeSio So beautiful that it glows! 🌟", "@ST0RYVINYL Love you, bestie! 🥰", "@aydild7 We're shaking things up! 😉", "@arii_ambitious We have a standing sip date! 😉", "@The_Omikron We're glad you enjoyed it!", "@B2utyfulEXOtic Thanks for the love! 🙌", "@baileyaleece To all the dreams that come true! ☕✨", "@o_keefechris Always happy to shake things up! Thanks for the love, Chris. 😊", "@Raegan_33 Of course, it is!", "@tiniest_bean Dear tiniest, you're our favorite bean! 😉💚", "@Egyptchristos You're welcome, friend! 💚", "@B2utyfulEXOtic We love this deliciously spiced cup too! 😋", "@DunPlayin That's such a spring thing to do! 😉 https://t.co/0DiS3fLtFf", "@Leesie_Lu We're glad that you've been enjoying it, Elise!", "@_gabigail Happy to add some joy to your cup!", "@DunPlayin Sounds wonderful!", "@DunPlayin What do you enjoy pairing with this beverage?", "@krosenlund We're pretty excited too! 😉", "@C_Gullible_Esq Pistachiyum choice! 😋", "@CMichaelDavid Good to hear!", "@lekhamehtaa Coffe always has a way of drawing us in! 😍", "@MaggieAnnHallum Enjoy!", "@gabby41varado Happy Sipping! 💚", "@jc_swift13 Happy that you let the sunshine into your cup! 🌞 https://t.co/3yeyv8KT4P", "@ruth_delemos The Honey Citrus Mint Tea is such a cozy sip!", "@sunchallaj Coffee pairs best with kindness! Thanks for sharing. 💚", "@_Ree11 Sip, sip, hooray! 😍", "@FloralCrissy We're happy to hear you're loving every sip!", "@briannamarie__K Sounds like you've found a new favorite sip. 😋", "@DENsQuared We're happy to hear you're loving every sip! The Iced Brown Sugar Oatmilk Shaken Espresso is here to stay! 😍", "@sadhiyamoolji Sip, sip, hooray! 😍🙌 We're happy to hear you're loving it!", "@taylor624 Sorry for the delay, but we're happy to share it's available now!", "@thisBIRDisword Cheers! 💚", "@thisBIRDisword We'd love to hear what you think! 😍", "@thisBIRDisword We're happy to hear you loved every sip! Is it a new favorite?", "@BrodyRyan Cheers! 😋", "@Sabrina_Annnnnn Sip, sip, hooray! 😍", "@melaniebriannaa Sounds like you've found a new favorite sip! 😋", "@melaniearmelim We're happy to hear you think it's perfect!", "@sarrahberkery SIp, sip, hooray! 😍", "@haleeybrooke_ Cheers! 😋", "@kellyjean512 We're happy to hear you're loving it! 💚", "@MellyyLove Sounds like you've found a new favorite sip! 😋", "@akatsmarki Cheers! 💚", "@HoldemMedia_Dan Sip, sip, hooray! 😍", "@AlayneAllstar Sounds like you've found a new favorite sip! 😋", "@__okaykatie We're happy to hear you're loving every sip! 😋", "@maddy_jane_ Cheers to finding a new favorite sip! 💚", "@maddy_jane_ It's here to stay! 😍", "@maddy_jane_ We're happy to hear you think it's perfect! 😋🙌", "@itsaudreyyy We're happy to hear you're loving every sip! 😋", "@alexisBaybe_ Yes it does!", "@nikkicorrine17 We're happy to hear you're loving it! Sounds like you've found a new favorite! 😍", "@_jodielu_ Sounds like someone found a new favorite! We're happy to let you know that our Iced Brown Sugar Oatmilk Shaken Espresso is here to stay. 🙂", "@_danagraham So glad you're enjoying it!", "@allisson_xo So happy that it rates so highly with you! 💚", "@woosaniast We hope you'll love it! \nhttps://t.co/d6G6fLTJPr", "@Aiyraw_ We see that look in your eyes. 😍", "@chellebearr An entirely new level had to be made to accommodate its greatness!", "@MSBYMlYAS We're just trying to do our part towards filling this year with all the good things. 💚", "@darlizae Looking forward to sharing a sip with you this weekend!", "@allys_sun You can't win 'em all, but you're still winning. 😉", "@radiocarissa It can make any day feel like Fri-Yay!", "@WitchyGoth https://t.co/q09olIiDJ7", "@Camarillo17K Sooo glad you're enjoying it!", "@JNoble__ We know what we did. 😉", "@abbylefler Cheers to the best sips!", "@Thisswifttbeat New year, new sips. Better latte than never! 😉", "@melisssaaaa97 Never lose that feeling. 💚", "@mightymidwest Cheer to the sips the make our days better!", "@gcmovesworld Better latte than never. 😉", "@melisssaaaa97 Glad you're enjoying every amazing sip!", "@HeyItsDiana 😘", "Which one are you? (GIFs only)\n\nStopping to smell the flowers.🌸\n\nStopping to smell the coffee.☕️", "@_AmberWolf Glad you think it's a hit. 💚", "@nunezec_ We see you drooling. 😉", "@brandi_devine We were due for some good news. 😉 Sip happy, friend!", "@kmariemessinger You're welcome, Kels! Enjoy every sip of happiness. 💚", "@Maria_24p Enjoy every perfectly balanced sip of goodness, friend! 💚", "@mochutofu Thanks for the perfect sip score!", "@internalnoises We are thrilled to have oatmilk join our lineup of non-dairy milk options! 😊", "@sleepynstressed Cheers!", "@sleepynstressed The Iced Brown Sugar Oatmilk Shaken Espresso is a part of our core menu, so it's here to stay! 😊", "@sleepynstressed We're happy to hear that you're loving this non-dairy drink! 💚", "@TeuschKarise Sounds like you've found your new go-to sip! 😊", "@AshEntrek3 Thank you for your patience: Oatmilk is available now in the Starbucks app! https://t.co/yM8wLkDDdt", "@chanelly37 Cheers to our fave Starbucks sips!", "@chanelly37 Sounds like the Iced Shaken Espresso is your new go-to sip!", "@chanelly37 💚💚", "@sortanightblind Hi there! Can you please follow so we can send a DM? TYSM 💚", "@SmileForKayla Hello! Could you please follow us so we can send you a DM? Thank you. 💚", "@_PATonthebackk Can you please follow us so we can send a DM? Thanks! ☺️", "@HeyArnold920 Cheers to new and delicious sips! 💚", "RT @thatvegangirl_: so I tried the oat milk espresso drink at Starbucks...\n\nBelieve the hype.", "@shelbyleinbach So glad you've given it a try and found a delicious new fave!", "@QueenAshley75 Our new, non-dairy espresso beverages might change your mind! (Or if not, we'll always be happy to help you find a drink you love.) https://t.co/7WDSsLrEiD", "@SVTV20 Yes! Starbucks® Blonde espresso, brown sugar and cinnamon shaken together and topped with oatmilk. https://t.co/d6G6fLTJPr", "@CaitlinDineen Thanks for trying it out!", "@NerdyAndNatural Yes! We just added it this week at participating stores in the U.S. https://t.co/yM8wLkDDdt", "@kaitlinlexiexx We think so too! First Starbucks baristas shake Starbucks Blonde espresso, brown sugar and cinnamon together with ice, and then top it off with oatmilk for a cool lift to power you through your day.", "@AmayaReneee Thanks for that perfect sip score!", "@josephsortiz Yes! We now have oatmilk at participating U.S. stores. https://t.co/yM8wLkDDdt", "@earthsigngirl Victory has never been so delicious!", "@shibbybrooks Cheers to life-changing sips!", "@UwUXPMXUwU On March 4, Starbucks Rewards members who use the Starbucks app to order ahead any handcrafted beverage (grande or larger), will be sent a coupon for a free drink redeemable March 10-12. Download the Starbucks app and sign up for Starbucks® Rewards to get the offer.", "@DanielScarn We're glad you love it so much!", "@joycilleee It's a top tier sip!", "@miyxni_ Sip sip, hooray! 💚", "@torres_ari28 We're so glad you found a new favorite, Ari! 💚", "Shaking things up with the new Iced Brown Sugar Oatmilk Shaken Espresso. ☀️ #IcedShakenEspresso #Oatmilk https://t.co/sstq0vrxkp", "@Anita_Realtor1 Cheers to new favorites! 💚", "@MarisaLeeMartin Sounds like someone found their new favorite. 😉", "@Dear_Min_Yoongi 💚", "@hollywoodbIues We hope you'll love it! Looking forward to starting the day with you. 💚", "@_livingdeadgxrl The most delish PSA of the day! 🙂", "@Dear_Min_Yoongi Sounds like someone might have just discovered a new favorite sip!", "@lisayee We love it when you find a new fave! 💚", "@abilley8 Glad you like it! Looking forward to our next sip together.", "@chanelly37 The Iced Shaken Espresso is next-level cold coffee bliss. 😍", "@haylauryn_ Happy to make your taste buds happy! 🥰", "@m3raha Enjoy! 😋", "@emmawhinnie Very true! We're glad that you enjoyed it. 🙂", "@emmawhinnie Exciting! What did you snack on with it?", "@_mayrraa Woohoo! Thanks for the high marks. 🥰", "RT @benzenehan: Can’t talk rn, too busy planning my entire day tomorrow around going to Starbucks and trying their new oatmilk drink", "@tiarajamie191 Enjoy it all! 😋", "@ummmkayyy_ Love you too, Kay! 🥰", "@ummmkayyy_ We're all for sipping and shopping!", "@_jambell_ Both! 😋", "@caitlinp33 Good news. It's here to stay! 🙂", "@caitlinp33 That's the tweet. That's it. That's the sip!", "@vanessaguzwoman https://t.co/Y0m8BkM8S3", "@adoregldn https://t.co/0rMlMXwgkl", "@victoria_evelyn All happiness is necessary. 💚", "@JasonMOBrien That's its entire business. And business is good. 😎", "@PlNKANGEL You're welcome. 💚", "@nyusicheng Cheers to enjoying your best sip!", "@Pucca4lyf We see you drooling. 😉", "@supermangotang0 🎵Sweet dreams are made of this. Who are we to disagree? 🎵", "@p1umeriass So glad you like it!", "@cheyennemikala We know right? Better latte than never!", "@WitchyGoth Honestly, when is it not though? 😉 https://t.co/akm3MUD5xR", "@Brayan_Gto https://t.co/jX2s1oB75w", "@sluice_gate On Wednesdays, we sip pink! 😎\nhttps://t.co/LlJAax1DfT", "@_janxo Yes. 😉", "@sad1754872066 Treat yourself. You deserve it. 💚", "@fit_princess93 For the best experience of the beverage, we only offer tall and grande Nitro Cold Brew. With larger sizes, the Nitro cascade leaves the beverage before it can be consumed.", "@bhadbratzz1 Can't stop, won't stop. Sip happy, friend!", "@monniehope https://t.co/om8gEJWZYp", "@vanessaguzwoman Sounds like one delicious checklist!", "@smoknP We'll thank you now. That sounds delish!", "@bhadbratzz1 We know what we did. 😉", "@monniehope Can confirm! Glad you're enjoying every incredible sip!", "@adoregldn See you soon! 💚", "@adoregldn It's a pretty safe bet. 😉\nhttps://t.co/d6G6fLTJPr", "RT @noitskatelyn: I wish everyone a very oat milk at starbucks", "@AbdulJuhaina Better latte than never. 😉", "@fongo2 It knows what it does. 😉", "@lady_hyperbole Cheers to delicious new favorites!", "@ashkay823 We're so happy that you gave one a try and it exceeded your expectations!", "@mariaaadeniceee That's the delicious truth!", "@Simply_Bia See you soon!\nhttps://t.co/d6G6fLTJPr", "@hansolsgem We're happy that it rates a perfect sip score with you!", "@VelvetMobius We're all about sharing the good news! 😊", "@jennandrewss Just wanted to say we're really glad you enjoyed it. 😊", "@mozelle24 Look no further. Cheers to your perfect sip!", "@karlarachellem Glad you enjoyed every delicious drop!", "@celestenavv Cheers to life-changing new fave sips! 😊", "@VelvetMobius Can confirm. It's here to stay!", "@itsnorayareli We're glad your sip rated a 10! 😊", "@Jladolcee Answer the call! 😉\nhttps://t.co/d6G6fLTJPr", "@itsBEBE__ Can't wait to share that sip with you!", "@itsmekaylap 🙌", "@uhhashlyyn_ Just for you, Ash! 🥰", "@toriimariaa Woohoo! 🎉", "@itsmekaylap Iced Brown Sugar Oatmilk Shaken Espresso is officially here!", "@mrdavidortega We're aware that some customers are experiencing issues ordering select items through the Starbucks app. We apologize for the inconvenience and encourage you to visit our drive thru and store for your order. Thank you.", "@karenxbasulto Thanks for the perfect sip score!", "@nikkiiiiann Cheers to finding new favorite sips!", "@tiffanyaknox We love it when you find a new favorite!", "@meggbenson Thanks for sharing this! 😋", "Spring is here! Jump into the season with our new game, Sip, Smile, Spring—powered by your smile! Check it out on Instagram. https://t.co/tQPdmYZi0B https://t.co/UyEFWzvpHz", "@AshAllen350 It's your time, Ashley! How was your drink?", "@topazkat We were thinking of you! 😉", "@Notabumbleb88 Happy to make you happy! 🥰", "@KTMaviglia Look at that glow! Cheers.✨", "@lysscalv So much yum!", "@EmilyTFord And it's here to stay so enjoy! 😉🥰", "@ChelleMoraga Enjoy!", "@Jacksters685 We're always happy to serve you your cups of joy! 💚", "@CoralAngele A pick-me-up that you deserve!", "@RussDeCastro221 That's a delicious way to sip!", "@RussDeCastro221 You'll love our new Iced Brown Sugar Oatmilk Shaken Espresso! https://t.co/d6G6fLTJPr", "@t_slns Cheers to new faves!", "@yadirapaxton It sounds like you've found a new favorite sip! 😋", "@Albert_347 Cheers to finding another sip to love! 😍", "@FSUmanager Aw, shucks! 😊🥰", "@Albert_347 We're happy to hear you're loving it! 😋", "@itskristind Now you can customize your sip any way you'd like!", "@xoedialma Yes and yes! 😋", "@falatyn A sip changer, for sure! 😉", "@zonazanga Exciting!  🥰", "@Lo_wee We'd love to hear what you think! 💚 https://t.co/B26DzIimvZ", "@bahiehhh Thanks for the delicious tip!", "@danicaam2201 We're happy to hear you're loving every sip! Is it a new favorite? 😍", "@CLGagnon86 It is, indeed! Thanks for siplebrating with us. 🥰🎉 https://t.co/UoyJ7DN1D4", "@nursedani23 Cheers!", "@nabrathhhh We're happy to hear you're loving it! 😍", "@Maine_Char Sounds like it should be in your cup!", "@Lo_wee We're happy to hear you're loving it! 😋", "@Eleytwun Yum! How was it?", "@mmary_jay 💚", "@mmary_jay Tears of joy for all those sweet happy sips!", "RT @luceroicantu: got the new @Starbucks brown sugar oat milk latte and it is, to the shock of no one, divine", "@mariquinteros_ No kidding! It's delish!", "@ktsurly So...how was it? 😊", "@_Nessss Sip, sip, hooray! 😍🙌", "@margmaes Truly the best month.", "@DavidProia Yes! The new Chickpea Bites &amp; Avocado Protein Box is available in U.S. stores.  A fully plant-based portable box—with 15 g protein—delivers chickpea bites, snap peas, mini carrots, dried cranberry and nut mix, and avocado spread for a perfect on-the-go moment.", "@RobertPoser Today you can! Oatmilk is available at participating U.S. stores.", "@powderedmilkk Goooood morning and happy Oatmilk day!", "@ivydreamlands We hope it's just the start of an amazing week.", "@Ian_n_wells Cheers! 🙌💚", "@nicpaige_ https://t.co/71Vq65o7fC", "@silkleia Starbucks Doubleshot On Ice is now called Iced Shaken Espresso.  https://t.co/QfgOjLstE5", "@tynie_boo We're happy to hear you think it's perfect! 😍", "@Heather_Burdo Yes, you can customize this drink with decaf espresso shots.", "@lucyyrios_ We're thrilled you're loving every sip! 😍", "@marissaaAnthony Sounds like you've found a new favorite sip! 😋", "@JustLikeeIsaac So glad you're enjoying it!", "@0hanasorry Cheers, friend! So glad you're enjoying it.", "@nicpaige_ See you soon, friend! We hope you'll love every sip. 😊", "@HelloMandyO Cheers! 😍🙌", "@belieberx2369 Starbucks Doubleshot On Ice is now called Iced Shaken Espresso. Just ask for it with our Blonde Espresso and sip happy!", "@cantsleepsyd Yes! Just ask your barista for decaf espresso. Sip happy, friend!", "@bfremm Or stay in bed and order in. 😉 Starbucks Delivers is now available in all 50 states in the U.S. To see if Starbucks Delivers is available near you visit: https://t.co/8TzwEl1eav", "@birkclogs Glad you enjoyed every magnificent mouthful!", "@elaineskennedy It's here to stay! Enjoy every delicious sip, friend!", "@jazminelopeez Sounds like you've found a new favorite sip! 😍", "@kjmelvin3 You are correct it was renamed. A venti Iced Shaken Espresso has 4 shots. https://t.co/QfgOjLstE5", "@MatchaBobaFett It's here to stay and make your day.", "@kforbs Not to worry: It's been renamed to Iced Shaken Espresso. https://t.co/QfgOjLstE5", "@briannazakyra Oatmilk is here today! https://t.co/yM8wLkDDdt", "@firstdayofhome Thanks for celebrating with us!", "@realxoxoethan Not to worry: It's renamed! Look for the Iced Shaken Espresso.", "@RaeWhitlock @rhymeswvictoria We apologize for an earlier, inaccurate tweet. A tall Iced Shaken Espresso is served with 2 shots, a grande has 3, and a venti has 4.", "@sofrito_mami Good morning and happy Oatmilk day!", "@vntgebutterfly Tastes delish, too!", "@RyanHufton Glad you enjoyed it!", "@94dru We didn't have oatmilk nationwide until today! It's available now in participating U.S. stores, and in our app.", "@0hanasorry Starbucks Doubleshot On Ice is now called Iced Shaken Espresso. It's a drink you know and love—made with Signature Espresso shaken with classic syrup and topped with 2% milk.", "@sarahkotss Good morning, it's oatmilk day!", "@RyanHufton We're pretty excited about it, too! Which oatmilk sip will you try first?", "@adamssadnler If you say so. 😉 Cheers, friend!", "@Ghetticashedout As of today, Oatly oatmilk is on the menu and in our app!", "@tudorgirl21 We hope you enjoy every sip!", "@DubQueenAbs We have Oatmilk today (in US stores)! https://t.co/yM8wLkDDdt", "@jennamariesch No more tears - it's true! https://t.co/yM8wLkDDdt", "@escapefromseI Today's a big day.", "@Shannan_WR We hope today is the most delicious day of the whole week!", "@mandamakesmusic Check your app! We're excited to offer Oatly oatmilk starting today in participating US stores.", "@bibidibalba 🙌", "@Outsider0utcast We did it all for you! Glad you enjoyed every amazing sip. 💚", "@a_lank Oh, happy day! 🥳", "@Tylerhartling Better latte than never. 😉", "@greenthumbleo Oatmilk is available today!", "@Cinmer13 We still don't mind if you tweet us, but you should check out the app today - Oatmilk is available at participating US stores!", "@bibidibalba OK https://t.co/yM8wLkDDdt", "@ALICEreevas Oatmilk is now available in participating US stores! https://t.co/7WDSsLrEiD", "@murielm1031 You know what, you're absolutely right! https://t.co/yM8wLkDDdt", "@lighttkylo You got it: Oatmilk is available today! https://t.co/yM8wLkDDdt", "@tereee_u We love you too! 💚", "@LiteBriteMs Today's the day!", "@Katie_Misuraca Not to worry! Starbucks Doubleshot On Ice is now called Iced Shaken Espresso.", "@lehungster Which one will you go for first?", "@aaaldape It's a similar build, but extra delicious! First Starbucks baristas shake Blonde espresso, brown sugar and cinnamon together with ice, and then top it off with oatmilk for a cool lift to power you through your day.", "@Britney4Trump Sorry, it's not available as a Frappuccino® drink.", "@mrdavidortega Starbucks Doubleshot On Ice is now called Iced Shaken Espresso.", "@p0esiedanslarue Oatmilk is here!", "@whirlwindjenn Cheers to delicious new favorites!", "@breanna_miranda The Iced Brown Sugar Oatmilk Shaken Espresso is available today!", "@aluskee See you later today! And tomorrow...", "@adelvecchio8 ¯\\_(ツ)_/¯", "@hotynation Today's the day!", "@LabanZReeves We're happy to help everyone enjoy Oatmilk in participating US stores starting today!", "Let the sunshine in. Introducing the all-new Iced Chocolate Almondmilk Shaken Espresso and the Iced Brown Sugar Oatmilk Shaken Espresso! ☀️ (US only) #IcedShakenEspresso #Oatmilk #Almondmilk https://t.co/zIR1UMB63h", "@Nad_Bho We love you too! We have no plans to remove it from our menu. Happy sipping!", "RT @LostInStereoLiz: STARBUCKS FINALLY GETTING OAT MILK LETS GO", "@brightiiC You're welcome!", "@brightiiC We don't have plans to bring them to our menu but feel free to let us know what you'd like to see at https://t.co/1BxewVH8JT. You never know what might show up!", "@brightiiC Thank YOU for sharing your feedback. It makes a difference. 💚", "@kariari21 Sounds amazing!", "@Jen_Murray70 It's oat for you, Jen! 😉🥰", "@kariari21 What are you excited to sip with oatmilk?", "@jamezshea Thanks for helping us introduce the delicious oatmilk to your fellow sippers! 😉", "@jensized We appreciate your patience, Jen! 😊💚", "@norrrrtz March 2nd in the US!", "@becca__xoxo_ https://t.co/w3eSkKSa6I", "@kfreshyo You're in for an amazing celebration!", "@Shot0fDepresso Yes, oatmilk will be available on the app starting tomorrow.", "@conor_murrayy Oatmilk. At Starbucks. What a great way to start March! https://t.co/yM8wLkDDdt", "@TexasRud Can't wait!", "@Md1819 Yes! It's available as ground coffee and K-Cup Pods. Find it near you: https://t.co/d0Yjhc79ju", "@TexasRud See you tomorrow?", "@becca__xoxo_ Prepare your taste buds for even more deliciousness!", "@brightiiC Can't wait for you to see what we have in store! 😋", "@ColleenIsChill It'll be at participating U.S. stores March 2, so most stores will offer it.", "@iDREWonyou An 8 oz serving of Oatly oatmilk has 7 grams of sugar per serving.", "@dontshootskrlx Best sister ever.", "@neportuqua It'll be at participating U.S. stores!", "@JessieMackie You got it: We’re excited to partner with Oatly to bring oatmilk to participating Starbucks stores in the US tomorrow, March 2.", "@NMarley1128 We’re excited to partner with Oatly to bring oatmilk to participating Starbucks stores in the US.", "@mymusemyflaaame You're not the only one! 🥰", "@IsolationActivi Starbucks dates with the one you love are the best!", "@coolgrey Please visit https://t.co/uYzFgFCdKD to learn more about Oatly carton recyclability and to find out if your community recycles the cartons.", "@GalacTrisSquad We're looking forward to it!", "@DieRenaissance It's at participating U.S. stores - which will definitely include many stores in Seattle &amp; Tacoma.", "@xangbar Yes! Starting March 2, you'll be able to  choose oatmilk as your milk option at participating US stores. When you open our app tomorrow, choose your beverage, tap “Milk,” and then pick “Oatmilk.”", "@hotynation SAME! What drink are you going to try first?", "@linklyx3 We heard you, Kelly! Can't wait to sip with you. 🥰", "Your patience will be deliciously rewarded March 2! https://t.co/IolObCK8Ek", "@christinaginesi Seeing you is the highlight of ours!", "@sadieeehdz We're glad you're enjoying it! What drink did you get with oatmilk today?", "@btallsalt3 On day 1, no less! We hope it's just the start of an amazing month.", "@Mary81bjc Awesome!", "@phiIsthiccbooty We sure are! 💚", "@For_Butlers Seriously! https://t.co/yM8wLkDDdt", "@justkittenya It will be at participating US stores tomorrow. All company-owned, and many licensed stores will offer it.", "@Bailey_Waltman We hope it's just the start of an amazing week!", "@Bailey_Waltman It will be at participating U.S. stores tomorrow, and many licensed locations will offer it as well!", "@F_R_Odo Please visit https://t.co/uYzFgFCdKD to learn more about allergens and certifications.", "@GloriaRodrii Yes! And starting tomorrow we'll have 2 new iced shaken espresso drinks to help you fall in love with oatmilk: https://t.co/7WDSsLrEiD", "@dezzloc Starting tomorrow, March 2nd, you'll be able to choose oatmilk as your milk option in your favorite Starbucks drinks!", "@Eleytwun Hawaii too! Participating stores all over the U.S.", "@alyssa_coop Here's to a delicious new future together. 💚", "@nygauth It's true! Tomorrow, we'll have the Iced Brown Sugar Oatmilk Shaken Espresso as well as the Honey Oatmilk Latte. https://t.co/yM8wLkDDdt", "@cinnamongrlfrnd hello. https://t.co/yM8wLkDDdt", "@stxphvniev Agreed. We're making it happen tomorrow. https://t.co/yM8wLkDDdt", "@voIcanicloves 🙌", "@hopelesspaopu (They are not kidding https://t.co/yM8wLkDDdt)", "@hello_Adriana You got it (tomorrow). https://t.co/yM8wLkDDdt", "@LJamesP1991 Tomorrow at participating US stores! https://t.co/yM8wLkDDdt", "@emilymepham1 You're going to love it with oatmilk!", "RT @missbossladykai: Starbucks is finally rolling out oat milk nationwide and my day is made 🥰", "@dawn_horan Happy sipping!", "@kkupksy Now you can enjoy your favorite drink anywhere you sip!", "@randykender That's awesome to hear!", "@aragooon_ You have a latte to enjoy!", "@OSCARViSiON13 There's always a reason for Iced Coffee! 😉😋", "@emilymepham1 Yay! What's your usual?", "@kessiejane11 Tomorrow! https://t.co/yM8wLkDDdt", "@SpaceCa53326233 Participating Starbucks stores in the U.S. will serve it, and many licensed stores (that's the term you were looking for!) will as well. Please check with your barista when you arrive tomorrow morning. ☺️", "@cheryl_tweeedy Sorry for the late response, but to answer your question: Yes! 😉", "@Violetworld Happy sipping!", "@LuvingMrsKasha Delicious choice! Love you too, btw. 💚", "@davebarish You never know! 😉", "@87Chill_ Of course!", "@SteveCallaway2 Enjoy!", "@meganmccluskeyy Hope it brightens up the day!", "@tppfreestyle It will be available starting tomorrow, March 2!", "@itsemilyduude Thank you for spreading the word!", "@joshGrana2 We hope your year just gets better from here.", "@rrmtexasboi We're writing this down. 😍", "@_JordiePoo It's true! It'll be at participating U.S. stores tomorrow, March 2.", "@Ruffles421620 So glad you've already found a delicious way to enjoy it! 💚", "@devonmcfeeley 💚", "@kelsie_leia98 We look forward to your daily visits! https://t.co/yM8wLkDDdt", "@tonyystankk We will have Oatmilk tomorrow! https://t.co/yM8wLkDDdt", "@1017BrooksSquad 🤔 https://t.co/yM8wLkDDdt", "@devonmcfeeley We're just one day away!", "@oxxxll It's true. https://t.co/yM8wLkDDdt", "@l0vetinabell Oatmilk will bein our U.S. stores starting March 2nd! https://t.co/yM8wLkDDdt", "@samanthabelle41 No more tears starting tomorrow, OK? https://t.co/yM8wLkDDdt", "@Phoenixs_Flame_ We're looking forward to how much you enjoy it!", "@prasannaaaa_ 🙌", "@sarahinkc Which drink are you most excited to add it to, friend?", "@urmomrosh We'll actually have it on March 2nd!", "@Hudson_Lhp Let us know how much you love it!", "@Hudson_Lhp What's going to be your first Oatmilk drink?", "@Grouchosauras We cannot guarantee that any of our beverages and foods are allergen free as we use shared equipment to store, prepare and serve them.", "@Phoenixs_Flame_ Yes! Starting March 2nd, you'll be able to choose oatmilk as your milk option in your favorite Starbucks drink.", "@cvakratsis Coffee date soon, Chrissy? 💚", "@captainmorggaan Same.", "@tayymariee02 It will soon! We're adding it to all U.S. stores on March 2. https://t.co/DqipJgzTBp", "@bribriforthewin How about... tomorrow? https://t.co/DqipJgzTBp", "@savfranzdorf We can't wait to hear how you enjoy it!", "@Kestrel_Rose We're happy to hear you've found some favorites! We welcome you to share your feedback at https://t.co/SPH9PuUUvR.", "@Ruffles421620 We are excited to offer it tomorrow! Which drink will you try it in first?", "@emilykub_ It will tomorrow! We're launching in US stores on March 2.", "@kaycee_345 Thanks for sharing the Oatmilk love!", "@nygauth What drink are you going to try it in first?", "@PartiikiddJay 💚", "@luxtides We're here for you whether you need a shoulder to cry on or a creamy and delicious plant-based milk made with oats.", "@c_delarosa21 SAME!", "@selinashiny A lot has been building up to this day, and we're happy to share the special occasion with you.", "@SweetButCreepyy It’s creamy and delicious and pairs perfectly in your favorite Starbucks beverage including the new Iced Brown Sugar Oatmilk Shaken Espresso and the Honey Oatmilk Latte.", "@Grimes_Gurl We’re excited to partner with Oatly to bring oatmilk to participating Starbucks stores in the US.", "@taylorhuling *hands you a tissue* we'd never joke about something so great! https://t.co/DqipJgzTBp", "So we heard you wanted oatmilk... Oatly is available at Starbucks starting March 2—add it to all of your favorite drinks! (US only) https://t.co/kPNnwtLN9V", "@_haileighhhh 💚💚", "@Brizzlefizz Sip sip, hooray!", "@tereee_u We can't wait to see you! 💚", "@evenparadise Cheers to the perfect start to the day!", "@87Chill_ What's your go-to drink to pair with it?", "@explosive_blood We love you too! 💚", "@jchowardSPEAKS Welcome, friend! 💚", "@ImThatKLA Now that's the color of love!", "@Rascal5623 Hope you had fun! 💚", "@davebarish Enjoy your sip down memory lane!", "@misteeybar Its true, it's truuuueee! 😉", "@LuvingMrsKasha What did you decide?", "@bellarosecasas We hope you got your refreshing cup!", "@sydlovessean It's definitely the perfect time to relax with your cup!", "@misteeybar Sounds like you have a winter favorite!", "@willsharksmith Enjoy!", "@scorzzz Cheers! 💚", "@mhmokay6 https://t.co/a6BHAhcpsm", "@shenani_gann Exactly! 😉💚", "@sydlovessean Cheers to weekend sipping!", "@allisonha5 True and true. 😉🥰", "@AmazingICT_Paul Sometimes we have to pause and appreciate our favorite cups!", "@beeplayswow Glad you found the perfect sip to stay cozy with!", "@Darth_Sonia Happy to hear!", "@Kestrel_Rose What's your go-to sip? 😋", "@sortaprettycool Some delicious things just can't wait! 😉", "@im2qut They know what you're capable of! 😉🌟", "@beeplayswow What did you decide to sip?", "@Dame_Champagne We appreciate your feedback, Lindsay! We'll keep this in mind.", "@alexadorstt Cheers! 😍🙌", "@rudeboiiromeo Cheers! 😋", "@PureAshanti We'd love to hear what you think! 😋", "@mandaa_v7 Happy Sunday! 💚", "@TashaThoinks We're happy to hear they're a favorite! 😋💚", "@ciarafinnegan_ Cheers! 😍🙌", "@MissSpoiledGirl We're happy to hear you're loving every sip! 😍", "@ALI_YOUNGMOULA Delish!", "@NyawiraNjoroge All delicious favorites! Cheers! 🙌💚", "@NyawiraNjoroge Sip, sip, hooray! What's your go-to? 😍", "@TaymarBianca_xx Have you tried an Iced Caramel Macchiato with hazelnut added?", "@NyawiraNjoroge Happy ordering! 😉💚", "@mollyk1996 We're thrilled you're loving every sip! Is it a new favorite? 😍", "@lianett03 We like your style. 💚", "@cash_lun Awesome to hear! 💚", "@ALI_YOUNGMOULA Nice! What did you enjoy?", "@swiftchampagne3 Enjoy! 💚", "@amanda13wall Happy to serve you! 💚", "@yumsterx3 We happen to speak that language! 😉", "@EverydayShevine Awesome to hear!", "@Janetfyb Especially when paired with a delicious Cinnamon Dolce Latte!", "@Just_Raine Kind cups are the best!", "@heymrosario https://t.co/dFFoXXZPrg", "@Dame_Champagne Hey Lindsay, you can order decaf espresso beverages on the app by choosing the beverage you're interested in and changing the shot option to decaf espresso. Hope this helps!", "@scorzzz Oatmilk will launch in all U.S. stores later this year!", "@yimmyashi We're happy to hear you enjoyed Nitro Cold Brew! 💚", "@HelloSmitty_ Sounds like you've found your favorite sip! 😍😋", "@ceciliamramire1 We're happy to hear you're a fan! 😋", "@cheyennejael Sounds like you've found a new favorite sip! 😋", "@harmonicwavez Not as cute as you! 🥰", "@arb100sf Looks awesome!", "@OnlyNathan Sounds perfect!", "@ruthsarahi31_ What a treat!", "@harmonicwavez Thanking you now! 😋", "@OnlyNathan What's your favorite snack to enjoy with it?", "@skookiee1013 Sounds like you've found a new favorite sip! 😋", "@maegankyla Is that your favorite sip, Maegan?", "@lawlpap We like your style. 😋", "@paigeguerrero3 Aww! 💚", "@Dracofav We'd love to hear what you think! 💚", "@Dracofav We're happy to hear you're loving it! Are you enjoying the Pistachio Latte hot or iced?", "@alisa2089 We're happy to hear you're loving it! 😋 Though seasonal favorites will come and go, we'll always have something delicious for you to try with your favorite sip!", "@Brizzlefizz What's your favorite drink to add it to, Bri?", "@averymariecx They're heaven-sent!", "@LaBelleShanell It's creamy, dreamy pistachio perfection! 💚", "@_haileighhhh Was it love at first sip?", "@carencera_ We're happy to hear you're loving it! 😋", "@cas_ste15 Come sip with us, friend! 💚", "@KatieGreenTrib Yes! 😍🙌☀️", "@E_Roqq We're happy to hear you're loving it!", "@diibydesign We like your style! Cheers!", "@diibydesign We're happy to hear you loved every sip! 😍 Is your favorite Pistachio Latte hot or cold?", "@OhYOUButterball Yum! Cheers! 💚", "@Copy_failed We're happy to hear you're a fan! 😋", "@OhYOUButterball Sip, sip, hooray! What is it? 😋", "@yagirlya__ Sounds like you've found your favorite sip. 😍😋", "@luvvjack Do you have a favorite? 😋", "@kd0llas We're happy to hear you think it's out of this world! 😋🌎", "@babyycakessxo Sounds like you've found your favorite sip! 😍", "@navajoweeb Sip sip, hooray!", "@OhHelloMedusa We 💚 you too!", "@fadedsuh We're happy to hear you're loving them! 😋", "@GabbySteele3 Cheers! 😋💚", "@ScooterbugFaw Happy Birthday! 💚", "@mayyyrrra_ Yum! 😋 Cheers! 💚", "@mayyyrrra_ Always! 😊 What's your sip?", "@srayanne_ Cheers!", "@PrettyLittleMo_ Sounds like you've found your favorite sip. 😋", "@TionnaLashae__ What is it? 😋", "@fernandotl Cheers! 💚", "@jaymarlow_ We offer all kinds of ways for you to enjoy great Starbucks coffees at home! Check them out at https://t.co/mU47fw4rFv", "@PenyChristopher Cheers! 💚", "@rundeirun That is wonderful to hear! Thank you so much for sharing your positive experience with us. 💚", "@cathyylu We're happy to hear it's a favorite! 😋", "@haIosxangeI We're happy to hear you've found a new sip to love! 💚", "@GailzHurst Yes, Starbucks Delivers is available on Uber Eats in all 50 states. Check to see if it's near you: https://t.co/FT9Kh0PvhK", "@rachelzaas Boss move!", "@lindacaughman Both delish choices!", "@KristenMcPeekTV Thanks for stopping by!", "@rhyyan_ We're happy to hear you're loving them! 😋", "@ayohvnna Sounds like you've found your favorite sip! 😋", "@Laye_La_Ali We're happy to hear you're loving it! 💚", "@xox_jessss We're thrilled you're loving every sip! 😍 Is it a new favorite?", "@vibrant_elocin Sounds like you've found your favorite sip! 😍😋", "@PostOpPrincess We're happy to hear it's a favorite! 💚", "@PenyChristopher We're happy to hear you're loving it! Is it a new favorite? 😋", "@pomegranatesky_ Starbucks Delivers is now available in all 50 states in the U.S. To see if Starbucks Delivers is available near you visit: https://t.co/8TzwEl1eav", "@mmoonniikkaaaa We're happy to hear you're loving it! 😋", "@tardnum Looking forward to our next sip together. 🙂", "@tardnum Some days you need a Frappuccino® drink, some days you need a cold brew. 😉", "@tardnum Both excellent choices. Let us know which one you choose!", "@Sweetweet64 Sipping your favorite is a great way to start your day!", "@emsplace1 Your secret is safe with us. 😉", "@caruiz516 Yesss! 🙌", "@jenchirpchirp The math checks out.", "@smilesisdope It sounds like you'd enjoy our Caffè Mocha! Our rich, full-bodied espresso combined with bittersweet mocha sauce and steamed milk, then topped with sweetened whipped cream. The classic coffee drink that always sweetly satisfies. https://t.co/xwfUVRSDEg", "@MaddieMLG To be fair though, it's never too cold.", "@helenelizabethx There's nothing boring about sipping your favorite. 💚", "@elliieexoo We love sharing a cozy sip with you. 💚", "@niaaaaax_ You can order this handcrafted hot tea beverage by its official name in stores or via the mobile app: Honey Citrus Mint Tea! https://t.co/l0hs5sEYiQ", "@theefiresign We know what we did. 😉", "@_whitners_ Looking forward to our sweet reunion. 💚", "@MeImJames There we go!", "@kaitlineliza4 Mother nature doesn't decide what's delicious!", "@EliseMichelle We recommend a decaf Iced Americano instead!", "@Kiesey78 We're here for you! 💚", "@Sauda_Malkia Based on the replies... nobody", "@IsrealCasiano Cheers to favorites no matter the weather!", "@Kiesey78 We are suggesting that it can never be too cold for iced coffee, using Twitter features to joke about how fans of the drink enjoy and celebrate it no matter the weather.", "@rchlwg We see you drooling. 😉", "@dogmomx2_1989 Correct!", "@KARLA_F0RNIA When you find the one, you know. Cheers to love in every sip. 💚", "@iiesme111 We hope you'll be enjoying one soon!", "@blametaryn Let us know when we need to get that order started. 😉", "@usetocook 🤨", "@GregoryMarrufo That's the spirit!", "@ronnockoch Ice cold?", "@Dev_thecreator No chance!", "@charlisrae Ever.", "@k_ockout We can't wait for you to give one a try!\nhttps://t.co/6kSCBONUq5", "@DanicaDavid_ There's nothing more delicious than discovering a new fave. Cheers, friend!", "@coolcatcris Can't wait to see you!", "Reply if you think it's too cold for iced coffee. 👇😉", "@joooceyyy https://t.co/fSueiF5EfS", "@rundeirun We're happy to hear that our partners can put a smile on your face! 💚", "@rowena42 We're happy to hear that our partners can always make you smile!", "@lwarren89 Sounds like you're having a berry good day! 🍓", "@hmancentipede 🚨 New Starbucks fave found! 🚨", "@senia_garciaa White Cheddar and mozzarella cheeses on sourdough bread, topped with a Parmesan butter spread...it's the ultimate bite! 😍", "@JuliannaSeide We're always happy to put a smile on your face! 😊", "@JoeGig83 We're thrilled to hear that we could put a smile on your face!", "@Karen757Norfolk Now that is a brew-tiful sight! 😍", "@KatieBethJ It's the perfect day for some Cold Brewing and some Spring blooming! 🌸😊", "@BorgheseAmira We hope that you had a fa-brew-lous day! 💚", "@AmitSharmadel We're happy to be your workday companion!", "@cy_rus23x You're so welcome! 😉", "@its_kayli_b You really are amazing! 💚", "@InfusedGeek We 💚 you!", "@LifeAfteRob We do it all for you! 💚", "@misssummerrrr You + green tea = a matcha made in heaven! 💚", "@bominful 💚💚", "@katyinbloom Coffee date soon? 💚", "@bominful We hope you enjoyed every sip! 💚", "@christineladera Delicious! 💚", "@christineladera What's your favorite kind of bagel, Christine?", "@VannyG_303 We're pretty nuts about it too! 😉", "@pr1ncwss Cheers to finding the perfect drink! 💚", "@navajoweeb Is that your new favorite sip?", "@pr1ncwss That sounds like quite the sip! 😍", "@violetmartinezz Coffee date soon? 😉", "@TheTimiRay That sounds like a matcha made in heaven! 💚", "@amc1563 That sounds like a wonderful way to start the day! 💚", "@IAMHARVAY Come sip with us!", "@jungeuliet No question. 😉", "@byhapppyal We'd love to see you again! 💚", "@blldgshockey11 We love it when you find a new favorite!", "@YD5Racks Answer that call. 😉\nhttps://t.co/l0hs5sEYiQ", "@qyyyyyra We hope you'll be enjoying some soon.", "@nicahprz @drwnbautista Cheers, friend! We hope you enjoyed every sip.💚", "@ItsAriCampos Sip sip, hooray!", "@bareftessa It's pretty dreamy! 😍", "@MedusaOfTheSea You're so welcome! We hope you enjoyed every sip!", "@hiddenalchemy_ It's perfection in every sip!", "@NoTixNoLaundry We do it all for you. 💚", "@Evani_Atheris That definitely sounds like something worth celebrating! 💚", "@denae1c The feeling is mutual! 💚", "@denae1c The Honey Almondmilk Cold Brew is definitely a magical Cold Brew sip!", "@joooceyyy Looking forward to your visit.", "@kaleyymichelle We hope you start each day with a smile. 💚", "@joooceyyy What should we get started for you? 😉", "@jaynieleavy Cheers to sipping on our favorites!", "@schlarbae Neither will seeing you smile. 💚", "@clashyVR6 We hope you enjoyed every sip!", "@cillaann_mtz Some of the best plans are the ones we didn't make. 😉", "@beautiful9195 Thank you for making us part of your day. 💚", "@sierradouglasc It sounds like you're winning! 💚", "@JustYourGinger_ That sounds like a wonderful way to start the day!", "@ChihiroKasa Cheers to finding a new favorite sip!", "@knnxs_ Cheers to delish new favorites!", "@dogqueenv It's so delish!", "@my_cosmic_chaos Glad you enjoy them!", "@ChavezSarena Each bite has us on cloud 9! 😍", "@UncleKhi What's your favorite kind of bagel, friend?", "@ElizabethhhLynn Sorry about that! The slow steep time limits the amount we can make daily, so it’s only available while supplies last.", "@byhapppyal *Chef's kiss!*", "@xlhottie It's creamy, dreamy, pistachio perfection!", "@tiaa1622 Cheers to delicious! 💚", "@Taiii_Taiiii Give it a try and let us know what you think!", "@cherrybabbyyy It's a match made in heaven!", "@aashleylizette4 Sorry about that! The slow steep time limits the amount we can make daily, so it’s only available while supplies last.", "@fleurpixi Enjoy every sip of happiness!", "@strooooh We're glad you've discovered this today!", "@myobviousmotive 400 Stars may be redeemed for a packaged coffee item such as whole bean coffee, or select merchandise up to $20. Packaged coffee and merchandise availability may vary by store location.", "@garner_erik Cheers to enjoying every sip! 💚", "@tiaa1622 Is that your new favorite sip?", "@ColdBoy__Vic02 Cheers, friend! We hope you enjoy every sip.", "@angiejanicek Seasonal flavors come and go, but we'll always have delicious new drink for you to discover!", "@tfoxster You're in the right place! Please share the details in a DM and we'll be happy to pass it along to the right team. 💚", "@kalifkoen21 If you just can't wait for the holidays, you can recapture a touch of festive flavor with a Caramel Macchiato made with blonde espresso and extra caramel sauce.", "@markyarm What a throwback!", "@mooshdraws Our Siren has a special story! You can read about it here: https://t.co/bmVACf56sC", "@yousaforce Now more than ever, we must come together to affirm specifically that Black lives matter and confront racism in our communities.", "@Rinzler1836 Not at all. 💚", "@TherealShy___ Peppermint syrup is available year-round to mint up your mocha!", "@_lrhx It's the perfect treat to pair with your favorite sip! 💚", "RT @StarbucksNews: Join The @Starbucks Foundation in supporting the American Red Cross Disaster Relief. Your donation will help the Red Cro…", "@garner_erik What's your favorite drink to enjoy with it, Erik?", "@GiullianaVz It's a winning sip! 💚", "@Spoileddee_ It's a top tier sip! 💚", "@Keep_YaEye_OnMe Enjoy!", "@danixla_ They're so creamy and dreamy! Do you get yours iced or hot, Daniela?", "@Cescbe Sorry, since it is currently only a regional beverage oatmilk is not available as a modifier in the Starbucks App.", "@brianna63191921 Starbucks Delivers is now available in all 50 states in the U.S. To see if Starbucks Delivers is available near you visit: https://t.co/8TzwEliPz5", "@fxhmidx Can't wait to share that sweet sip with you!", "@madeline_west_ Yes!", "@jvarvel74 Almost. 😉", "@haleyvictoria13 Next month!", "@hunterbear1303 💚", "@MELNCOMPANY It's a par-tea for our tastebuds!", "@hunterbear1303 That sounds like a match made in heaven!", "@__TheJoeGallery 💚💚", "@hunterbear1303 They're the perfect treat to pair with your favorite sip!", "@gfx_kid Come sip with us! 💚", "@__TheJoeGallery Cheers to the perfect matcha! 💚", "@brothercaramel Come see us, friend!", "@lilysworld129 Thanks, friend! What's your favorite kind of Cold Brew?", "@itsyoncaee It's a top tier sip! 💚", "@jazmyn_mallory We couldn't agree more! Cheers to the perfect sip, Jazmyn! 💚", "@adreaglz What's your favorite sip to pair with it, friend?", "@mollysabine We love it when you find a new favorite!", "@mollysabine It's a pistachio flavor explosion!", "@goldenyenn Cheers to that first sip feeling and finding new favorites!", "@maarrrrrre It's delicious any way you say it. 😉", "@brwneyesblktea Vanilla Sweet Cream Cold Brew with some caramel! \nhttps://t.co/EHFQ1D1Tjz", "@SamsungNeptunia Thanks, friend. We'll keep your feedback in mind. Enjoy!", "@chaiporfavor We hope it put a little smile in your heart. 💚 https://t.co/I6nsuGB6z7", "@moonquarius https://t.co/YvaTFWh8qa", "@marianariosrmz1 You're welcome. Sip happy, friend!", "@SamsungNeptunia Is it your go-to?", "@FatimaaaTorress Resistance is futile. See you soon? 😉", "@marianariosrmz1 Here's to a year full of delicious firsts. https://t.co/PRsmWV1Uj5", "@Mosseyroc If any game needed a change, it would be Monday. 😉", "@JoJoe89309852 You rang? 😉", "@moonquarius Can't wait to see you!", "@tuckyy_ Cheers to pistachio perfection! 💚", "@katiemcknightt Delicious! 💚", "@katiemcknightt What's your favorite kind of muffin, Katie?", "@prettyshonniee That sounds like the perfect daily routine! 😍", "@Karin36509214 We encourage you to reach out directly to the local stores in your country regarding their available menu items.", "@VoraNoKie What's your favorite drink to order with them?", "@diibydesign Give it a try and let us know what you think! 💚", "@JocelynJoon That Honey Citrus Mint Tea is always a hit!", "@AbPasillas Looking forward to sharing an amazing sip with you!", "@briasimoneeee Cheers to love at first sip!", "@emilybasquiat Cheers to life-changing sips!", "@My7Suns Cheers to your peachy perfect sip!", "@coche1234 We love it when you find your perfect matcha!", "@tiaraamacoleee That sip is an overachiever and proud of it!", "@JosePratts5 We hope to see you soon!", "Frosty feels. ❄️ #ColdBrew https://t.co/SoXotuimwh", "@alyssa_bananas Glad you enjoyed it! 😊", "@moms2ontwittter https://t.co/moPOHB6kqR", "@VanessammmSmith Sorry about that! The slow steep time limits the amount we can make daily, so it’s only available while supplies last.", "@tabriajai We hope you enjoy every sip!", "@aoiarubam Looking forward to satisfying that craving with you!", "@alyssa_bananas Have you tried our Vanilla Sweet Cream Cold Brew yet? \nhttps://t.co/EHFQ1D1Tjz", "@madisonmdd No judgement today or any day. Sip happy, friend! 💚", "@AshleySandborn Wednesday doesn't stand a chance.", "@TheDivineMrsCM You're welcome. We're glad you're loving every sip!", "@moms2ontwittter We hope you loved every sip!", "@cameroncalder13 I am so sorry to hear one of your favorites has been discontinued. However, if you'd like to see it back on our menu, please leave us feedback at https://t.co/SPH9PuUUvR. Thank you. -Kevin", "@miwa_nchu 💚", "@grisellex3 We do in select Midwest stores, and will have it nationwide next month!", "@Marisol_mari1 Our mobile app is the best place to check store hours near you, or the store locator on our website: https://t.co/KK8sA8lD1k", "@_Cecilialazo Happy Birthday! 💚", "@taylscoughlin That's a pretty delicious level up. 🙂", "@Taylorschott14 Sip, sip, hooray! 😍💚", "@miwa_nchu The best part of the day is sipping with you!", "@DiDisthename_ Always a winner. We hope you enjoy every sip!", "@melodyzimm1 https://t.co/DeTmEutK8w", "@LifeofJordie We're thrilled you're loving it!", "@suitercul We love that you're loving it! Do you have a favorite sip to pair with it?", "@trinityeugenio We're happy to hear you're loving it! 😍", "@midtorred Cheers!", "@melodyzimm1 Glad it brought some joy to your day. Cheers to that first sip feeling!", "@ans_lane18 We know what we did. 😉", "@Super_McToaster Sounds like love at first sip! 😋", "@tvjames Yes, just let them know you've made a mobile order when you arrive!", "@kaatieegiibson Glad you found your perfect sip! 💚", "@JaysenGold It's never too early to start the #PSL countdown.", "@JoshJuache01 We're happy to hear you're a fan! 😋", "@gymgrl98 We are opening new stores globally every year, so we recommend submitting your location suggestion to https://t.co/SPH9PuUUvR", "@justambsss We're happy to hear it's a favorite! 💚", "@bay112747 Sorry, since it is currently only a regional beverage oatmilk is not available as a modifier in the Starbucks App.", "@tianaleiii Cheers! 😍😋", "@_Tianaxoxo We're happy to hear you're a fan! 😍", "@_shelby_rose 💚💚", "@Karin36509214 Good news, Karin. Toffeenut syrup is available all year round!", "@249be35thst Starbucks Delivers is now available in all 50 states in the U.S. To see if Starbucks Delivers is available near you visit: https://t.co/8TzwEl1eav", "@sarah_sullins19 Sounds like you've found a new favorite sip!", "@serahloreine It's entirely lovable. 💚", "@tamarcia99 Glad you found your happy place. 🥰", "@shawniebe1 Not a thing. 😉", "@trentajess We're happy to hear you're loving it! 😍", "@badbvthkim Cheers! 💚", "@skylar_106 Starbucks Delivers is now available in all 50 states in the U.S.! To see if Starbucks Delivers is available near you visit: https://t.co/8TzwEl1eav.", "@flimflamxx Looks like we're on the same page! 🥰", "@vtozil Happy to hear that!", "@JMcBride6 A delicious way to start the day!", "@goldensbiebs Enjoy!", "@dogmamasrock It will change the texture of the foam, but yes, you can have it with your choice of soymilk, almondmilk, or coconutmilk and add a flavored syrup to it as well.", "@1revor Thanks for visiting - we're glad you enjoyed this Starbucks Reserve coffee!", "@C0RALINEj That's correct, but we'll always be happy to help you find a new drink to love!", "@renzovaldezzz What's your favorite kind of refresher, friend?", "@flimflamxx Since you're a festive sipper, the Birthday Cake Pop sounds like the right one for you!", "@miwa_nchu 💚💚💚", "@ChanelJett What's your favorite sip to enjoy with it, friend?", "@sunfl0wersunday You're so welcome!", "@sunfl0wersunday Cheers to enjoying our favorites!", "@flimflamxx Of course, friend! That's wonderful to hear. If you let us know your favorite drink, we can help you find the right cake pop. 😊", "@lacey_nielsen98 That's awesome, Lacey! Thanks for being a part of it. 💚", "@pendragonly Awesome to hear, bestie! 💚", "@nurahzaidi We can't wait to see you! 💚", "@hayatxdoll Coffee date soon? 😉", "@sunfl0wersunday What's your favorite drink to enjoy with this? 💚", "@alwaysforskyler That sounds like the perfect way to start the day!", "@_1kmarie Welcome back! 🥰", "@Always_Jae See you soon?", "@neeyuhhh And we're the type to say yes and happily walk you through our menu! 😉💚", "@HeMoansNik What did you sip?", "@lacey_nielsen98 We love kind cups!", "@astoldbyMIKA We look forward to hearing what you think!", "@rvniya What do you enjoy with your sip?", "@0NLYDIESEL91 Sounds like an amazing cup!", "@SinceMCMXCIV The perfect Sunday sip!", "@astoldbyMIKA Our Pistachio Latte combines espresso with steamed milk, real pistachio and a brown buttery topping for a creamy, comforting and cozy beverage.", "@pendragonly Your winter go-to?", "@brefromthepack That's awesome to hear!", "@carlaadefreitas Okay but you're right! 😋", "@LegacyofGena 💚 https://t.co/6mbCOkPAJJ", "@OfficialMarinaX We hope you got your cozy cup!", "@miwa_nchu We love your taste!", "@MrSoprano21 Good morning, indeed! 🌞", "@TeAmoShante 💚", "@TeAmoShante Enjoy what you hear!", "@KittyAceAzula15 Cheers to that first sip feeling! 😋🙌", "@vivizares Do you have a favorite? 😋", "@caneswagg Cheers!", "@ThePsyence It's definitely a fave! 😋", "@jailenelopez560 Currently, oatmilk is available regionally in U.S. stores. It will launch in all U.S. stores later this year!", "@TheKawaiiSora Cheers! 😍", "@kenia_wyd Have you tried the Honey Almondmilk Cold Brew? 😋 https://t.co/DZcTgtmtk6", "@AHartofFire Cheers! 💚", "@FernandoMichhel Cheers! 💚", "@seaofchocolat Cheers! 💚", "@sabittariuss We're happy to hear you're a fan! 😍😋", "@badbvthkim What are your favorites? 😋", "@alicia_garvey Cheers! 😍🙌", "@_nimaaibrahim Yum! 😋 Cheers to finding a new sip to love!", "@NaazNazzz We're happy to hear it's a favorite! 😋 Is there a sip you like to pair it with?", "@forevertaeh Cheers! 😍😋", "@_nimaaibrahim Sip, sip, hooray! What is it? 😍", "@hidingsolo Yum! Sounds like you've found a new favorite sip! 😋", "@kingdavib Sounds like you've found a new favorite sip! 😍", "@fashion_kween69 😋💚", "@b_colunga3 Yum! 😋 Sounds like you've found a new favorite sip!", "@YooyaaLu Cheers!", "@bvgaa Sounds like you've found a new favorite sip. 😋", "@pbasedd We're thrilled you're loving it! Are you enjoying yours hot or iced? 😋", "@GiveEm_Buckets What's your go-to sip? 😍", "@bbyflack0 We're happy to hear you've found your favorite sip! 😋", "@elizughhbeth Sounds like you've found a new favorite sip. 😋", "@veroholley Cheers! 💚", "@loveIanguaqe Sounds like you've found a new favorite! 😍", "@ayeebria We're happy to hear it's a favorite! 😋", "@JonathanHorswel Enjoy the day! 🌞", "@nashal_y We love sipping with you! 😍", "@ZackKusnir Brewtiful! ✨", "@ItsMeAshDee We're happy to hear you're a fan! 😋", "@aleeciaxx Cold Brew is a cold coffee concentrate that baristas top with water and ice. Nitro Cold Brew is infused with nitrogen to create a velvety-smooth finish. https://t.co/lQcBS8Rj2J", "@HashJelani Do you have a favorite? 😋", "@heidilaw16 We like your style! 😋", "@_itskimchii Sounds like you've found your favorite sip! 😋💚", "@veroholley We're thrilled you're a fan! Are you loving the Pistachio Latte hot or cold? 😋", "@jaebeomXD 💚💚💚", "@flimflamxx This depends on what you're sipping!", "@hattie0220 Happy Birthday! 🎉", "@Reetzy830 Love this! 💚", "@sixfootdee Hope to sip with you soon!", "@tctphoto Sip sip, hooray! 😍 Cheers to new favorites!", "@squidlife_ What's your go-to? 😋", "@maj0641 Cheers! 💚", "@jaebeomXD We're happy to hear you're a fan! 😋", "@Bt35Good Yep. https://t.co/TJBLVomdqd", "@skylar_106 Sounds like you've found your favorite sip! 😋", "@jewelsxt We love that you're loving it! 😍💚 Is your favorite Matcha Green Tea Latte hot or iced?", "@Perez14Lauren Sounds like you've found a new favorite sip! 😋", "RT @Kevin_Johnson: We stand in support of our AAPI partners and communities in condemning the rise in racist attacks. This is our shared re…", "@brizhane_ We love that you're loving it! 😋", "@megaanwyn We're happy to hear they're a favorite! 💚", "@nanalyn303 Yum! 😋", "@merzmurphy Cheers to that first sip feeling! 😊💚", "@stillgold3 Cheers to finding your favorite sip! 😍😋", "@ashley_rusch We'd love to hear what you think if you try one! 💚 https://t.co/TJBLVomdqd", "@RealQueenBrie Love it! 😍 Cheers!", "@bbyzxs You can't go wrong with a simply classic sip!", "@shahadhismath_ We hope you'll soon be reunited with this sweet sip!", "@Moumin_Quazi The Cold Brew love is real! 🥰", "@duhitsdar It had to be done. 😎", "@BreeLouIn It's a foolproof way to summon all your favorites. 😉", "@ashley_rusch Have you had a chance to try the Salted Caramel Cream Cold Brew? 😍", "@RealQueenBrie What's your go-to Cold Brew? 😋", "@JaziDes Cheers! 😍", "@ageguyera21 Do you have a favorite? 😋", "@ChurtHurt What's your go-to Cold Brew? 😋", "@Leah406tothe509 💚💚", "@nguygie Cheers! 💚", "@Leah406tothe509 We like your style! 🙌 Cheers!", "@ParkerUwaiz Do you have a favorite Frappuccino? 😋", "@mkay_larshayy What is it? 😋", "@dtb11 We like your style! 😍 Cheers!", "@sklrari Cheers! 💚", "@sklrari We're happy to hear you've found your favorite sip. 😋", "@_AniyaMaria We're happy to hear you're loving it. 😋", "@AriannaYtselle We're happy to hear you're a fan. 😋", "@OhThatGirlAngel Cheers! 💚", "@OhThatGirlAngel Sip, sip, hooray! What is it? 😍", "@ParkerUwaiz Have you had a chance to try the Honey Almondmilk Cold Brew?", "@nandron Do you have a favorite? 😋", "@emmywallace84 Cheers to finding your go-to sip! 😋", "@Leah406tothe509 What's your go-to Cold Brew? 😍", "@dtb11 How do you love your Cold Brew? 😋", "@celenaleonn A favorite sip is a favorite sip no matter what. 😋", "@KaylaZampino Sip, sip, hooray! 😋", "@shhherecomesmom We're happy to hear you're loving it! 😍", "@ashleysparkle Delicious choice!", "@caffeinatedwif1 Cheers! 💚", "@marianeck293 A favorite sip is a favorite sip. 😉", "@danielleaboud Cheers! 😍", "@soggycheesefry Delicious choice. 😋 https://t.co/TJBLVomdqd", "@finnelljenny1 Yum! 😍", "@nessacelio A delightful duo! 😋", "@aluskee What's your go-to Cold Brew?", "@LBuckeye77 Cheers! 😋", "@cancer_warrior7 We like your style! 😍", "@Mooflower Cheers! 💚", "@GeFicha Cheers!", "@terriannereed14 Sounds like you've found some new favorites! 😋", "@lilbratjanelle Cheers! 😊💚", "@jason_frierson We're happy to be part of your day! 💚", "@lopestka Sounds like you've found a seasonal favorite! 😋", "@Yehitsgaby_ We're happy to hear it's among your favorites! 😋", "@RyanLordan7625 We're happy to hear you've found your go-to sip!", "@geminibtsvt Cheers! 😋", "@specialjay150 Cheers! 😍🙌", "@stripedpacific Cheers! 💚", "@cmissana7 We're happy to hear it's a favorite! 😋", "@CaydencesMommy We like your style! 😋", "@LindseyOlin Cheers! 💚", "@Pestrada1010 We're happy to hear you've found a sip to love! 💚", "@hdano15 We're happy to hear you've found some favorites! 😋💚", "@abxgvil Hey, bestie. 🥰", "@al3xandriaaaa Glad you think they're a hit!", "@GretchenVB Dad's always bean brewing these ways to espresso themselves.", "@desideeznutss Glad to see you reunited with your favorite sip! 🥰", "@AiyanahStewart We're happy to hear they're your favorite! 😍😋", "@arlette_gomezz That first sip feeling! 😊💚", "@MarieSunflowerr We hope you'll be enjoying one soon!", "@AbooMikaeel Cheers! 💚", "@ashy_314 Cheers to finding love in every sip. 💚", "@_kelsi__ Is that your go-to sip? 😍", "@MNISNI We're happy to hear you're a fan! 😋", "@Lizzifeth We're happy to hear you're loving them! 💚", "@AbooMikaeel What's your go-to? 😋", "@opinionatedINTJ We're happy to hear you loved it! 😍 Is it a new favorite?", "@lilbratjanelle Do you have a favorite? 😋", "@mclovenxoxo Sounds like you've found your favorite sip! 😋", "@fs_4710 Do you have a favorite? 😋", "@mrskingle Cheers to that! 💚", "@sammieorosco We're happy to hear it's a favorite! 😋", "@_Yinng We love a lemonade addition! 😋", "@jareli__ Cheers! 💚", "@SamsungNeptunia https://t.co/xk6yubee02", "@benootie https://t.co/OBbXRUbWtE", "@ItsMeNeachelle Delish! Glad you're enjoying it.", "@elainerfarah Stay powerful, friend!", "@benootie https://t.co/ZCliDp1Owd", "@SamsungNeptunia Get ready to catch that cold brew Friday feeling! 🥰", "@SamsungNeptunia Looking forward to enjoying one with you!", "@ShalisaLaSha You can order this handcrafted hot tea beverage by its official name in stores or via the mobile app: Honey Citrus Mint Tea! https://t.co/l0hs5sEYiQ", "@SoleilCo3 On it!\nhttps://t.co/TJBLVomdqd", "@_Kriistiie Click to send. 😉\nhttps://t.co/TJBLVomdqd", "@MikeyYeilding89 Coming right up!\nhttps://t.co/ogx0qcwc8U", "@Catrina_Marie9 Yum! 😋", "@benootie Salted Caramel Cream Cold Brew send order: \nhttps://t.co/TJBLVomdqd", "@elainerfarah Knowledge is power! 😉", "@TessG07 We hope you'll be enjoying one soon!", "@desideeznutss Looking forward to your visit!", "@han_brem Coming right up! \nhttps://t.co/3UVyYA0o8x", "@lovelylexibee Quest lines don't need to be linear. Unlock the achievement in your most delicious way!", "@SamsungNeptunia Tweet received. Click to receive Cold Brew order:\nhttps://t.co/KBuIr2sp2v", "@JustBein_Neisha Enjoy that sweet sip!", "@jkline120 We're so glad you love it!", "@reneelaaurenn We hope you'll be enjoying one soon!", "@tiffunfiltered Wanting coffee is reason enough. 😉", "@summerchic45 Happy cold brew sips will always warm your heart regardless of the outside temperature!", "@29Altaird Click to send. 😉\nhttps://t.co/TJBLVomdqd", "@summerchic45 https://t.co/28sYdLRdyQ", "@Badd_Assets It's just a click away!\nhttps://t.co/KBuIr2sp2v", "@BarnabasRanaya It could be waiting for you! \nhttps://t.co/3UVyYA0o8x", "@mosko_l Coming right up! \nhttps://t.co/ogx0qcwc8U", "@hackeychicken Let us know when to get that started for you! \nhttps://t.co/ogx0qcwc8U", "@godsgirlkarennn Delish!", "@minngolf You can use the app to summon it. 😉\nhttps://t.co/KBuIr2sp2v", "@frogprof And now we wait...", "@summerchic45 We're glad you can taste the love! 💚", "@babyycakessxo We're happy to make it for you. See you soon!", "@raychel71 That's it. That's the tweet. 😎", "@doanutfactory Welcome to the Cold Brew Crew!  😎", "@jessicagriffin_ It's definitely a hit!", "@mskimkelley Stay warm. Order in. It's okay. 💚", "@frogprof Try it and find out. 😉", "@niicaaxo Yes!", "@SmichaelH971 it works", "@kristiceratops 🙌", "@elenakellow nailed it", "cold brew send tweet", "@jaypxx23 That's a delish duo! That's it, that's the tweet. 💚", "@CSmithsonian19 Cheers to that Friday feeling! 💚", "@smb_akaSMB The Siren and cold brew are there for you!", "@v_carmenn 🥰", "@JenaLang It's always a good time for a cozy hot chocolate! 😊", "@WhoKali We'll get one started for you! https://t.co/oVuFMFOjqj", "@thiamorisuke 💚💚", "@adelleh2o *Chef's kiss*! 💚", "@thiamorisuke What's your favorite sip to enjoy with it, friend?", "@_xrameah Coffee date soon? 😉", "@karinaaaa___m Looking forward to sharing a sip with you!", "@samluvgood You're welcome!", "@samluvgood For the best experience of the beverage, we only offer tall and grande Nitro Cold Brew. With larger sizes, the Nitro cascade leaves the beverage before it can be consumed.", "@ashfineness So glad you enjoy it!", "@berthaperez101 It's a flavor explosion!", "@ashfineness We couldn't have described it any better. 😋", "@zaysuaveee 🥰", "@dae__g We look forward to sharing that cozy sip with you!", "@CandeeCANDII_ Your bae sounds like a keeper! 💚", "@NickCribari It's creamy, dreamy, pistachio perfection! 💚", "@Sarahj1919 Enjoy that sweet sip! 😋", "@erikaawebster Delish! 😋", "@_Deleonn It's everything! 💚", "@Menier11 Sorry, this one is just here for a limited time. We hope you're enjoying every sip while it lasts.", "@erniechiara You're welcome. 🙂", "@stephjean_louis Cheers to life-changing sips!", "@dianaalicia26 We're so happy that you've been reunited with your favorite sip!", "@erniechiara Our Flat Whites have ristretto shots vs. espresso shots. Ristretto shots use less water and due to this, the final shot is more intense and a bit sweeter than a traditional espresso shot. In addition, there's no foam on our Flat Whites, whereas our latte beverages do have foam.", "@RylieNicoleL We're so happy to hear that we could put a smile on your face!", "@RylieNicoleL Aw, shucks! 🥰 The feeling is mutual.", "@grewyourwings If you just can't wait for the holidays, you might enjoy a Caramel Macchiato made with blonde espresso and extra caramel sauce.", "@skyxbluesilk Cheers to love at first sip!", "@FabulousShake They make every day taste like your birthday! 🥳", "@JammiRacca3 We hope your wish comes true soon!", "@raytheegreat Delish! Looking forward to your visit.", "@jaredais Hi, friend!", "@SimplyErika__ Cheers to the Vanilla Sweet Cream Cold Brew life!", "@jaredais We hope you'll think it tastes as good as it looks!\nhttps://t.co/AeCDuzspKR", "@Mrs_Ramirez94 https://t.co/DzI46I63xK", "@MissSneed Looking forward to it! 💚", "@MayaaaaGs Cheers to the love in every sip!", "@MissSneed Can't wait to share a sip with you!", "@lisadanaemusic Enjoy every sip of happiness. 🥰", "@Mrs_Ramirez94 Good news, Sammi. That Peppermint Mocha isn't going anywhere. Peppermint syrup is available all year long!", "@jaylohh https://t.co/uswGBZ3Qm4", "@ShawnaL33w Cheers to life-changing sips!", "@_RubyyyN We hope you'll be enjoying one soon!", "@emchantment 😘", "@esterlla94 Looking forward to our next sip together.", "@XSenseiSavageX Coming right up! 😉", "@kelly_nimmo1 Delish! 😋", "@Jadealexus_94 That's the tweet and that's the tea! \nhttps://t.co/l0hs5sEYiQ", "@Raph_Escoe That's a delish way to customize a cozy sip!", "@dejajezell Answer the call. 😉\nhttps://t.co/KBuIr2sp2v", "@emchantment New high score! Glad you're enjoying every amazing sip. 😊", "@NekaLovesSky Looking forward to sharing a cozy sip with you!", "@esterlla94 We love it when you find a new fav!", "@krystda We hope your wish comes true soon. 💚", "@Marta_Monkeys It would taste even better. 😉 We hope you'll be enjoying one soon.", "@_AllysSunshine We hope we'll be sharing a sip together soon. 💚", "@ashtheearthling Here's hoping thinking leads to sipping. 😉", "@jessiebarco We love it when you find a new favorite!", "@LazyChick_83 https://t.co/zb5jgBLldl", "@Tasja75 Happy to sip-lebrate with you! 💚", "@moms2ontwittter 🙌", "@C_Boogieee_ Hi Cari, while this beverage is made with honey derived from bees, it does not contain any dairy.", "@GGArnoldwrites Cheers to velvet sips!", "@estherbower_tv That's awesome to hear! ✨", "@chrissy7661 Happy Sipping!", "@bruceblackford https://t.co/q1zk3P9fqd", "@michell83766826 Classic syrup contains Sugar, Water, Natural Flavors, Potassium Sorbate, Citric Acid. You can find these details within the ingredients list found on our website or via the Starbucks app. Here's an example: https://t.co/gVQGzRtorp", "@ShannonArrighi How do you customize your cold brew with white mocha?", "@lorax313 Yum! We'll keep that in mind. 🙂", "@LaurenA723 You're welcome. Good luck! 🙂", "@KennethCassel11 Awesome! We would love to hear what you think. 😍", "@LaurenA723 In most states, you must be at least 16 years old (14 in Montana) to work for Starbucks. We recommend checking with your local store as well as viewing https://t.co/rRWz8nwuCx  for more details.", "@_femme9 We hope you'll be reunited with this savory sweet beverage soon!\nhttps://t.co/TJBLVomdqd", "@Samma6652 Always delicious!", "@LaurenA723 Sure!", "@anetmarie1986 For extra coziness!", "@bruceblackford Get ready for favorite overload! We're planning to launch oatmilk in all U.S. stores this year.", "@LaurenA723 Love you too! 💚", "@LaurenA723 We like the way you sip!", "@anetmarie1986 Hot or iced?", "@LazyChick_83 We do have hot chocolate all year! We look forward to sharing a cozy white hot chocolate sip with you soon. 💚", "@_haileighhhh Indeed! 😋", "@Target A venti Starbucks with a grande Target inside, with a tall Starbucks inside that. \n\nAnd extra caramel drizzle. 😍", "@dogmamasrock Our Flat Whites have ristretto shots vs. espresso shots. Ristretto shots use less water and, due to this, the final shot is more intense and a bit sweeter than a traditional espresso shot. In addition, there's no foam on our Flat Whites, whereas our latte beverages do have foam.", "@mamaasquishy We're happy to hear you're loving every sip! 💚", "@xmoondreams A favorite sip is a favorite sip. 😋", "@queenieq79 It's a pistachio flavor explosion!", "@juhlissuhh You're welcome! We'd love to hear what you think!", "Hot or cold, do non-dairy your way. The Honey Almondmilk Flat White and Honey Almondmilk Cold Brew are here. 🍯 https://t.co/zaI0dsCku2", "@leftyman231 Yum!", "@theswartzfam13 We knew you'd understand! 💚", "@QueenAshley75 Cheers to true brew love!", "@FrostbiteFist Yum!", "@bay1497 Delicious twist!", "@Animal_Nurse Cheers!", "@medinajames Glad you love it!", "@MsCrysStl Agreed!", "@KennethCassel11 Brewtiful! How was your sip?", "@dorothy_kylie Delicious choice!", "@juhlissuhh If you're loving the Pistachio Latte you may like it iced or as a blended Frappuccino® beverage! We also have a variety of Cold Brew that you could add the Pistachio sauce to. 😋", "@TessG07 We knew you'd agree! 😉", "@smaewest Sometimes a cold cup is coziest!", "@juhlissuhh We're happy to hear it's a new favorite! 😍 Are you loving yours hot or iced?", "@LyndseyBerta Awesome!", "@alllextaylor It's a wonderful holiday treat!", "@ploofff Enjoy!", "@LyndseyBerta Nice! Have you tried our Nitro Cold Brew with Cinnamon Almondmilk Foam?", "@ploofff Our Decaf Iced Americano can help!", "@aareavis Snow brewtiful! 😍", "@_haileighhhh Ohhhh yes! 😍", "@JoJoe89309852 Which one is your go-to?", "@davidbrunelle ~ you do you ~", "@leen2417 Lovin' your style! 😋", "@manofsteel83 We're glad you found your favorites! 😊", "@kmarvay 💚", "@dawgsindahouse1 Can't wait to sip with you! https://t.co/r0CbULHFNp", "What's your favorite drink and why is it Cold Brew?", "@pretttyyyt Cheers to enjoying every sip!", "@gremlinprobably Enough said!", "@dynds Cheers!", "@attack_moose While we don't have a 1000 star tier, you can shoot for taking home a cup, your favorite at-home coffee, and a delicious handcrafted sip!", "@bombasshonesty Which cold brew did you get cozy with today?", "@extravicious Sounds like the perfect Valentine's Day sip! 💚", "@kmarvay https://t.co/mlqn2sx5IO", "@caica_ayamizuki We love you! 💚", "@90feetfromhome We're happy to hear you're loving it! 💚", "@hallrsc Sip, sip, hooray! 💚", "@dreadelarosa We recommend using your Starbucks app to check store hours near you. 💚", "@MissEricaCC We're thrilled you're loving it! 😍 Ask your barista to try your next one with Sriracha if you're looking to kick it up a notch! 😋", "@_jflowers We're happy to hear you're loving them! 💚"]}