{"tweets": "RT @hannahmontana: Nice to hear from you @MileyCyrus. It’s only been a decade. Dear @HannahMontana, I still love you 15 years later. #HMForever https://t.co/TBqZd5aOKh I miss u guys so much. 🤖 https://t.co/eKnXgWUPq3 https://t.co/ewDcDi2NZr Angels Like You music video filmed at the first Covid compliant concert of its size since the pandemic is out now. https://t.co/j5aAIMgpbN PALM SPRUNG 💕 https://t.co/cj55nLDiKM FML is the new NFT 🤡 https://t.co/ZesRKo8HQ6 RT @Spotify: “They laid, brick by brick, the path that I’m walking down right now.” @mileycyrus shares how @joanjett, @dollyparton and Stev… RT @Vevo: .@mileycyrus' \"Angels Like You\" includes scenes from her Covid-safe concert for vaccinated frontline and healthcare workers ❤️  L… We just have to do our part. I hope you love what I have made for you &amp; that you feel for just these few minutes that you were here in the crowd at the show with us. Soon.... 🕊 It’s been almost a year without live music. I desperately miss the connection it brings. I miss hearing your voices ring out in harmony with my own. I miss YOU. With vaccines becoming more available the dream of us all being reunited is getting closer to becoming a reality. I never would have thought when I wrote “Angels” that the first time I would be performing this song or shooting a music video would be in a time like this. Angels Like You video OuT NoW! Shot on 2/7/21 at #TikTokTailgate , the first out door covid compliant concert of its size since the pandemic changed our lives forever. https://t.co/1FrPM7fpiu https://t.co/rR0J8hI6hX .@LilNasX took every single one of these photos. https://t.co/dsMe59Fejw https://t.co/y4i6cfWqzJ I’m a guest on this week’s episode of Rock This with Allison Hagendorf! Listen to it now only on @SpotifyPodcasts #RockThis https://t.co/vhcizGaHAX CONSIDER THIS BOUGHT. Adding to my HS collection immediately. https://t.co/cvd7kn3Lwl RT @_bangxrz: my golden g string finally came! 😭 https://t.co/i3Lo71PjrS WHEN IM NOT RUNNING GAME. IM RUNNING MY MF BUSINESS. \n\nLET’S RIDE. 🏍 @ColumbiaRecords https://t.co/Gspnq7IIal What Lily is really thinking when Hannah presses send on ANOTHER Hannah reveal. @LilNasX https://t.co/6JzjAsDOnj Can Hannah get a feature? #HannahSnow #HannahTheeStallion #HotGirlHannah https://t.co/0kh4LTjn6f You just had to be there. https://t.co/oWfKPxG0YV Precisely. https://t.co/Ue829rBDNa https://t.co/VYwPngxivM SMOKE TODAY DOWN TO THE FILTER! 🚬🤘🏻🎸🦾🤡🥀🎯🛠🦅\n\n#JustDontSmokeCigs \n#INeverQuit #UnlessItsCigarettes \n\n#WhenTheySay #IMissTheOldMiley #WheresHannahMontana  #ThisIsAnImposter https://t.co/yDrfenzJVK love. It never dies. 😭 💙💕🦴💌 ⛪️ over heels in love. Not sure I will ever sleep again because I can’t take my eyes off of her! Her halo shines for all to see and I can’t wait to show her off! It’s pretty cool having an Angel on a leash! She is illuminated by the aura of the late and great Mary Jane. Long live The stigma and stereotype that surrounds pit bulls tears me in two. This breed is incomparably loving. Just like humans nurture often overrides nature. I want to thank #lisachiarelli for her dedication in fighting for the lives of pit bulls &amp; finding me my perfect fit. I am head break a promise. I feel her here with me blessing this new member to my family who’s name is “Angel” because she was delivered to me by one... My Mary. It breaks my heart to know Angel was sleeping on concrete in a shelter for 3 months before finally making it home. Almost two months ago my best friend a rescued pit mix Mary Jane left this world. I knew she wasn’t gone for good. She had out lived the body she was in but she never said goodbye ..... with her eyes she whispered “See you soon Bestie”. Mary Jane defined loyalty and would never But I thought I lost you” “I thought I lost you when you ran away to try &amp; find me. I thought I'd never see your sweet face again. I turned around and you were gone &amp; on the days went.  I kept the moments that we were in. Cause I hoped in my heart you’d come back to me my friend. And now I got you... https://t.co/AX2BYAPOVm RT @BRITs: 💕 'Plastic Hearts', the 2020 album from @MileyCyrus, has gone #BRITcertified Silver! 💿 https://t.co/s0wziakKgj Break the internet. Not hearts. #MileyTok 💔 https://t.co/TB0l63QMJT CONFESSIONS OF A TEENAGE DRAMA QUEEN ☠️💕🦄🔪 ☠️💕🦄🔪☠️💕🦄🔪\n\n(yes they sold magazine telling teenagers that being single is vengeful... not just healthy &amp; acceptable!) https://t.co/B6UYHXA68e ThE beSt PaRt AbOuT VaLeNtInEs DaY Is HoW gOoD iT LeAveS eVeRyOnE fEeLiNg AbOuT ThEmSeLvEs! ☠️ https://t.co/2xQVzHUNxy HaPpY sHaMeLeSsLy MaStUrBaTe FoR 24 hOuRs wHiLe EaTiNg ChOcOlAtE dAy! 🌹\n\nSuCh A mEaNiNgFuL HoLiDaY bAsEd On LoViNg &amp;  ChErIsHiNg YoUrSeLf As 1 SoLiD fUlLy rEaLiZeD iNdiViDuAl WiTh No NeEd FoR eXtErNaL cOmPlEtIoN! https://t.co/4pIdvRvL3I Miley is here to wish you a Happy Valentines Day filled with a fuck ton of fucking. \n\nUnfortunately Hannah is here to remind you of Covid-19 which means no sex. https://t.co/sX6HxojOm7 @espnmma @JMarquezMMA Shave an MC into your chest hair and I am YOURS ❤️ Happy VDay and Congrats my love! https://t.co/HzPe2abJZW you ain’t listened to my new album plastic hearts out on all platforms and physically around the world say what?!? *Hannah Montana voice* https://t.co/9jRGKDnxCQ Man. Being single sucks. All I ever do is WHATEVER THE F❤️CK I WANT! Bahabahahahahabahahhahaha! https://t.co/8Ywj8I72QU PRE SHOW VIDEO I SEND TO EVERY BOY I KNOW ☠️ jkjkjk (you know you’re my one and only 😻) https://t.co/jlSTEpJfMG My RIDE OR DIE @BillyIdol &amp; @Stevestevens ROCKIN 🎸❤️ 💋  l https://t.co/wAexvKvERJ GUCCI GIRL ☠️💕#CustomNotCostume https://t.co/0bJuuYfN82 https://t.co/Eu8RGn800B HIGH AT THE SUPER BOWL 😜 https://t.co/BUIotflGh7 RT @DDLECOURS: In loving memory of all my exes, eat sh!t #PLASTICHEARTS 🖤🎸 https://t.co/xhO0zkNEsG RT @youtubemusic: It's a nice day for @MileyCyrus and @BillyIdol to rock 🤟 Relive their #SuperBowl Pre-Show performance now → https://t.co/… .@JoanJett I wouldn’t be ME without YOU. Thank you for being apart of my first show back for #SBLV 🏈💕🏈💕🏈💕🏈💕 https://t.co/uVFUBYr6r4 Save a horse. Ride a motorcycle. 🏍🏈💕🇺🇸☠️🏁🎲🎱🏴‍☠️ #LetsRide https://t.co/YU7HENnljq Who’s my Superman? @BillyIdol DUH! It’s a nice day for a white wedding! 💒☠️ https://t.co/XJ3IopYclQ One of my favorite small businesses is @mikesicecream in Nashville . Reply with yours and tag #BigConcertSmallBiz, then tune into @Verizon Big Concert for Small Business to watch me LIVE tonight after #SBLV at 11pm ET / 8pm PT #VerizonPartner https://t.co/FcwGKgEt44 RT @NYCHealthSystem: Check this out! Our awesome #HealthCareHeroes from NYC Health + Hospitals/Elmhurst who were featured in this @MileyCyr… https://t.co/m2Tculjqq5 @NFL #TikTokTailgate HOT IN THE CITY. 🏍 @BillyIdol https://t.co/68uwQOxEtG SOUNDCHECK &amp; then GAME ON! 💕🏈🏁☠️🖤💕🏈🏁☠️🖤💕🏈🏁☠️🖤💕🏈🏁☠️ https://t.co/ZyjNJWzNPo Me showing up to the @tiktok_us tailgate! #SBLV 🏈🏁💕🖤☠️🏍 #LetsRide https://t.co/3NtuQrxYcj RT @DDLECOURS: MILEY-BOWL!!!! 🎸🖤#PLASTICHEARTS #SBLV https://t.co/Sw3PUysacY THIRST TAP IN🤘🏈🏁☠️🖤 https://t.co/sWHcdn6iXJ Reply with your fave small biz using #BigConcertSmallBiz &amp; you can get a shoutout at Verizon’s Big Concert for Small Business on Sunday after #SBLV! Then tune into @Verizon on Twitter to watch me perform LIVE at 11pm ET / 8pm PT #VerizonPartner https://t.co/Rllbx1bolA BOSS BABY MC TAKES TAMPA! 🏈💕 @NFL @tiktok_us https://t.co/LHwGJe47jJ RT @MileyOfficial: Prisoner ft. Dua Lipa (@JaxJones Remix) is out now! 🤘🏼🖤\n\nhttps://t.co/rt0rlXhZM4 RT @StylishCyrus: NEW ‘Prisoner’ remix out now! @MileyCyrus ft @DUALIPA \n\nhttps://t.co/UW3FWdrISh RT @viuvodeadpetz: i love you @MileyCyrus @MileyOfficial https://t.co/hL0IAM3r2Q Sexting &amp; Thriving!!! 📲🖤🏍☠️\nNOT texting &amp; driving! #SBLV #PlasticHeartsLIVE 💕💕💕 https://t.co/7yKvqV4cri @theebikinikill Rebel Girl 4EVR ☠️ ANGELS LIKE YOU CAN’T FLY WITH REBEL GIRLS LIKE ME. 😈👼 https://t.co/JuX7idCrrh #SBLV PREP ☠️ https://t.co/QwIeC6A2AK RT @MileyEdition: Live, after #SBLV, @MileyCyrus will be performing at the After Party concert to help small businesses. Tune into Verizon… MILEY: FOR THE WIN! 🏈💗☠️ Join the tailgate at 2:30 PM ET FEBRUARY 7 on @tiktok_us ! #SBLV https://t.co/yk9IxzNPLl GOD MONEY I’LL DO ANYTHING FOR YOU. 💰👹💵☠️💲🤡 #AshleyOGoneWild https://t.co/LPI2jImD5b RT @KevanKenney: .@MileyCyrus currently has a 2 week streak on the @MTV #FridayLivestream. \n\nContinue her streak by tweeting \"REQUEST @Mile… ALSO @gwenstefani @blakeshelton  I’ll be your wedding singer!  I promise to be on my best behavior. Or worst. whatever you want! It’s your special day! Cheers to loving you both almost as much as you love each other! 💗🥰 https://t.co/iz21PDiRGS When my hero’s tweet me I get horny. https://t.co/iz21PDiRGS Prisoner on @nprmusic tiny desk ☠️ https://t.co/vgJd0y2T2o RT @PopCrave: @MileyCyrus has been nominated for Outstanding Music Artist at the 32nd GLAAD awards. https://t.co/J2anBwebhc RT @positivesteven: yooo thanks @MileyCyrus for the shirt ahhhh i love you &lt;3 https://t.co/hB2JiTEyIG My room was covered in Elvis , Hillary Duff, and Metallica posters. Nothing has changed except everything. Golden G String on @nprmusic Tiny Desk in a tiny room modeled after my own I grew up in at my parents house in Nashville. So many songs written straight onto the walls which were recorded on tape using a karaoke machine my granddaddy gave me for Xmas. https://t.co/xDf9f5HsGW Fade Into You x Tiny Desk.\n\nA strangers heart without a home. 👤💙🦋👤💙🦋👤💙🦋 https://t.co/Iq7asrCM6R https://t.co/B5eQ6XqIKU Category is: #MazzyStar @nprmusic Tiny Desk just premiered on YouTube.  Check out all 3 of my performances. https://t.co/qU6YfxGKwW RT @MileyNation13: MILEY CYRUS TINY DESK CONCERT STARTS NOW !!! 🤘🏼\n\nJoin here: https://t.co/b7rSyDA0dm RT @StylishCyrus: Check out @MileyCyrus’ NPR Tiny Desk (Home) Concert on NPR Music’s YouTube page out now! https://t.co/2k4dUBINUR RT @BobBoilen: Today, Thursday Jan. 28 at 12 p.m. ET we'll be premiering Miley Cyrus' (@mileycyrus) Tiny Desk (home) concert and you don't… Been working my ass off on this set list! I think you’re gonna DIG IT! ☠️ SUPER BOWL LV!!! I’ll be there for TIKTOK TAILGATE!!! I can’t wait to put on a show for the NFL’s honored guests before the game…. Health care workers from Tampa and around the country!  Join the tailgate at 2:30 PM ET FEBRUARY 7 on @TikTok! #SBLV https://t.co/r6gprJjFC6 Tiny Desk airs tomorrow at 12 PM ET on NPR’s YouTube 🎙🦅☠️🖤 @nprmusic https://t.co/IJuAv79vZb RT @nprmusic: 🕛 tomorrow\n🎤 @MileyCyrus \n🏡 Tiny Desk (home) concert\n📺 https://t.co/gOe840qRFw https://t.co/rI0na2yzEE RT @MileyMedia: Look what just came in the mail 🥺💗 @MileyCyrus @MileyOfficial https://t.co/tifKQUrS31 RT @NFL: .@mileycyrus will be at Super Bowl LV to perform at the first-ever #TikTokTailgate – the NFL’s pregame event for the 7,500 vaccina… SUPER BOWL LV!!! 💗 🏈 \n\nI’ll be there for TIKTOK TAILGATE!!! I can’t wait to put on a show for the NFL’s honored guests before the game…. Health care workers from Tampa and around the country!  Join the tailgate at 2:30 PM ET FEBRUARY 7 on @tiktok_us @ @cbstv ! #SBLV https://t.co/MBibfx8XxF When all this SHIT we’re goin thru is herstory imma celebrate by taking my biggest fan to get a FRESH SET HUNTY. 💅💚 ☠️ Shine Bright. Shine far. Don’t be shy. Be a star baby.  Love y’all 5EVR! You did it again! Plastic Hearts has spent 6 weeks as the #1 rock album in the country. This is all because of YOU supporting my record! I don’t forget! I really fucking appreciate it! https://t.co/iSUwND235b RT @chartdata: .@MileyCyrus’ 'Plastic Hearts' remains at #1 on the Top Rock Albums chart for a sixth week. Happy B-Day Aunt @DollyParton ! I hope you’re maskin’ &amp; relaxin. I will always love you! 🌸💗🌺💕👄 https://t.co/AMVNHxvgYq I am constantly thinking about the time we can reunite &amp; mosh again.  I miss you so fucking much. Ready for this circus to come to an end. 🤡 My love for you shoots to the moon (collects some of its magic energy) and back down to each and every person making my dream a reality. Although we can’t be together right now I hope you can feel my appreciation in spirit. 5 weeks #1 on the rock charts w/ #PlasticHearts 💗💕 Seems like a hard time to be “happy” with so much sadness surrounding all of us but the support being shown to this record can’t be overlooked. My upmost gratitude to everyone listening and relating to this album. https://t.co/KccOIVT2lZ Happy birthday to an icon living @noahcyrus https://t.co/RzJuemskAM RT @MileyCyrusBz: Available in newsstands now! 👅❤️ @MileyCyrus x @RollingStone https://t.co/kLFdCTnd59 RT @onepeloton: Peloton, are you ready? This next Artist Series is an epic musical rager you might want to buckle up for. Ride with @jesski… Who loves the sun? \nWho cares that it is shining?\nWho cares what it does?\nSince you broke my heart. https://t.co/O1nInC4aFw Predicting a 2021 full of safe sex &amp; effloresce 🌺 🎸🌸💕 🌹🫀 ( AND more fucking MUSIC 🏴‍☠️🤘🏼) https://t.co/BD3nxfTdQM Was my honor to perform PARTY IN THE USA opening tonight’s @NYRE after the year we’ve experienced. This song represents TRIUMPH (check the belt) 🇺🇸 🎉🎸looking forward to 2021 wishing everyone a happy and safe NY celebration! 2 more songs to come! https://t.co/TFnemQxOwx RT @RyanSeacrest: It's officially a party in the USA! Starting the night strong with the one and only @MileyCyrus. #RockinEve https://t.co/… SOUND CHECK REALNESS 🎙🏴‍☠️🎸 #RockinEve https://t.co/zbPH4jhqn7 RT @NYRE: If you start the #RockinEve playlist at exactly 9:30pm on New Year's Eve, \"11 PM\" by @maluma will play at 11pm, and Midnight Sky… DRESS REHEARSAL ☠️🖤🤘🏼 I’m performing TOMORROW! \n@NYRE Celebration! Don’t miss at 8/7c on ABC. #RockinEve 🎸🎉🎈 https://t.co/J6nUcFM6nS Hey Sis! It’s Christmas! 🎄 https://t.co/OrOGpAIugY Christmas ain't the time for breaking each other's heart 🖤 #ramones 🤘🏼🍒☠️🎶🎸 https://t.co/6EihJfiqMS Merry Xmassssss Eve! https://t.co/jI28mDaiad RT @miIeystay: How it started             How it’s going https://t.co/d0eKLZLHDI IDOLIZE YOURSELF! 🍦💙🤘🏼☠️🖤 @BILLYIDOL @applemusic #PlasticHearts #NightCrawling https://t.co/E4FGnXWbix https://t.co/WYvWNOuGRu RT @amazonmusic: Time to sleigh. Catch @MileyCyrus tonight on #HolidayPlays with our host @LilNasX \n \nWatch 5pm PT/8pm ET on @PrimeVideo: h… RT @Bratz: @MileyCyrus #bratz 💕 https://t.co/QBv3Ia2OcQ https://t.co/x4IrRxo8Hp I am grateful to health care workers and their tireless efforts to bring us a vaccination/cure for Covid-19 so we can all be together in person again. For now moments like this must be cherished as it brings us together thru another dimension. 💕☠️💕☠️💕 Engaging with you created a connection I think we have all been longing for over the last year where we’ve only been able to communicate at a distance. This lyric video is a love letter to all of you superstars who made #PlasticHearts a viral phenomenon by creating this totally out of the blue/random AF “comment challenge”. https://t.co/4gdVXMaVIn RT @RyanSeacrest: Ready for @MileyCyrus to put the rock in #RockinEve! 11 more days.... RT @NYRE: Can't get @MileyCyrus off my mind, off my mind because she's performing on #RockinEve! Don't miss it, December 31st at 8/7c on AB… Serving PUNT 🏈💕☠️🖤 https://t.co/l5YnaO7D9W RT @MCNewsSource: Miley’s full interview with @BillyIdol from her YouTube RELEASED episode is out now! Watch here: https://t.co/NTx3NL2wBK… DON’T CALL ME ANGEL. 🏈 🖤 #nfl https://t.co/jjGhI2Xwt8 Don’t hate the player. Hate the game. 🏈💕☠️🖤 #nfl\n\nCatch me across the @NFLNetwork this week as their Takeover Artist…. @MJAcostaTV @nfl https://t.co/1uxeBrSNUr RT @BillyIdol: @mileycyrus is my very special guest on my ‘Live Transmission’ Christmas Show on @SIRIUSXM @1stwave ch. 33 on Tue December 2… RT @GlblCtznCAN: ✨ BIG NEWS: @Usher, @MileyCyrus, @Oprah, and MORE just joined our lineup for #GCPrize this Saturday Dec.19 on @CTV. Don’t… Time really flew by. I remember this like it was yesterday..... J/K I don’t remember shit cause I was fucked the hell up. #YesItWasReallySalvia #IfYouFindWeedThatDoesThisToYouSHARE https://t.co/p36RwZCvRg Happy 10 year anniversary to the groundbreaking video of a teenager smoking a bong &amp; saying dumb shit to their friends. (Not so sure the director of this fine film should be considered  a “friend” but....) 🎈💨🖤🎈💨🖤🎈💨🖤 https://t.co/FMIlgJ8B3M ALL GONE 👅 https://t.co/HliuQPh3XL Wear a mask. Eat burritos. (Not at the same time lol) #GuacIsExtraButSoIsMiley https://t.co/9r5LmYinrr Not sure there’s an artist I’ve listened to more than I have you. You’ve made me feel heard since I was a little raspy voiced girl. Love love love that! https://t.co/VchkAoJqNQ RT @youtubemusic: \"This is too good.\" 🎸 🤟\n\n@MileyCyrus stops by this week with an exclusive performance of her new song Prisoner. Watch #RE… RT @YouTube: Tonight on #RELEASEDonYT, it's all about @MileyCyrus 😍 \n\nTune in at 11:45pm ET for an exclusive performance of Prisoner, an in… Feeling my own fantasy!💕#BonnieTylerForever @youtube released tonight @ 11:45 ET! https://t.co/1NwEsSp4D3 https://t.co/AG7E9L5pVC Took @AppleMusic behind my creative process &amp; into my backyard!  Watch the exclusive short film now on Apple Music #PlasticHearts ☠️ https://t.co/5OPN1THczu https://t.co/SXgc3LBdlD RT @mileychronology: Streaming #PlasticHearts while munching on my Miley Burrito 🌯 ☠️💕\n@ChipotleTweets @MileyCyrus https://t.co/k9KxZtIhJd RT @lesrogo7: Totally recommend checking out @MileyCyrus‘ new album Plastic Hearts 🎸 RT @ChipotleTweets: We weren't kidding @MileyCyrus https://t.co/pznBGw1U5E RT @MileyCyrusBz: Chipotle kept their promise!! 👀 “Guac is extra but so is the Miley burrito” is available to order now!! 🌯❤️ https://t.co/… @Sia @Sia in the New Year when it’s safe to kiss you on the mouth again. 💋 RT @billboardcharts: This week's top 5 on the #TopRockAlbums chart:\n\n1. @MileyCyrus Plastic Hearts\n2. @acdc Power Up\n3. @QueenWillRock Grea… RT @chartdata: US Certifications (@RIAA): @MileyCyrus, Party In the USA Diamond (10,000,000). It’s all about me. ☠️ Don’t miss my exclusive performance of Prisoner on this week’s episode of #RELEASEDonYT! Set a reminder to tune in this Thursday at 11:45pm ET, only on @YouTube 🤘🏼🖤💋🍒🩸🎸 https://t.co/2N6Ah592Rn Last night performing Prisoner on @jimmykimmellive ☠️ https://t.co/yqwbOpyWxE RT @YouTube: .@MileyCyrus is taking over this week's episode of #RELEASEDonYT! Set a reminder to tune in on Thursday at 11:45pm ET for an e… RT @MileyCyrusBz: .@MileyCyrus will be presenting @DollyParton the Hitmaker Award at the 2020 Billboard Women in Music awards on Thursday 1… RT @cyrustrippy: I might even be           #1 rock record\na rockstar                       in the US https://t.co/8zqPhGZCU1 MOOOOOD! I tried to tell y’all! Fuck yeah! ☠️ #PlasticHearts is the #1 rock record in the country! https://t.co/pp3Lxgmax3 RT @JimmyKimmelLive: #1 ROCK ALBUM!!! See you tonight @MileyCyrus! 🙌💘👑 RT @JimmyKimmelLive: A little #MondayMotivation for you... @MileyCyrus tonight! https://t.co/SEGs3Qaa99 RT @billboard: .@MileyCyrus' #PlasticHearts crowns the #TopRockAlbums chart 🔥 https://t.co/WHPE3cUxJ9 Thank you to my momager @tishcyrus &amp; my team at @rcarecords @Maverick @adamleber @AdrianaArce_ @livrudensky my creative angels @TheRealMickRock  @Vijatm @bradleymcpeek #alanaoherlihy .@Wyattish is responsible for the most intimate and personal song on the entire record Golden G String.... you see me.... you hear me , you’re there when i need you most. I am grateful. Love u. . @MarkRonson I am never going to quite comprehend how you manage to make songs sound so classic and fucking next level new simultaneously! You are a wizard! Thankful for the past few years we’ve spent making art together and looking forward to many more. You’re my hero. To watch you work is astonishing. Cheers to the dude who has Bieber at 2 and Metallica at 7 (and squeezes me in somewhere between) 🤘🏼🎸 My EP 🖤 @thisiswatt you are a rock god. Your steadfast belief in my artistry is fueling the rocket we’re taking out of this fucking atmosphere! 10 years of memories behind us and a fuck ton more to make ahead! I won’t take a second we’re together for granted. https://t.co/aMqqGit3MO TO MY NEWEST FRIEND, @DUALIPA -\nThank you for allowing me to cover you in cherry juice, lick your face and playing at a dirty rock club w me! You’re fearlessness is all that could outshine you’re fabulousness.  I love you forever. .@BillyIdol BILLY FUCKING IDOL! \nWe’ve been “rebel yelling” since 2012 when I brought a photo of you to the salon and said “I wanna look like that”. You are brazen, bold, unapologetic, and authentic in a way that is my honor to witness . I appreciate you deeply. .@StevieNicks, Your words have been coming out of my mouth since I can remember .... but mine flowing from yours is still surreal. Your generosity is unrivaled. Thank you for lending your magic! I am forever your “smiley baby”.... I love you .@joanjett, I have you to thank for my love of leather, playing music at an unholy level of loud, and my uncompromising sense of self. I fucking love you. The confidence I have in who I am / what I am doing stems for the values instilled by looking up to you 3 as my role models from the beginning. To my fucking idols @joanjett @billyidol and @stevienicks your blessing, guidance, inspiration , and validation mean everything to me. Even though you 3 would tell me I do not need validation from anyone but my fucking self. It’s official. #PlasticHearts is the #1 rock record in the country.  My mind is blown and my heart is overwhelmed with gratitude. Thank YOU to every creative collaborator involved on this project! If one person was missing I would not be writing this message. https://t.co/rvVuSO7L5v RT @nicholasdante_: history repeats itself @MileyCyrus https://t.co/LAb4EobBHS RT @sternshow: .@MileyCyrus explains why she evolves her sound while on tour and reveals the advice @PaulSimonMusic gave her at the #SNL 40… I dare you to let Quaker hit it on the first “date”. Lemme know how it goes! I like to stay updated on “currant” affairs.  💕 https://t.co/aFie7EFEIt THE MORE THAT YOU GIVE THE LESS THAT I NEED. https://t.co/Rjwmwfrr5b IF YOU THINK THAT I’M SOMEONE TO GIVE UP &amp; LEAVE THAT’LL NEVER BE ME. https://t.co/LPcO5YCEpL SOMETIMES I NEED YOUR LOVIN. SOMETIMES I STAB YOU IN THE BACK. https://t.co/FqGnpTGmU6 RT @MsTaylorBanks: I can’t be tamed. A story in 3 parts. https://t.co/XM7AXZqXZ0 RT @sternshow: 🎶See my lips on her mouth, everybody’s talking now, baby …\n… just like the white winged dove sings a song sounds like she’s… PLEASURE LEADS TO PAIN. TO ME THEY’RE BOTH THE SAME. ☠️ https://t.co/8KS0JPe2TD THEY TOLD ME I SHOULD COVER IT SO I WENT THE OTHER WAY ☠️ https://t.co/q3pXAm0Sbp THE ITSY BITSY SPIDER WENT &amp; SPUN A WEB OF LIES. 🕸☠️🖤 https://t.co/a0SHJPobxA https://t.co/7m2aTl2z0S ☠️ https://t.co/3yBWOofHLa RT @RollingStone: Miley Cyrus appears on our January cover. She opens up about her wild new rock &amp; roll sound, heroes like Joan Jett and Da… https://t.co/7m2aTl2z0S AT LEAST I GIVE THE PAPERS SOMETHING THEY CAN WRITE ABOUT. ☠️ @RollingStone by @BradElterman https://t.co/zh7T9NMjL9 https://t.co/ZXwqKA4Ktl https://t.co/CrXBNWWOFI There’s nothing like covering Hole at 6 am in a Plasmatics sleepy tee cause I got to the fucking studio and realized my dress I brought was a jacket with no buttons lol @courtneylove Thank you @sternshow for having me and the great conversation. Always a good time. Doll Parts on Stern https://t.co/RXABK5XqEX RT @sternshow: Watch @MileyCyrus debut her cover of “Doll Parts” LIVE from the @SiriusXM Garage in L.A. during her interview with @HowardSt… RT @MCNewsSource: The Apple Music Backyard Sessions edition of “Plastic Hearts” is currently discounted on iTunes for just $7.99! Purchase… come listen to #PlasticHearts with me ! ❤️💋 https://t.co/9U7w3Zmx0d RT @MileyOfficial: Less than 30 minutes until the next #PlasticHearts streaming party! https://t.co/kMJu3VMxwg https://t.co/KARScIwF7P RT @BBCTheOneShow: Hands up if you're obsessed 'Plastic Hearts' 🙋‍♀️🙋‍♂️💛 \n\n@mileycyrus talks about the collaborations on her 7th studio al… RT @amolrajan: Absolutely mega @BBCTheOneShow coming up on @BBCOne at 7pm\n\n@MicaParisSoul \n\n@MileyCyrus \n\n@maisie_smith_ https://t.co/v43js… See you at 3 👅 https://t.co/572AK42Wiw Who else got ?! 🖤💋 https://t.co/3HftsTqa2L https://t.co/kFkh1Kwbnq RT @OCHannahMontana: Miley covering Last Christmas by Wham! https://t.co/AnjsORwjAn RT @ItsScarlettBobo: Holy. Eff. This is fucking AMAAAAAZING!! @MileyCyrus how’s this for a GAG! \nEdit by @LUNARPH4SES 🖤 https://t.co/b6NIwJ… RT @iHeartRadio: ONLY 30 MINUTES until our iHeartRadio Album Listening Party with @MileyCyrus! 🖤\n\nDon't miss out and watch at 7PM ET / 4PM… Performin’ PRISONER without @dualipa got me really missin my girl! Our new song is OuT eVeRyWheRe NoW! https://t.co/7pmWpsjmTa RT @iHeartRadio: Tonight the party is coming to you!!! Join us as we celebrate the release of @MileyCyrus' new album #PlasticHearts with an… RT @MileyOfficial: Tonight! iHeartRadio #PlasticHearts Listening Party with @MileyCyrus 🖤\n\nTune in here https://t.co/BJcVPRQjbT at 4PM PT /… RT @BBCTheOneShow: We can't wait to have @MileyCyrus on the show tomorrow! We want your questions! Film a quick video of you asking your qu… RT @sternshow: TODAY: @MileyCyrus returns to perform LIVE on the #SternShow and talk to @HowardStern about her new album #PlasticHearts. Tu… RT @jcal812: when I tell you @MileyCyrus is the reason I made it through this pandemic, I ain’t lying. #SpotifyWrapped https://t.co/FWvIrd3… Fill your place with PRESENCE OVER PRESENTS!  If you can’t love yourself how in the hell you gonna love another elf?!?! @amazonmusic holiday plays out now featuring my cover of Last Christmas x Wham! The holidays can get ya feelin lonely especially in these times of social distancing! BUT “If you’re lonely when you’re alone you are in bad company.” It’s a greedy time of year but try to be thankful for all that is front of you! Including the truth that others reveal! https://t.co/mxrd0LUpqf PRISONER LIVE @AMAZONMUSIC #HOLIDAYPLAYS OUT NOW! ☠️ https://t.co/lrm42KcvSj #HolidayPlays starts NOW on https://t.co/3clNnq15I4 and https://t.co/OhlIOMqOgs ❤️❤️❤️ https://t.co/QUC0drfiOA RT @MileyEdition: 1 Hour until Miley’s “Holiday Plays” performance! https://t.co/NFIRxFKtBL https://t.co/ActaPdxhuu RT @amazonmusic: 🚨 Free show alert 🚨 . Hear @MileyCyrus and @LilNasX perform on the opening night of #HolidayPlays for no charge! \n\nIt’s al… Thanks @amazonmusic for the love!!!! #JustAsk, “Alexa, play Song of the Day to listen” to hear Midnight Sky #SOTD 🖤💀 https://t.co/Kr28yRQkWG https://t.co/T3nTiH9DTx RT @cantbetamed: .@MileyCyrus’s new album #PlasticHearts is now discounted to $4.99 on Amazon! Hurry and get yours now!! https://t.co/8kaNl… 4.99 TODAY ONLY  https://t.co/FyKduEAWZP RT @MarkRonson: 💔💔💔 https://t.co/hxK4M1VTxG RT @amazonmusic: Bundle up &amp; tune in tonight to catch @mileycyrus kick off #HolidayPlays with some tracks from #PlasticHearts!\n\nShow starts… https://t.co/FyKduEAWZP Hey Sis it’s Christmas! Don’t miss @amazonmusic holiday plays tonight @ 8pm ET! My album is discounted on Amazon! Down to 4.99! Get that shit! https://t.co/UcIxUyGZ7r https://t.co/w0uuhv5Uvw https://t.co/RogwsiNvSi https://t.co/nLnXknN0Vt https://t.co/fPfQ882ZXX RT @itschris96: @MileyCyrus #PlasticHearts love the album!!! https://t.co/PwprOF7uhu https://t.co/B7THmoIIy4 https://t.co/rOAHBIFu2j https://t.co/cYNRN6ld15 https://t.co/PNpWeFtvft loving these reactions ! Send me your faves to #PlasticHearts https://t.co/0ke9rllQRF Listened to @LilNasX and added some holiday spirit to my @amazonmusic holiday plays set!  Don’t forget to check it out tomorrow! I’m performing new songs from #PlasticHearts including Prisoner and Midnight Sky! ☠️💕❄️ https://t.co/2ymWxd19ZP @Beveraggi ❤️❤️ Happy Fucking Birthday to Billy Fucking Idol @billyidol #NightCrawling #PlasticHearts https://t.co/xzu7eRkSTs RT @pandoramusic: #PLASTICHEARTS is here and has already stolen our heart. Listen to the brand-new album from @MileyCyrus now 🖤 https://t.c… RT @amazonmusic: It’s *their* show. @MileyCyrus and @LilNasX are here to play the opening night of #HolidayPlays ❄️ \n\nWatch tomorrow at 5pm… Watch free tomorrow on https://t.co/3clNnq15I4 and https://t.co/pZlUQGwDuf 🖤 Watch me &amp; @lilnasx SLEIGH @amazonmusic #holidayplays tomorrow night - don’t miss it! ❄️☠️ https://t.co/t0Ng5wzwiv Golden G String w @Wyattish for Backyard Sessions out now exclusively on @applemusic #PlasticHearts ☠️💕 https://t.co/k0J7F9FtfT https://t.co/R6oZPLriMc A response to my fans 🖤 https://t.co/p4dZGPk91T https://t.co/hVCxetV7k2 RT @ColtonLHaynes: I’m still not able to fully express how incredible the new @MileyCyrus album is. It’s a no skip but these 3 songs couldn… I’m everything they said I would be... #AngelsLikeYou STRIPPED back on @applemusic now! #BackyardSessions https://t.co/k0J7F9FtfT https://t.co/TXSv0FVtCE RT @0407_aaron: @MileyOfficial with my new baby ❤️ #PLASTICHEARTS https://t.co/3zJ1hXl8HO My new record #PlasticHearts is OUT NOW!  Check out an exclusive STRIPPED down version of 4 songs off the album on @AppleMusic from my #BackyardSessions! https://t.co/k0J7F9FtfT https://t.co/S3f1lczsic My new record #PLASTICHEARTS deluxe , vinyl , and a fuck ton of merch just dropped on https://t.co/F0BQuwOK9i ☠️💕 https://t.co/P6qZKHOO0P RT @seltzersnapped: We drove around Nashville telling people to stream #PLASTICHEARTS #MileyCyrus @MileyOfficial @MileyCyrus @yeehaw_gurl h… RT @TeamMileySWE: 7 years apart, still here, new album\n#PLASTICHEARTS https://t.co/VZfNQyJs1S PRISONER @ STUDIO 2054 @DUALIPA 🍒🕸🫀🏍☠️💕 #PLASTICHEARTS https://t.co/Zyy6saMJ8b RT @mileyxdestiny: LOOK WHAT I BOUGHT ♥️ @mileycyrus #PLASTICHEARTS https://t.co/buAPIrux1b RT @MileyCyrusBz: 😂🤘🏼🖤 https://t.co/vrbV5t9Yiu https://t.co/JBSEeXX709 RT @lanikaps: me and my girls after listening to plastic hearts https://t.co/ds8kVRE7Fk RT @DDLECOURS: When @MileyCyrus sends you $100 for #PLASTICHEARTS release day you obviously get another MC tattoo, duh. 🎸🖤💋 https://t.co/Y0… RT @videogxrl: IM CRYING MY EYES OUT @MileyCyrus this means so much to me and my family \n\nI’ve been a fan since 2005 and this will help so… RT @MileyUpdates: ICONIC! Miley taking over Oslo for #PLASTICHEARTS Listening Party  https://t.co/6ImKlzGOm4 @FREAKYPRlNCESS @CashApp Got u ❤️ RT @joanjett: Brand new @MileyCyrus record feat. #JoanJett OUT NOW — https://t.co/YDBUMDU18u — #PlasticHearts https://t.co/ebtuao6rp1 sent ! https://t.co/WWORJgM5Sj Got you https://t.co/cFcUCj1N7i RT @joanjett: .@MileyCyrus “Bad Karma (feat. Joan Jett)” — OUT TODAY! https://t.co/YDBUMDU18u RT @MileyEdition: .@MILEYCYRUS THANK YOU SO MUCH OMFG I LOVE YOU #PLASTICHEARTS https://t.co/88urCAz84W * Void where proh no purch nec. https://t.co/oMQ89mafwM. Ends 11/28 MY HEART MAY BE MADE OF PLASTIC BUT TODAY I’M GIVING AWAY SOME PAPER WITH @CashApp !  DROP YOUR CASH APP BELOW &amp; #PLASTICHEARTS FOR BLACK FRIDAY $$$ https://t.co/etQAtcLbWX https://t.co/F0BQuwOK9i https://t.co/UZh6qJGJ8B RT @iHeartRadio: We are celebrating @MileyCyrus' new album #PlasticHearts with an exclusive iHeartRadio Album Listening Party! 🖤\n\nDon't mis… RUINING YOUR LIFE ONE QUESTION AT A TIME ☠️ @SPOTIFY #PLASTICHEARTS 💕 https://t.co/flzgik5FGa RT @Spotify: What advice would you ask from @MileyCyrus? Drop it in the comments below 👇 https://t.co/1ZLSZcGDeQ https://t.co/L2Z87JUCfk https://t.co/u2Eibdaofc 👅 #PLASTICHEARTS https://t.co/sdR2ZWRDx6 RT @MarkRonson: I made this short film to celebrate the release of the three songs I worked on for Plastic Hearts ♥️ @MileyCyrus https://t.… RT @Shazam: A brand new album from @MileyCyrus! Stream #PLASTICHEARTS on @AppleMusic: https://t.co/m1nfZuZbnm 💙 https://t.co/QxXZYpU7QC PLASTIC HEARTS IS OUT NOW! 💀🖤 https://t.co/UXYOb2oI89 https://t.co/1NN3V71u0G 🖤💋 https://t.co/dynF4zi7jH RT @Deezer: .@MileyCyrus’s anticipated rock album has arrived  🤘  Listen to #PlasticHearts on Deezer: https://t.co/c6fNepaieP https://t.co/… https://t.co/UXYOb2oI89 My PLASTIC HEART is overwhelmed by the support I’m receiving tonight! I was fucking born to make the record I’ve just released! To my fans who have been here from the beginning, I appreciate you more than I can properly articulate. To anyone I’ve ever loved or lost, THANK YOU. ☠️ RT @chartdata: .@MileyCyrus's #PLASTICHEARTS has reached #1 on US iTunes. https://t.co/F0BQuwOK9i https://t.co/3WmYzQ4KH8 RT @Spotify: Our #PlasticHearts  have melted 🖤 #MileyCyrus  is here with her first rock album https://t.co/T64ULvvo92 https://t.co/x6za0w2g… RT @TIDAL: .@MileyCyrus' new album 'Plastic Hearts' has arrived on TIDAL.\n\nListen now: https://t.co/iAkSdlplHF https://t.co/0grVu59pvz RT @AppleMusic: A new album from @MileyCyrus is here at last. 🖤\n\nListen to an exclusive edition of #PlasticHearts featuring four videos fro… F☠️CK YEAH! MY NEW RECORD #PLASTICHEARTS IS OUT NOW! LEMME KNOW YOUR FAVS! XXX https://t.co/UXYOb2oI89 https://t.co/FbFzL6Zp85 RT @MCNewsSource: .@MileyCyrus is about to go live on TikTok! Head on over now! https://t.co/rkXLyjMhWw https://t.co/tU4gkbaHLu RT @PLASTLCHEARTED: let's get it to #1 before midnight! #PlasticHearts https://t.co/lRMVhPyFHF LESS THAN AN HOUR #PLASTICHEARTS RT @viniwho: It’s the 80s / ROCK GLAM / DISCO VIBES that i asked 4! Thank u @mileycyrus #PLASTICHEARTS #PLASTICHEARTSZOOM https://t.co/qybL… LIVE ON MY TIKTOK IN AN HOUR #PLASTICHEARTS https://t.co/e4cvzANBJn SNAPPPED #PLASTICHEARTS https://t.co/2YEqAIKCR8 LOVE #PLASTICHEARTS https://t.co/cdGyBscpTx AHHHH #PLASTICHEARTS https://t.co/027hUOKes1 RT @Z100NewYork: Hear me play @MileyCyrus x @DUALIPA #Prisoner on @iHeartRadio 9@9?? Obsessed. #PLASTICHEARTS OUT MIDNIGHT 🚨☠️🔥 \n\nox @TheEr… RT @tiktok_us: Want another reason to be #grateful? @MileyCyrus is giving you a chance to preview her new album, Plastic Hearts, tonight at… RT @mileysfweakk: ME IN 4 HOURS #PLASTICHEARTS https://t.co/OpqCr0Bjtz FUCK YA #PLASTICHEARTS https://t.co/9Pa33NtV0Q #PLASTICHEARTS https://t.co/9tw4nYQ6pX ANGELS LIKE YOU can’t fly down here with me ☠️ #PlasticHearts out at midnight. https://t.co/70uYAM4I4s https://t.co/9tw4nYQ6pX TONIGHT @ MIDNIGHT #PLASTICHEARTS IS DROPPING! ALONG W/ YOUR PANTIES CUZ THERE’S A FUCKING @BILLYIDOL FEATURE!  XXX https://t.co/IAgqjXAoZ9 https://t.co/9tw4nYQ6pX GO AHEAD YOU CAN SAY THAT I’VE CHANGED.... JUST SAY IT TO MY FACE. ONE DRINK &amp; I’M BACK TO THAT PLACE. THE MEMORIES WON’T FADE. #HATEME 🕸 https://t.co/jIhLdJGfN6 https://t.co/9tw4nYQ6pX YOU ARE LIKE A NEON LIGHT SHINING THRU A DOOR THAT I CAN’T KEEP CLOSED.... #HIGH off my new record #PLASTICHEARTS 💚 @MarkRonson https://t.co/Cnd4HCq7XC https://t.co/SN3KVBMTcr FRIDAY 💀 https://t.co/zSvWTNVhhK PRE ORDER https://t.co/9tw4nYQ6pX WTF DO I KNOW! TRACK 1 OF 12 ORIGINAL SONGS OFF MY NEW RECORD PLASTIC HEARTS DROPPING THIS FRIDAY ☠️ EXEC PRODUCED BY GRAMNOM @THISISWATT https://t.co/F2Rl97CyPT RT @amazonmusic: Baby, it’s cold outside… so we’re staying in to watch @MileyCyrus launch our concert series, #HolidayPlays. Grab your cozi… RT @Spotify: Dealing with a #PlasticHeart? Believe in #Karma? Want to keep your spirits #High? Don’t worry @mileycyrus will be here to help… RT @AppleMusic: Listen to #Prisoner from @MileyCyrus x @DUALIPA on #AListPop: https://t.co/mQW68x3loo https://t.co/smL2COlaGX Thursday night on @tiktok_us #PlasticHearts https://t.co/vmhlilaqdl RT @1027KIISFM: #Prisoner is on right now!!! And @MileyCyrus and @DUALIPA are with us NEXT!\n\nhttps://t.co/PkQboszyuU RT @OnAirWithRyan: #MILEYCYRUS and #DUALIPA are zooming with us for \"Prisoner\", out now!! Just after 8:15a PT!\nhttps://t.co/Ie3y7KEv66 http… RT @MTV: Ah yes, another day where \"Prisoner\" by @MileyCyrus ft. @DUALIPA is stuck in my head. \n\n(not complaining, I'm very happy about thi… Fuck yes! Love u 4ever! https://t.co/uBeyDNPS5r Cheers to another year of Britney Spears and facing fears! YASSSSS! Thank you for makin my life so unbelievably rad! Appreciate you! ☠️⚔️🤘🏼🖤 https://t.co/M7B8Sr2suk RT @crystalwillseeu: @MileyCyrus album anticipation is really the only thing keeping me going right now. https://t.co/8HKNVTir84 RT @AppleMusic: “I love what people feel when they listen to it.”\n\nBefore she drops her new album this Friday, @MileyCyrus reflects on her… I LIVE! https://t.co/9fHPSCOLmR Friday 🤘🏼🖤 https://t.co/eyY4vCjdJN RT @DUALIPA: HAPPY BIRTHDAY 2 MY BIG SIS @MileyCyrus - I LOVE U BITCH - STAY SEXY ⛓🖤🍒🩸👅🔪 https://t.co/B7OTwSO7Ym RT @billyjoel: Happy Birthday @mileycyrus! \n📍Miley Cyrus and Billy Joel perform at @thegarden on October 1, 2017\n📸: @MyrnaSuarez25 https://… 🤘🏼 https://t.co/8m42dnZhix RT @MileyOfficial: Listen to Miley’s full #PlasticHearts interview with @ZaneLowe today, 10AM PT / 6PM GMT! https://t.co/bPhVB1BSIx\n\n https… RT @MileyCyrus: PRISONER FEAT. @DUALIPA 🍒💋 🎱🩸🧸🏍🔪🕸👅\nOUT NOW EVERYWHERE!!! \n\nhttps://t.co/bKJcIWNPXz https://t.co/WODX4DG8dP playing the opening night of @AmazonMusic #HolidayPlays on December 1! And @LilNasX is hosting!! 💋🖤 https://t.co/CAmWVw4vGo https://t.co/w1D95PKVci https://t.co/bKJcIWNPXz ME &amp; @DUALIPA LOOKIN AT THE WICKED NUMBERS OF PEOPLE LISTENIN &amp; LOVIN #PRISONER ☠️ https://t.co/lRvaDSQGww RT @MostRequestLive: For the first time EVER, the Most Requested Song of the Hour belongs to @MileyCyrus &amp; @DUALIPA with their hot new coll… RT @MostRequestLive: The THIRD Most Requested Song of the Hour was @MileyCyrus &amp; @DUALIPA #Prisoner on #MostRequestedLive with @OnAirRomeo!… RT @amazonmusic: .@MileyCyrus teams up with @DUALIPA to deliver us a retro rock anthem we didn't know we needed 🚨 #SongOfTheDay\n\nVibe out t… RT @AliGutyy: OUR PRISONER VERSION! 🍒❤️⛓@MileyCyrus @DUALIPA #Prisoner https://t.co/30YTJjxOdy SHE IS COMING FOR ALL THE CATEGORIES!!!!! ☠️🩸💉🎸🕸⛓ #PRISONER FEAT. @DUALIPA OUT NOW! https://t.co/a2wYAvk7nr https://t.co/KYP6hvTANd PRISONER FEAT @DUALIPA OUT NOW 🍒☠️🩸🤘🏼❤️ https://t.co/zQjYjyLQjs RT @ablackbillgates: take a look!! it wasn't perfect, but I tried 💀🤡 @MileyOfficial @mileycyrus @dualipa https://t.co/Cr9QpLeckg ❤️🍒💋 https://t.co/bKJcIWwf61 RT @DUALIPA: THANK YOU 4 ALL THE LOVE ON PRISONER @MileyCyrus - WE ARE SO PROUD OF THIS ONE ⛓✨ ++++ i’m so happy to have another song this… RT @TIDAL: .@MileyCyrus ft. @DUALIPA. \n\n🍒 Listen to #Prisoner now: https://t.co/x29VoC1mw7 https://t.co/YL6yEvNZtb 🤘🏼🍒 @Spotify https://t.co/g1ccXYxjOr https://t.co/OXjWMfV5Zw Listen to the full #PlasticHearts interview with @zanelowe Monday, Nov 23 at 10am PT on @applemusic #Prisoner @DuaLipa https://t.co/oeIE7FFDzD https://t.co/EPcpXsmUTd RT @AppleMusic: Miley is coming. 👀\n\n@MileyCyrus speaks with @zanelowe on #Prisoner with @DUALIPA before the #PlasticHearts interview coming… RT @DUALIPA: THIS NEWS IS CHERRY SWEET @MileyCyrus WILL BE JOINING ME AT STUDIO 2054!!!! 🍒🍒🍒🍒 https://t.co/zaFatiNzEq https://t.co/UX0zDJxh… https://t.co/KYP6hvBZoD THANK U FOR ROCKIN TO #PRISONER &amp; MAKING DAY 1 SUCH A SUCCES! INFINITE APPRECIATION FOR THE SUPPORT!!! XXXXXXX  BTW I FUCKING LOVE YOU @DUALIPA 🍒🕸☠️🖤👅🔪🎱🤘🏼🧸💄🥀💿🩸🦷🎸 THERE’S MORE WHERE THAT CAME FROM! STAY TUNED! WE’RE FULL OF SURPRISES! https://t.co/TGymoFwVLd ❤️🍒 @AppleMusic https://t.co/mNWLCvMp6W https://t.co/ZGIiPeWYfk @spotify 🖤🍒 https://t.co/bd06TdK9ma RT @chartdata: .@MileyCyrus and @DUALIPA's \"Prisoner\" is now the top trending music video on YouTube US. #MileyDuaPrisoner RT @Vevo: 🚨MILEY &amp; DUA🚨\n🚨MILEY &amp; DUA🚨\n🚨@mileycyrus &amp; @dualipa🚨\n⠀⠀⠀⠀⠀⠀⠀⠀⠀\n▶️https://t.co/etIt866zWd https://t.co/tpCZLwFTrb 🍒🖤 https://t.co/bKJcIWNPXz RT @pandoramusic: Is this collab even real? 😍 Listen to #PRISONER by @MileyCyrus and @DUALIPA now: https://t.co/p57gkWzuA6 https://t.co/wjr… RT @AppleMusic: #Prisoner 🖤🍒\n@MileyCyrus x @DUALIPA \nListen: https://t.co/KHXIvtoUZS https://t.co/DOEBVEmUCL RT @Spotify: .@MileyCyrus, if you had one lifeline who would you call? We bet it’s @DUALIPA. #Prisoner is here https://t.co/Kdo9rATzw9 http… RT @MTV: YES @MileyCyrus AND @DUALIPA, YES. How can I go on this tour with you??? 💋 #PRISONER https://t.co/G9NjB4TMGB RT @DUALIPA: PRISONER @MileyCyrus OUT NOW ⛓🍒🔪🧸🩸 BIG LOVE TO THE WHOLE GANG WHO HELPED PUT THIS TOGETHER DIRECTED BY ALANA O'HERLIHY + MILEY… PRISONER FEAT. @DUALIPA 🍒💋 🎱🩸🧸🏍🔪🕸👅\nOUT NOW EVERYWHERE!!! \n\nhttps://t.co/bKJcIWNPXz https://t.co/WODX4DG8dP 20 mins!!!!  https://t.co/FYwNg0kFBZ 30 minutes ❤️🍒 https://t.co/FYwNg0kFBZ https://t.co/qqxPpbf65I I’m in the chat room 🍒🍒🍒🍒#MileyDuaPrisioner https://t.co/FYwNg0kFBZ https://t.co/FYwNg0kFBZ #MileyDuaPrisoner drops in ONE HOUR ! \n\nⓘ  𝗢𝗳𝗳𝗶𝗰𝗶𝗮𝗹 𝘀𝗼𝘂𝗿𝗰𝗲𝘀 𝘀𝘁𝗮𝘁𝗲𝗱 𝘁𝗵𝗮𝘁 𝘁𝗵𝗶𝘀 𝗶𝘀 𝘁𝗿𝘂𝗲. LOVE U 🇧🇷 https://t.co/HhHLI1ZtN8 2 HOURS #MileyDuaPrisoner #MileyDuaPrisoner RT @MileyMedia: 2 HOURS LEFT UNTIL PRISONER #PRISONERTODAY\n\n⛓YouTube: https://t.co/yFdV0RrpBn \n\n⛓Pre-Save: https://t.co/LXXpcImuZf https://… RT @MileyOfficial: 2 HOURS! 👄🎤🩸\n#PrisonerTODAY https://t.co/aozK8nQWwb https://t.co/Wa7lzaVL68 Few more hours ! https://t.co/bKJcIWNPXz 👅🍒💋🩸 @DUALIPA DOIN THE “TONGUE THANG” #PRISONER #YouAreWhoYourFriendsAre https://t.co/BK3xVewK2t SO SOON #PrisonerTODAY https://t.co/3qQZf0SG0w RT @miley_aep: mood #PRISONERTODAY https://t.co/a0HozK7hcI RT @DUALIPA: R U READY - PRISONER - @MileyCyrus - MIDNIGHT UK - https://t.co/Er2pmgTXsn 🍒🔪⛓🤍🩸 https://t.co/MwLj7pq5lI join the official watch party on @youtube! https://t.co/FYwNg0kFBZ PRISONER FEAT. @DUALIPA 🍒💋🩸❤️☠️🤘🏼🔪📀🧸🎱 DROPPING AT 7PM ET\n\noff my new record Plastic Hearts out  November 27th https://t.co/8nH4sB80CB RT @SpaceBootz1123: #PRISONER OUT TODAY! 🍒 @MileyCyrus @DUALIPA https://t.co/4JYN7rLcis @perfectselarry there’s only a few hours to go until the video !!! RT @MileyUpdates: SMILERS! Let's go TREND #PRISONERTODAY ⛓🖤🍒 https://t.co/Lwivc6D1Gu @fuckingsmilers9 @MileyUpdates ITALY🖤 @MileyUpdates Let’s do it if you want to see art !!!! #PRISONERTODAY RT @seancellmore: PRISONER OUT TODAY ⛓☠️🍒☠️⛓\n@MileyCyrus @DUALIPA https://t.co/4x5Jy93jAC I LOVE U https://t.co/CxNvX9yJTg RT @MileyCyrus: PRISONER FEAT @DUALIPA TOMORROW 11/19 ☠️\n\n4PM LA / 7PM NYC  / 12 AM London  / 11AM Sydney / 8AM Beijing https://t.co/OoT8ul… at 9AM PT WILL SHARE SOON ! 🍒 https://t.co/EOpy26dCXu TODAY 🍒❤️ https://t.co/OK5chsPsVD RT @MileyNation13: Set your reminders for #PRISONER ‼️ \n\nhttps://t.co/wq3DPFc7VS https://t.co/scLZhlMtmS RT @dailymileygifs: PRISONER TOMORROW https://t.co/VYsyqc0L4a YouTube watch page is live 🖤🍒 https://t.co/FYwNg0kFBZ Not on my calendar! #PRISONER is coming! @dualipa 🍒🩸💋 https://t.co/5lEZVffgGD PRE SAVE https://t.co/bKJcIWNPXz COMING 4 BLOOD #PRISONER w/ my main squeeze @DUALIPA 🍒🩸💋❤️ https://t.co/wbN2HcH0CZ RT @Missing_Lorde: @MileyCyrus @DUALIPA The end part gurrrlll https://t.co/NFL0JFcIBC YAS PRISONER TOMORROW https://t.co/4GBxWLNaRr RT @MileyMedia: PRISONER TOMORROW 💀🍒 \n\nhttps://t.co/7SFrawv9E6 https://t.co/XYGQDQQqr0 RT @DUALIPA: PRISONER @MileyCyrus 19NOV 🖤  4PM LA / 7PM NYC / 12AM LONDON / 11AM SYDNEY / 8AM BEIJING ⛓🔪🍒🩸🚬👅 https://t.co/5Qwcm9sEZt https:… pre-save: https://t.co/bKJcIWNPXz 🖤 PRISONER FEAT @DUALIPA TOMORROW 11/19 ☠️\n\n4PM LA / 7PM NYC  / 12 AM London  / 11AM Sydney / 8AM Beijing https://t.co/OoT8ulevzk 🍒 https://t.co/238bO3tj16 ... RT @DUALIPA: PRISONER IS COMING @MileyCyrus https://t.co/1xqWdRUWKC #PRISONER https://t.co/ZCROoTLvnb NOVO CLIPE COM A @DUALIPA, EM BREVE! MAL POSSO ESPERAR PARA QUE O MUNDO INTEIRO ASSISTA! 💀💀💀 #prisoner https://t.co/ZfoL5Uq0vC IS IT EVEN MY MUSIC VIDEO IF IT DOESN’T CAUSE A REACTION?!?! #PRISONER 👅#COMINGSOON  @dualipa https://t.co/T0unoOuQSh PRISONER IS COMING SENT A TEASE OF MY UNRELEASED VIDEO WITH @DUALIPA TO SOME REACTORS …  PRISONER COMING SOON ☠️ https://t.co/C98SJoGvWl RT @MileyCyrus: https://t.co/dXqP86rWBe RT @MileyCyrus: November 27th💀 https://t.co/hT6Fq3s8O2 Mick + Miley 4EVR! 👅☠️ 📸  #PlasticHearts https://t.co/3HgCDFr6rz Album photography shot by the legendary @TheRealMickRock #PlasticHearts is coming! November 27th! https://t.co/au9YZC3R5F https://t.co/Wlwm3YbEPm https://t.co/urgOA23YRG RT @MarkRonson: And Never Be Me is that unapologetic heartbreak shit that you love from ms Miley.\nSo psyched for this album\n💔 RT @MarkRonson: Bad Karma was written at a jam session at Max’s Kansas Xity in 1976 with Ace Frehley and Joan Jett (it wasn’t but u get my… RT @MarkRonson: I love that I get to see the tracklisting at the same time as you all. \nIt’s makes it so exciting to see these three tracks… https://t.co/UXYOb2oI89 🖤 https://t.co/dXqP86rWBe RT @MileyEdition: There are now 3 new album covers on Mileys site #PlasticHearts \n\nShop:  https://t.co/9Vl47xKiUG https://t.co/y2CuUKP06q additional album covers available on my site 💀💀💀https://t.co/N23UIE96Hm https://t.co/UXYOb2oI89 November 27th💀 https://t.co/hT6Fq3s8O2 RT @seancellmore: wearing the @mileycyrus merch i designed. a dream come true ❤️ https://t.co/D36CrVfqHp Fuck yes! Your wish is my command baby. ❤️ https://t.co/wJW6zqMNY4 RT @ElizLanders: .@MileyCyrus’ “Party in the USA” blaring outside the White House https://t.co/ksvEc8tluI RT @MileyUpdates: HUGE Crowd in D.C singing Party In The USA ❤️💙 https://t.co/F23NIbASnb RT @MileyUpdates: “People have been driving by blasting Party In The USA.\" - ABC News Achor! https://t.co/6GPjYEFP0G 🇺🇸🎉🇺🇸🎉🇺🇸🎉🇺🇸🎉🇺🇸 https://t.co/EEoiNDwftL Now THIS is a PARTY IN THE USA! @JoeBiden @KamalaHarris 🇺🇸🎉 https://t.co/zFKL1ncuSa RT @MileyCyrus: 🖤@StevieNicks has always been my idol &amp; an inspiration. It’s an honor to now call her my friend and collaborator. Edge Of M… RT @MileyUpdates: iTunes US 🇺🇸: #5 - Miley Cyrus, Stevie Nicks - Edge Of Midnight https://t.co/1ndSVoX3nw @Alexa99, happy birthday! Hear my new song, Midnight Sky, when you say “Alexa, play Alexa’s Birthday playlist” #AlexaHappyBirthday https://t.co/aNEVtFrnoi I love you Stevie Baby! https://t.co/D9n1OrCTiW RT @StevieNicks: Duet with @MileyCyrus ...Magical! Loved singing with her! Available everywhere. https://t.co/3OSSS1xdDg RT @Spotify: Pinch us... @mileycyrus and @stevienicks joined forces for a remix of #MidnightSky #EdgeofMidnight 🖤  https://t.co/4NnHTpw8hu 🖤@StevieNicks has always been my idol &amp; an inspiration. It’s an honor to now call her my friend and collaborator. Edge Of Midnight (Midnight Sky Remix) out everywhere!\n\nhttps://t.co/jU7z36Af3M https://t.co/SRbKJjlqk9 RT @_pIastichearts: Finally got my MC X Madeworn shirt (I'm inlooooove)! &amp; I also voted today, hbu? ❤️ #ElectionDay https://t.co/gbSJJRnonb When I create a look I always ask “would this make someone want to be me for Halloween?”\n\nit makes me fucking melt knowing so many of you were MS MC this year! Love u! 🖤💀🖤💀🖤 https://t.co/4g3qNUs8rR RT @missmelissaraex: @MileyCyrus my queen look what I found up in nashville! I am so happy #plastichearts #mileycyrus https://t.co/vtv5bm02… RT @beatleswift: Me and my bf were just driving around for fun for Diá De Los Muertos and look who I found 🥺🥺🥺💖💖💖 @MileyCyrus #PlasticHeart… Happy MileyWeen! https://t.co/67jOqDMNwM RT @LouisMonttana: HAPPY HALLOWEEN!!! 🎃👻 @MileyCyrus #MileyCyrus #MILEYWEEN2020 https://t.co/ctIlPdjPY2 RT @valencalderont: @MileyCyrus #mileyween #mileyween2020 #MidnightSky 🤘🏼✨ https://t.co/doS0P46KDZ RT @Ghada_khaznadar: Not me trying to get @MileyCyrus s attention on every social media platform 😬 #mileyween #mileyween2020 https://t.co/o… RT @chiyrusna: Mileyの数量限定のTシャツ届いた！！！🤩\nMiley x Madeworn tee arrived and I’m obsessed 🖤🔥😍\n@MileyCyrus https://t.co/x57rg14ihm RT @HaleyBo68461515: @MileyCyrus #MileyCyrus #miley #Costume #Halloween #Viral #RETWEEET https://t.co/yjmjVlCYgO RT @bunnyandfawn: it's the tin foil mic and shrinky dink chanel belt for me @MileyCyrus @MileyCyrus @MileyCyrus @MileyCyrus #MileyCyrus #Mi… RT @qweeenmiley: #MILEYWEEN2020 @MileyCyrus https://t.co/BbH4CplGyx RT @JayJayKings: Happy #HalloweenAtHome  @MileyCyrus @fuckingsmilers9 @MileyNewsAccess #MileyCyrus https://t.co/yrDW25y36V RT @anthonydrapos: MC x Madeworn comin in HOT 🔥 @MileyCyrus 🖤. https://t.co/D3KfbrsOup RT @mileychronology: Happy #Mileyween!! Here’s my #MidnightSky look 💜\n#PlasticHearts out November 27th!! \n@MileyCyrus https://t.co/fJ1CaSa4… RT @dylandavii: the midnight sky is the road i’m taking... https://t.co/btldZygfVj RT @takemealongstan: PLASTIC HEARTS\n11.27\n@MileyCyrus https://t.co/yCRKKi1Zxy RT @mileysbae: .@MileyCyrus x Made Worn https://t.co/LdLq7FxDxm RT @aliciakeys: Fam!! Tonight is the night!! You are going to LOVE. THIS. SHOW. If you are feeling a hope deficit, I got u. We’re having a… RT @changeisathing: People stare at me for wearing my @MileyCyrus mask but I’m OBSESSED https://t.co/vOp8Jk1pfU RT @StylishCyrus: Got my vintage inspired Miley x Madeworn tee in the mail and I am obsessed! I love the gold glitter detailing! ✨ @MileyCy… RT @PLASTlCHEARTED: plastic hearts teaser ft smilers x @MileyCyrus @MileyOfficial https://t.co/nCXxiASuyy 🖤 @noahcyrus https://t.co/FRAF9hBVir https://t.co/xXAC52qmvr RT @noahcyrus: I GOT SO HIGH THAT I SAW JESUS FT. @MileyCyrus out now everywhere !!!! no one knows how excited we are to be releasing somet… RT @AppleMusic: More @MileyCyrus is coming.\nPre-add her upcoming album #PlasticHearts now. 👀❤️\nhttps://t.co/wOR8zwc3yU RT @MileyEdition: Smilers x #PlasticHearts 🖤💀 @MileyCyrus \n\nThe New Rock Album Out November 27th! \n\nPre-Order: https://t.co/CNh1rgqGF0 http… RT @MileyCyrus: https://t.co/PGFrnusTnd RT @MileyUpdates: \"Plastic Heart\" Cover was shoot by Mick Rock who has worked with the most iconic people on the industry like Debbie Harry… PLASTIC HEARTS OUT NOVEMBER 27TH. https://t.co/qAO6AfZ4Vm PLASTIC HEARTS OUT NOVEMBER 27th. https://t.co/oTvCo3BvXB RT @StylishCyrus: You can now also stream @MileyCyrus’ cover of ‘Zombie’, which will be featured on her upcoming album #PlasticHearts - Out… RT @MTV: My alarms are already set RT @Spotify: @MileyCyrus Category is: Leather and chains ⛓ We're ready for this era🖤 https://t.co/PGFrnusTnd PLASTIC HEARTS OUT NOVEMBER 27th. PRE ORDER NOW:  https://t.co/UXYOb2oI89 https://t.co/G6exEAXLva https://t.co/RCcY5qxVVv RT @KamalaHarris: Instagram Live tonight at 6:30pm ET. \n\n@MileyCyrus, see you soon. going live with Senator @kamalaharris at 3:30 PT / 6:30 ET on my IG! https://t.co/DElY1zaG4g RT @PearlJam: 👏 @MileyCyrus https://t.co/54Y5uuw3is Pearl Jam x Just Breathe... Under everything’s just another human being.... 🧚🏻 https://t.co/a5gV1DjzQ5 RT @Shazam: Keep going! Shazam #MidnightSky by @MileyCyrus!! 🎶 https://t.co/npewKh7zGE https://t.co/6zfJwvq0MY Thought you’d never be replaced .... you know it’s true. 💀🖤 #MidnightSky https://t.co/ZmuliqU4uu https://t.co/fK7EnS1fPB https://t.co/4AS0vlgV62 https://t.co/WyHmZwzSEV From my middle school gym locker room to backstage on timeless tours you could always find me listening to #TheCardigans it was a privilege to perform Communication for BYS unplugged. These words are even more relevant to me now at 27 years old. https://t.co/6259VsVTfT RT @MileyEdition: .@MileyCyrus has just uploaded her cover of “Sweet Jane” Live from the backyard sessions 💫🖤\n\nWatch: https://t.co/en6tGDu1… https://t.co/kA6CECkFnw RT @MileyEdition: 🚨| Miley has uploaded her cover of ‘Zombie’ on her YouTube Channel! \n\nGo stream it: https://t.co/hMX8w29CHN https://t.co/… https://t.co/iqrugljOim *sobs* BOYS DON’T CRY *sobs* BOYS DON’T CRY *sobs* BOYS DON’T CRY *sobs* BOYS DON’T CRY *sobs* BOYS DON’T CRY *sobs* 💀 https://t.co/QQGeMcLvoT RT @BigTop40: Another week at Number 1 in the UK! @MileyCyrus makes it SEVEN WEEKS at the top of the UK's biggest chart show 🏆🏆🏆🏆🏆🏆🏆\n\nSee t… How it started vs how it’s fucking going 💀 https://t.co/jcu7kTq8c1 RT @MileyNation13: How it started:                How it's going: https://t.co/vvi02YPC1B RT @MileySmilerNews: The world finally seeing something Miley showed 10 years ago\n\n 2010                  vs             2020 https://t.co/… your girl was v.i.b.i.n.g 💀 https://t.co/6r5FVlGRqE Misjudged your limits. Pushed you to far. Took you for granted. I thought that you needed me more.... 💀 #BoysDontCry #SOSFest https://t.co/WrPeD11eLh ZOMBIE 💀 @TheWhiskyAGoGo @youtube #SaveOurStages https://t.co/4tY71aS9N3 #saveourstages #SOSfest on my @youtube at 7:15 PT! https://t.co/SlVpJLwW7u Here's my @MostRequestLive @AskAnythingChat https://t.co/PRz3mmhPTi thanks again to @OnAirRomeo and @iHeartRadio #MidnightSky RT @nivassoc: #SOSFEST is back on @YouTubeMusic for Day 2 ft. @Jason_Mraz from @BellyUpMusic at 1PM PT/ 4PM ET + @KelseaBallerini, @LeonBri… https://t.co/VbQkEh1cQj 🖤 @noahcyrus sanggggg the house down last night! proudest big sister ever. i love u soooo much. https://t.co/YHJgIxh69e RT @AskAnythingChat: we're getting ready for our @MileyCyrus @iHeartRadio @AskAnythingChat tonight at 8pm est on @MostRequestLive.  let's f… https://t.co/fK6x7X6M96 https://t.co/DT6n6BCm8W RT @MTV: 𝙏𝙊𝙉𝙄𝙂𝙃𝙏 𝙏𝙊𝙉𝙄𝙂𝙃𝙏 𝙏𝙊𝙉𝙄𝙂𝙃𝙏 𝙏𝙊𝙉𝙄𝙂𝙃𝙏\n\n#MTVUnplugged presents @MileyCyrus' #BackyardSessions at 7/6c on MTV! 💜✨ https://t.co/sRwjYempiT RT @MTV: I'll NEVER forget @MileyCyrus’ cover of “Why’d You Only Call Me When You’re High?” during her 2014 #MTVUnplugged sesh! 🎶\n\nWe're le… Backyard Sessions Unplugged TOMORROW on @mtv 💀 We got so high we saw Jesus 🙏@noahcyrus https://t.co/2f7JMD60iM You got me in a crazy position. If your on a mission. You got my permission. 💀 @britneyspears @mtv #BackyardSessions #Unplugged https://t.co/3HFrv2eW0r @PopCraveMusic @BLACKPINK 🖤🖤🖤 RT @xoSonique: Getting me a piece of @MileyCyrus midnight sky on Snapchat 🔥 https://t.co/eI2FvoPcoH DON’T FORGET #BackyardSessions #Unplugged on @mtv this Friday 🖤 https://t.co/M3Bok3Ag75 POWER SUIT 🖤♠️🖤♠️🖤♠️ https://t.co/kICyHuQm5o FORBIDDEN FRUIT 🍎🐍 ❤️ https://t.co/PFnciG3r8b RT @MTV: IN 3 DAYS... #MTVUnplugged is going to rock your world with @MileyCyrus' #BackyardSessions! 🤘\n\nJoin the party this Friday, Oct. 16… VOTE 💜 VOTE 💜 VOTE 💜 VOTE 💜 https://t.co/ad02NIfPha I'm excited to invite you to \"Honor Her Wish\" -- an exclusive celebration &amp; tribute to RBG tonight at 8pm ET. We must take action to protect her legacy by honoring her last wish: No confirmation until inauguration.  Accept your invite &gt; https://t.co/UpvGMwaNqO https://t.co/s5gsNOoofv I want to be the girl with the most cake.\nI love him so much it just turns to hate.\nI fake it so real, I am beyond fake. https://t.co/5i34ZX3QW5 Midnight Sky is on her 6th week #1 at UK radio! Broke the record for most weeks at the top in 2020. Thank YOU so much for all the love you show me and my art! It’s my honor makin music for you! https://t.co/0TVlc3tMfU Midnight Sky on @TheGNShow https://t.co/MVFIhJMmnD my @MostRequestLive @AskAnythingChat happens next saturday with @OnAirRomeo and @iHeartRadio. Send me your questions ! https://t.co/MG4ntmutOk. #MidnightSky See my lips on her mouth everybody’s talkin now baby. https://t.co/l2Ae4sCbbY #MidnightSky on @TheGNShow  ! https://t.co/k3ZkhdsaW1 https://t.co/8wRvU5xAQr M.I.L.E.Y W.O.R.L.D @TheGNShow https://t.co/up3Nkt1lJZ RT @TheGNShow: TONIGHT! We're joined by Ewan McGregor, @ShirleyBallas, @AshleyBanjo, Frank Skinner &amp; @MileyCyrus! On @BBCOne at 10:45pm #Th… I LOVE U SO MUCH @KamalaHarris. \n\n@JoeBiden X HARRIS FOREVER https://t.co/EyOOVpbsnf RT @nivassoc: Independent venues are at risk of closing forever 🚨 Help #SaveOurStages! Join @NIVAssoc &amp; @YouTubeMusic for #SOSFEST on Oct 1… RT @TheGNShow: Have you heard @mileycyrus' new single #midnightsky? The incredibly talented Miley Cyrus will return to #TheGNShow on Friday… backyard sessions x unplugged is coming 10/16 on @MTV https://t.co/v84Vyj2p6C RT @mtvema: Here are you 2020 #MTVEMA Best Artist nominees!! 🙌\nWho will you be voting for?! 🤔\n\n⭐ @DUALIPA  \n⭐ @Harry_Styles \n⭐ @justinbiebe… RT @MileyNation13: MILEY has been nominated for \"Best Artist\" at the MTV EMAs 2020! 💫 \n\nVote now: https://t.co/28sTrulwCw https://t.co/Z54u… RT @MTV: #MTVUnplugged Presents @MileyCyrus #BackyardSessions, Friday, October 16th at 7/6c on MTV! GET. READY. 👏 https://t.co/R3QXf6k1D1 🚨 Backyard Sessions on @mtv October 16th 🚨 https://t.co/LY2iusTBtP ANNOUNCEMENT! 🚨🚨🚨 reply with your best guess! @MTV https://t.co/nRPbWoNPR8 I’m back on @MostRequestLive Sat Oct 17th to answer your #MidnightSky @AskAnythingChat questions! Thanks @OnAirRomeo &amp; @iHeartRadio for having me. Submit Q’s here: https://t.co/MG4ntmM5cU. OUT NOW! @blondieofficial forever https://t.co/mQaPI3W9bf https://t.co/3Va6W689Pa RT @TheGNShow: Next week on #TheGNShow we have #EwanMcGregor, @AshleyBanjo and @MileyCyrus 🎉 RT @MileyCyrus: By popular demand my Heart Of Glass cover is up on steaming services ❤️ https://t.co/mQaPI3EyjH https://t.co/eZXfVh15KG RT @MrHorrorPsychDT: Ahhhh. After many weeks, she is here. @MileyCyrus #MidnightSky https://t.co/DMQjA9iQBj Thank YOU for the “Heart Of Glass” LOVE! Keep steaming! @BlondieOfficial  forever! https://t.co/mO4xMIujtY RT @iHeartRadio: Love a great cover from an amazing artist at an incredible festival. 😉\n\n@MileyCyrus just released her performance of @Blon… RT @BlondieOfficial: Once @MileyCyrus covered \"Heart of Glass\" and it was divine. ✨ Listen now: https://t.co/VM0OJLAib4 https://t.co/7j7emB… https://t.co/mQaPI3EyjH 💪🏼 https://t.co/169ZTV0xnb https://t.co/mQaPI3EyjH By popular demand my Heart Of Glass cover is up on steaming services ❤️ https://t.co/mQaPI3EyjH https://t.co/eZXfVh15KG Today https://t.co/nzyRsqxZtU RT @iHeartRadio: Are you ready for night one of the iHeartRadio Music Festival?! Oh yeah – @MileyCyrus will be there. 😉 Watch tonight at 8/… Should I drop Heart Of Glass on streaming?! 💀 https://t.co/8yenZTZY6I Who wants more BTS from MS MV! LOL! 👅💋👽🎈💀 https://t.co/yAUImdzzfK Happy 10 year anniversary to “Who Owns My Heart” ❤️💋 https://t.co/kvTg8EJfRq https://t.co/eCDBo3Q1YK Fuck Yes! Been on loop all day! Queen Debbie forever! PS your hair is beautiful! https://t.co/buq4WkaRpy ATOMIC. https://t.co/L3LYPu1FAH Midnight Sky @iheartfestival airing 9/27-28 on @TheCW @ 8pm https://t.co/1ycuThl2JR RT @BlondieOfficial: We think @MileyCyrus nailed it. 🖤 Check it out: https://t.co/6Xx9Wtglot RT @MileyNation13: Did it work? 🥵 @MileyCyrus https://t.co/eeOHz004T1 Who owns my heart?! 💀❤️ https://t.co/nik3Fjdbqt Heart of Glass #iHeartFestival2020 https://t.co/bP1GsADgoa RT @Wild949: Me when @MileyCyrus comes on at the #iHeartFestival2020!! \n\nTune in now on @theCW app / https://t.co/JoB0FXLjM1!! https://t.co… RT @961KISSOnline: Raise your hand if you're ready for @MileyCyrus's performance! 🙋🏼‍♀️ #iHeartFestival2020 https://t.co/yoenwrFsCC RT @iHeartRadio: The midnight sky is the road I'm takin' to the #iHeartFestival2020 with @MileyCyrus ✨ @CapitalOne https://t.co/KOo6Q800Gr #iHeartRadioFestival2020 TONIGHT 🖤 https://t.co/n7qE0xcZvV Excited to be a part of the 10th anniversary of the @iHeartRadio Music Festival. Watch my performance tonight starting at 9PM ET / 6PM PT on @TheCW app or by clicking here: https://t.co/OhXr7l2s3n https://t.co/kHE97bD4zD #iHeartFestival2020 tomorrow 🖤 https://t.co/laeXBiX9wM 🖤 @iHeartRadio https://t.co/XRy7Lt477X Bad ass edit fuck yeah https://t.co/oqTaIG8062 RT @hitsradiouk: We are SO excited about this 😍\n\nTomorrow morning the one and only @MileyCyrus joins us on Hits Radio Breakfast 🔥 #Midnight… fuck yeah I love u https://t.co/1B2lhuFAeQ MAN EATER ❤️🖤❤️🖤 https://t.co/iVwwmm6PG0 @brooksmiley13 @MileyUpdates @MileyOfficial 🖤🖤 https://t.co/ZzT0hFvSW4 RT @FallonTonight: La-la, la-la, la! @MileyCyrus shares a sparkling performance of #MidnightSky! 🌌✨🎶 #MileyOnFallon \n\n🎧▶️ https://t.co/ujvm… RT @FallonTonight: .@MileyCyrus shares a killer cover of the @halloates hit “Maneater” ❤️🎵 #MileyOnFallon \n\n🎧▶️ https://t.co/o6g00y7vqJ htt… RT @SNFonNBC: \"It's always Al &amp; Cris...why can't it be Cris and Al?\" 😂😂\n\n@MileyCyrus asking the important #NFLKickoff questions before @Fal… https://t.co/vKYjiCviRC I’m on ⁦@FallonTonight⁩ performing Midnight Sky and a cover! C u there! 🖤🖤🖤🖤🖤 https://t.co/xIKwOCcS87 RT @FallonTonight: Talk &amp; TWO performances with @MileyCyrus tonight? Now that’s the best of both worlds 💫 #FallonTonight https://t.co/IRd4B… Performing Midnight Sky and hangin w my dude @JimmyFallon after football on @fallontonight 🖤 https://t.co/OhKJMGvbr1 I’ll be looking at YOU tonight and I can’t wait! Love u @Jimmyfallon https://t.co/OXkyE9oKik You can’t sit with us. 🖤 @joanjett @BlondieOfficial https://t.co/DfEt0IU8D0 One Year of Slide Away https://t.co/R9xu58vzLL This Thursday @FallonTonight https://t.co/t6J5RrXfpm RT @FallonTonight: 🎶 Ooh, you know it’s true! 🎶\n\n✨ @MileyCyrus is on #FallonTonight this Thursday! ✨ https://t.co/zA2sJLie1C RT @heardwell: All our favs living our #midnightsky fantasies with visits from @MileyCyrus’ disco truck 🌟 https://t.co/iL2wIcSGiY ROCKSTAR @billieeilish COMING THRU WITH THE MOST BEAUTIFUL BOUQUET EVVVVVVEEEER! MADE MY FUCKING DAY! APPRECIATE YOU AND YOUR ART! 🌺 https://t.co/XNNDL9KFJi #MidnightSky is #1 on iTunes UK!! 🖤🖤🖤 #LiveLounge @BBCR1 https://t.co/LIwFCz4Njf RT @NiallOfficial: wowwww ⁦@MileyCyrus⁩ ❤️. ⁦@thisiswatt⁩  https://t.co/5rapabpT4s ❤️💋 https://t.co/s9fDRNSin2 🖤🖤🖤 https://t.co/2tEshsX48i https://t.co/UPEuRPmB1L RT @wtfdoik: Joe Rogan was NOT ready for that 😭 https://t.co/DdBr3gvySM RT @spotifypodcasts: “The voice can be like a face, it collects wrinkles and it tells a story.”\n\n@MileyCyrus is on the @JoeRogan Experience… RT @joerogan: Today on the podcast - the great and powerful @mileycyrus! I had a great time talking to her and wearing @davidchoe’s shirt!… Take It To The Limit- Dedicated to my Mammie... The Eagles were my Mammies favorite band.... and my mama grew up singing this song on drives in the car w her mom! This is in honor of my grandma ❤️ https://t.co/ywTjFbVSoW https://t.co/t7fbGRiDac ❤️ Honored to be the 1st performing for @bbcradio1 Live Lounge Month 2020! @billieeilish “my future”..... https://t.co/ZBGH2kZ3GJ RT @PopCrave: Addison Rae &amp; Kourtney Kardashian visited Miley Cyrus’ #MidnightSky truck to ride the wrecking ball installation. https://t.c… RT @BBCR1: How incredible does #MidnightSky sound in the Live Lounge? 🌠\n\n@MileyCyrus truly is opening #R1LiveLoungeMonth in STYLE ✨ https:/… RT @BBCR1: 'Slide Away' gets us every time 💔\n\n@MileyCyrus brings her perfect sad banger to #R1LiveLoungeMonth and it's stunning. https://t.… RT @BBCR1: We're in love with @MileyCyrus' version of 'my future' by @billieeilish 😍\n\nWhat an amazing #R1LiveLoungeMonth performance! https… RT @BBCR1: Want to play @MileyCyrus' Live Lounge on repeat? (Of course you do!) 🎤❤️\n\nListen in full on @BBCSounds here: https://t.co/LITYaA… Who’s seen the Midnight Sky truck around LA?!?! Come ride my (disco) balls! https://t.co/NVtLgJGb1R BTS #VMAs https://t.co/itDH4Vv6eU only 50 tees available of each 👅 New merch drop ! Limited edition merch with MadeWorn &amp; @harleydavidson https://t.co/2z57U0lyzf https://t.co/KM9tEQtbUc Truth is I didn’t eat the pizza.... I had 4 day old Indian food to celebrate instead. https://t.co/oJBOqkK6kx RT @OCHannahMontana: https://t.co/40D5nuOAH3 RT @BBCR1: 🤩 Who's ready for a @MileyCyrus Live Lounge? 🤩\n\nJoin us at 12pm BST tomorrow when Miley will be kicking off #R1LiveLoungeMonth i… I don’t belong to anyone. https://t.co/kUnTHCortB RT @MTV: Our girl @MileyCyrus has us all gazing at the #MidnightSky tonight! #VMAs 🔭✨ https://t.co/7UVmPix1My #vmas red carpet moment yasssssss https://t.co/QSVeZhwBIw @TheEricaAmerica @MTV @Z100NewYork 💋 RT @MostRequestLive: Had the best time on Zoom with @MileyCyrus on #MostRequestedLive! Thanks for hanging with us - we loved hearing all ab… ⚪️🔵⚫️🔴 Tomorrow @MTV #vmas performing Midnight Sky live for the first time ever! https://t.co/e5X0kRd2Xg ❤️ https://t.co/FyhTOW3crp RT @MostRequestLive: Tonight we welcome the one and only ⁦@MileyCyrus⁩ to #MostRequestedLive with ⁦@OnAirRomeo⁩ to talk about #MidnightSky… #vma rehearsals 💙 TOMORROW I’M PERFORMING MIDNIGHT SKY LIVE FOR THE 1ST TIME EVERRRRR!!!!!!!!!!! https://t.co/VDlIKzo3WP The Making Of Midnight Sky OUT NOW! https://t.co/6dNLKbNd4u https://t.co/GUs2KLfQuM RT @BBCR1: What better way to start #R1LiveLoungeMonth than with the one and only @MileyCyrus? 🤩✨\n\nMake sure you're listening to Radio 1 at… 👏💋 https://t.co/7fnFHj9OeB In 3 days I perform Midnight Sky LIVE for the first time EVER! Don’t miss @vmas this Sunday 8/30! 🤘 https://t.co/Wj0DUDQnsX Go vote Midnight Sky 💋 https://t.co/m1H5t6fen8 RT @cyrusftlovatx: @MileyCyrus @DollyParton miley x rosie from blackpink\n\nhttps://t.co/i2Spm4O7Db RT @camilasjonas: @MileyCyrus kristen stewart... served in #MidnightSky https://t.co/WweQzOArKM RT @kekemoneykp: @katyperry looks so good in midnight sky mv 😻 @MileyCyrus 🔥😍 https://t.co/cT6GnoP7vT RT @vmas: @MileyCyrus Congrats! You're nominated for SONG OF SUMMER for #MidnightSky 🌌\n\nVote now on @MTV's IG Story! Can't wait for your pe… RT @selmakesmerare: Selena looks so good in midnight sky mv🔥🔥 @MileyCyrus https://t.co/pPvfGtfLxU RT @cyrsnitta: @MileyCyrus @DollyParton @Anitta look so good at mv 🇧🇷🤪 https://t.co/AtDJ21RH0r RT @thinkingboutyou: @MileyCyrus @DollyParton do you like mine, hennnnny?  https://t.co/PUDX9v9SWH RT @JavierCyruss: @MileyCyrus @DollyParton @joanjett x @MileyCyrus lol https://t.co/8USQVv6AzZ RT @gayvioli: @MileyCyrus @DollyParton LMAO @MileyCyrus https://t.co/OxMxy65XwP RT @_kcyrus97: @MileyCyrus @DollyParton Think i should get a mullet 😂😫 https://t.co/KsfzslyoGl RT @kaylamedlin7: @MileyCyrus @DollyParton @ddlovato looks so good in ur music video @MileyCyrus 😍 https://t.co/qqPoY2x8a3 RT @smiler_230: @MileyCyrus @DollyParton omg kkkkkkkkkkkkkk #MidnightSky #reface https://t.co/i0jd3KsQFu RT @confide1555: @MileyCyrus @DollyParton Sis- \nSomeone should morph you and kylie \nhttps://t.co/liPHqo8xmI When your godmother @dollyparton looks better in your own video than you do. #midnightsky on #reface ! 👄 https://t.co/6P1qX6xW9p Midnight Sky is nominated for @vmas Song Of The Summer! Vote on @mtv Instagram stories! All the LOVE you’ve shown this song already is blowin’ my mind... this would take it over the top! 🚀 https://t.co/u1xroL42a4 RT @AppleMusic: Keep listening to #MidnightSky from @MileyCyrus on #TodaysHits. 💋✨\nhttps://t.co/GbjeOeSlTq https://t.co/K9WmIehreV 7 years of Wrecking Ball. My concept of time is completely askew. Feels like a lifetime ago... but somehow only yesterday. Thank you for all the support you gave me then and of course the love you’re continuing to show my art today. Forever grateful &amp; inspired. https://t.co/LKRubLOKdZ In honor of my Mammies funeral #Mammie4Evr limited tees are up on https://t.co/G9DhARaS7U.... portion of profits will be donated to @CISTennessee to support children staying in school! My grandma was a preschool teacher and graduated college at 70 years old! My hero! https://t.co/f1wGbT6NuZ https://t.co/Abb366uUm5 https://t.co/1z8talIAKX I will keep your spirit here by continuing to do good for others and treating them the way we all desire to be treated. With an infinite amount  of the same gentle kindness you displayed daily.  We will ache everyday you are not with us.... Everyday I wake and see that fiery ball in the sky I will see your face. Then say a prayer thanking heaven above for giving me the best grandmother a girl could ever be gifted. I will miss you for the rest of my life.... https://t.co/KDjL15xOcE Even though you are gone.... NOTHING has or ever will change. You will FOREVER be my inspiration and fashion icon. Even more than that the ultimate model of being a true LIGHT in a dark world. You are sunshine. https://t.co/FlJHC2N7va RT @MileyUpdates: This is so amazing! You need to check this out @MileyCyrus Midnight Sky / Edge Of Seventeen mashup wow https://t.co/Hz47J… RT @MFPLA: HUGE thanks to our champion @MileyCyrus and our friends at @Postmates for teaming up to support our youth! For every order on Po… live on https://t.co/Wlwm3XU3XO ! Badass fan merch &amp; happy birthday @seancellmore https://t.co/4tVdHhiHtZ 💙 @Postmates https://t.co/48Uumyk4jA @abc123billys @Postmates 💙💙 @thecaracavalli 👅💜 Listen to my latest single on the #TodaysHits playlist on @applemusic, https://t.co/hA5B1KMb6D 💙👅 https://t.co/cUdyJe8vIY RT @MileyEdition: Get the midnight munchies with Miley exclusively on Postmates #MidnightSky https://t.co/3SNGQqvVKI RT @Panda92631294: @callherdaddy gang after watching the interview with @MileyCyrus and Alex I recommend the Midnight Sky playlist on Spoti… Tag their handle below 💙 @Postmates @yourMLKCH @FeedNurses @alfredcoffee https://t.co/grDKAGf8CY RT @BBCR1: 🎤 LIVE LOUNGE MONTH IS BACK! 🎤\n\nGet ready to hear brand new live performances this September from:\n\n⭐️ @AnneMarie\n⭐️ @ArloParks… Obsessed 💋🎤 https://t.co/SGlBPw0Bt6 RT @MissPiggy: Moi is always in tune to the demands of modern fashion. As soon as I saw @MileyCyrus rocking this look, I thought, \"When did… RT @MileyUpdates: Watch Midnight Sky Official Lyric Video by @MileyCyrus: https://t.co/a3hZgQuiu6 ✨ https://t.co/4yIqZWT8Eq RT @zanelowe: Missed the show? Episode 1 of #Essentials Radio with @mileycyrus is now live on @applemusic: https://t.co/YwSZeW7hLn https://… RT @Shazam: Don't forget to Shazam #MidnightSky by @MileyCyrus: https://t.co/onJezrXFvc 🙌 https://t.co/EM3IZFK2fr episode is live now https://t.co/njiZQM4OGq 💋  @AppleMusic @zanelowe @meggrsx 👅 RT @zanelowe: Miley's telling some stories about her songs that are def going to surprise you Joining @zanelowe in 30min for the first episode of #Essentials Radio! Listen only on @applemusic: https://t.co/njiZQM4OGq 🖤 https://t.co/niRyT53CDt Midnight Sky is #SOTD on @amazonmusic. Grab your echo &amp; #JustAsk, “Alexa, play Song of the Day” to listen!!! 🖤 https://t.co/4lxAH25m8M https://t.co/07SZ24Bzys RT @1061BLI: Part 1 of @SykeOnAir's interview with @MileyCyrus drops here tonight at 7:15P EDT! #MidnightSky https://t.co/SPYiwnxdgW RT @YoKidrauhll: #MidnightSky by @MileyCyrus is out NOW is available on all plataforms!\n\niTunes: https://t.co/dqbsQ8L94S…\n\nApple Music: htt… @Y100MIAMI @imarionair ❤️💋 RT @CapitalOfficial: ⚡️ ℑ 𝔴𝔞𝔰 𝔟𝔬𝔯𝔫 𝔱𝔬 𝔯𝔲𝔫, ℑ 𝔡𝔬𝔫'𝔱 𝔟𝔢𝔩𝔬𝔫𝔤 𝔱𝔬 𝔞𝔫𝔶𝔬𝔫𝔢 ⚡️\n\n#MidnightSky by @MileyCyrus is now playing on Capital https://t.co/… RT @MCNewsSource: “Midnight Sky” has re-peaked at #3 on iTunes in the United States! Buy the song now! https://t.co/6XlQKjhdRI https://t.co… Just heard that Midnight Sky is having the biggest radio add week of my CAREER and it’s #1 most added at Pop and Hot AC .... Every radio programmer who added it is rad as fuck and everyone who didn’t well..... 👅👅👅 Big fuckin thanks to my team and bad ass label! https://t.co/82uKLVbpNs RT @thehonestvocal: Woahhhhh! It’s me x RT @KingDaffy1: @MileyCyrus Wassup y’all that’s me &amp; my brother  @trey_lollis first we wanna say thank you to @MileyCyrus for sharing our v… 😻💋 https://t.co/Cajereybfv https://t.co/h8i4fKh2h3 https://t.co/x3PwEnLOZm https://t.co/iC49xiC4NE RT @anthonyandpaul: telling strangers to download midnight sky on omegle @MileyCyrus https://t.co/XkYsKXCe5D RT @MileyCyrus: MIDNIGHT SKY. SONG + SELF DIRECTED MUSIC VIDEO OUT NOW.  \n\nhttps://t.co/yOJzDIctlF https://t.co/vXwXuFt2w6 Welcome 👅 https://t.co/lTR4nEiexD @MileyUpdates @MileyNewsAccess Done !!! @MakeMeFweaky @mirrorsbalI @MileyOfficial Chances of getting us both in the same place at the same time is highly unlikely with our busy schedules these days ......... 💋 @Fwaaky @mxrvelariley ❤️💋 @mileysbiewty @Mifmix https://t.co/kGy73tZjQ3 @peruvianmendes 💋❤️ @gagasyuyi 🇧🇷 @adoreycu @MileysCyrusNews Amazing @MileysCyrusNews https://t.co/YEegy7XhQy @mxrvelariley It’s hard not to notice Brazil 🇧🇷 @justnlopez 😇😇😇 We are not playing this era https://t.co/XtqSdaEpfW RT @fightingmiley: Did it work? @MileyCyrus #MidnightSky https://t.co/tQg4MHmvdU facts ! https://t.co/w218X3GW4r Sometimes you gotta go away to come back 💋 https://t.co/nJAhX7Z8Ay I do https://t.co/BNXv9tCJJM Streaming the wrong song https://t.co/exYFyMR6Ts Me @ the VMAs next weekend... (actually me at the VMAs 7 years ago but who’s countin) 🐻 https://t.co/4Yiwbv8iyI RT @spotifypodcasts: You won’t hear an interview like this on TV 🙃 @MileyCyrus tells #DaddyGang EVERYTHING on this episode of @callherdaddy… Should I put some fan art on some of my merch ? Badass @seancellmore https://t.co/MLCPvSArbl I’m back on Twitter because my mom just said “I use Twitter to find out the latest”..... you know I love tea! What’s good?! RT @MTV: The 𝑴𝑰𝑫𝑵𝑰𝑮𝑯𝑻 𝑺𝑲𝒀 is the road @MileyCyrus is taking straight to the #VMA stage! ✨🌙 \n\nDon't miss her first-ever performance of #Midn… I’m performing at the 2020 #VMAs! Tune in August 30 at 8p on @MTV! @vmas 😻💋 https://t.co/N7QbEk9TmJ RT @MileyEdition: #MidnightSky has a green update and is still holding its place at #3 on iTunes US! 🖤✨\nPurchase the song here: \nhttps://t.… RT @KissFMUK: ⚡️#KISSBreakfast BANGER Of The Week!⚡️ \n\nShe's BACKKK! 🙌\n\n♬ @MileyCyrus - #MidnightSky♬  \n\n🔊https://t.co/JTFXCs5beY https://t… RT @Deezer: .@MileyCyrus is the star of our #RadarWeekly playlist!\n\nWho else is loving her new era? Listen to #MidnightSky and this week’s… RT @hifmradio: The midnight sky is the road we're takin' as we have added @MileyCyrus' new track to our playlist. \n\nWhat else do you want t… @BBCR1 @iamcardib @theestallion @disclosure @FatouDiawara @idlesband @THEREALGHETTS @Jaykae10 @Moonsanelly @jcstewart @theweeknd 😻💫 Fuck. Thank you for all the support. My heart is on fire right now. Gratitude up to 💯. If you haven’t already check the link in my bio to listen to my new single/watch my debut self directed video for Midnight Sky. https://t.co/KvjmqR3Nld RT @Smallzy: I just hit play on @MileyCyrus' new smash #MidnightSky 🙌🏼\n\nWhat a bop 👏🏼\n\nListen here: https://t.co/HLdlKs0oV2\n\n#SmallzysSurge… RT @emilythegem: K but have you heard the new @MileyCyrus or nah @kirbiejohnson 😻 RT @bawbbyshere: i don’t think it’s a coincidence that Annabelle escaped the same day that @MileyCyrus released #MidnightSky https://t.co/K… Stream on today’s top hits 🖤 https://t.co/gU8FdOpjGP RT @MileyMedia: Stream @MileyCyrus’ brand new single #MidnightSky, OUT NOW!☁️🌌🤍\n\n• Spotify: https://t.co/LBLUyBIeUA\n• Apple Music: https://… RT @redcupscyrus: My friend Büşra’s drawning of Midnight Sky music video😍 \nHope you like it queen💫⭐️🌌  @MileyCyrus @MileyOfficial\n #Midnigh… RT @BigTop40: #MidnightSky has debuted in the UK's Top 10 after just two days 👏 @MileyCyrus \nhttps://t.co/5LNogkWV04 💛💛💛 @Spotify https://t.co/KWEm7PJ1Fu @MileyNYCyrus @thehonestvocal 🖤💋 “You should know right now that I never stay put in one place...” 🖤 https://t.co/kUbksKf7D9 RT @MostRequestLive: FOR THE FIRST TIME EVER, the Most Requested Song of the Hour is that hot new @MileyCyrus \"Midnight Sky\" and it's #NowP… RT @WORLDMUSICAWARD: #MileyCyrus tops the Worldwide ITunes Song Chart with #MidnightSky and holds atop the global YouTube Counter for a 2nd… RT @buterabelxo: imagine me not being inspired by @MileyCyrus’s makeup in #MidnightSky https://t.co/bPobsKFKyK @RickyPDillon 💋🖤 Head high up in the clouds because Midnight Sky is #1 on iTunes worldwide ☁️ 🌌 🤍 https://t.co/QGBxIiDYMS https://t.co/I1EmUJLByy 👅🖤 @callherdaddy @minniemouse https://t.co/wWZVI2Fvtf Midnight Sky hit 11 million views in 24hrs &amp; it’s all because of you 🖤🖤🖤 THANK YOU for supporting my art! https://t.co/W1CJPihKMK RT @MCNewsSource: Let’s get #MidnightSky to 9 million views before midnight! Watch here: https://t.co/YXTiLDt4wO https://t.co/e3P8L6vVjK https://t.co/U0jz0h6Vlu https://t.co/40EJObduSd https://t.co/7bkjL7utFj Midnight Sky - Single by Miley Cyrus https://t.co/qqCKbgwbwh https://t.co/5J92pvl2Bm @zanelowe @Beats1 @AppleMusic 🖤🖤🖤 RT @pandoramusic: .@MileyCyrus' brand-new single is about \"taking back control of our own narrative, speaking for ourselves, and having a h… RT @MCNewsSource: “Midnight Sky” is VERY close to reaching #2 on iTunes in the United States! Buy the song now here: https://t.co/6XlQKjhdR… RT @AppleMusic: Needed new @MileyCyrus. 🖤\nListen to #MidnightSky on #AListPop: https://t.co/mQW68x3loo https://t.co/oYNvaQ2s1m ❤️💋 https://t.co/DpbINCH55A RT @SIRIUSXM: There's deep meaning behind the lyrics of @MileyCyrus' latest single, \"Midnight Sky.\" Hear her full interview on @SiriusXMHit… In other news.... #NOFAKENEWS #FACTS https://t.co/kn53jzwWpI RT @TwitterMoments: 🌌 The midnight sky is the road I'm takin' ... ✨\nNew @MileyCyrus is here. https://t.co/psDEZpELYc RT @VogueRunway: With her new song and self-directed music video for “Midnight Sky,” @MileyCyrus is ushering in a new era—one that harks ba… RT @TheOdyssey: 10 Relationship Tips @MileyCyrus Dropped On @callherdaddy That We Can't Stop Thinking About\n\nhttps://t.co/ay9p8ROOI5 RT @MarkRonson: This single is wonderful. And can't wait for you to hear what's karming @MileyCyrus https://t.co/H1Hf81oivo RT @thecaracavalli: #MIDNIGHTSKY https://t.co/VNSHIRFHlT My boobies &amp; new song Midnight Sky out now 💜 https://t.co/g1npOVKBb5 RT @MCNewsSource: New interviews ✨\n\nZach Sang: https://t.co/kTcihU187T\nElvis Duran: https://t.co/wkBtkMVA0B\nSiriusXM: https://t.co/IePKSvJG… RT @AppleMusic: “I felt like my story and my narrative had kind of been told for me over the past year.”\n\n@MileyCyrus is talking #MidnightS… RT @zanelowe: Miley’s back and as honest as ever with the beautiful new moment #MidnightSky. One of her best. And she’s one of my favorite… RT @Shazam: .@MileyCyrus is back with #MidnightSky. Stream our Song of the Day on @AppleMusic: https://t.co/onJezrXFvc 🌗 https://t.co/m5SfJ… RT @RollingStone: Miley Cyrus' new single \"Midnight Sky\" is Stevie Nicks' \"Stand Back\" 2.0. Here's why it's a Song You Need to Know https:/… Done sweet talkin’... I am speaking my truth. Midnight Sky out now 🖤 https://t.co/pxSq9kMgYo RT @mileyshipsta: miley cyrus did what she had to do https://t.co/EByg7b2RtA #WAP Wings And Pizza. Everybody gets one bite https://t.co/CqE0oW1ovo RT @RollingStone: Watch Miley Cyrus’ sassy self-directed video for new song \"Midnight Sky\" https://t.co/1EMggAigax https://t.co/QEIqoLYCjq RT @PopCrave: .@MileyCyrus’ new single #MidnightSky samples @StevieNicks’ 1981 single “Edge of Seventeen.” https://t.co/vCz7v4L0EU RT @iHeartRadio: It's officially here! Listen to the World Premiere of @MileyCyrus' new song #MidnightSky on iHeartRadio! \n\n🌑: https://t.co… RT @ElvisDuranShow: TOMORROW ⏰ @MileyCyrus will be on-air with @elvisduran at 8:45am ET! \n\n👂 at https://t.co/SPlz2AF1sH \n\n#MileyOnElvis in… RT @MorningMashUp: Our friend @MileyCyrus is taking over the show right now to celebrate her new single #MidnightSky!\n\nCome join the fun: h… RT @1035KTU: Missed @MileyCyrus' interview with @TheRealCarolina?! \n\nWatch the full thing here: https://t.co/ZMNlJBcgl1 ❤️\n\n#MidnightSky ht… RT @Z100NewYork: How many times should we play @MileyCyrus' #MidnightSky today?! 🎵 https://t.co/QJ0nzJcDfB RT @milesholy: 2010: asking for freedom\n\n2020: having her freedom\n\n#MidnightSky https://t.co/sscK1uMhDh RT @AppleMusic: She is back. 🖤💋✨\nListen to #MidnightSky from @MileyCyrus now.\nhttps://t.co/AnDMOlcclm https://t.co/sVdqAHXiI8 RT @Spotify: .@mileycyrus just took us to cloud 9 with her new single #MidnightSky. Step into the new era now https://t.co/1q9ksKgw9x https… RT @amazonmusic: .@MileyCyrus nods to the legendary @StevieNicks on new track #MidnightSky ✨ \n\nListen now 🎧: https://t.co/xOMW7hzACK https:… I want to hop into some zooms and celebrate #MidnightSky ! send me links MIDNIGHT SKY. SONG + SELF DIRECTED MUSIC VIDEO OUT NOW.  \n\nhttps://t.co/yOJzDIctlF https://t.co/vXwXuFt2w6 10 mins https://t.co/DpbINCH55A #midnightsky !!!!!! 45!!!! https://t.co/DpbINCH55A #MidnightSky tea with MC on my IG live ☕️ RT @MileyOfficial: Can we get #MidnightSky trending before the release?! RT @godneysjs: Justin supporting Miley is so cute https://t.co/YRyHsKZTnk #MidnightSky https://t.co/PrXjQ21dyW did it work? #MidnightSky https://t.co/n7p2hnPz1m RT @MTV: 💜✨ IT'S REALLY HAPPENING ✨💜 \n\nDon't miss the premiere of @MileyCyrus' video for #MidnightSky at midnight on MTV, MTVU, and MTV Liv… countdown begins NOW......\n\n#MidnightSky song + self directed video MIDNIGHT EST. https://t.co/co0qYgtFBX TONIGHT!!!! @callherdaddy ❤️💋 ☎️ #MidnightSky https://t.co/6xdMSAZ2iT #MidnightSky RT @alexandracooper: CALL HER FUCKING DADDY #MIDNIGHT  @MileyCyrus https://t.co/IU1u0xSAuR WAP https://t.co/5gionEEJTn My self directed video for Midnight Sky is dropping Aug 14! 💕 https://t.co/PicwP8jJUr #MidnightSkyIn2Days https://t.co/DOu4O3zbvD https://t.co/In8Qsb6SGe #MidnightSkyIn2Days https://t.co/DOu4O3zbvD https://t.co/UfQQP8DL6R RT @ElvisDuranShow: And they'll be talkin on our show this Friday 😉 Can't wait to catch up with you @MileyCyrus!!! #MidnightSky RT @MileyNation13: SMILERS we are already TT in Brazil &amp; Spain... keep tweeting!! ✨  #MidnightSkyIn2Days https://t.co/JHGGjtHgUh RT @unholyswiftie: Can’t believe @MileyCyrus is finally coming...and in just 2 days 😭y’all better stream and buy\n\n#MidnightSkyIn2Days #Midn… @XHSMGX @MileyCyrusBz 😍 RT @billyraycyrus: Can't wait for #MidnightSky out this Friday! So proud of you @MileyCyrus! https://t.co/v1MqyuZTDT RT @SheIsCumming: @MileyOfficial @MileyCyrus I preordered last night! #MidnightSkyIn3Days 💖 https://t.co/VGFhtVzD4w RT @andreagiannett2: @MileyOfficial Already pre-ordered! 🔥 #MidnightSky #MidnightSkyin3Days https://t.co/sIHPo1yGem RT @MileyCyrusBz: #MidnightSkyIn3Days \n\nHave you pre-ordered? ✨ https://t.co/m0xp8HDOzp RT @callherdaddy: SHE IS COMING #CALLHERDADDY 8/14 https://t.co/fsXvdAikYx See my lips on her mouth everybody’s talkin now..... 💋 https://t.co/DOu4O3zbvD https://t.co/P8Tq32hpHs RT @MileyCyrus: I know it feels like you’ve been waiting forever and ever .... but no more..... She is finally here. \n\nMy new single MIDNIG… https://t.co/eGpSsFPGGc Forever and ever no more. 🖤  The #MidnightSky is the road I’m taking.... head high up in the clouds. https://t.co/grk9Sk9oWJ RT @elliegmichael: @MileyCyrus literally so embarrassed i cannot https://t.co/A3imiGo6N2 I was born to run. I don’t belong to anyone. (And yes I can run in these fucking heels cause I’m a BOSS) https://t.co/DOu4O3zbvD https://t.co/fGpiJUBrMx Happy b-day @Vijatm ❗️📸🎈❤️🎤🎸🌑💥🕷🌹🎱🍷 (shot on set of Midnight Sky) https://t.co/nlzM12hpwo RT @forreal_isaiah: @PopCrave @MileyCyrus LMFAOOO THAT WAS HER https://t.co/hU2cHxTHZZ RT @PopCrave: .@MileyCyrus pranked fans with cryptic text messages ahead of her new single release #MidnightSky. https://t.co/cjZBp7PLhI RT @jsgirardin: @MileyCyrus No one at work believed it was you, even though I called four times 🥴😂 https://t.co/YPe7SmS8Kp RT @whatevermagz: @MileyCyrus YO I WAS JUST AS LOST; I was getting coffee with a friend and we spent like an hour deciding if I should call… what’s your Venmo ? https://t.co/xyaw1lJdMA 1-833-SHEIS-MC https://t.co/PEBuLTeVS6 Me sending those cryptic ass messages to fans . https://t.co/ajGAjuq8cv RT @Elle_Pletnick: Lmao got this text earlier and got concerned and I mispelld my response ( i was working ) ;' so then I spent time googli… RT @fweakymc: NOT MILEY CYRUS ENDING RELATIONSHIPS 💀 @MileyCyrus https://t.co/9cdQQ4ca8E I know it feels like you’ve been waiting forever and ever .... but no more..... She is finally here. \n\nMy new single MIDNIGHT SKY. AUGUST 14th. PRE SAVE NOW.\n\nhttps://t.co/DOu4O3zbvD https://t.co/o4CR1yZtHn RT @alexIovesariana: @gimmethecloot @MileyCyrus it happened to me 😂😂 https://t.co/dDPlOrXPyD RT @Narcissusxchai1: @gimmethecloot Shit just happened to me lol I do t even know wtf? Last time I let my friend use my phone lol https://t… RT @KarlaPaulina_: I got nervous af when some random number text me to call them this morning. I asked my sisters if they recognized the #… RT @kindabritt: I forgot I subscribed to texts from Miley Cyrus’s hotline for new music and I was so confused and scared at work https://t.… RT @DUALIPA: bromance https://t.co/fJasjQD0Si Dua has heard what you haven’t.... 🌑 https://t.co/YCJKV6WoEH MIDNIGHT SKY https://t.co/N9RrO6o5kO TEASE. https://t.co/TsFGvsGB4T Meet Miley Cyrus..... again. #SheIsComing #ButForRealThisTime 🎸🖤🎤 https://t.co/3Cc3UL1m8O @NachDiller ❤️ That shady side eye to y’all who ain’t wearing your recommended, in many places MANDATORY masks. Psh. 😷 https://t.co/9QOzILDrjE RT @Z100NewYork: JUST ANNOUNCED Our iHeartRadio Music Festival is BACK for its 10th year on Sept. 18 + 19! ❤️\n\n@bts_bighit, @MileyCyrus, @k… RT @iHeartRadio: 🌟🖤 @MileyCyrus 🖤🌟\n\n#iHeartFestival https://t.co/znCmbBlCvn https://t.co/6HAUsBhvPu This was in 2017. Feels EVEN MORE relevant right NOW. It ain’t a Party In The USA until we see #LibertyandJusticeFORALL you heard me, FOR ALL! #fuckthefourthuntilthereisfreedom https://t.co/QNRrIknL0R RT @bbcglasto: 🚨 SPECIAL GUEST ANNOUNCEMENT 🚨 \n\nToday's addition to our Glastonbury Experience Channel is one of last years stand out Pyram… I look forward to working w you and @GlblCtzn in the future! This is not the end by any means, it is only the beginning. https://t.co/OShvpQm84k Truly honored to be a part of making sure everyone has equal access to testing, treatments and vaccines. We will keep working together to help fight COVID-19 #globalgoalunite ❤️ https://t.co/3YIZK6ybCa I dedicated this performance to everyone who is working tirelessly for testing, treatments and vaccines so all of us can come together in places like this empty stadium.... I can’t wait to be together again 💛 https://t.co/05zMGnZazZ #GlobalGoalUnite During this time of COVID-19, we are coming together in a different way...we are uniting with the goal of ensuring EVERYONE has access to the solutions to end this pandemic. For me, the magic of performing is sharing and celebrating music together...being surrounded by people and feeling their energy! Honored to join PM Solberg @erna_solberg and @GlblCtzn to talk about the disproportionate impact of covid-19 on marginalized communities and how our generation is speaking up to demand action and change! #GlobalGoalUnite https://t.co/OBSuw4sOGX RT @GlblCtznUK: 𝗪𝗘 𝗔𝗥𝗘 𝗟𝗜𝗩𝗘! Watch the #GlobalGoalUnite concert right here 👇\n\nWe've already mobilised $6.9 billion to get COVID-19 tests, t… ❤️👏 https://t.co/ntxY1qTODV Starting soon! #GlobalGoalUnite https://t.co/zcnOxpXbBC RT @GlblCtzn: We’re LIVE for the #GlobalGoalUnite Summit, hosted by @katiecouric! Tune in as world leaders and philanthropists come togethe… RT @GlblCtznUK: T O D A Y ! 🥳 #GlobalGoalUnite @MileyCyrus \n\nWhen? Summit: 2pm BST // Concert: 7pm BST.\n\nWhere? All info: https://t.co/cYJJ… I’m joining @glblctzn &amp; @EU_Commission for the #GlobalGoalUnite Concert to fight for equal access to COVID-19 healthcare for everyone, everywhere. Join us tomorrow: https://t.co/9TZVUifjhs https://t.co/L01j5gxcpv RT @GlblCtzn: We can’t stop, and we won’t stop fighting for equal access to COVID-19 tests, treatments, and vaccines, and neither will @Mil… RT @marcmalkin: I've talked to @mileycyrus a lot over the years. But this is probably my favorite interview because we spent some real (Zoo… RT @GlblCtznCAN: .@shakira, @Usher, @MileyCyrus, and more are all on deck to perform at #GlobalGoalUnite For Our Future. See who else will… At a time when we have seen the injustices in our societies increase even more, we now have the opportunity to unite and take a stand for equality and health for all!! Join me on June 27 for a performance that I’m really excited about. https://t.co/9TZVUifjhs Honored to be a part of #GlobalGoalUnite for Our Future hosted by @GlblCtzn to make sure that EVERYONE, EVERYWHERE has access to the solutions that will help end the COVID-19 pandemic — testing, treatments, and vaccines. https://t.co/J6YHRJ5I8b @MCistheQUEEN @MileyCyrusBz ...I couldn’t stay Hannah Montana forever and they knew that, but they also didn’t want me to make a mistake that couldn’t be undone. Been so fortunate to have loyal fans (like you) who have always allowed me to experiment and evolve. @MCistheQUEEN @MileyCyrusBz First G.A.Y london performance! I wore a dress I knew would piss everybody off and that was around the time I really began to “spread my wings” &amp; felt free. But....also it took a lot of guts because people around me were saying I would lose all my fans and my career would be over @mileyshippie @MileyCyrusBz Heart beats for love feels even more relevant now. Celebrating pride month while being an out &amp; proud member of the LGBTQ+ community is such an honor and I am so lucky for those who paved the way for me to live a life full of freedom and love! #PrideWasAProtest @downfourit @MileyCyrusBz Now listening to Robot all I can think about is “Ashley Too” .... during those days I did feel a lot of pressure to “conform”  I was lucky I had no “ aunt Catherine” though. My parents have alway encouraged me to be experimental. @rootingforlove @MileyCyrusBz I grew up on rock n roll.  Nirvana, Joan Jett, Blondie..... so I was just super inspired and influenced by the artists my dad rotated on our juke box. @GlblCtzn https://t.co/mntvLIkDmC Hi @JustinTrudeau...there are WAY too many beliebers in Canada to ignore @JustinBieber’s call for support! Please join us and support funding for testing, treatments and vaccines for everyone, everywhere. #globalgoalunite. https://t.co/RqfTRiUM5D Grazie mille ! Looking forward to new funding commitments on June 27 needed to provide access to treatments &amp; a vaccine for everyone, everywhere. #GlobalGoalUnite https://t.co/aLjii17ymo Thank you! Will you join us on June 27 for #GlobalGoalUnite to help close the funding gap for the most vulnerable? Testing, treatments, and vaccines for everyone everywhere ... We need your leadership! https://t.co/c86AeO4DFz 🇳🇱 https://t.co/Lf7sWglZVM 🇮🇪 https://t.co/Lf7sWglZVM 🇪🇸 https://t.co/Lf7sWglZVM 🇮🇹 https://t.co/Lf7sWglZVM @MinPres All across Ireland 🇮🇪 citizens joined in solidarity with Black Lives Matter in the US. We must stay united with the world to tackle #COVID19 and the racial injustice of health inequalities. Please join us, PM @LeoVaradkar? #GlobalGoalUnite⭕ Across the Netherlands🇳🇱 you united in solidarity with Black Lives Matter in the US. We must keep standing together to tackle #COVID19 and the racial injustice of health inequalities. Please join us, PM @MarkRutte? #GlobalGoalUnite⭕️ Spain, you united in solidarity with Black Lives Matter in the US. We must keep standing together to tackle #COVID19 and its disproportionate impact on marginalized communities, especially communities of color. Please join us, PM @sanchezcastejon? #GlobalGoalUnite⭕️ Italy🇮🇹 and the world united in solidarity with Black Lives Matter in the US. We must stay united to tackle #COVID19 and its disproportionate impact on marginalized communities, especially communities of color. Please join us, PM @GiuseppeConteIT? #GlobalGoalUnite⭕️ BlackLivesMatter https://t.co/QN73WYcePA https://t.co/Htmw0rmpot A day to listen &amp; learn.... @happyhippiefdn and I will continue posting information and resources to amplify black voices and community organizations. Please do not forget that today is PRIMARY ELECTION DAY in several states! For more info visit https://t.co/9SovQwVBrm RT @BLMLA: We need everyone to show up...virtually...to tell LAPD that it's about more than #GeorgeFloyd...It's about the 601 of our people… RT @ACLU: In Minneapolis, Black people are 13 times more likely to be killed by cops than white people.\n\nOfficer Chauvin had 17 previous co… RT @AyannaPressley: Congress must ACT.\n\n@IlhanMN &amp; I just introduced A Resolution Condemning Police Brutality with @BLeeForCongress @KarenB… RT @ACLU: Derek Chauvin, the police officer who murdered George Floyd, was arrested.\n\nThis is not enough. We have much further to go — incl… @r6nchsauc9 Sample scripts in here! https://t.co/CXpPrCcRMW RT @ACLU: Join us in calling for justice for George Floyd. Take action now. Please call the Minnesota Governor at 651-201-3400 and Attorney General to demand #justiceforGeorgeFloyd. They need to be held accountable. We can’t stand by, we need to each do our part to make justice for everyone a reality. https://t.co/CXpPrCcRMW Like so many of you, I am angry, outraged and heartbroken about the injustice in our country that has been going on for way too long- centuries &amp; generations. To my fans, each one of us has a voice—I’m asking you to please use it right now. https://t.co/2Vfi2LvB1v RT @EU_Commission: We kick-off a campaign with @GLBLCTZN to step up the mobilisation of funding and overcome this pandemic\n\nIt will culmina… RT @GlblCtzn: An urgent message from @MileyCyrus: We need to come together as a global community to beat the COVID-19 pandemic. Join Global… The mullet is officially back when ‘08 Miley says so..... perioTTTTT https://t.co/D8FaEK2KWB RT @voguemagazine: .@CodySimpson's new music video is styled and directed by girlfriend @MileyCyrus. Watch it here: https://t.co/acTOfAfD5A Thank you @ddlovato ! ❤️ Thank you @thewebbyawards ! Thank you to everyone who made bright minded so magic! #StayLitInDarkTimes https://t.co/tYB67rijOC RT @TheWebbyAwards: For her Instagram Live show, Bright Minded, we're excited to present @MileyCyrus with a 2020 Webby Special Achievement… fresh perspective, innovation, and ACTION! The future is yours! I’m on your team! #Graduation2020 Congrats to all of the high school and college graduates of 2020! It was my honor to celebrate all you’ve accomplished! This isn’t the end but just the beginning! I look forward to seeing how you all use the tools and skills you’ve been given to create a world fueled by - https://t.co/YP9wXsMRxP #Graduation2020 https://t.co/PLH6B3nwT2 It is the 5 year anniversary of @happyhippiefdn and cover of Don’t Dream It’s Over with ⁦@ArianaGrande⁩ 💛 https://t.co/13kqCBrySa RT @MileyOfficial: Tune in today! @MileyCyrus will be part of #Graduation2020 on FB @ 11a PT/2p ET at https://t.co/NJN2qovyI3 https://t.co/… 3 YEAR ANNIVERSARY OF MALIBU 🎈❤️🎈❤️🎈❤️🎈❤️🎈❤️🎈 https://t.co/QZjkzohtlA Mothers Daughter for life! @tishcyrus Most supportive mommy ever ! You always told me I would make it , so I did it! So thankful for you always! Love you! https://t.co/2eUxct2sjj Category is : Wear a mask for the safety of yourself and others .... but make it fashion! 👅 https://t.co/prpCQsknYL Bean is queen! 💚 https://t.co/wWAgl2jdPs https://t.co/wznvxDOX6o https://t.co/jXiSzb3GJY RT @AMarch4OurLives: Ahmaud Arbery should be alive with us today. He deserved for his life to be valued, and for justice to be served when… 💛💙💚💜 https://t.co/wznvxDOX6o https://t.co/oruhcSiSPV Wash. Your. Hands ❤️❤️❤️ https://t.co/KbCjuxTqdS 💜💚 @WSJMag https://t.co/wznvxDOX6o https://t.co/86CArlm6Qe RT @WSJMag: “Miley has never been afraid to take risks or put herself out there. This new role really seems to suit her, and you can tell s… RT @WSJMag: “I am protective of all my guests, no matter how famous or how not. I want people to shine,” says @MileyCyrus. We talked to the… Bringing the BRIGHTNESS to  @WSJMag 💚💜💚💜💚💜💚💜💚💜💚💜💚 #wsjmagazine\n\nhttps://t.co/wznvxDOX6o https://t.co/58iLOzjSvH RT @jessetyler: It’s Saturday Night! Let’s get turnt up! (Text &amp; music by @MileyCyrus. Piano by @ourladyj). https://t.co/5GyoQOU1js https://t.co/jS68rH2fWL https://t.co/W4Owohn5bR 💔 #LoveLockdown with @MarkRonson in 30 mins ! Tune in https://t.co/Z6E2Xyuuue https://t.co/wS8oewYZgp RT @RockNRollPics: Paul McCartney, Joan Jett &amp; Miley Cyrus attend the 30th Annual Rock And Roll Hall Of Fame Induction Ceremony at Public H… RT @MileyOfficial: Miley Cyrus - Wish You Were Here (At Home) on ⁦@nbcsnl⁩ #SNLAtHome  https://t.co/KYzm5XDsC1 @StevieAiello @nbcsnl 🖤🖤🖤 WYWH SNL #SNLAtHome https://t.co/nHkM5NNJ7u #SNLAtHome .... performing “wish you were here” ❤️ @nbcsnl https://t.co/9zKK4VLCTt RT @nbcsnl: 🔥🔥 @MileyCyrus 🔥🔥\n#SNLAtHome https://t.co/fK3eXVk3gI RT @nbcsnl: Who's ready ⁉️\n#SNLAtHome https://t.co/iHax0BIXTf this is amazing ! #mileyvirtualconcert https://t.co/MqfaKIqmU2 2015 version..... WAKE UP WORLD! #EarthDay 💚 https://t.co/5T5WjjjhK4 RT @joanjett: .@MileyCyrus inducts Joan Jett into the Rock and Roll Hall of Fame-- Five years ago this week 🖤 https://t.co/OGJZCu15aL reflecting on earth day and thought back to this song I wrote &amp; released in 08 &amp; feel like these words are truer than ever! Especially after my conversations w/ climate change activists last week, I know that if we come together NOW we will create change &amp; action! Happy earth day https://t.co/IIHZByvam5 I won’t be smokin’ but the rest of my fam sure will be tokin’ 💚Happy 4/20 y’all! 💨 https://t.co/307pdyYE6l Here's a playlist of all the #BrightMinded episodes on @youtube ! #StayHome https://t.co/rX0Saozq9M Bright Minded #HightlightingHeroes with Senator @ewarren on @youtube now! #stayhome https://t.co/ZvCqgPouM2 Today on #BrightMinded #HighlightingHeroes @goodgoodgood @xiuhtezcatl https://t.co/SbtFG68ha3 RT @ewarren: Nobody should have to choose between protecting their health and exercising their right to vote—and all of us should get invol… RT @ewarren: I’ll be live with @MileyCyrus’s #BrightMinded show on Instagram at 2:30pm ET. Hope you’ll tune in! Today on Bright Minded: #HighlightingHeroes Senator @ewarren https://t.co/IjmPYaU5yN Bright Minded #HighlightingHeroes! @7GenFund, @beauty2streetz, @MFPLA Ep 18 https://t.co/VNPZxGTIjZ #StayHome Today on #BrightMinded #HighlightingHeroes @MFPLA @beauty2streetz @7GenFund https://t.co/YWTrvTuhj2 #HighlightingHeroes: \n@chefjoseandres, @2harvestMidTN -  Ep 17 now on \n@Youtube! https://t.co/22WpvAfZPC #StayHome Today on #BrightMinded #HighlightingHeroes: @chefjoseandres @2HarvestMidTN https://t.co/2foBrDtDLm #HighlightingHeroes Dr. Oscar L Maitas, Dr. Syra Madad -  Ep 16! https://t.co/T8Xh1UXBRj #StayHome Let’s highlight heroes who are making a difference in our communities during this time - use #HighlightingHeroes on IG and Twitter to submit so I can highlight on Bright Minded this week! https://t.co/DackSiUqJT Today on #brightminded! #HighlightingHeroes https://t.co/WslLuUMDo6 Hoppy Easter 🐰 https://t.co/YccamTEHBp 1 week special starting Monday! #BrightMinded #HighlightingHeroes https://t.co/Lw1Ys7FBEB RT @SSChospices: On #WorldHealthDay our amazing hospice nurses and carers have taken some inspiration from @MileyCyrus and put together thi… RT @MACcosmetics: Now’s your opportunity to help make a difference right from home. Get the Lipstick that gives back to those impacted by C… Episode 15 with @eltonofficial, @kerrywashington, @selenagomez, @jimmyfallon up now! https://t.co/9Vfy9MVQCn #stayhome RT @kerrywashington: Thank you for having me @MileyCyrus! &amp; for helping me uplift the work that @medshare’s doing to provide medical suppli… RT @FallonTonight: .@MileyCyrus reveals the truth behind the lyrics in her song “Malibu” https://t.co/ecc28kZKhx #FallonAtHome https://t.co… RT @FallonTonight: .@MileyCyrus shares how one of her favorite throwback songs “Can’t Be Tamed” foreshadowed her current career https://t.c… RT @FallonTonight: Jimmy talks with @MileyCyrus tonight on #FallonAtHome! https://t.co/4SOJGlJn6P RT @eltonofficial: Elton joins @MileyCyrus today for #BrightMinded: Live with Miley, her live @instagram show about \"staying lit with love\"… Tomorrow! Finale Friday! #BrightMinded @kerrywashington @eltonofficial @selenagomez @jimmyfallon https://t.co/7Q9fAPdP2X RT @FallonTonight: .@MileyCyrus is on the show Friday!\n\nIf you’re a fan and you’re currently volunteering or working on the frontlines, we… Tomorrows ep of # BrightMinded is all about Zero Waste &amp; Poetry! 💚 https://t.co/ENbsuQu3Sg Today on #BrightMinded! @Anitta @ZoeKravitz @diplo #ashleylongshore https://t.co/URD4FNOnh7 Tomorrow! April Fools episode with Ashley Longshore @ZoeKravitz @diplo @anitta https://t.co/BehbbrXMGF RT @ashleygraham: Alsoooo super excited to be on Bright Minded with @MileyCyrus on her IG live today at 3:20pm 💕 ✨ 🌈 Self care episode today on #BrightMinded! https://t.co/yA8xOQFajb episode 11 with Zion Clark, @aliciakeys, @SelmaBlair, @Milliestopshate up now on @Youtube! #StayHome \n\nhttps://t.co/5YpwQB5rx9 🌈❤️ https://t.co/7DCga8LiQH Self care episode tomorrow! https://t.co/JJXi9vIixY Waaaayy tooooo late https://t.co/A0ttODNGEh Wayyyy to real. https://t.co/CdQIgBWRj2 Today! https://t.co/c9Jz9SNggq Motivational Monday! Tune in tomorrow! @aliciakeys @SelmaBlair @Milliestopshate #ZionClark https://t.co/N10gyReknt Episode 10 up now on @Youtube! @nicolerichie @ParisHilton @Vijatm @michellevisage #lgbthistory\n\n#StayHome \n\nhttps://t.co/kH3dAacrdr Send in your questions for Paris on Bright Minded ! I’ll shout you out and get your 🔥 questions answered! https://t.co/1LLGYNvO6r #BrightMinded episode 9 with \n@antoni @MarkRonson @RyanTedder @ilsey UP NOW! \n\nhttps://t.co/Fspq3b7YQt RT @NikaraJohns: It’s 2020 and Miley Cyrus has the best guests on her MAKESHIFT INSTAGRAM TALK SHOW. Networks are shaking. Tomorrow! @nicolerichie @ParisHilton @Vijatm @michellevisage On bright minded! With 5  LGBTQ facts in 5 minutes by lgbt history ! Tune in! 11:30 AM PT https://t.co/FI2ArF1Uip RT @instagram: Mindfulness ✨ + music 🎶 + puppies 🐶= pure joy 🌈\n\n#TakeABreak with singer @MileyCyrus, right now on our IGTV. https://t.co/u9… #BrightMinded episode 8 with @ReeseW @HilaryDuff @BebeRexha @DUALIPA is up on YT now ! 🌈\nhttps://t.co/1WpAccDhvO Tomorrow! To start the show, Cooking lessons with @antoni on ways to keep food fun in times of limited options and responsible rationing! Then SONGWRITING camp with some of the best in the world! @MarkRonson @RyanTedder @ilsey #BrightMinded https://t.co/p98bx3Q1lV RT @BebeRexha: 💞 @MileyCyrus https://t.co/KBMycsEHSY 🌈🎉❤️ https://t.co/QkoIZSxBWn RT @MileyOfficial: Miley will be joining @zanelowe at 9:30 AM PT. Listen live here: https://t.co/dw9Em883By It’s Women’s Wednesday! With 4 special guests! @ReeseW @hilaryduff @beberexha @dualipa #BrightMinded 11:30 AM PT https://t.co/Zgby4QEHYy RT @UKMileySupport: RT this tweet if you want @MileyCyrus to discuss heartbreak/break ups/love and what advice she would give to anyone str… #BrightMinded episode 7 with @tishcyrus @billyraycyrus @noahcyrus &amp; @stassi up now! 🌈\n\nhttps://t.co/ecaJ1p64H7 RT @Z100NewYork: THANK YOU @MileyCyrus for your show #BrightMinded. You're creating a sense of community, positivity and support that is tr… @EmilyOsment @Claire_ifying Ready when you are! #MileyandEmilyForTeenVogue Tomorrow on #BrightMinded #LiveWithMiley #WomensWednesday 🌈 @ReeseW @HilaryDuff @beberexha @dualipa https://t.co/kCJlbL0yqO Ketchup may be a great hand moisturizer BUT NOT sanitizer! Happy Hannah-Versary! #14YearsOfHannahMontana ❤️ https://t.co/4Snz1hD86A My #BrightMinded official theme song is now up on YouTube ! Check it out ! Make your own #FanArt intro and I’ll post and tag ! Thanks for watching and I’ll see you tomorrow live on my Instagram!  https://t.co/X3vMW5kE6H my official intro for bright minded is up on youtube now ! Check it https://t.co/XcJIefh2Oe https://t.co/d6uq3lOrmv https://t.co/hd0CrItYDZ Tomorrow on #BrightMinded #LiveWithMiley 🌈💖🌈💖 https://t.co/LM7u5fQTuI #NewProfilePic https://t.co/SQepoSJrRo I am #FanFocused but really Hope everyone else out there is enjoying it too! I ❤️ you! Wow! What a first week of #BrightMinded  #🌈💖🌈💖@Kaqui_ slayed this recap!  My whole career , a lot of my life , all my accomplishments , so much of my joy has been created by my fans ! It’s only right that Bright Minded is #FanMade! https://t.co/GHm1Y6lIox RT @MTV: I've been working from home, which means I don't need to change out of my sweatpants because @MileyCyrus said so!!! #AloneTogether… RT @MTV: Pls enjoy these words of wisdom from Social Distancing Guru, @MileyCyrus! Being #AloneTogether just got a lot easier! 👏 https://t.… Watch #BrightMinded #LiveWithMiley Mon-Fri 11:30AM- 12:30PM PT !!!!! @billyraycyrus (aka Dad ) for Devotionals With Dad! 💕 Tune https://t.co/a0DBmlfyJC Tomorrow!! #BrightMinded https://t.co/5iSFYo8Q3L Keep checking in Mon-Fri 11:30am - 12:30pm PT for more ways to get involved and join the fight against Covid-19! Stay LIT! 💡 So many of us are feeling helpless and hopeless! Let’s channel that energy into action! If possible, please join me in supporting @FeedingAmerica @2HarvestMidTN @oasisnashville \n@calfund 🌈 https://t.co/1mM2wGmx6P 🌈❤️🌈 https://t.co/xsTlbQvy9w Tomorrow on #BrightMinded #LiveWithMiley 11:30am - 12:30 pm Special Guest @ITSJEREMYSCOTT https://t.co/SGGZbHVX1y RT @VogueRunway: “This may not be how Ellen does it, but it’s how I do it,” @MileyCyrus has a new IGTV program, Bright Minded: Live with Mi… @RitaOra all the way from the Uk on Bright Minded tomorrow! It will be so interesting to hear a perspective from somewhere so far from where I am located, the differences and similarities of the Covid-19 experience.... love you Rita thank u https://t.co/kl6GAS2xm5 #BrightMinded #LiveWithMiley gets a little more official each day! What’s a talk show without a custom mug thooooooo?!?!?! Working on creating some for purchase and the profit will go towards supporting the foundations discussed on today’s episode! Stay tuned! https://t.co/MvY2qprfkt RT @StylishCyrus: Who else wants Bright Minded merch?! 🌈 @MileyCyrus https://t.co/LKpiO0A4YQ 💛💛💛💛 @happyhippiefdn @tiktok_us https://t.co/PbV9lsB8Cz Quarantine puppy date #BrightMinded @ddlovato https://t.co/PsEadX0wBt 😂🌈 #BrightMinded @tiktok_us https://t.co/PuH0lqsEq4 #BrightMinded episode 2 with @ddlovato is up now !! 🌈https://t.co/rX0SaohPie https://t.co/w1D8eMavYW MOOD until further notice 🌈 ( Watch Bright Minded: Live With Miley Mon-Fri 11:30am-12:30pm PT ) on my IG live! https://t.co/3Nx6EBYsPg Mood at all times https://t.co/u4Tj3Ix1KQ @MCyrusArgentina Love !!! 🌈 Uploaded the first episode of #BrightMinded #LiveWithMiley on YouTube! https://t.co/fsB4eM0ZTV TOMORROW 11:30 AM PT  Workout with winsorchoza pilates , Hangin’ with @amyschumer and her hubby Chris Fischer AND talking to @Need4LSpeed and @camrhamilton ALL about Love Is Blind! It’s gonna be LIT! https://t.co/R5lLsRYeWQ Lovatic for Life ! https://t.co/kQAt85mufs RT @iHeartRadio: .@MileyCyrus and @ddlovato talked staying positive, their Disney days and more on Miley's latest 'Bright Mind' Instagram L… RT @MileyOfficial: Who’s ready for #BrightMinded #LivewithMiley?! Special guest @ddlovato! https://t.co/G6DjUg8OM4 BRIGHT MINDS = 🌈 https://t.co/A2w6ML9jD9 Tune in tomorrow to my insta live series #BrightMinded #LiveWithMiley to see me and @ddlovato talking about keeping it LIT in dark times! https://t.co/tJOIr2ZMjw it’s incredibly difficult to make smart decisions while panicking , but think twice before following the fear and being inconsiderate. There is enough to go around if we take care of one another. This is a beautiful time to LEAD! Be thoughtful. Respectful. Compassionate. HUMAN. while preparing for social distancing.... NO ONE needs every soup in the store, The more we hoard the more expensive and sparse necessities will become, leaving many without essentials. This is a great time to practice restraint... https://t.co/LfLflFfG8c Day 2 Quarantine https://t.co/1oUZRi8PsJ https://t.co/0ZKt5jFXhs wash your damn hands. #WashYourLyrics https://t.co/hXF0HPrWi3 I am so disappointed to not be there, but I have to do what is right to protect the health and safety of my band and crew. I will still be making a donation to help the victims of the Australian bush fire.  I’m sorry to miss everyone in Australia, but I will be back soon. Australia: Due to the recommendations of local, state, federal and international government authorities, including the Center for Disease Control, to reduce potential health risks in response to the current global health crisis, we are no longer traveling to Aus for the show. Look who came to rehearsal ?!?! @itsjojosiwa !!!!!!! world Tour Bushfire benefit concert! March 13 in Melbourne! https://t.co/WddGGa82OV I am Miley Cyrus &amp; this is my first “jitter gram” ...... #OnlyForAustralia #ILoveAustralia #AndObviAustralians ❤️🇦🇺❤️🇦🇺❤️🇦🇺❤️🇦🇺 @worldtour March 13th In Melbourne Bushfire Benefit Concert !!!! https://t.co/cfLWJoNJyf Get your tickets now, Party while saving animals and restoring Australia’s wildlife! 🖤 https://t.co/rIPNpH8edC Covering Aussie band @jet.theband CLASSIC WORLDWIDE SMASH RECORD “Are you gonna be my girl?” March 13th in Melbourne at the Bushfire Relief Concert! I’m bringing @lilnasx w me! You’ll never guess what we have up our sequined sleeves!!!!! https://t.co/PqflqVIaAL MT X THE WHOA https://t.co/9Rew7gKdmC Australia next week! Tix: https://t.co/rIPNpGQDm4 https://t.co/8i65yMrDKR RT @happyhippiefdn: Donate to the Middle Tennessee Emergency Response Fund at https://t.co/iGd2zmCzet. #nashvillestrong 💛 https://t.co/JJ7n… RT @happyhippiefdn: Sending all of our love and support to our #HappyHippie family in #Nashville affected by the tornadoes. The city is clo… Follow @happyhippiefdn for updates on shelter and ways to get active! I am receiving information just as fast as everyone else at this point so stay tuned and we will share info as quickly as possible! Thinking about my home and family in Nashville and how fortunate I am that my place and loved ones have remained safe in these deadly tornados . My heart is broken for my home state. So much loss and damage. We are #NashvilleStrong and will rebuild together! https://t.co/nPbGPbfNqy RT @sunriseon7: \"More than almost anywhere in the world, I think I've had more of a personal relationship with it because of the amount of… best friends forever https://t.co/VFOFMs7Eq8 ❤️❤️❤️ https://t.co/PutIczlhBd See you March 13th Melbourne! ❤️ https://t.co/7TWaPOHT2Q RT @ausgrandprix: Tickets for the @worldtour Bushfire Relief charity concert are on sale to the general public NOW! See @MileyCyrus &amp; speci… 🇦🇺👋 https://t.co/CKSXeC94PC Australia - tix for the Bushfire Relief charity concert on Friday March 13th in Melbourne are on sale NOW! https://t.co/rIPNpH8edC https://t.co/Xue3CLTiGz RT @sheis_skye: IM SO READY!!! 🇦🇺🇦🇺 I wasn’t even able to sleep ahh. tixxx come my way, bring on 2pm @MileyCyrus🤞🏻 Tix go on sale at 2pm AEDT https://t.co/rIPNpH8edC  🇦🇺 you ready? https://t.co/0lSWlGgtbK @ObsessedSmiler @Spotify thank you !!! 💚💚 @sheisMC23 @Spotify Yas ! ❤️  @Spotify https://t.co/cl1p7j2aw5 RT @ausgrandprix: Just announced! @MileyCyrus will headline the @worldtour Bushfire Relief charity concert to benefit Australian fire relie… Proceeds from ticket sales will go to Australian charities working to restore forests, wildlife, and communities affected by the devastating fires. \n\nTix on sale 2pm AEDT tomorrow: https://t.co/rIPNpH8edC AUSTRALIA! I’m so excited to announce I’m headlining the World Tour Bushfire Relief charity concert on Friday March 13th in Melbourne !! Bringing out @LilNasX + more! ❤️ https://t.co/X6vDqB6eeF Find u a dude that fuels your Brit fantasy ! https://t.co/Acu2JKGG0i Munich! On sale now https://t.co/LL5vESAqau https://t.co/PXajS0b8dj On sale now! @LollapaloozaDe https://t.co/4iBeY11yjn https://t.co/viEInEO7sI Happy V-Day! Love yourself ❤️ https://t.co/VIfLLhi6GZ Backstage shot by @Vijatm https://t.co/ymsiCCyRpm Fittings with @themarcjacobs shot by @vijatm https://t.co/fk2Z6OFucF Park Ave Armory with @marcjacobs shot by @Vijatm https://t.co/Nrijthwlj7 genius design and execution 💀 @marcjacobs https://t.co/5xfeWcs2sg Marc Jacobs https://t.co/FhATJrBHui RT @voguemagazine: .@MileyCyrus's latest nostalgic look cements her status as one of Hollywood's top vintage mavens. https://t.co/CagSERXQEg you’ve been red. ❤️💋💯 https://t.co/Cv48m9bis7 Why you gotta insist on croppin the boot tho?!?! #NYC https://t.co/KJ34FgcL9g Shot by @Vijatm https://t.co/6a3d3UfXGI https://t.co/KXMjVwz0ZI Tom Ford https://t.co/G5woIseBIr https://t.co/FAXkCGnBHU My fans with the next album drop https://t.co/6TzlMpyhI6 All the female candidates competing in the 2020 election so they can get an EQUAL shot at the position they EQUALLY deserve no matter their own anatomy! I’d like to see women’s health and reproductive rights highlighted in upcoming debates! WBU?!?! https://t.co/gZQMESLCka everything is soooo divine these days ( and ALWAYS.  sometimes just harder to stay aware of the magic) I’m finding my vocal surgery at the end of last year to be a gift, made me take time to really hone my craft ! Watch out! 😈 No No No No No more wall squat vocal rehabilitation exercises! (cool trick get another muscle to fire so your throat is distracted, it takes the pressure off your chords and doing this against a wall also helps keep the chin and neck parallel/back so you have less strain and pull https://t.co/IcnZ0dqcZc My cover of @arcticmonkeys Why’d you only ever call me when you’re high 6 years ago! Dude I can’t believe how much I sound like @noahcyrus Fuckin wild ! https://t.co/4wvvMqcWG8 &amp; we wonder why I’m not invited to award shows anymore .... https://t.co/rmRdovVwGu https://t.co/tAaXj1F4jT Dolly’s setting world wide trends shouting out platforms she don’t even use #legendwithaflipphone #shestillsendsfaxes #ifyoudontknowhatafaxislookitup #myfairygodmotheristhequeen #queenofcountry #queenofthegram #therewillneverbeanotherdolly #allhaildollyparton https://t.co/vKoPfrv27g A day in Watt’s shoes 👢 ( is definitely safer than in his brain 🧠 🔞 ⚔️) ( btw that’s bean saying hurry up and take the damn picture) https://t.co/BvTasw5JkT 💀💀 https://t.co/tAFg0TlkG4 12 years ago today. Don’t say I haven’t always been punk. 💀 @jonasbrothers https://t.co/DVxxLS07UY On sale now! https://t.co/hFGNMrrwYm It was a year yesterday I had the honor of performing at the @chriscornell tribute concert. Will never forget that night OR you C.C. thank you for the music you left for us ..... you were and are a gift. https://t.co/HujbgsP9cB Watt The Fuck Is Happening ?!?! 📸 by @majidjordan https://t.co/CEw5sOGFIx Tix on sale tomorrow At 12pm ET! @GovBallNYC https://t.co/qdjNYPZxQn https://t.co/2fMdm1rDnk 🖤🖤🖤 @joerogan @madflavor https://t.co/EKx8z25aOo https://t.co/dC7wl45wwp I’m unusual... not so typical .... https://t.co/HwaluZRrsp RT @BRITs: The nominees for #BRITs 2020 Song of the Year are: \n\n🎶 @Mabel - 'Don't Call Me Up'\n🎶 @MarkRonson feat. @MileyCyrus - 'Nothing Br… Billy Fucking Idol. Miley Fucking Cyrus. Andrew Fucking Watt. #NameAMoreIconicTrio #IWillWait @BillyIdol @thisiswatt ☠️🖤🏴‍☠️ https://t.co/CUJgR7RIHh RT @BottleRockNapa: Ready, set, rock! 🤘🎶 1-day tickets to #BottleRock are on sale NOW. Snag them while we have them: https://t.co/AUOO6yuW3… RT @justnlopez: @MileyCyrus what’s next? haha lmk! https://t.co/9cKI43swgi RT @IovingmiIey: @MileyCyrus JUST GOT MY TICKET !!! can’t believe i can finally say i’m seeing you 🥺 https://t.co/ltzOIbzqUh 🎊 https://t.co/NFvjnJUspi RT @iHeartRadio: 🎤 @MileyCyrus 🎤\n\n#BlackDog #BestCoverSong #iHeartAwards\n\nhttps://t.co/aPueslpaIw https://t.co/aooiJWAxYm RT @MileyOfficial: Tix on sale THURSDAY 1/9 at Noon ET! https://t.co/pnAmQymXZp On sale now! https://t.co/SlpF03gw6P 🖤 @Bonnaroo https://t.co/6svOScp8Ah https://t.co/aml55MhYib https://t.co/pPC7XREzvW New hair. New year. NEW MUSIC. 💀 https://t.co/Fpi7cauqie Dank je 🇳🇱 https://t.co/ra9zkPk1ol RT @AmericanExpress: Just announced! @ChiliPeppers, @davematthewsbnd, @MileyCyrus and more will be performing @BottleRockNapa 2020! Card Me… https://t.co/s1jwFeXjV3 https://t.co/EhMc2D1wQS New Year. New Era. #HappyFuckingNewYear https://t.co/57c3J5tMGt 10 Years in 10 minutes #NewYearStartsNow https://t.co/2Co0qqeFtY RT @EOnlineStyle: She's  ̶g̶o̶t̶ always had nerve!! @mileycyrus https://t.co/Td0qJ4FThU https://t.co/vqc0v5u0VZ RT @MTV: .@MileyCyrus at the beginning of the decade 𝙫𝙨 Miley Cyrus at the end of the decade: https://t.co/uPXaIAT4En FAN TWEET DECADE ROUND UP! Keep making and tagging me and I will repost! https://t.co/jNzlliuyrv start dating your bestfriend Asap https://t.co/tJyvJVd9qW Happy Holidays from America’s most dysfunctional family 🎄 https://t.co/U92jwvoAfH Getttttt in the fuckinnnnn spirit yalllllll! Rockin around the Christmas tree &amp; Sleigh Bells are both up on @Spotify from a few years ago! Oldies but goodies! These covers plus some punkinnnnn pie is sure to get ya vibey 🎄 &amp; maybe a holi-jay 💨 https://t.co/V5ShQIpMXs and joy knowing how singularly amazing YOU are! Love always wins! 🎄 In ways that still feels relevant  and someone reading this right now could possibly relate! If you feel lonely this season just know YOU ARE COMPLETELY MADE OF MAGIC! You are as special as a  snowflake , beautifully unique and I hope inside your soul feels light, hope , peace... A sad Christmas song I wrote a few years back right before the holidays. Was feeling like shit cause I couldn’t be with the one I loved. Even with a house full of family and friends I still felt alone....  https://t.co/n1g3f2IsMh @postmates hooking it up for the @happyhippiefdn @mfpla #HappyHippieHolidays party!! Thank you for supporting the youth in our community this holiday season! 💛 #BetterThanSanta https://t.co/hyqLleNlLV .@happyhippiefdn holiday party @MFPLA was a success once again ! 🎄 always blown away by the young people I meet at MFP! There is always so much love and talent! Thank you to everyone who joined us in celebrating this special time of year with HH! 💛 #happyhippieholidays https://t.co/WsuzAtBSDS Last Christmas @ electric lady studios in NYC cutting War Is Over with this super group! 🎄❤️🎄❤️🎄 @seanonolennon @MarkRonson @Wyattish @ilsey to name just a few of the sick ass musicians accompanying me! https://t.co/g5mFdUVOsh Taking a creepy Christmas classic and giving it a modern feminist update! On @jimmyfallon with @MarkRonson last year! https://t.co/L0hmIYT3Jd Happy Birthday to THE QUEEN of the entire fucking universe! You own everything! @britneyspears ❤️ #SagSisters fuck yes https://t.co/8UbBN84E3z It’s already December 1st... another year almost over 🎄 throwback to this time last year performing a Christmas classic #WarIsOver @seanonolennon @MarkRonson @ilsey https://t.co/iLMPw8QRGg @MarkRonson*💔 Can’t wait to release all the other sick shit we’ve made together ! Love you! Today “MARKs” the 1 year anniversary of NBLAH! @iammarkronson thank you for not only bringing me the beginning of a song that gave me the canvas of my dreams.... somewhere between Parton and Joplin but also allowing me to make a video with political charge! https://t.co/sLNjkUtMJ0 It runs in the family. @billyraycyrus https://t.co/dURNW3pxQI https://t.co/7iW4AdJ6bV ❤️🧡💛💙💙💜 https://t.co/bqYFxJqGst ❤️🧡💛💙💜 https://t.co/nEcZam1nug https://t.co/6LkAKllWUT https://t.co/NRTJ3XFqz2", "bag_of_tweets": ["RT @hannahmontana: Nice to hear from you @MileyCyrus. It’s only been a decade.", "Dear @HannahMontana, I still love you 15 years later. #HMForever https://t.co/TBqZd5aOKh", "I miss u guys so much. 🤖 https://t.co/eKnXgWUPq3", "https://t.co/ewDcDi2NZr", "Angels Like You music video filmed at the first Covid compliant concert of its size since the pandemic is out now. https://t.co/j5aAIMgpbN", "PALM SPRUNG 💕 https://t.co/cj55nLDiKM", "FML is the new NFT 🤡 https://t.co/ZesRKo8HQ6", "RT @Spotify: “They laid, brick by brick, the path that I’m walking down right now.” @mileycyrus shares how @joanjett, @dollyparton and Stev…", "RT @Vevo: .@mileycyrus' \"Angels Like You\" includes scenes from her Covid-safe concert for vaccinated frontline and healthcare workers ❤️  L…", "We just have to do our part. I hope you love what I have made for you &amp; that you feel for just these few minutes that you were here in the crowd at the show with us. Soon.... 🕊", "It’s been almost a year without live music. I desperately miss the connection it brings. I miss hearing your voices ring out in harmony with my own. I miss YOU. With vaccines becoming more available the dream of us all being reunited is getting closer to becoming a reality.", "I never would have thought when I wrote “Angels” that the first time I would be performing this song or shooting a music video would be in a time like this.", "Angels Like You video OuT NoW! Shot on 2/7/21 at #TikTokTailgate , the first out door covid compliant concert of its size since the pandemic changed our lives forever. https://t.co/1FrPM7fpiu https://t.co/rR0J8hI6hX", ".@LilNasX took every single one of these photos. https://t.co/dsMe59Fejw", "https://t.co/y4i6cfWqzJ", "I’m a guest on this week’s episode of Rock This with Allison Hagendorf! Listen to it now only on @SpotifyPodcasts #RockThis https://t.co/vhcizGaHAX", "CONSIDER THIS BOUGHT. Adding to my HS collection immediately. https://t.co/cvd7kn3Lwl", "RT @_bangxrz: my golden g string finally came! 😭 https://t.co/i3Lo71PjrS", "WHEN IM NOT RUNNING GAME. IM RUNNING MY MF BUSINESS. \n\nLET’S RIDE. 🏍 @ColumbiaRecords https://t.co/Gspnq7IIal", "What Lily is really thinking when Hannah presses send on ANOTHER Hannah reveal. @LilNasX https://t.co/6JzjAsDOnj", "Can Hannah get a feature? #HannahSnow #HannahTheeStallion #HotGirlHannah https://t.co/0kh4LTjn6f", "You just had to be there. https://t.co/oWfKPxG0YV", "Precisely. https://t.co/Ue829rBDNa https://t.co/VYwPngxivM", "SMOKE TODAY DOWN TO THE FILTER! 🚬🤘🏻🎸🦾🤡🥀🎯🛠🦅\n\n#JustDontSmokeCigs \n#INeverQuit #UnlessItsCigarettes \n\n#WhenTheySay #IMissTheOldMiley #WheresHannahMontana  #ThisIsAnImposter https://t.co/yDrfenzJVK", "love. It never dies. 😭 💙💕🦴💌 ⛪️", "over heels in love. Not sure I will ever sleep again because I can’t take my eyes off of her! Her halo shines for all to see and I can’t wait to show her off! It’s pretty cool having an Angel on a leash! She is illuminated by the aura of the late and great Mary Jane. Long live", "The stigma and stereotype that surrounds pit bulls tears me in two. This breed is incomparably loving. Just like humans nurture often overrides nature. I want to thank #lisachiarelli for her dedication in fighting for the lives of pit bulls &amp; finding me my perfect fit. I am head", "break a promise. I feel her here with me blessing this new member to my family who’s name is “Angel” because she was delivered to me by one... My Mary. It breaks my heart to know Angel was sleeping on concrete in a shelter for 3 months before finally making it home.", "Almost two months ago my best friend a rescued pit mix Mary Jane left this world. I knew she wasn’t gone for good. She had out lived the body she was in but she never said goodbye ..... with her eyes she whispered “See you soon Bestie”. Mary Jane defined loyalty and would never", "But I thought I lost you”", "“I thought I lost you when you ran away to try &amp; find me. I thought I'd never see your sweet face again. I turned around and you were gone &amp; on the days went.  I kept the moments that we were in. Cause I hoped in my heart you’d come back to me my friend. And now I got you... https://t.co/AX2BYAPOVm", "RT @BRITs: 💕 'Plastic Hearts', the 2020 album from @MileyCyrus, has gone #BRITcertified Silver! 💿 https://t.co/s0wziakKgj", "Break the internet. Not hearts. #MileyTok 💔 https://t.co/TB0l63QMJT", "CONFESSIONS OF A TEENAGE DRAMA QUEEN ☠️💕🦄🔪 ☠️💕🦄🔪☠️💕🦄🔪\n\n(yes they sold magazine telling teenagers that being single is vengeful... not just healthy &amp; acceptable!) https://t.co/B6UYHXA68e", "ThE beSt PaRt AbOuT VaLeNtInEs DaY Is HoW gOoD iT LeAveS eVeRyOnE fEeLiNg AbOuT ThEmSeLvEs! ☠️ https://t.co/2xQVzHUNxy", "HaPpY sHaMeLeSsLy MaStUrBaTe FoR 24 hOuRs wHiLe EaTiNg ChOcOlAtE dAy! 🌹\n\nSuCh A mEaNiNgFuL HoLiDaY bAsEd On LoViNg &amp;  ChErIsHiNg YoUrSeLf As 1 SoLiD fUlLy rEaLiZeD iNdiViDuAl WiTh No NeEd FoR eXtErNaL cOmPlEtIoN! https://t.co/4pIdvRvL3I", "Miley is here to wish you a Happy Valentines Day filled with a fuck ton of fucking. \n\nUnfortunately Hannah is here to remind you of Covid-19 which means no sex. https://t.co/sX6HxojOm7", "@espnmma @JMarquezMMA Shave an MC into your chest hair and I am YOURS ❤️ Happy VDay and Congrats my love!", "https://t.co/HzPe2abJZW", "you ain’t listened to my new album plastic hearts out on all platforms and physically around the world say what?!? *Hannah Montana voice* https://t.co/9jRGKDnxCQ", "Man. Being single sucks. All I ever do is WHATEVER THE F❤️CK I WANT! Bahabahahahahabahahhahaha! https://t.co/8Ywj8I72QU", "PRE SHOW VIDEO I SEND TO EVERY BOY I KNOW ☠️ jkjkjk (you know you’re my one and only 😻) https://t.co/jlSTEpJfMG", "My RIDE OR DIE @BillyIdol &amp; @Stevestevens ROCKIN 🎸❤️ 💋  l https://t.co/wAexvKvERJ", "GUCCI GIRL ☠️💕#CustomNotCostume https://t.co/0bJuuYfN82", "https://t.co/Eu8RGn800B", "HIGH AT THE SUPER BOWL 😜 https://t.co/BUIotflGh7", "RT @DDLECOURS: In loving memory of all my exes, eat sh!t #PLASTICHEARTS 🖤🎸 https://t.co/xhO0zkNEsG", "RT @youtubemusic: It's a nice day for @MileyCyrus and @BillyIdol to rock 🤟 Relive their #SuperBowl Pre-Show performance now → https://t.co/…", ".@JoanJett I wouldn’t be ME without YOU. Thank you for being apart of my first show back for #SBLV 🏈💕🏈💕🏈💕🏈💕 https://t.co/uVFUBYr6r4", "Save a horse. Ride a motorcycle. 🏍🏈💕🇺🇸☠️🏁🎲🎱🏴‍☠️ #LetsRide https://t.co/YU7HENnljq", "Who’s my Superman? @BillyIdol DUH! It’s a nice day for a white wedding! 💒☠️ https://t.co/XJ3IopYclQ", "One of my favorite small businesses is @mikesicecream in Nashville . Reply with yours and tag #BigConcertSmallBiz, then tune into @Verizon Big Concert for Small Business to watch me LIVE tonight after #SBLV at 11pm ET / 8pm PT #VerizonPartner https://t.co/FcwGKgEt44", "RT @NYCHealthSystem: Check this out! Our awesome #HealthCareHeroes from NYC Health + Hospitals/Elmhurst who were featured in this @MileyCyr…", "https://t.co/m2Tculjqq5 @NFL #TikTokTailgate", "HOT IN THE CITY. 🏍 @BillyIdol https://t.co/68uwQOxEtG", "SOUNDCHECK &amp; then GAME ON! 💕🏈🏁☠️🖤💕🏈🏁☠️🖤💕🏈🏁☠️🖤💕🏈🏁☠️ https://t.co/ZyjNJWzNPo", "Me showing up to the @tiktok_us tailgate! #SBLV 🏈🏁💕🖤☠️🏍 #LetsRide https://t.co/3NtuQrxYcj", "RT @DDLECOURS: MILEY-BOWL!!!! 🎸🖤#PLASTICHEARTS #SBLV https://t.co/Sw3PUysacY", "THIRST TAP IN🤘🏈🏁☠️🖤 https://t.co/sWHcdn6iXJ", "Reply with your fave small biz using #BigConcertSmallBiz &amp; you can get a shoutout at Verizon’s Big Concert for Small Business on Sunday after #SBLV! Then tune into @Verizon on Twitter to watch me perform LIVE at 11pm ET / 8pm PT #VerizonPartner https://t.co/Rllbx1bolA", "BOSS BABY MC TAKES TAMPA! 🏈💕 @NFL @tiktok_us https://t.co/LHwGJe47jJ", "RT @MileyOfficial: Prisoner ft. Dua Lipa (@JaxJones Remix) is out now! 🤘🏼🖤\n\nhttps://t.co/rt0rlXhZM4", "RT @StylishCyrus: NEW ‘Prisoner’ remix out now! @MileyCyrus ft @DUALIPA \n\nhttps://t.co/UW3FWdrISh", "RT @viuvodeadpetz: i love you @MileyCyrus @MileyOfficial https://t.co/hL0IAM3r2Q", "Sexting &amp; Thriving!!! 📲🖤🏍☠️\nNOT texting &amp; driving! #SBLV #PlasticHeartsLIVE 💕💕💕 https://t.co/7yKvqV4cri", "@theebikinikill Rebel Girl 4EVR ☠️", "ANGELS LIKE YOU CAN’T FLY WITH REBEL GIRLS LIKE ME. 😈👼 https://t.co/JuX7idCrrh", "#SBLV PREP ☠️ https://t.co/QwIeC6A2AK", "RT @MileyEdition: Live, after #SBLV, @MileyCyrus will be performing at the After Party concert to help small businesses. Tune into Verizon…", "MILEY: FOR THE WIN! 🏈💗☠️ Join the tailgate at 2:30 PM ET FEBRUARY 7 on @tiktok_us ! #SBLV https://t.co/yk9IxzNPLl", "GOD MONEY I’LL DO ANYTHING FOR YOU. 💰👹💵☠️💲🤡 #AshleyOGoneWild https://t.co/LPI2jImD5b", "RT @KevanKenney: .@MileyCyrus currently has a 2 week streak on the @MTV #FridayLivestream. \n\nContinue her streak by tweeting \"REQUEST @Mile…", "ALSO @gwenstefani @blakeshelton  I’ll be your wedding singer!  I promise to be on my best behavior. Or worst. whatever you want! It’s your special day! Cheers to loving you both almost as much as you love each other! 💗🥰 https://t.co/iz21PDiRGS", "When my hero’s tweet me I get horny. https://t.co/iz21PDiRGS", "Prisoner on @nprmusic tiny desk ☠️ https://t.co/vgJd0y2T2o", "RT @PopCrave: @MileyCyrus has been nominated for Outstanding Music Artist at the 32nd GLAAD awards. https://t.co/J2anBwebhc", "RT @positivesteven: yooo thanks @MileyCyrus for the shirt ahhhh i love you &lt;3 https://t.co/hB2JiTEyIG", "My room was covered in Elvis , Hillary Duff, and Metallica posters. Nothing has changed except everything.", "Golden G String on @nprmusic Tiny Desk in a tiny room modeled after my own I grew up in at my parents house in Nashville. So many songs written straight onto the walls which were recorded on tape using a karaoke machine my granddaddy gave me for Xmas. https://t.co/xDf9f5HsGW", "Fade Into You x Tiny Desk.\n\nA strangers heart without a home. 👤💙🦋👤💙🦋👤💙🦋 https://t.co/Iq7asrCM6R", "https://t.co/B5eQ6XqIKU", "Category is: #MazzyStar @nprmusic Tiny Desk just premiered on YouTube.  Check out all 3 of my performances. https://t.co/qU6YfxGKwW", "RT @MileyNation13: MILEY CYRUS TINY DESK CONCERT STARTS NOW !!! 🤘🏼\n\nJoin here: https://t.co/b7rSyDA0dm", "RT @StylishCyrus: Check out @MileyCyrus’ NPR Tiny Desk (Home) Concert on NPR Music’s YouTube page out now! https://t.co/2k4dUBINUR", "RT @BobBoilen: Today, Thursday Jan. 28 at 12 p.m. ET we'll be premiering Miley Cyrus' (@mileycyrus) Tiny Desk (home) concert and you don't…", "Been working my ass off on this set list! I think you’re gonna DIG IT! ☠️", "SUPER BOWL LV!!! I’ll be there for TIKTOK TAILGATE!!! I can’t wait to put on a show for the NFL’s honored guests before the game…. Health care workers from Tampa and around the country!  Join the tailgate at 2:30 PM ET FEBRUARY 7 on @TikTok! #SBLV https://t.co/r6gprJjFC6", "Tiny Desk airs tomorrow at 12 PM ET on NPR’s YouTube 🎙🦅☠️🖤 @nprmusic https://t.co/IJuAv79vZb", "RT @nprmusic: 🕛 tomorrow\n🎤 @MileyCyrus \n🏡 Tiny Desk (home) concert\n📺 https://t.co/gOe840qRFw https://t.co/rI0na2yzEE", "RT @MileyMedia: Look what just came in the mail 🥺💗 @MileyCyrus @MileyOfficial https://t.co/tifKQUrS31", "RT @NFL: .@mileycyrus will be at Super Bowl LV to perform at the first-ever #TikTokTailgate – the NFL’s pregame event for the 7,500 vaccina…", "SUPER BOWL LV!!! 💗 🏈 \n\nI’ll be there for TIKTOK TAILGATE!!! I can’t wait to put on a show for the NFL’s honored guests before the game…. Health care workers from Tampa and around the country!  Join the tailgate at 2:30 PM ET FEBRUARY 7 on @tiktok_us @ @cbstv ! #SBLV https://t.co/MBibfx8XxF", "When all this SHIT we’re goin thru is herstory imma celebrate by taking my biggest fan to get a FRESH SET HUNTY. 💅💚 ☠️ Shine Bright. Shine far. Don’t be shy. Be a star baby.  Love y’all 5EVR!", "You did it again! Plastic Hearts has spent 6 weeks as the #1 rock album in the country. This is all because of YOU supporting my record! I don’t forget! I really fucking appreciate it! https://t.co/iSUwND235b", "RT @chartdata: .@MileyCyrus’ 'Plastic Hearts' remains at #1 on the Top Rock Albums chart for a sixth week.", "Happy B-Day Aunt @DollyParton ! I hope you’re maskin’ &amp; relaxin. I will always love you! 🌸💗🌺💕👄 https://t.co/AMVNHxvgYq", "I am constantly thinking about the time we can reunite &amp; mosh again.  I miss you so fucking much. Ready for this circus to come to an end. 🤡", "My love for you shoots to the moon (collects some of its magic energy) and back down to each and every person making my dream a reality. Although we can’t be together right now I hope you can feel my appreciation in spirit.", "5 weeks #1 on the rock charts w/ #PlasticHearts 💗💕 Seems like a hard time to be “happy” with so much sadness surrounding all of us but the support being shown to this record can’t be overlooked. My upmost gratitude to everyone listening and relating to this album. https://t.co/KccOIVT2lZ", "Happy birthday to an icon living @noahcyrus https://t.co/RzJuemskAM", "RT @MileyCyrusBz: Available in newsstands now! 👅❤️ @MileyCyrus x @RollingStone https://t.co/kLFdCTnd59", "RT @onepeloton: Peloton, are you ready? This next Artist Series is an epic musical rager you might want to buckle up for. Ride with @jesski…", "Who loves the sun? \nWho cares that it is shining?\nWho cares what it does?\nSince you broke my heart. https://t.co/O1nInC4aFw", "Predicting a 2021 full of safe sex &amp; effloresce 🌺 🎸🌸💕 🌹🫀 ( AND more fucking MUSIC 🏴‍☠️🤘🏼) https://t.co/BD3nxfTdQM", "Was my honor to perform PARTY IN THE USA opening tonight’s @NYRE after the year we’ve experienced. This song represents TRIUMPH (check the belt) 🇺🇸 🎉🎸looking forward to 2021 wishing everyone a happy and safe NY celebration! 2 more songs to come! https://t.co/TFnemQxOwx", "RT @RyanSeacrest: It's officially a party in the USA! Starting the night strong with the one and only @MileyCyrus. #RockinEve https://t.co/…", "SOUND CHECK REALNESS 🎙🏴‍☠️🎸 #RockinEve https://t.co/zbPH4jhqn7", "RT @NYRE: If you start the #RockinEve playlist at exactly 9:30pm on New Year's Eve, \"11 PM\" by @maluma will play at 11pm, and Midnight Sky…", "DRESS REHEARSAL ☠️🖤🤘🏼 I’m performing TOMORROW! \n@NYRE Celebration! Don’t miss at 8/7c on ABC. #RockinEve 🎸🎉🎈 https://t.co/J6nUcFM6nS", "Hey Sis! It’s Christmas! 🎄 https://t.co/OrOGpAIugY", "Christmas ain't the time for breaking each other's heart 🖤 #ramones 🤘🏼🍒☠️🎶🎸 https://t.co/6EihJfiqMS", "Merry Xmassssss Eve! https://t.co/jI28mDaiad", "RT @miIeystay: How it started             How it’s going https://t.co/d0eKLZLHDI", "IDOLIZE YOURSELF! 🍦💙🤘🏼☠️🖤 @BILLYIDOL @applemusic #PlasticHearts #NightCrawling https://t.co/E4FGnXWbix https://t.co/WYvWNOuGRu", "RT @amazonmusic: Time to sleigh. Catch @MileyCyrus tonight on #HolidayPlays with our host @LilNasX \n \nWatch 5pm PT/8pm ET on @PrimeVideo: h…", "RT @Bratz: @MileyCyrus #bratz 💕 https://t.co/QBv3Ia2OcQ", "https://t.co/x4IrRxo8Hp", "I am grateful to health care workers and their tireless efforts to bring us a vaccination/cure for Covid-19 so we can all be together in person again. For now moments like this must be cherished as it brings us together thru another dimension. 💕☠️💕☠️💕", "Engaging with you created a connection I think we have all been longing for over the last year where we’ve only been able to communicate at a distance.", "This lyric video is a love letter to all of you superstars who made #PlasticHearts a viral phenomenon by creating this totally out of the blue/random AF “comment challenge”. https://t.co/4gdVXMaVIn", "RT @RyanSeacrest: Ready for @MileyCyrus to put the rock in #RockinEve! 11 more days....", "RT @NYRE: Can't get @MileyCyrus off my mind, off my mind because she's performing on #RockinEve! Don't miss it, December 31st at 8/7c on AB…", "Serving PUNT 🏈💕☠️🖤 https://t.co/l5YnaO7D9W", "RT @MCNewsSource: Miley’s full interview with @BillyIdol from her YouTube RELEASED episode is out now! Watch here: https://t.co/NTx3NL2wBK…", "DON’T CALL ME ANGEL. 🏈 🖤 #nfl https://t.co/jjGhI2Xwt8", "Don’t hate the player. Hate the game. 🏈💕☠️🖤 #nfl\n\nCatch me across the @NFLNetwork this week as their Takeover Artist…. @MJAcostaTV @nfl https://t.co/1uxeBrSNUr", "RT @BillyIdol: @mileycyrus is my very special guest on my ‘Live Transmission’ Christmas Show on @SIRIUSXM @1stwave ch. 33 on Tue December 2…", "RT @GlblCtznCAN: ✨ BIG NEWS: @Usher, @MileyCyrus, @Oprah, and MORE just joined our lineup for #GCPrize this Saturday Dec.19 on @CTV. Don’t…", "Time really flew by. I remember this like it was yesterday..... J/K I don’t remember shit cause I was fucked the hell up. #YesItWasReallySalvia #IfYouFindWeedThatDoesThisToYouSHARE https://t.co/p36RwZCvRg", "Happy 10 year anniversary to the groundbreaking video of a teenager smoking a bong &amp; saying dumb shit to their friends. (Not so sure the director of this fine film should be considered  a “friend” but....) 🎈💨🖤🎈💨🖤🎈💨🖤 https://t.co/FMIlgJ8B3M", "ALL GONE 👅", "https://t.co/HliuQPh3XL", "Wear a mask. Eat burritos. (Not at the same time lol) #GuacIsExtraButSoIsMiley https://t.co/9r5LmYinrr", "Not sure there’s an artist I’ve listened to more than I have you. You’ve made me feel heard since I was a little raspy voiced girl. Love love love that! https://t.co/VchkAoJqNQ", "RT @youtubemusic: \"This is too good.\" 🎸 🤟\n\n@MileyCyrus stops by this week with an exclusive performance of her new song Prisoner. Watch #RE…", "RT @YouTube: Tonight on #RELEASEDonYT, it's all about @MileyCyrus 😍 \n\nTune in at 11:45pm ET for an exclusive performance of Prisoner, an in…", "Feeling my own fantasy!💕#BonnieTylerForever @youtube released tonight @ 11:45 ET! https://t.co/1NwEsSp4D3 https://t.co/AG7E9L5pVC", "Took @AppleMusic behind my creative process &amp; into my backyard!  Watch the exclusive short film now on Apple Music #PlasticHearts ☠️ https://t.co/5OPN1THczu https://t.co/SXgc3LBdlD", "RT @mileychronology: Streaming #PlasticHearts while munching on my Miley Burrito 🌯 ☠️💕\n@ChipotleTweets @MileyCyrus https://t.co/k9KxZtIhJd", "RT @lesrogo7: Totally recommend checking out @MileyCyrus‘ new album Plastic Hearts 🎸", "RT @ChipotleTweets: We weren't kidding @MileyCyrus https://t.co/pznBGw1U5E", "RT @MileyCyrusBz: Chipotle kept their promise!! 👀 “Guac is extra but so is the Miley burrito” is available to order now!! 🌯❤️ https://t.co/…", "@Sia @Sia in the New Year when it’s safe to kiss you on the mouth again. 💋", "RT @billboardcharts: This week's top 5 on the #TopRockAlbums chart:\n\n1. @MileyCyrus Plastic Hearts\n2. @acdc Power Up\n3. @QueenWillRock Grea…", "RT @chartdata: US Certifications (@RIAA): @MileyCyrus, Party In the USA Diamond (10,000,000).", "It’s all about me. ☠️ Don’t miss my exclusive performance of Prisoner on this week’s episode of #RELEASEDonYT! Set a reminder to tune in this Thursday at 11:45pm ET, only on @YouTube 🤘🏼🖤💋🍒🩸🎸 https://t.co/2N6Ah592Rn", "Last night performing Prisoner on @jimmykimmellive ☠️ https://t.co/yqwbOpyWxE", "RT @YouTube: .@MileyCyrus is taking over this week's episode of #RELEASEDonYT! Set a reminder to tune in on Thursday at 11:45pm ET for an e…", "RT @MileyCyrusBz: .@MileyCyrus will be presenting @DollyParton the Hitmaker Award at the 2020 Billboard Women in Music awards on Thursday 1…", "RT @cyrustrippy: I might even be           #1 rock record\na rockstar                       in the US https://t.co/8zqPhGZCU1", "MOOOOOD! I tried to tell y’all! Fuck yeah! ☠️ #PlasticHearts is the #1 rock record in the country! https://t.co/pp3Lxgmax3", "RT @JimmyKimmelLive: #1 ROCK ALBUM!!! See you tonight @MileyCyrus! 🙌💘👑", "RT @JimmyKimmelLive: A little #MondayMotivation for you... @MileyCyrus tonight! https://t.co/SEGs3Qaa99", "RT @billboard: .@MileyCyrus' #PlasticHearts crowns the #TopRockAlbums chart 🔥 https://t.co/WHPE3cUxJ9", "Thank you to my momager @tishcyrus &amp; my team at @rcarecords @Maverick @adamleber @AdrianaArce_ @livrudensky my creative angels @TheRealMickRock  @Vijatm @bradleymcpeek #alanaoherlihy", ".@Wyattish is responsible for the most intimate and personal song on the entire record Golden G String.... you see me.... you hear me , you’re there when i need you most. I am grateful. Love u.", ". @MarkRonson I am never going to quite comprehend how you manage to make songs sound so classic and fucking next level new simultaneously! You are a wizard! Thankful for the past few years we’ve spent making art together and looking forward to many more. You’re my hero.", "To watch you work is astonishing. Cheers to the dude who has Bieber at 2 and Metallica at 7 (and squeezes me in somewhere between) 🤘🏼🎸", "My EP 🖤 @thisiswatt you are a rock god. Your steadfast belief in my artistry is fueling the rocket we’re taking out of this fucking atmosphere! 10 years of memories behind us and a fuck ton more to make ahead! I won’t take a second we’re together for granted. https://t.co/aMqqGit3MO", "TO MY NEWEST FRIEND, @DUALIPA -\nThank you for allowing me to cover you in cherry juice, lick your face and playing at a dirty rock club w me! You’re fearlessness is all that could outshine you’re fabulousness.  I love you forever.", ".@BillyIdol BILLY FUCKING IDOL! \nWe’ve been “rebel yelling” since 2012 when I brought a photo of you to the salon and said “I wanna look like that”. You are brazen, bold, unapologetic, and authentic in a way that is my honor to witness . I appreciate you deeply.", ".@StevieNicks, Your words have been coming out of my mouth since I can remember .... but mine flowing from yours is still surreal. Your generosity is unrivaled. Thank you for lending your magic! I am forever your “smiley baby”.... I love you", ".@joanjett, I have you to thank for my love of leather, playing music at an unholy level of loud, and my uncompromising sense of self. I fucking love you.", "The confidence I have in who I am / what I am doing stems for the values instilled by looking up to you 3 as my role models from the beginning.", "To my fucking idols @joanjett @billyidol and @stevienicks your blessing, guidance, inspiration , and validation mean everything to me. Even though you 3 would tell me I do not need validation from anyone but my fucking self.", "It’s official. #PlasticHearts is the #1 rock record in the country.  My mind is blown and my heart is overwhelmed with gratitude. Thank YOU to every creative collaborator involved on this project! If one person was missing I would not be writing this message. https://t.co/rvVuSO7L5v", "RT @nicholasdante_: history repeats itself @MileyCyrus https://t.co/LAb4EobBHS", "RT @sternshow: .@MileyCyrus explains why she evolves her sound while on tour and reveals the advice @PaulSimonMusic gave her at the #SNL 40…", "I dare you to let Quaker hit it on the first “date”. Lemme know how it goes! I like to stay updated on “currant” affairs.  💕 https://t.co/aFie7EFEIt", "THE MORE THAT YOU GIVE THE LESS THAT I NEED. https://t.co/Rjwmwfrr5b", "IF YOU THINK THAT I’M SOMEONE TO GIVE UP &amp; LEAVE THAT’LL NEVER BE ME. https://t.co/LPcO5YCEpL", "SOMETIMES I NEED YOUR LOVIN. SOMETIMES I STAB YOU IN THE BACK. https://t.co/FqGnpTGmU6", "RT @MsTaylorBanks: I can’t be tamed. A story in 3 parts. https://t.co/XM7AXZqXZ0", "RT @sternshow: 🎶See my lips on her mouth, everybody’s talking now, baby …\n… just like the white winged dove sings a song sounds like she’s…", "PLEASURE LEADS TO PAIN. TO ME THEY’RE BOTH THE SAME. ☠️ https://t.co/8KS0JPe2TD", "THEY TOLD ME I SHOULD COVER IT SO I WENT THE OTHER WAY ☠️ https://t.co/q3pXAm0Sbp", "THE ITSY BITSY SPIDER WENT &amp; SPUN A WEB OF LIES. 🕸☠️🖤 https://t.co/a0SHJPobxA", "https://t.co/7m2aTl2z0S ☠️ https://t.co/3yBWOofHLa", "RT @RollingStone: Miley Cyrus appears on our January cover. She opens up about her wild new rock &amp; roll sound, heroes like Joan Jett and Da…", "https://t.co/7m2aTl2z0S", "AT LEAST I GIVE THE PAPERS SOMETHING THEY CAN WRITE ABOUT. ☠️ @RollingStone by @BradElterman https://t.co/zh7T9NMjL9", "https://t.co/ZXwqKA4Ktl", "https://t.co/CrXBNWWOFI", "There’s nothing like covering Hole at 6 am in a Plasmatics sleepy tee cause I got to the fucking studio and realized my dress I brought was a jacket with no buttons lol @courtneylove Thank you @sternshow for having me and the great conversation. Always a good time.", "Doll Parts on Stern https://t.co/RXABK5XqEX", "RT @sternshow: Watch @MileyCyrus debut her cover of “Doll Parts” LIVE from the @SiriusXM Garage in L.A. during her interview with @HowardSt…", "RT @MCNewsSource: The Apple Music Backyard Sessions edition of “Plastic Hearts” is currently discounted on iTunes for just $7.99! Purchase…", "come listen to #PlasticHearts with me ! ❤️💋 https://t.co/9U7w3Zmx0d", "RT @MileyOfficial: Less than 30 minutes until the next #PlasticHearts streaming party! https://t.co/kMJu3VMxwg https://t.co/KARScIwF7P", "RT @BBCTheOneShow: Hands up if you're obsessed 'Plastic Hearts' 🙋‍♀️🙋‍♂️💛 \n\n@mileycyrus talks about the collaborations on her 7th studio al…", "RT @amolrajan: Absolutely mega @BBCTheOneShow coming up on @BBCOne at 7pm\n\n@MicaParisSoul \n\n@MileyCyrus \n\n@maisie_smith_ https://t.co/v43js…", "See you at 3 👅 https://t.co/572AK42Wiw", "Who else got ?! 🖤💋 https://t.co/3HftsTqa2L", "https://t.co/kFkh1Kwbnq", "RT @OCHannahMontana: Miley covering Last Christmas by Wham! https://t.co/AnjsORwjAn", "RT @ItsScarlettBobo: Holy. Eff. This is fucking AMAAAAAZING!! @MileyCyrus how’s this for a GAG! \nEdit by @LUNARPH4SES 🖤 https://t.co/b6NIwJ…", "RT @iHeartRadio: ONLY 30 MINUTES until our iHeartRadio Album Listening Party with @MileyCyrus! 🖤\n\nDon't miss out and watch at 7PM ET / 4PM…", "Performin’ PRISONER without @dualipa got me really missin my girl! Our new song is OuT eVeRyWheRe NoW! https://t.co/7pmWpsjmTa", "RT @iHeartRadio: Tonight the party is coming to you!!! Join us as we celebrate the release of @MileyCyrus' new album #PlasticHearts with an…", "RT @MileyOfficial: Tonight! iHeartRadio #PlasticHearts Listening Party with @MileyCyrus 🖤\n\nTune in here https://t.co/BJcVPRQjbT at 4PM PT /…", "RT @BBCTheOneShow: We can't wait to have @MileyCyrus on the show tomorrow! We want your questions! Film a quick video of you asking your qu…", "RT @sternshow: TODAY: @MileyCyrus returns to perform LIVE on the #SternShow and talk to @HowardStern about her new album #PlasticHearts. Tu…", "RT @jcal812: when I tell you @MileyCyrus is the reason I made it through this pandemic, I ain’t lying. #SpotifyWrapped https://t.co/FWvIrd3…", "Fill your place with PRESENCE OVER PRESENTS!  If you can’t love yourself how in the hell you gonna love another elf?!?! @amazonmusic holiday plays out now featuring my cover of Last Christmas x Wham!", "The holidays can get ya feelin lonely especially in these times of social distancing! BUT “If you’re lonely when you’re alone you are in bad company.” It’s a greedy time of year but try to be thankful for all that is front of you! Including the truth that others reveal! https://t.co/mxrd0LUpqf", "PRISONER LIVE @AMAZONMUSIC #HOLIDAYPLAYS OUT NOW! ☠️ https://t.co/lrm42KcvSj", "#HolidayPlays starts NOW on https://t.co/3clNnq15I4 and https://t.co/OhlIOMqOgs ❤️❤️❤️ https://t.co/QUC0drfiOA", "RT @MileyEdition: 1 Hour until Miley’s “Holiday Plays” performance! https://t.co/NFIRxFKtBL https://t.co/ActaPdxhuu", "RT @amazonmusic: 🚨 Free show alert 🚨 . Hear @MileyCyrus and @LilNasX perform on the opening night of #HolidayPlays for no charge! \n\nIt’s al…", "Thanks @amazonmusic for the love!!!! #JustAsk, “Alexa, play Song of the Day to listen” to hear Midnight Sky #SOTD 🖤💀 https://t.co/Kr28yRQkWG https://t.co/T3nTiH9DTx", "RT @cantbetamed: .@MileyCyrus’s new album #PlasticHearts is now discounted to $4.99 on Amazon! Hurry and get yours now!! https://t.co/8kaNl…", "4.99 TODAY ONLY  https://t.co/FyKduEAWZP", "RT @MarkRonson: 💔💔💔 https://t.co/hxK4M1VTxG", "RT @amazonmusic: Bundle up &amp; tune in tonight to catch @mileycyrus kick off #HolidayPlays with some tracks from #PlasticHearts!\n\nShow starts…", "https://t.co/FyKduEAWZP", "Hey Sis it’s Christmas! Don’t miss @amazonmusic holiday plays tonight @ 8pm ET! My album is discounted on Amazon! Down to 4.99! Get that shit! https://t.co/UcIxUyGZ7r", "https://t.co/w0uuhv5Uvw", "https://t.co/RogwsiNvSi", "https://t.co/nLnXknN0Vt", "https://t.co/fPfQ882ZXX", "RT @itschris96: @MileyCyrus #PlasticHearts love the album!!! https://t.co/PwprOF7uhu", "https://t.co/B7THmoIIy4", "https://t.co/rOAHBIFu2j", "https://t.co/cYNRN6ld15", "https://t.co/PNpWeFtvft", "loving these reactions ! Send me your faves to #PlasticHearts https://t.co/0ke9rllQRF", "Listened to @LilNasX and added some holiday spirit to my @amazonmusic holiday plays set!  Don’t forget to check it out tomorrow! I’m performing new songs from #PlasticHearts including Prisoner and Midnight Sky! ☠️💕❄️ https://t.co/2ymWxd19ZP", "@Beveraggi ❤️❤️", "Happy Fucking Birthday to Billy Fucking Idol @billyidol #NightCrawling #PlasticHearts https://t.co/xzu7eRkSTs", "RT @pandoramusic: #PLASTICHEARTS is here and has already stolen our heart. Listen to the brand-new album from @MileyCyrus now 🖤 https://t.c…", "RT @amazonmusic: It’s *their* show. @MileyCyrus and @LilNasX are here to play the opening night of #HolidayPlays ❄️ \n\nWatch tomorrow at 5pm…", "Watch free tomorrow on https://t.co/3clNnq15I4 and https://t.co/pZlUQGwDuf 🖤", "Watch me &amp; @lilnasx SLEIGH @amazonmusic #holidayplays tomorrow night - don’t miss it! ❄️☠️ https://t.co/t0Ng5wzwiv", "Golden G String w @Wyattish for Backyard Sessions out now exclusively on @applemusic #PlasticHearts ☠️💕 https://t.co/k0J7F9FtfT https://t.co/R6oZPLriMc", "A response to my fans 🖤 https://t.co/p4dZGPk91T https://t.co/hVCxetV7k2", "RT @ColtonLHaynes: I’m still not able to fully express how incredible the new @MileyCyrus album is. It’s a no skip but these 3 songs couldn…", "I’m everything they said I would be... #AngelsLikeYou STRIPPED back on @applemusic now! #BackyardSessions https://t.co/k0J7F9FtfT https://t.co/TXSv0FVtCE", "RT @0407_aaron: @MileyOfficial with my new baby ❤️ #PLASTICHEARTS https://t.co/3zJ1hXl8HO", "My new record #PlasticHearts is OUT NOW!  Check out an exclusive STRIPPED down version of 4 songs off the album on @AppleMusic from my #BackyardSessions! https://t.co/k0J7F9FtfT https://t.co/S3f1lczsic", "My new record #PLASTICHEARTS deluxe , vinyl , and a fuck ton of merch just dropped on https://t.co/F0BQuwOK9i ☠️💕 https://t.co/P6qZKHOO0P", "RT @seltzersnapped: We drove around Nashville telling people to stream #PLASTICHEARTS #MileyCyrus @MileyOfficial @MileyCyrus @yeehaw_gurl h…", "RT @TeamMileySWE: 7 years apart, still here, new album\n#PLASTICHEARTS https://t.co/VZfNQyJs1S", "PRISONER @ STUDIO 2054 @DUALIPA 🍒🕸🫀🏍☠️💕 #PLASTICHEARTS https://t.co/Zyy6saMJ8b", "RT @mileyxdestiny: LOOK WHAT I BOUGHT ♥️ @mileycyrus #PLASTICHEARTS https://t.co/buAPIrux1b", "RT @MileyCyrusBz: 😂🤘🏼🖤 https://t.co/vrbV5t9Yiu https://t.co/JBSEeXX709", "RT @lanikaps: me and my girls after listening to plastic hearts https://t.co/ds8kVRE7Fk", "RT @DDLECOURS: When @MileyCyrus sends you $100 for #PLASTICHEARTS release day you obviously get another MC tattoo, duh. 🎸🖤💋 https://t.co/Y0…", "RT @videogxrl: IM CRYING MY EYES OUT @MileyCyrus this means so much to me and my family \n\nI’ve been a fan since 2005 and this will help so…", "RT @MileyUpdates: ICONIC! Miley taking over Oslo for #PLASTICHEARTS Listening Party  https://t.co/6ImKlzGOm4", "@FREAKYPRlNCESS @CashApp Got u ❤️", "RT @joanjett: Brand new @MileyCyrus record feat. #JoanJett OUT NOW — https://t.co/YDBUMDU18u — #PlasticHearts https://t.co/ebtuao6rp1", "sent ! https://t.co/WWORJgM5Sj", "Got you https://t.co/cFcUCj1N7i", "RT @joanjett: .@MileyCyrus “Bad Karma (feat. Joan Jett)” — OUT TODAY! https://t.co/YDBUMDU18u", "RT @MileyEdition: .@MILEYCYRUS THANK YOU SO MUCH OMFG I LOVE YOU #PLASTICHEARTS https://t.co/88urCAz84W", "* Void where proh no purch nec. https://t.co/oMQ89mafwM. Ends 11/28", "MY HEART MAY BE MADE OF PLASTIC BUT TODAY I’M GIVING AWAY SOME PAPER WITH @CashApp !  DROP YOUR CASH APP BELOW &amp; #PLASTICHEARTS FOR BLACK FRIDAY $$$ https://t.co/etQAtcLbWX", "https://t.co/F0BQuwOK9i https://t.co/UZh6qJGJ8B", "RT @iHeartRadio: We are celebrating @MileyCyrus' new album #PlasticHearts with an exclusive iHeartRadio Album Listening Party! 🖤\n\nDon't mis…", "RUINING YOUR LIFE ONE QUESTION AT A TIME ☠️ @SPOTIFY #PLASTICHEARTS 💕 https://t.co/flzgik5FGa", "RT @Spotify: What advice would you ask from @MileyCyrus? Drop it in the comments below 👇 https://t.co/1ZLSZcGDeQ", "https://t.co/L2Z87JUCfk https://t.co/u2Eibdaofc", "👅 #PLASTICHEARTS https://t.co/sdR2ZWRDx6", "RT @MarkRonson: I made this short film to celebrate the release of the three songs I worked on for Plastic Hearts ♥️ @MileyCyrus https://t.…", "RT @Shazam: A brand new album from @MileyCyrus! Stream #PLASTICHEARTS on @AppleMusic: https://t.co/m1nfZuZbnm 💙 https://t.co/QxXZYpU7QC", "PLASTIC HEARTS IS OUT NOW! 💀🖤 https://t.co/UXYOb2oI89 https://t.co/1NN3V71u0G", "🖤💋 https://t.co/dynF4zi7jH", "RT @Deezer: .@MileyCyrus’s anticipated rock album has arrived  🤘  Listen to #PlasticHearts on Deezer: https://t.co/c6fNepaieP https://t.co/…", "https://t.co/UXYOb2oI89", "My PLASTIC HEART is overwhelmed by the support I’m receiving tonight! I was fucking born to make the record I’ve just released! To my fans who have been here from the beginning, I appreciate you more than I can properly articulate. To anyone I’ve ever loved or lost, THANK YOU. ☠️", "RT @chartdata: .@MileyCyrus's #PLASTICHEARTS has reached #1 on US iTunes.", "https://t.co/F0BQuwOK9i https://t.co/3WmYzQ4KH8", "RT @Spotify: Our #PlasticHearts  have melted 🖤 #MileyCyrus  is here with her first rock album https://t.co/T64ULvvo92 https://t.co/x6za0w2g…", "RT @TIDAL: .@MileyCyrus' new album 'Plastic Hearts' has arrived on TIDAL.\n\nListen now: https://t.co/iAkSdlplHF https://t.co/0grVu59pvz", "RT @AppleMusic: A new album from @MileyCyrus is here at last. 🖤\n\nListen to an exclusive edition of #PlasticHearts featuring four videos fro…", "F☠️CK YEAH! MY NEW RECORD #PLASTICHEARTS IS OUT NOW! LEMME KNOW YOUR FAVS! XXX https://t.co/UXYOb2oI89 https://t.co/FbFzL6Zp85", "RT @MCNewsSource: .@MileyCyrus is about to go live on TikTok! Head on over now! https://t.co/rkXLyjMhWw https://t.co/tU4gkbaHLu", "RT @PLASTLCHEARTED: let's get it to #1 before midnight! #PlasticHearts https://t.co/lRMVhPyFHF", "LESS THAN AN HOUR #PLASTICHEARTS", "RT @viniwho: It’s the 80s / ROCK GLAM / DISCO VIBES that i asked 4! Thank u @mileycyrus #PLASTICHEARTS #PLASTICHEARTSZOOM https://t.co/qybL…", "LIVE ON MY TIKTOK IN AN HOUR #PLASTICHEARTS https://t.co/e4cvzANBJn", "SNAPPPED #PLASTICHEARTS https://t.co/2YEqAIKCR8", "LOVE #PLASTICHEARTS https://t.co/cdGyBscpTx", "AHHHH #PLASTICHEARTS https://t.co/027hUOKes1", "RT @Z100NewYork: Hear me play @MileyCyrus x @DUALIPA #Prisoner on @iHeartRadio 9@9?? Obsessed. #PLASTICHEARTS OUT MIDNIGHT 🚨☠️🔥 \n\nox @TheEr…", "RT @tiktok_us: Want another reason to be #grateful? @MileyCyrus is giving you a chance to preview her new album, Plastic Hearts, tonight at…", "RT @mileysfweakk: ME IN 4 HOURS #PLASTICHEARTS https://t.co/OpqCr0Bjtz", "FUCK YA #PLASTICHEARTS https://t.co/9Pa33NtV0Q", "#PLASTICHEARTS", "https://t.co/9tw4nYQ6pX", "ANGELS LIKE YOU can’t fly down here with me ☠️ #PlasticHearts out at midnight. https://t.co/70uYAM4I4s", "https://t.co/9tw4nYQ6pX", "TONIGHT @ MIDNIGHT #PLASTICHEARTS IS DROPPING! ALONG W/ YOUR PANTIES CUZ THERE’S A FUCKING @BILLYIDOL FEATURE!  XXX https://t.co/IAgqjXAoZ9", "https://t.co/9tw4nYQ6pX", "GO AHEAD YOU CAN SAY THAT I’VE CHANGED.... JUST SAY IT TO MY FACE. ONE DRINK &amp; I’M BACK TO THAT PLACE. THE MEMORIES WON’T FADE. #HATEME 🕸 https://t.co/jIhLdJGfN6", "https://t.co/9tw4nYQ6pX", "YOU ARE LIKE A NEON LIGHT SHINING THRU A DOOR THAT I CAN’T KEEP CLOSED.... #HIGH off my new record #PLASTICHEARTS 💚 @MarkRonson https://t.co/Cnd4HCq7XC", "https://t.co/SN3KVBMTcr", "FRIDAY 💀 https://t.co/zSvWTNVhhK", "PRE ORDER https://t.co/9tw4nYQ6pX", "WTF DO I KNOW! TRACK 1 OF 12 ORIGINAL SONGS OFF MY NEW RECORD PLASTIC HEARTS DROPPING THIS FRIDAY ☠️ EXEC PRODUCED BY GRAMNOM @THISISWATT https://t.co/F2Rl97CyPT", "RT @amazonmusic: Baby, it’s cold outside… so we’re staying in to watch @MileyCyrus launch our concert series, #HolidayPlays. Grab your cozi…", "RT @Spotify: Dealing with a #PlasticHeart? Believe in #Karma? Want to keep your spirits #High? Don’t worry @mileycyrus will be here to help…", "RT @AppleMusic: Listen to #Prisoner from @MileyCyrus x @DUALIPA on #AListPop: https://t.co/mQW68x3loo https://t.co/smL2COlaGX", "Thursday night on @tiktok_us #PlasticHearts https://t.co/vmhlilaqdl", "RT @1027KIISFM: #Prisoner is on right now!!! And @MileyCyrus and @DUALIPA are with us NEXT!\n\nhttps://t.co/PkQboszyuU", "RT @OnAirWithRyan: #MILEYCYRUS and #DUALIPA are zooming with us for \"Prisoner\", out now!! Just after 8:15a PT!\nhttps://t.co/Ie3y7KEv66 http…", "RT @MTV: Ah yes, another day where \"Prisoner\" by @MileyCyrus ft. @DUALIPA is stuck in my head. \n\n(not complaining, I'm very happy about thi…", "Fuck yes! Love u 4ever! https://t.co/uBeyDNPS5r", "Cheers to another year of Britney Spears and facing fears! YASSSSS! Thank you for makin my life so unbelievably rad! Appreciate you! ☠️⚔️🤘🏼🖤 https://t.co/M7B8Sr2suk", "RT @crystalwillseeu: @MileyCyrus album anticipation is really the only thing keeping me going right now. https://t.co/8HKNVTir84", "RT @AppleMusic: “I love what people feel when they listen to it.”\n\nBefore she drops her new album this Friday, @MileyCyrus reflects on her…", "I LIVE! https://t.co/9fHPSCOLmR", "Friday 🤘🏼🖤 https://t.co/eyY4vCjdJN", "RT @DUALIPA: HAPPY BIRTHDAY 2 MY BIG SIS @MileyCyrus - I LOVE U BITCH - STAY SEXY ⛓🖤🍒🩸👅🔪 https://t.co/B7OTwSO7Ym", "RT @billyjoel: Happy Birthday @mileycyrus! \n📍Miley Cyrus and Billy Joel perform at @thegarden on October 1, 2017\n📸: @MyrnaSuarez25 https://…", "🤘🏼 https://t.co/8m42dnZhix", "RT @MileyOfficial: Listen to Miley’s full #PlasticHearts interview with @ZaneLowe today, 10AM PT / 6PM GMT! https://t.co/bPhVB1BSIx\n\n https…", "RT @MileyCyrus: PRISONER FEAT. @DUALIPA 🍒💋 🎱🩸🧸🏍🔪🕸👅\nOUT NOW EVERYWHERE!!! \n\nhttps://t.co/bKJcIWNPXz https://t.co/WODX4DG8dP", "playing the opening night of @AmazonMusic #HolidayPlays on December 1! And @LilNasX is hosting!! 💋🖤 https://t.co/CAmWVw4vGo https://t.co/w1D95PKVci", "https://t.co/bKJcIWNPXz", "ME &amp; @DUALIPA LOOKIN AT THE WICKED NUMBERS OF PEOPLE LISTENIN &amp; LOVIN #PRISONER ☠️ https://t.co/lRvaDSQGww", "RT @MostRequestLive: For the first time EVER, the Most Requested Song of the Hour belongs to @MileyCyrus &amp; @DUALIPA with their hot new coll…", "RT @MostRequestLive: The THIRD Most Requested Song of the Hour was @MileyCyrus &amp; @DUALIPA #Prisoner on #MostRequestedLive with @OnAirRomeo!…", "RT @amazonmusic: .@MileyCyrus teams up with @DUALIPA to deliver us a retro rock anthem we didn't know we needed 🚨 #SongOfTheDay\n\nVibe out t…", "RT @AliGutyy: OUR PRISONER VERSION! 🍒❤️⛓@MileyCyrus @DUALIPA #Prisoner https://t.co/30YTJjxOdy", "SHE IS COMING FOR ALL THE CATEGORIES!!!!! ☠️🩸💉🎸🕸⛓ #PRISONER FEAT. @DUALIPA OUT NOW! https://t.co/a2wYAvk7nr", "https://t.co/KYP6hvTANd", "PRISONER FEAT @DUALIPA OUT NOW 🍒☠️🩸🤘🏼❤️ https://t.co/zQjYjyLQjs", "RT @ablackbillgates: take a look!! it wasn't perfect, but I tried 💀🤡 @MileyOfficial @mileycyrus @dualipa https://t.co/Cr9QpLeckg", "❤️🍒💋 https://t.co/bKJcIWwf61", "RT @DUALIPA: THANK YOU 4 ALL THE LOVE ON PRISONER @MileyCyrus - WE ARE SO PROUD OF THIS ONE ⛓✨ ++++ i’m so happy to have another song this…", "RT @TIDAL: .@MileyCyrus ft. @DUALIPA. \n\n🍒 Listen to #Prisoner now: https://t.co/x29VoC1mw7 https://t.co/YL6yEvNZtb", "🤘🏼🍒 @Spotify https://t.co/g1ccXYxjOr https://t.co/OXjWMfV5Zw", "Listen to the full #PlasticHearts interview with @zanelowe Monday, Nov 23 at 10am PT on @applemusic #Prisoner @DuaLipa https://t.co/oeIE7FFDzD https://t.co/EPcpXsmUTd", "RT @AppleMusic: Miley is coming. 👀\n\n@MileyCyrus speaks with @zanelowe on #Prisoner with @DUALIPA before the #PlasticHearts interview coming…", "RT @DUALIPA: THIS NEWS IS CHERRY SWEET @MileyCyrus WILL BE JOINING ME AT STUDIO 2054!!!! 🍒🍒🍒🍒 https://t.co/zaFatiNzEq https://t.co/UX0zDJxh…", "https://t.co/KYP6hvBZoD", "THANK U FOR ROCKIN TO #PRISONER &amp; MAKING DAY 1 SUCH A SUCCES! INFINITE APPRECIATION FOR THE SUPPORT!!! XXXXXXX  BTW I FUCKING LOVE YOU @DUALIPA 🍒🕸☠️🖤👅🔪🎱🤘🏼🧸💄🥀💿🩸🦷🎸 THERE’S MORE WHERE THAT CAME FROM! STAY TUNED! WE’RE FULL OF SURPRISES! https://t.co/TGymoFwVLd", "❤️🍒 @AppleMusic https://t.co/mNWLCvMp6W", "https://t.co/ZGIiPeWYfk @spotify 🖤🍒 https://t.co/bd06TdK9ma", "RT @chartdata: .@MileyCyrus and @DUALIPA's \"Prisoner\" is now the top trending music video on YouTube US. #MileyDuaPrisoner", "RT @Vevo: 🚨MILEY &amp; DUA🚨\n🚨MILEY &amp; DUA🚨\n🚨@mileycyrus &amp; @dualipa🚨\n⠀⠀⠀⠀⠀⠀⠀⠀⠀\n▶️https://t.co/etIt866zWd https://t.co/tpCZLwFTrb", "🍒🖤 https://t.co/bKJcIWNPXz", "RT @pandoramusic: Is this collab even real? 😍 Listen to #PRISONER by @MileyCyrus and @DUALIPA now: https://t.co/p57gkWzuA6 https://t.co/wjr…", "RT @AppleMusic: #Prisoner 🖤🍒\n@MileyCyrus x @DUALIPA \nListen: https://t.co/KHXIvtoUZS https://t.co/DOEBVEmUCL", "RT @Spotify: .@MileyCyrus, if you had one lifeline who would you call? We bet it’s @DUALIPA. #Prisoner is here https://t.co/Kdo9rATzw9 http…", "RT @MTV: YES @MileyCyrus AND @DUALIPA, YES. How can I go on this tour with you??? 💋 #PRISONER https://t.co/G9NjB4TMGB", "RT @DUALIPA: PRISONER @MileyCyrus OUT NOW ⛓🍒🔪🧸🩸 BIG LOVE TO THE WHOLE GANG WHO HELPED PUT THIS TOGETHER DIRECTED BY ALANA O'HERLIHY + MILEY…", "PRISONER FEAT. @DUALIPA 🍒💋 🎱🩸🧸🏍🔪🕸👅\nOUT NOW EVERYWHERE!!! \n\nhttps://t.co/bKJcIWNPXz https://t.co/WODX4DG8dP", "20 mins!!!!  https://t.co/FYwNg0kFBZ", "30 minutes ❤️🍒 https://t.co/FYwNg0kFBZ https://t.co/qqxPpbf65I", "I’m in the chat room 🍒🍒🍒🍒#MileyDuaPrisioner https://t.co/FYwNg0kFBZ", "https://t.co/FYwNg0kFBZ", "#MileyDuaPrisoner drops in ONE HOUR ! \n\nⓘ  𝗢𝗳𝗳𝗶𝗰𝗶𝗮𝗹 𝘀𝗼𝘂𝗿𝗰𝗲𝘀 𝘀𝘁𝗮𝘁𝗲𝗱 𝘁𝗵𝗮𝘁 𝘁𝗵𝗶𝘀 𝗶𝘀 𝘁𝗿𝘂𝗲.", "LOVE U 🇧🇷 https://t.co/HhHLI1ZtN8", "2 HOURS #MileyDuaPrisoner", "#MileyDuaPrisoner", "RT @MileyMedia: 2 HOURS LEFT UNTIL PRISONER #PRISONERTODAY\n\n⛓YouTube: https://t.co/yFdV0RrpBn \n\n⛓Pre-Save: https://t.co/LXXpcImuZf https://…", "RT @MileyOfficial: 2 HOURS! 👄🎤🩸\n#PrisonerTODAY https://t.co/aozK8nQWwb https://t.co/Wa7lzaVL68", "Few more hours ! https://t.co/bKJcIWNPXz", "👅🍒💋🩸 @DUALIPA DOIN THE “TONGUE THANG” #PRISONER #YouAreWhoYourFriendsAre https://t.co/BK3xVewK2t", "SO SOON #PrisonerTODAY https://t.co/3qQZf0SG0w", "RT @miley_aep: mood #PRISONERTODAY https://t.co/a0HozK7hcI", "RT @DUALIPA: R U READY - PRISONER - @MileyCyrus - MIDNIGHT UK - https://t.co/Er2pmgTXsn 🍒🔪⛓🤍🩸 https://t.co/MwLj7pq5lI", "join the official watch party on @youtube! https://t.co/FYwNg0kFBZ", "PRISONER FEAT. @DUALIPA 🍒💋🩸❤️☠️🤘🏼🔪📀🧸🎱 DROPPING AT 7PM ET\n\noff my new record Plastic Hearts out  November 27th https://t.co/8nH4sB80CB", "RT @SpaceBootz1123: #PRISONER OUT TODAY! 🍒 @MileyCyrus @DUALIPA https://t.co/4JYN7rLcis", "@perfectselarry there’s only a few hours to go until the video !!!", "RT @MileyUpdates: SMILERS! Let's go TREND #PRISONERTODAY ⛓🖤🍒 https://t.co/Lwivc6D1Gu", "@fuckingsmilers9 @MileyUpdates ITALY🖤", "@MileyUpdates Let’s do it if you want to see art !!!!", "#PRISONERTODAY", "RT @seancellmore: PRISONER OUT TODAY ⛓☠️🍒☠️⛓\n@MileyCyrus @DUALIPA https://t.co/4x5Jy93jAC", "I LOVE U https://t.co/CxNvX9yJTg", "RT @MileyCyrus: PRISONER FEAT @DUALIPA TOMORROW 11/19 ☠️\n\n4PM LA / 7PM NYC  / 12 AM London  / 11AM Sydney / 8AM Beijing https://t.co/OoT8ul…", "at 9AM PT", "WILL SHARE SOON ! 🍒 https://t.co/EOpy26dCXu", "TODAY 🍒❤️ https://t.co/OK5chsPsVD", "RT @MileyNation13: Set your reminders for #PRISONER ‼️ \n\nhttps://t.co/wq3DPFc7VS https://t.co/scLZhlMtmS", "RT @dailymileygifs: PRISONER TOMORROW https://t.co/VYsyqc0L4a", "YouTube watch page is live 🖤🍒 https://t.co/FYwNg0kFBZ", "Not on my calendar! #PRISONER is coming! @dualipa 🍒🩸💋 https://t.co/5lEZVffgGD", "PRE SAVE https://t.co/bKJcIWNPXz", "COMING 4 BLOOD #PRISONER w/ my main squeeze @DUALIPA 🍒🩸💋❤️ https://t.co/wbN2HcH0CZ", "RT @Missing_Lorde: @MileyCyrus @DUALIPA The end part gurrrlll https://t.co/NFL0JFcIBC", "YAS PRISONER TOMORROW https://t.co/4GBxWLNaRr", "RT @MileyMedia: PRISONER TOMORROW 💀🍒 \n\nhttps://t.co/7SFrawv9E6 https://t.co/XYGQDQQqr0", "RT @DUALIPA: PRISONER @MileyCyrus 19NOV 🖤  4PM LA / 7PM NYC / 12AM LONDON / 11AM SYDNEY / 8AM BEIJING ⛓🔪🍒🩸🚬👅 https://t.co/5Qwcm9sEZt https:…", "pre-save: https://t.co/bKJcIWNPXz 🖤", "PRISONER FEAT @DUALIPA TOMORROW 11/19 ☠️\n\n4PM LA / 7PM NYC  / 12 AM London  / 11AM Sydney / 8AM Beijing https://t.co/OoT8ulevzk", "🍒 https://t.co/238bO3tj16", "...", "RT @DUALIPA: PRISONER IS COMING @MileyCyrus https://t.co/1xqWdRUWKC", "#PRISONER https://t.co/ZCROoTLvnb", "NOVO CLIPE COM A @DUALIPA, EM BREVE! MAL POSSO ESPERAR PARA QUE O MUNDO INTEIRO ASSISTA! 💀💀💀 #prisoner https://t.co/ZfoL5Uq0vC", "IS IT EVEN MY MUSIC VIDEO IF IT DOESN’T CAUSE A REACTION?!?! #PRISONER 👅#COMINGSOON  @dualipa https://t.co/T0unoOuQSh", "PRISONER IS COMING", "SENT A TEASE OF MY UNRELEASED VIDEO WITH @DUALIPA TO SOME REACTORS …  PRISONER COMING SOON ☠️ https://t.co/C98SJoGvWl", "RT @MileyCyrus: https://t.co/dXqP86rWBe", "RT @MileyCyrus: November 27th💀 https://t.co/hT6Fq3s8O2", "Mick + Miley 4EVR! 👅☠️ 📸  #PlasticHearts https://t.co/3HgCDFr6rz", "Album photography shot by the legendary @TheRealMickRock #PlasticHearts is coming! November 27th! https://t.co/au9YZC3R5F", "https://t.co/Wlwm3YbEPm https://t.co/urgOA23YRG", "RT @MarkRonson: And Never Be Me is that unapologetic heartbreak shit that you love from ms Miley.\nSo psyched for this album\n💔", "RT @MarkRonson: Bad Karma was written at a jam session at Max’s Kansas Xity in 1976 with Ace Frehley and Joan Jett (it wasn’t but u get my…", "RT @MarkRonson: I love that I get to see the tracklisting at the same time as you all. \nIt’s makes it so exciting to see these three tracks…", "https://t.co/UXYOb2oI89 🖤", "https://t.co/dXqP86rWBe", "RT @MileyEdition: There are now 3 new album covers on Mileys site #PlasticHearts \n\nShop:  https://t.co/9Vl47xKiUG https://t.co/y2CuUKP06q", "additional album covers available on my site 💀💀💀https://t.co/N23UIE96Hm", "https://t.co/UXYOb2oI89", "November 27th💀 https://t.co/hT6Fq3s8O2", "RT @seancellmore: wearing the @mileycyrus merch i designed. a dream come true ❤️ https://t.co/D36CrVfqHp", "Fuck yes! Your wish is my command baby. ❤️ https://t.co/wJW6zqMNY4", "RT @ElizLanders: .@MileyCyrus’ “Party in the USA” blaring outside the White House https://t.co/ksvEc8tluI", "RT @MileyUpdates: HUGE Crowd in D.C singing Party In The USA ❤️💙 https://t.co/F23NIbASnb", "RT @MileyUpdates: “People have been driving by blasting Party In The USA.\" - ABC News Achor! https://t.co/6GPjYEFP0G", "🇺🇸🎉🇺🇸🎉🇺🇸🎉🇺🇸🎉🇺🇸 https://t.co/EEoiNDwftL", "Now THIS is a PARTY IN THE USA! @JoeBiden @KamalaHarris 🇺🇸🎉 https://t.co/zFKL1ncuSa", "RT @MileyCyrus: 🖤@StevieNicks has always been my idol &amp; an inspiration. It’s an honor to now call her my friend and collaborator. Edge Of M…", "RT @MileyUpdates: iTunes US 🇺🇸: #5 - Miley Cyrus, Stevie Nicks - Edge Of Midnight https://t.co/1ndSVoX3nw", "@Alexa99, happy birthday! Hear my new song, Midnight Sky, when you say “Alexa, play Alexa’s Birthday playlist” #AlexaHappyBirthday https://t.co/aNEVtFrnoi", "I love you Stevie Baby! https://t.co/D9n1OrCTiW", "RT @StevieNicks: Duet with @MileyCyrus ...Magical! Loved singing with her! Available everywhere. https://t.co/3OSSS1xdDg", "RT @Spotify: Pinch us... @mileycyrus and @stevienicks joined forces for a remix of #MidnightSky #EdgeofMidnight 🖤  https://t.co/4NnHTpw8hu", "🖤@StevieNicks has always been my idol &amp; an inspiration. It’s an honor to now call her my friend and collaborator. Edge Of Midnight (Midnight Sky Remix) out everywhere!\n\nhttps://t.co/jU7z36Af3M https://t.co/SRbKJjlqk9", "RT @_pIastichearts: Finally got my MC X Madeworn shirt (I'm inlooooove)! &amp; I also voted today, hbu? ❤️ #ElectionDay https://t.co/gbSJJRnonb", "When I create a look I always ask “would this make someone want to be me for Halloween?”\n\nit makes me fucking melt knowing so many of you were MS MC this year! Love u! 🖤💀🖤💀🖤 https://t.co/4g3qNUs8rR", "RT @missmelissaraex: @MileyCyrus my queen look what I found up in nashville! I am so happy #plastichearts #mileycyrus https://t.co/vtv5bm02…", "RT @beatleswift: Me and my bf were just driving around for fun for Diá De Los Muertos and look who I found 🥺🥺🥺💖💖💖 @MileyCyrus #PlasticHeart…", "Happy MileyWeen! https://t.co/67jOqDMNwM", "RT @LouisMonttana: HAPPY HALLOWEEN!!! 🎃👻 @MileyCyrus #MileyCyrus #MILEYWEEN2020 https://t.co/ctIlPdjPY2", "RT @valencalderont: @MileyCyrus #mileyween #mileyween2020 #MidnightSky 🤘🏼✨ https://t.co/doS0P46KDZ", "RT @Ghada_khaznadar: Not me trying to get @MileyCyrus s attention on every social media platform 😬 #mileyween #mileyween2020 https://t.co/o…", "RT @chiyrusna: Mileyの数量限定のTシャツ届いた！！！🤩\nMiley x Madeworn tee arrived and I’m obsessed 🖤🔥😍\n@MileyCyrus https://t.co/x57rg14ihm", "RT @HaleyBo68461515: @MileyCyrus #MileyCyrus #miley #Costume #Halloween #Viral #RETWEEET https://t.co/yjmjVlCYgO", "RT @bunnyandfawn: it's the tin foil mic and shrinky dink chanel belt for me @MileyCyrus @MileyCyrus @MileyCyrus @MileyCyrus #MileyCyrus #Mi…", "RT @qweeenmiley: #MILEYWEEN2020 @MileyCyrus https://t.co/BbH4CplGyx", "RT @JayJayKings: Happy #HalloweenAtHome  @MileyCyrus @fuckingsmilers9 @MileyNewsAccess #MileyCyrus https://t.co/yrDW25y36V", "RT @anthonydrapos: MC x Madeworn comin in HOT 🔥 @MileyCyrus 🖤. https://t.co/D3KfbrsOup", "RT @mileychronology: Happy #Mileyween!! Here’s my #MidnightSky look 💜\n#PlasticHearts out November 27th!! \n@MileyCyrus https://t.co/fJ1CaSa4…", "RT @dylandavii: the midnight sky is the road i’m taking... https://t.co/btldZygfVj", "RT @takemealongstan: PLASTIC HEARTS\n11.27\n@MileyCyrus https://t.co/yCRKKi1Zxy", "RT @mileysbae: .@MileyCyrus x Made Worn https://t.co/LdLq7FxDxm", "RT @aliciakeys: Fam!! Tonight is the night!! You are going to LOVE. THIS. SHOW. If you are feeling a hope deficit, I got u. We’re having a…", "RT @changeisathing: People stare at me for wearing my @MileyCyrus mask but I’m OBSESSED https://t.co/vOp8Jk1pfU", "RT @StylishCyrus: Got my vintage inspired Miley x Madeworn tee in the mail and I am obsessed! I love the gold glitter detailing! ✨ @MileyCy…", "RT @PLASTlCHEARTED: plastic hearts teaser ft smilers x @MileyCyrus @MileyOfficial https://t.co/nCXxiASuyy", "🖤 @noahcyrus https://t.co/FRAF9hBVir https://t.co/xXAC52qmvr", "RT @noahcyrus: I GOT SO HIGH THAT I SAW JESUS FT. @MileyCyrus out now everywhere !!!! no one knows how excited we are to be releasing somet…", "RT @AppleMusic: More @MileyCyrus is coming.\nPre-add her upcoming album #PlasticHearts now. 👀❤️\nhttps://t.co/wOR8zwc3yU", "RT @MileyEdition: Smilers x #PlasticHearts 🖤💀 @MileyCyrus \n\nThe New Rock Album Out November 27th! \n\nPre-Order: https://t.co/CNh1rgqGF0 http…", "RT @MileyCyrus: https://t.co/PGFrnusTnd", "RT @MileyUpdates: \"Plastic Heart\" Cover was shoot by Mick Rock who has worked with the most iconic people on the industry like Debbie Harry…", "PLASTIC HEARTS OUT NOVEMBER 27TH. https://t.co/qAO6AfZ4Vm", "PLASTIC HEARTS OUT NOVEMBER 27th. https://t.co/oTvCo3BvXB", "RT @StylishCyrus: You can now also stream @MileyCyrus’ cover of ‘Zombie’, which will be featured on her upcoming album #PlasticHearts - Out…", "RT @MTV: My alarms are already set", "RT @Spotify: @MileyCyrus Category is: Leather and chains ⛓ We're ready for this era🖤", "https://t.co/PGFrnusTnd", "PLASTIC HEARTS OUT NOVEMBER 27th. PRE ORDER NOW:  https://t.co/UXYOb2oI89 https://t.co/G6exEAXLva", "https://t.co/RCcY5qxVVv", "RT @KamalaHarris: Instagram Live tonight at 6:30pm ET. \n\n@MileyCyrus, see you soon.", "going live with Senator @kamalaharris at 3:30 PT / 6:30 ET on my IG! https://t.co/DElY1zaG4g", "RT @PearlJam: 👏 @MileyCyrus", "https://t.co/54Y5uuw3is", "Pearl Jam x Just Breathe... Under everything’s just another human being.... 🧚🏻 https://t.co/a5gV1DjzQ5", "RT @Shazam: Keep going! Shazam #MidnightSky by @MileyCyrus!! 🎶 https://t.co/npewKh7zGE", "https://t.co/6zfJwvq0MY", "Thought you’d never be replaced .... you know it’s true. 💀🖤 #MidnightSky https://t.co/ZmuliqU4uu", "https://t.co/fK7EnS1fPB", "https://t.co/4AS0vlgV62", "https://t.co/WyHmZwzSEV", "From my middle school gym locker room to backstage on timeless tours you could always find me listening to #TheCardigans it was a privilege to perform Communication for BYS unplugged. These words are even more relevant to me now at 27 years old. https://t.co/6259VsVTfT", "RT @MileyEdition: .@MileyCyrus has just uploaded her cover of “Sweet Jane” Live from the backyard sessions 💫🖤\n\nWatch: https://t.co/en6tGDu1…", "https://t.co/kA6CECkFnw", "RT @MileyEdition: 🚨| Miley has uploaded her cover of ‘Zombie’ on her YouTube Channel! \n\nGo stream it: https://t.co/hMX8w29CHN https://t.co/…", "https://t.co/iqrugljOim", "*sobs* BOYS DON’T CRY *sobs* BOYS DON’T CRY *sobs* BOYS DON’T CRY *sobs* BOYS DON’T CRY *sobs* BOYS DON’T CRY *sobs* 💀 https://t.co/QQGeMcLvoT", "RT @BigTop40: Another week at Number 1 in the UK! @MileyCyrus makes it SEVEN WEEKS at the top of the UK's biggest chart show 🏆🏆🏆🏆🏆🏆🏆\n\nSee t…", "How it started vs how it’s fucking going 💀 https://t.co/jcu7kTq8c1", "RT @MileyNation13: How it started:                How it's going: https://t.co/vvi02YPC1B", "RT @MileySmilerNews: The world finally seeing something Miley showed 10 years ago\n\n 2010                  vs             2020 https://t.co/…", "your girl was v.i.b.i.n.g 💀 https://t.co/6r5FVlGRqE", "Misjudged your limits. Pushed you to far. Took you for granted. I thought that you needed me more.... 💀 #BoysDontCry #SOSFest https://t.co/WrPeD11eLh", "ZOMBIE 💀 @TheWhiskyAGoGo @youtube #SaveOurStages https://t.co/4tY71aS9N3", "#saveourstages #SOSfest on my @youtube at 7:15 PT! https://t.co/SlVpJLwW7u", "Here's my @MostRequestLive @AskAnythingChat https://t.co/PRz3mmhPTi thanks again to @OnAirRomeo and @iHeartRadio #MidnightSky", "RT @nivassoc: #SOSFEST is back on @YouTubeMusic for Day 2 ft. @Jason_Mraz from @BellyUpMusic at 1PM PT/ 4PM ET + @KelseaBallerini, @LeonBri…", "https://t.co/VbQkEh1cQj", "🖤 @noahcyrus sanggggg the house down last night! proudest big sister ever. i love u soooo much. https://t.co/YHJgIxh69e", "RT @AskAnythingChat: we're getting ready for our @MileyCyrus @iHeartRadio @AskAnythingChat tonight at 8pm est on @MostRequestLive.  let's f…", "https://t.co/fK6x7X6M96 https://t.co/DT6n6BCm8W", "RT @MTV: 𝙏𝙊𝙉𝙄𝙂𝙃𝙏 𝙏𝙊𝙉𝙄𝙂𝙃𝙏 𝙏𝙊𝙉𝙄𝙂𝙃𝙏 𝙏𝙊𝙉𝙄𝙂𝙃𝙏\n\n#MTVUnplugged presents @MileyCyrus' #BackyardSessions at 7/6c on MTV! 💜✨ https://t.co/sRwjYempiT", "RT @MTV: I'll NEVER forget @MileyCyrus’ cover of “Why’d You Only Call Me When You’re High?” during her 2014 #MTVUnplugged sesh! 🎶\n\nWe're le…", "Backyard Sessions Unplugged TOMORROW on @mtv 💀 We got so high we saw Jesus 🙏@noahcyrus https://t.co/2f7JMD60iM", "You got me in a crazy position. If your on a mission. You got my permission. 💀 @britneyspears @mtv #BackyardSessions #Unplugged https://t.co/3HFrv2eW0r", "@PopCraveMusic @BLACKPINK 🖤🖤🖤", "RT @xoSonique: Getting me a piece of @MileyCyrus midnight sky on Snapchat 🔥 https://t.co/eI2FvoPcoH", "DON’T FORGET #BackyardSessions #Unplugged on @mtv this Friday 🖤 https://t.co/M3Bok3Ag75", "POWER SUIT 🖤♠️🖤♠️🖤♠️ https://t.co/kICyHuQm5o", "FORBIDDEN FRUIT 🍎🐍 ❤️ https://t.co/PFnciG3r8b", "RT @MTV: IN 3 DAYS... #MTVUnplugged is going to rock your world with @MileyCyrus' #BackyardSessions! 🤘\n\nJoin the party this Friday, Oct. 16…", "VOTE 💜 VOTE 💜 VOTE 💜 VOTE 💜 https://t.co/ad02NIfPha", "I'm excited to invite you to \"Honor Her Wish\" -- an exclusive celebration &amp; tribute to RBG tonight at 8pm ET. We must take action to protect her legacy by honoring her last wish: No confirmation until inauguration.  Accept your invite &gt; https://t.co/UpvGMwaNqO https://t.co/s5gsNOoofv", "I want to be the girl with the most cake.\nI love him so much it just turns to hate.\nI fake it so real, I am beyond fake. https://t.co/5i34ZX3QW5", "Midnight Sky is on her 6th week #1 at UK radio! Broke the record for most weeks at the top in 2020. Thank YOU so much for all the love you show me and my art! It’s my honor makin music for you! https://t.co/0TVlc3tMfU", "Midnight Sky on @TheGNShow https://t.co/MVFIhJMmnD", "my @MostRequestLive @AskAnythingChat happens next saturday with @OnAirRomeo and @iHeartRadio. Send me your questions ! https://t.co/MG4ntmutOk. #MidnightSky", "See my lips on her mouth everybody’s talkin now baby. https://t.co/l2Ae4sCbbY", "#MidnightSky on @TheGNShow  ! https://t.co/k3ZkhdsaW1", "https://t.co/8wRvU5xAQr", "M.I.L.E.Y W.O.R.L.D @TheGNShow https://t.co/up3Nkt1lJZ", "RT @TheGNShow: TONIGHT! We're joined by Ewan McGregor, @ShirleyBallas, @AshleyBanjo, Frank Skinner &amp; @MileyCyrus! On @BBCOne at 10:45pm #Th…", "I LOVE U SO MUCH @KamalaHarris. \n\n@JoeBiden X HARRIS FOREVER https://t.co/EyOOVpbsnf", "RT @nivassoc: Independent venues are at risk of closing forever 🚨 Help #SaveOurStages! Join @NIVAssoc &amp; @YouTubeMusic for #SOSFEST on Oct 1…", "RT @TheGNShow: Have you heard @mileycyrus' new single #midnightsky? The incredibly talented Miley Cyrus will return to #TheGNShow on Friday…", "backyard sessions x unplugged is coming 10/16 on @MTV https://t.co/v84Vyj2p6C", "RT @mtvema: Here are you 2020 #MTVEMA Best Artist nominees!! 🙌\nWho will you be voting for?! 🤔\n\n⭐ @DUALIPA  \n⭐ @Harry_Styles \n⭐ @justinbiebe…", "RT @MileyNation13: MILEY has been nominated for \"Best Artist\" at the MTV EMAs 2020! 💫 \n\nVote now: https://t.co/28sTrulwCw https://t.co/Z54u…", "RT @MTV: #MTVUnplugged Presents @MileyCyrus #BackyardSessions, Friday, October 16th at 7/6c on MTV! GET. READY. 👏 https://t.co/R3QXf6k1D1", "🚨 Backyard Sessions on @mtv October 16th 🚨 https://t.co/LY2iusTBtP", "ANNOUNCEMENT! 🚨🚨🚨 reply with your best guess! @MTV https://t.co/nRPbWoNPR8", "I’m back on @MostRequestLive Sat Oct 17th to answer your #MidnightSky @AskAnythingChat questions! Thanks @OnAirRomeo &amp; @iHeartRadio for having me. Submit Q’s here: https://t.co/MG4ntmM5cU.", "OUT NOW! @blondieofficial forever https://t.co/mQaPI3W9bf https://t.co/3Va6W689Pa", "RT @TheGNShow: Next week on #TheGNShow we have #EwanMcGregor, @AshleyBanjo and @MileyCyrus 🎉", "RT @MileyCyrus: By popular demand my Heart Of Glass cover is up on steaming services ❤️ https://t.co/mQaPI3EyjH https://t.co/eZXfVh15KG", "RT @MrHorrorPsychDT: Ahhhh. After many weeks, she is here. @MileyCyrus #MidnightSky https://t.co/DMQjA9iQBj", "Thank YOU for the “Heart Of Glass” LOVE! Keep steaming! @BlondieOfficial  forever! https://t.co/mO4xMIujtY", "RT @iHeartRadio: Love a great cover from an amazing artist at an incredible festival. 😉\n\n@MileyCyrus just released her performance of @Blon…", "RT @BlondieOfficial: Once @MileyCyrus covered \"Heart of Glass\" and it was divine. ✨ Listen now: https://t.co/VM0OJLAib4 https://t.co/7j7emB…", "https://t.co/mQaPI3EyjH 💪🏼 https://t.co/169ZTV0xnb", "https://t.co/mQaPI3EyjH", "By popular demand my Heart Of Glass cover is up on steaming services ❤️ https://t.co/mQaPI3EyjH https://t.co/eZXfVh15KG", "Today https://t.co/nzyRsqxZtU", "RT @iHeartRadio: Are you ready for night one of the iHeartRadio Music Festival?! Oh yeah – @MileyCyrus will be there. 😉 Watch tonight at 8/…", "Should I drop Heart Of Glass on streaming?! 💀 https://t.co/8yenZTZY6I", "Who wants more BTS from MS MV! LOL! 👅💋👽🎈💀 https://t.co/yAUImdzzfK", "Happy 10 year anniversary to “Who Owns My Heart” ❤️💋 https://t.co/kvTg8EJfRq https://t.co/eCDBo3Q1YK", "Fuck Yes! Been on loop all day! Queen Debbie forever! PS your hair is beautiful! https://t.co/buq4WkaRpy", "ATOMIC. https://t.co/L3LYPu1FAH", "Midnight Sky @iheartfestival airing 9/27-28 on @TheCW @ 8pm https://t.co/1ycuThl2JR", "RT @BlondieOfficial: We think @MileyCyrus nailed it. 🖤 Check it out: https://t.co/6Xx9Wtglot", "RT @MileyNation13: Did it work? 🥵 @MileyCyrus https://t.co/eeOHz004T1", "Who owns my heart?! 💀❤️ https://t.co/nik3Fjdbqt", "Heart of Glass #iHeartFestival2020 https://t.co/bP1GsADgoa", "RT @Wild949: Me when @MileyCyrus comes on at the #iHeartFestival2020!! \n\nTune in now on @theCW app / https://t.co/JoB0FXLjM1!! https://t.co…", "RT @961KISSOnline: Raise your hand if you're ready for @MileyCyrus's performance! 🙋🏼‍♀️ #iHeartFestival2020 https://t.co/yoenwrFsCC", "RT @iHeartRadio: The midnight sky is the road I'm takin' to the #iHeartFestival2020 with @MileyCyrus ✨ @CapitalOne https://t.co/KOo6Q800Gr", "#iHeartRadioFestival2020 TONIGHT 🖤 https://t.co/n7qE0xcZvV", "Excited to be a part of the 10th anniversary of the @iHeartRadio Music Festival. Watch my performance tonight starting at 9PM ET / 6PM PT on @TheCW app or by clicking here: https://t.co/OhXr7l2s3n https://t.co/kHE97bD4zD", "#iHeartFestival2020 tomorrow 🖤 https://t.co/laeXBiX9wM", "🖤 @iHeartRadio https://t.co/XRy7Lt477X", "Bad ass edit fuck yeah https://t.co/oqTaIG8062", "RT @hitsradiouk: We are SO excited about this 😍\n\nTomorrow morning the one and only @MileyCyrus joins us on Hits Radio Breakfast 🔥 #Midnight…", "fuck yeah I love u https://t.co/1B2lhuFAeQ", "MAN EATER ❤️🖤❤️🖤 https://t.co/iVwwmm6PG0", "@brooksmiley13 @MileyUpdates @MileyOfficial 🖤🖤", "https://t.co/ZzT0hFvSW4", "RT @FallonTonight: La-la, la-la, la! @MileyCyrus shares a sparkling performance of #MidnightSky! 🌌✨🎶 #MileyOnFallon \n\n🎧▶️ https://t.co/ujvm…", "RT @FallonTonight: .@MileyCyrus shares a killer cover of the @halloates hit “Maneater” ❤️🎵 #MileyOnFallon \n\n🎧▶️ https://t.co/o6g00y7vqJ htt…", "RT @SNFonNBC: \"It's always Al &amp; Cris...why can't it be Cris and Al?\" 😂😂\n\n@MileyCyrus asking the important #NFLKickoff questions before @Fal…", "https://t.co/vKYjiCviRC", "I’m on ⁦@FallonTonight⁩ performing Midnight Sky and a cover! C u there! 🖤🖤🖤🖤🖤 https://t.co/xIKwOCcS87", "RT @FallonTonight: Talk &amp; TWO performances with @MileyCyrus tonight? Now that’s the best of both worlds 💫 #FallonTonight https://t.co/IRd4B…", "Performing Midnight Sky and hangin w my dude @JimmyFallon after football on @fallontonight 🖤 https://t.co/OhKJMGvbr1", "I’ll be looking at YOU tonight and I can’t wait! Love u @Jimmyfallon https://t.co/OXkyE9oKik", "You can’t sit with us. 🖤 @joanjett @BlondieOfficial https://t.co/DfEt0IU8D0", "One Year of Slide Away https://t.co/R9xu58vzLL", "This Thursday @FallonTonight https://t.co/t6J5RrXfpm", "RT @FallonTonight: 🎶 Ooh, you know it’s true! 🎶\n\n✨ @MileyCyrus is on #FallonTonight this Thursday! ✨ https://t.co/zA2sJLie1C", "RT @heardwell: All our favs living our #midnightsky fantasies with visits from @MileyCyrus’ disco truck 🌟 https://t.co/iL2wIcSGiY", "ROCKSTAR @billieeilish COMING THRU WITH THE MOST BEAUTIFUL BOUQUET EVVVVVVEEEER! MADE MY FUCKING DAY! APPRECIATE YOU AND YOUR ART! 🌺 https://t.co/XNNDL9KFJi", "#MidnightSky is #1 on iTunes UK!! 🖤🖤🖤 #LiveLounge @BBCR1 https://t.co/LIwFCz4Njf", "RT @NiallOfficial: wowwww ⁦@MileyCyrus⁩ ❤️. ⁦@thisiswatt⁩  https://t.co/5rapabpT4s", "❤️💋 https://t.co/s9fDRNSin2", "🖤🖤🖤 https://t.co/2tEshsX48i", "https://t.co/UPEuRPmB1L", "RT @wtfdoik: Joe Rogan was NOT ready for that 😭 https://t.co/DdBr3gvySM", "RT @spotifypodcasts: “The voice can be like a face, it collects wrinkles and it tells a story.”\n\n@MileyCyrus is on the @JoeRogan Experience…", "RT @joerogan: Today on the podcast - the great and powerful @mileycyrus! I had a great time talking to her and wearing @davidchoe’s shirt!…", "Take It To The Limit- Dedicated to my Mammie... The Eagles were my Mammies favorite band.... and my mama grew up singing this song on drives in the car w her mom! This is in honor of my grandma ❤️ https://t.co/ywTjFbVSoW", "https://t.co/t7fbGRiDac ❤️", "Honored to be the 1st performing for @bbcradio1 Live Lounge Month 2020! @billieeilish “my future”..... https://t.co/ZBGH2kZ3GJ", "RT @PopCrave: Addison Rae &amp; Kourtney Kardashian visited Miley Cyrus’ #MidnightSky truck to ride the wrecking ball installation. https://t.c…", "RT @BBCR1: How incredible does #MidnightSky sound in the Live Lounge? 🌠\n\n@MileyCyrus truly is opening #R1LiveLoungeMonth in STYLE ✨ https:/…", "RT @BBCR1: 'Slide Away' gets us every time 💔\n\n@MileyCyrus brings her perfect sad banger to #R1LiveLoungeMonth and it's stunning. https://t.…", "RT @BBCR1: We're in love with @MileyCyrus' version of 'my future' by @billieeilish 😍\n\nWhat an amazing #R1LiveLoungeMonth performance! https…", "RT @BBCR1: Want to play @MileyCyrus' Live Lounge on repeat? (Of course you do!) 🎤❤️\n\nListen in full on @BBCSounds here: https://t.co/LITYaA…", "Who’s seen the Midnight Sky truck around LA?!?! Come ride my (disco) balls! https://t.co/NVtLgJGb1R", "BTS #VMAs https://t.co/itDH4Vv6eU", "only 50 tees available of each 👅", "New merch drop ! Limited edition merch with MadeWorn &amp; @harleydavidson https://t.co/2z57U0lyzf https://t.co/KM9tEQtbUc", "Truth is I didn’t eat the pizza.... I had 4 day old Indian food to celebrate instead. https://t.co/oJBOqkK6kx", "RT @OCHannahMontana: https://t.co/40D5nuOAH3", "RT @BBCR1: 🤩 Who's ready for a @MileyCyrus Live Lounge? 🤩\n\nJoin us at 12pm BST tomorrow when Miley will be kicking off #R1LiveLoungeMonth i…", "I don’t belong to anyone. https://t.co/kUnTHCortB", "RT @MTV: Our girl @MileyCyrus has us all gazing at the #MidnightSky tonight! #VMAs 🔭✨ https://t.co/7UVmPix1My", "#vmas red carpet moment yasssssss https://t.co/QSVeZhwBIw", "@TheEricaAmerica @MTV @Z100NewYork 💋", "RT @MostRequestLive: Had the best time on Zoom with @MileyCyrus on #MostRequestedLive! Thanks for hanging with us - we loved hearing all ab…", "⚪️🔵⚫️🔴 Tomorrow @MTV #vmas performing Midnight Sky live for the first time ever! https://t.co/e5X0kRd2Xg", "❤️ https://t.co/FyhTOW3crp", "RT @MostRequestLive: Tonight we welcome the one and only ⁦@MileyCyrus⁩ to #MostRequestedLive with ⁦@OnAirRomeo⁩ to talk about #MidnightSky…", "#vma rehearsals 💙 TOMORROW I’M PERFORMING MIDNIGHT SKY LIVE FOR THE 1ST TIME EVERRRRR!!!!!!!!!!! https://t.co/VDlIKzo3WP", "The Making Of Midnight Sky OUT NOW! https://t.co/6dNLKbNd4u https://t.co/GUs2KLfQuM", "RT @BBCR1: What better way to start #R1LiveLoungeMonth than with the one and only @MileyCyrus? 🤩✨\n\nMake sure you're listening to Radio 1 at…", "👏💋 https://t.co/7fnFHj9OeB", "In 3 days I perform Midnight Sky LIVE for the first time EVER! Don’t miss @vmas this Sunday 8/30! 🤘 https://t.co/Wj0DUDQnsX", "Go vote Midnight Sky 💋 https://t.co/m1H5t6fen8", "RT @cyrusftlovatx: @MileyCyrus @DollyParton miley x rosie from blackpink\n\nhttps://t.co/i2Spm4O7Db", "RT @camilasjonas: @MileyCyrus kristen stewart... served in #MidnightSky https://t.co/WweQzOArKM", "RT @kekemoneykp: @katyperry looks so good in midnight sky mv 😻 @MileyCyrus 🔥😍 https://t.co/cT6GnoP7vT", "RT @vmas: @MileyCyrus Congrats! You're nominated for SONG OF SUMMER for #MidnightSky 🌌\n\nVote now on @MTV's IG Story! Can't wait for your pe…", "RT @selmakesmerare: Selena looks so good in midnight sky mv🔥🔥 @MileyCyrus https://t.co/pPvfGtfLxU", "RT @cyrsnitta: @MileyCyrus @DollyParton @Anitta look so good at mv 🇧🇷🤪 https://t.co/AtDJ21RH0r", "RT @thinkingboutyou: @MileyCyrus @DollyParton do you like mine, hennnnny?  https://t.co/PUDX9v9SWH", "RT @JavierCyruss: @MileyCyrus @DollyParton @joanjett x @MileyCyrus lol https://t.co/8USQVv6AzZ", "RT @gayvioli: @MileyCyrus @DollyParton LMAO @MileyCyrus https://t.co/OxMxy65XwP", "RT @_kcyrus97: @MileyCyrus @DollyParton Think i should get a mullet 😂😫 https://t.co/KsfzslyoGl", "RT @kaylamedlin7: @MileyCyrus @DollyParton @ddlovato looks so good in ur music video @MileyCyrus 😍 https://t.co/qqPoY2x8a3", "RT @smiler_230: @MileyCyrus @DollyParton omg kkkkkkkkkkkkkk #MidnightSky #reface https://t.co/i0jd3KsQFu", "RT @confide1555: @MileyCyrus @DollyParton Sis- \nSomeone should morph you and kylie \nhttps://t.co/liPHqo8xmI", "When your godmother @dollyparton looks better in your own video than you do. #midnightsky on #reface ! 👄 https://t.co/6P1qX6xW9p", "Midnight Sky is nominated for @vmas Song Of The Summer! Vote on @mtv Instagram stories! All the LOVE you’ve shown this song already is blowin’ my mind... this would take it over the top! 🚀 https://t.co/u1xroL42a4", "RT @AppleMusic: Keep listening to #MidnightSky from @MileyCyrus on #TodaysHits. 💋✨\nhttps://t.co/GbjeOeSlTq https://t.co/K9WmIehreV", "7 years of Wrecking Ball. My concept of time is completely askew. Feels like a lifetime ago... but somehow only yesterday. Thank you for all the support you gave me then and of course the love you’re continuing to show my art today. Forever grateful &amp; inspired. https://t.co/LKRubLOKdZ", "In honor of my Mammies funeral #Mammie4Evr limited tees are up on https://t.co/G9DhARaS7U.... portion of profits will be donated to @CISTennessee to support children staying in school! My grandma was a preschool teacher and graduated college at 70 years old! My hero! https://t.co/f1wGbT6NuZ", "https://t.co/Abb366uUm5", "https://t.co/1z8talIAKX", "I will keep your spirit here by continuing to do good for others and treating them the way we all desire to be treated. With an infinite amount  of the same gentle kindness you displayed daily.  We will ache everyday you are not with us....", "Everyday I wake and see that fiery ball in the sky I will see your face. Then say a prayer thanking heaven above for giving me the best grandmother a girl could ever be gifted. I will miss you for the rest of my life.... https://t.co/KDjL15xOcE", "Even though you are gone.... NOTHING has or ever will change. You will FOREVER be my inspiration and fashion icon. Even more than that the ultimate model of being a true LIGHT in a dark world. You are sunshine. https://t.co/FlJHC2N7va", "RT @MileyUpdates: This is so amazing! You need to check this out @MileyCyrus Midnight Sky / Edge Of Seventeen mashup wow https://t.co/Hz47J…", "RT @MFPLA: HUGE thanks to our champion @MileyCyrus and our friends at @Postmates for teaming up to support our youth! For every order on Po…", "live on https://t.co/Wlwm3XU3XO ! Badass fan merch &amp; happy birthday @seancellmore https://t.co/4tVdHhiHtZ", "💙 @Postmates https://t.co/48Uumyk4jA", "@abc123billys @Postmates 💙💙", "@thecaracavalli 👅💜", "Listen to my latest single on the #TodaysHits playlist on @applemusic, https://t.co/hA5B1KMb6D 💙👅 https://t.co/cUdyJe8vIY", "RT @MileyEdition: Get the midnight munchies with Miley exclusively on Postmates #MidnightSky https://t.co/3SNGQqvVKI", "RT @Panda92631294: @callherdaddy gang after watching the interview with @MileyCyrus and Alex I recommend the Midnight Sky playlist on Spoti…", "Tag their handle below 💙 @Postmates @yourMLKCH @FeedNurses @alfredcoffee https://t.co/grDKAGf8CY", "RT @BBCR1: 🎤 LIVE LOUNGE MONTH IS BACK! 🎤\n\nGet ready to hear brand new live performances this September from:\n\n⭐️ @AnneMarie\n⭐️ @ArloParks…", "Obsessed 💋🎤 https://t.co/SGlBPw0Bt6", "RT @MissPiggy: Moi is always in tune to the demands of modern fashion. As soon as I saw @MileyCyrus rocking this look, I thought, \"When did…", "RT @MileyUpdates: Watch Midnight Sky Official Lyric Video by @MileyCyrus: https://t.co/a3hZgQuiu6 ✨ https://t.co/4yIqZWT8Eq", "RT @zanelowe: Missed the show? Episode 1 of #Essentials Radio with @mileycyrus is now live on @applemusic: https://t.co/YwSZeW7hLn https://…", "RT @Shazam: Don't forget to Shazam #MidnightSky by @MileyCyrus: https://t.co/onJezrXFvc 🙌 https://t.co/EM3IZFK2fr", "episode is live now https://t.co/njiZQM4OGq 💋  @AppleMusic @zanelowe", "@meggrsx 👅", "RT @zanelowe: Miley's telling some stories about her songs that are def going to surprise you", "Joining @zanelowe in 30min for the first episode of #Essentials Radio! Listen only on @applemusic: https://t.co/njiZQM4OGq 🖤 https://t.co/niRyT53CDt", "Midnight Sky is #SOTD on @amazonmusic. Grab your echo &amp; #JustAsk, “Alexa, play Song of the Day” to listen!!! 🖤 https://t.co/4lxAH25m8M https://t.co/07SZ24Bzys", "RT @1061BLI: Part 1 of @SykeOnAir's interview with @MileyCyrus drops here tonight at 7:15P EDT! #MidnightSky https://t.co/SPYiwnxdgW", "RT @YoKidrauhll: #MidnightSky by @MileyCyrus is out NOW is available on all plataforms!\n\niTunes: https://t.co/dqbsQ8L94S…\n\nApple Music: htt…", "@Y100MIAMI @imarionair ❤️💋", "RT @CapitalOfficial: ⚡️ ℑ 𝔴𝔞𝔰 𝔟𝔬𝔯𝔫 𝔱𝔬 𝔯𝔲𝔫, ℑ 𝔡𝔬𝔫'𝔱 𝔟𝔢𝔩𝔬𝔫𝔤 𝔱𝔬 𝔞𝔫𝔶𝔬𝔫𝔢 ⚡️\n\n#MidnightSky by @MileyCyrus is now playing on Capital https://t.co/…", "RT @MCNewsSource: “Midnight Sky” has re-peaked at #3 on iTunes in the United States! Buy the song now! https://t.co/6XlQKjhdRI https://t.co…", "Just heard that Midnight Sky is having the biggest radio add week of my CAREER and it’s #1 most added at Pop and Hot AC .... Every radio programmer who added it is rad as fuck and everyone who didn’t well..... 👅👅👅 Big fuckin thanks to my team and bad ass label! https://t.co/82uKLVbpNs", "RT @thehonestvocal: Woahhhhh! It’s me x", "RT @KingDaffy1: @MileyCyrus Wassup y’all that’s me &amp; my brother  @trey_lollis first we wanna say thank you to @MileyCyrus for sharing our v…", "😻💋 https://t.co/Cajereybfv", "https://t.co/h8i4fKh2h3", "https://t.co/x3PwEnLOZm", "https://t.co/iC49xiC4NE", "RT @anthonyandpaul: telling strangers to download midnight sky on omegle @MileyCyrus https://t.co/XkYsKXCe5D", "RT @MileyCyrus: MIDNIGHT SKY. SONG + SELF DIRECTED MUSIC VIDEO OUT NOW.  \n\nhttps://t.co/yOJzDIctlF https://t.co/vXwXuFt2w6", "Welcome 👅 https://t.co/lTR4nEiexD", "@MileyUpdates @MileyNewsAccess Done !!!", "@MakeMeFweaky @mirrorsbalI @MileyOfficial Chances of getting us both in the same place at the same time is highly unlikely with our busy schedules these days ......... 💋", "@Fwaaky @mxrvelariley ❤️💋", "@mileysbiewty @Mifmix https://t.co/kGy73tZjQ3", "@peruvianmendes 💋❤️", "@gagasyuyi 🇧🇷", "@adoreycu @MileysCyrusNews Amazing", "@MileysCyrusNews https://t.co/YEegy7XhQy", "@mxrvelariley It’s hard not to notice Brazil 🇧🇷", "@justnlopez 😇😇😇", "We are not playing this era https://t.co/XtqSdaEpfW", "RT @fightingmiley: Did it work? @MileyCyrus #MidnightSky https://t.co/tQg4MHmvdU", "facts ! https://t.co/w218X3GW4r", "Sometimes you gotta go away to come back 💋 https://t.co/nJAhX7Z8Ay", "I do https://t.co/BNXv9tCJJM", "Streaming the wrong song https://t.co/exYFyMR6Ts", "Me @ the VMAs next weekend... (actually me at the VMAs 7 years ago but who’s countin) 🐻 https://t.co/4Yiwbv8iyI", "RT @spotifypodcasts: You won’t hear an interview like this on TV 🙃 @MileyCyrus tells #DaddyGang EVERYTHING on this episode of @callherdaddy…", "Should I put some fan art on some of my merch ? Badass @seancellmore https://t.co/MLCPvSArbl", "I’m back on Twitter because my mom just said “I use Twitter to find out the latest”..... you know I love tea! What’s good?!", "RT @MTV: The 𝑴𝑰𝑫𝑵𝑰𝑮𝑯𝑻 𝑺𝑲𝒀 is the road @MileyCyrus is taking straight to the #VMA stage! ✨🌙 \n\nDon't miss her first-ever performance of #Midn…", "I’m performing at the 2020 #VMAs! Tune in August 30 at 8p on @MTV! @vmas 😻💋 https://t.co/N7QbEk9TmJ", "RT @MileyEdition: #MidnightSky has a green update and is still holding its place at #3 on iTunes US! 🖤✨\nPurchase the song here: \nhttps://t.…", "RT @KissFMUK: ⚡️#KISSBreakfast BANGER Of The Week!⚡️ \n\nShe's BACKKK! 🙌\n\n♬ @MileyCyrus - #MidnightSky♬  \n\n🔊https://t.co/JTFXCs5beY https://t…", "RT @Deezer: .@MileyCyrus is the star of our #RadarWeekly playlist!\n\nWho else is loving her new era? Listen to #MidnightSky and this week’s…", "RT @hifmradio: The midnight sky is the road we're takin' as we have added @MileyCyrus' new track to our playlist. \n\nWhat else do you want t…", "@BBCR1 @iamcardib @theestallion @disclosure @FatouDiawara @idlesband @THEREALGHETTS @Jaykae10 @Moonsanelly @jcstewart @theweeknd 😻💫", "Fuck. Thank you for all the support. My heart is on fire right now. Gratitude up to 💯. If you haven’t already check the link in my bio to listen to my new single/watch my debut self directed video for Midnight Sky. https://t.co/KvjmqR3Nld", "RT @Smallzy: I just hit play on @MileyCyrus' new smash #MidnightSky 🙌🏼\n\nWhat a bop 👏🏼\n\nListen here: https://t.co/HLdlKs0oV2\n\n#SmallzysSurge…", "RT @emilythegem: K but have you heard the new @MileyCyrus or nah", "@kirbiejohnson 😻", "RT @bawbbyshere: i don’t think it’s a coincidence that Annabelle escaped the same day that @MileyCyrus released #MidnightSky https://t.co/K…", "Stream on today’s top hits 🖤 https://t.co/gU8FdOpjGP", "RT @MileyMedia: Stream @MileyCyrus’ brand new single #MidnightSky, OUT NOW!☁️🌌🤍\n\n• Spotify: https://t.co/LBLUyBIeUA\n• Apple Music: https://…", "RT @redcupscyrus: My friend Büşra’s drawning of Midnight Sky music video😍 \nHope you like it queen💫⭐️🌌  @MileyCyrus @MileyOfficial\n #Midnigh…", "RT @BigTop40: #MidnightSky has debuted in the UK's Top 10 after just two days 👏 @MileyCyrus \nhttps://t.co/5LNogkWV04", "💛💛💛 @Spotify https://t.co/KWEm7PJ1Fu", "@MileyNYCyrus @thehonestvocal 🖤💋", "“You should know right now that I never stay put in one place...” 🖤 https://t.co/kUbksKf7D9", "RT @MostRequestLive: FOR THE FIRST TIME EVER, the Most Requested Song of the Hour is that hot new @MileyCyrus \"Midnight Sky\" and it's #NowP…", "RT @WORLDMUSICAWARD: #MileyCyrus tops the Worldwide ITunes Song Chart with #MidnightSky and holds atop the global YouTube Counter for a 2nd…", "RT @buterabelxo: imagine me not being inspired by @MileyCyrus’s makeup in #MidnightSky https://t.co/bPobsKFKyK", "@RickyPDillon 💋🖤", "Head high up in the clouds because Midnight Sky is #1 on iTunes worldwide ☁️ 🌌 🤍 https://t.co/QGBxIiDYMS", "https://t.co/I1EmUJLByy 👅🖤 @callherdaddy @minniemouse https://t.co/wWZVI2Fvtf", "Midnight Sky hit 11 million views in 24hrs &amp; it’s all because of you 🖤🖤🖤 THANK YOU for supporting my art! https://t.co/W1CJPihKMK", "RT @MCNewsSource: Let’s get #MidnightSky to 9 million views before midnight! Watch here: https://t.co/YXTiLDt4wO https://t.co/e3P8L6vVjK", "https://t.co/U0jz0h6Vlu", "https://t.co/40EJObduSd", "https://t.co/7bkjL7utFj", "Midnight Sky - Single by Miley Cyrus https://t.co/qqCKbgwbwh https://t.co/5J92pvl2Bm", "@zanelowe @Beats1 @AppleMusic 🖤🖤🖤", "RT @pandoramusic: .@MileyCyrus' brand-new single is about \"taking back control of our own narrative, speaking for ourselves, and having a h…", "RT @MCNewsSource: “Midnight Sky” is VERY close to reaching #2 on iTunes in the United States! Buy the song now here: https://t.co/6XlQKjhdR…", "RT @AppleMusic: Needed new @MileyCyrus. 🖤\nListen to #MidnightSky on #AListPop: https://t.co/mQW68x3loo https://t.co/oYNvaQ2s1m", "❤️💋 https://t.co/DpbINCH55A", "RT @SIRIUSXM: There's deep meaning behind the lyrics of @MileyCyrus' latest single, \"Midnight Sky.\" Hear her full interview on @SiriusXMHit…", "In other news.... #NOFAKENEWS #FACTS https://t.co/kn53jzwWpI", "RT @TwitterMoments: 🌌 The midnight sky is the road I'm takin' ... ✨\nNew @MileyCyrus is here. https://t.co/psDEZpELYc", "RT @VogueRunway: With her new song and self-directed music video for “Midnight Sky,” @MileyCyrus is ushering in a new era—one that harks ba…", "RT @TheOdyssey: 10 Relationship Tips @MileyCyrus Dropped On @callherdaddy That We Can't Stop Thinking About\n\nhttps://t.co/ay9p8ROOI5", "RT @MarkRonson: This single is wonderful. And can't wait for you to hear what's karming @MileyCyrus https://t.co/H1Hf81oivo", "RT @thecaracavalli: #MIDNIGHTSKY https://t.co/VNSHIRFHlT", "My boobies &amp; new song Midnight Sky out now 💜 https://t.co/g1npOVKBb5", "RT @MCNewsSource: New interviews ✨\n\nZach Sang: https://t.co/kTcihU187T\nElvis Duran: https://t.co/wkBtkMVA0B\nSiriusXM: https://t.co/IePKSvJG…", "RT @AppleMusic: “I felt like my story and my narrative had kind of been told for me over the past year.”\n\n@MileyCyrus is talking #MidnightS…", "RT @zanelowe: Miley’s back and as honest as ever with the beautiful new moment #MidnightSky. One of her best. And she’s one of my favorite…", "RT @Shazam: .@MileyCyrus is back with #MidnightSky. Stream our Song of the Day on @AppleMusic: https://t.co/onJezrXFvc 🌗 https://t.co/m5SfJ…", "RT @RollingStone: Miley Cyrus' new single \"Midnight Sky\" is Stevie Nicks' \"Stand Back\" 2.0. Here's why it's a Song You Need to Know https:/…", "Done sweet talkin’... I am speaking my truth.", "Midnight Sky out now 🖤 https://t.co/pxSq9kMgYo", "RT @mileyshipsta: miley cyrus did what she had to do https://t.co/EByg7b2RtA", "#WAP Wings And Pizza. Everybody gets one bite https://t.co/CqE0oW1ovo", "RT @RollingStone: Watch Miley Cyrus’ sassy self-directed video for new song \"Midnight Sky\" https://t.co/1EMggAigax https://t.co/QEIqoLYCjq", "RT @PopCrave: .@MileyCyrus’ new single #MidnightSky samples @StevieNicks’ 1981 single “Edge of Seventeen.” https://t.co/vCz7v4L0EU", "RT @iHeartRadio: It's officially here! Listen to the World Premiere of @MileyCyrus' new song #MidnightSky on iHeartRadio! \n\n🌑: https://t.co…", "RT @ElvisDuranShow: TOMORROW ⏰ @MileyCyrus will be on-air with @elvisduran at 8:45am ET! \n\n👂 at https://t.co/SPlz2AF1sH \n\n#MileyOnElvis in…", "RT @MorningMashUp: Our friend @MileyCyrus is taking over the show right now to celebrate her new single #MidnightSky!\n\nCome join the fun: h…", "RT @1035KTU: Missed @MileyCyrus' interview with @TheRealCarolina?! \n\nWatch the full thing here: https://t.co/ZMNlJBcgl1 ❤️\n\n#MidnightSky ht…", "RT @Z100NewYork: How many times should we play @MileyCyrus' #MidnightSky today?! 🎵 https://t.co/QJ0nzJcDfB", "RT @milesholy: 2010: asking for freedom\n\n2020: having her freedom\n\n#MidnightSky https://t.co/sscK1uMhDh", "RT @AppleMusic: She is back. 🖤💋✨\nListen to #MidnightSky from @MileyCyrus now.\nhttps://t.co/AnDMOlcclm https://t.co/sVdqAHXiI8", "RT @Spotify: .@mileycyrus just took us to cloud 9 with her new single #MidnightSky. Step into the new era now https://t.co/1q9ksKgw9x https…", "RT @amazonmusic: .@MileyCyrus nods to the legendary @StevieNicks on new track #MidnightSky ✨ \n\nListen now 🎧: https://t.co/xOMW7hzACK https:…", "I want to hop into some zooms and celebrate #MidnightSky ! send me links", "MIDNIGHT SKY. SONG + SELF DIRECTED MUSIC VIDEO OUT NOW.  \n\nhttps://t.co/yOJzDIctlF https://t.co/vXwXuFt2w6", "10 mins https://t.co/DpbINCH55A #midnightsky", "!!!!!!", "45!!!! https://t.co/DpbINCH55A #MidnightSky", "tea with MC on my IG live ☕️", "RT @MileyOfficial: Can we get #MidnightSky trending before the release?!", "RT @godneysjs: Justin supporting Miley is so cute https://t.co/YRyHsKZTnk", "#MidnightSky https://t.co/PrXjQ21dyW", "did it work? #MidnightSky https://t.co/n7p2hnPz1m", "RT @MTV: 💜✨ IT'S REALLY HAPPENING ✨💜 \n\nDon't miss the premiere of @MileyCyrus' video for #MidnightSky at midnight on MTV, MTVU, and MTV Liv…", "countdown begins NOW......\n\n#MidnightSky song + self directed video MIDNIGHT EST. https://t.co/co0qYgtFBX", "TONIGHT!!!! @callherdaddy ❤️💋 ☎️ #MidnightSky https://t.co/6xdMSAZ2iT", "#MidnightSky", "RT @alexandracooper: CALL HER FUCKING DADDY #MIDNIGHT  @MileyCyrus https://t.co/IU1u0xSAuR", "WAP https://t.co/5gionEEJTn", "My self directed video for Midnight Sky is dropping Aug 14! 💕 https://t.co/PicwP8jJUr", "#MidnightSkyIn2Days https://t.co/DOu4O3zbvD https://t.co/In8Qsb6SGe", "#MidnightSkyIn2Days https://t.co/DOu4O3zbvD https://t.co/UfQQP8DL6R", "RT @ElvisDuranShow: And they'll be talkin on our show this Friday 😉 Can't wait to catch up with you @MileyCyrus!!! #MidnightSky", "RT @MileyNation13: SMILERS we are already TT in Brazil &amp; Spain... keep tweeting!! ✨  #MidnightSkyIn2Days https://t.co/JHGGjtHgUh", "RT @unholyswiftie: Can’t believe @MileyCyrus is finally coming...and in just 2 days 😭y’all better stream and buy\n\n#MidnightSkyIn2Days #Midn…", "@XHSMGX @MileyCyrusBz 😍", "RT @billyraycyrus: Can't wait for #MidnightSky out this Friday! So proud of you @MileyCyrus! https://t.co/v1MqyuZTDT", "RT @SheIsCumming: @MileyOfficial @MileyCyrus I preordered last night! #MidnightSkyIn3Days 💖 https://t.co/VGFhtVzD4w", "RT @andreagiannett2: @MileyOfficial Already pre-ordered! 🔥 #MidnightSky #MidnightSkyin3Days https://t.co/sIHPo1yGem", "RT @MileyCyrusBz: #MidnightSkyIn3Days \n\nHave you pre-ordered? ✨ https://t.co/m0xp8HDOzp", "RT @callherdaddy: SHE IS COMING #CALLHERDADDY 8/14 https://t.co/fsXvdAikYx", "See my lips on her mouth everybody’s talkin now..... 💋 https://t.co/DOu4O3zbvD https://t.co/P8Tq32hpHs", "RT @MileyCyrus: I know it feels like you’ve been waiting forever and ever .... but no more..... She is finally here. \n\nMy new single MIDNIG…", "https://t.co/eGpSsFPGGc", "Forever and ever no more. 🖤  The #MidnightSky is the road I’m taking.... head high up in the clouds. https://t.co/grk9Sk9oWJ", "RT @elliegmichael: @MileyCyrus literally so embarrassed i cannot https://t.co/A3imiGo6N2", "I was born to run. I don’t belong to anyone. (And yes I can run in these fucking heels cause I’m a BOSS)", "https://t.co/DOu4O3zbvD https://t.co/fGpiJUBrMx", "Happy b-day @Vijatm ❗️📸🎈❤️🎤🎸🌑💥🕷🌹🎱🍷 (shot on set of Midnight Sky) https://t.co/nlzM12hpwo", "RT @forreal_isaiah: @PopCrave @MileyCyrus LMFAOOO THAT WAS HER https://t.co/hU2cHxTHZZ", "RT @PopCrave: .@MileyCyrus pranked fans with cryptic text messages ahead of her new single release #MidnightSky. https://t.co/cjZBp7PLhI", "RT @jsgirardin: @MileyCyrus No one at work believed it was you, even though I called four times 🥴😂 https://t.co/YPe7SmS8Kp", "RT @whatevermagz: @MileyCyrus YO I WAS JUST AS LOST; I was getting coffee with a friend and we spent like an hour deciding if I should call…", "what’s your Venmo ? https://t.co/xyaw1lJdMA", "1-833-SHEIS-MC", "https://t.co/PEBuLTeVS6", "Me sending those cryptic ass messages to fans . https://t.co/ajGAjuq8cv", "RT @Elle_Pletnick: Lmao got this text earlier and got concerned and I mispelld my response ( i was working ) ;' so then I spent time googli…", "RT @fweakymc: NOT MILEY CYRUS ENDING RELATIONSHIPS 💀 @MileyCyrus https://t.co/9cdQQ4ca8E", "I know it feels like you’ve been waiting forever and ever .... but no more..... She is finally here. \n\nMy new single MIDNIGHT SKY. AUGUST 14th. PRE SAVE NOW.\n\nhttps://t.co/DOu4O3zbvD https://t.co/o4CR1yZtHn", "RT @alexIovesariana: @gimmethecloot @MileyCyrus it happened to me 😂😂 https://t.co/dDPlOrXPyD", "RT @Narcissusxchai1: @gimmethecloot Shit just happened to me lol I do t even know wtf? Last time I let my friend use my phone lol https://t…", "RT @KarlaPaulina_: I got nervous af when some random number text me to call them this morning. I asked my sisters if they recognized the #…", "RT @kindabritt: I forgot I subscribed to texts from Miley Cyrus’s hotline for new music and I was so confused and scared at work https://t.…", "RT @DUALIPA: bromance https://t.co/fJasjQD0Si", "Dua has heard what you haven’t.... 🌑 https://t.co/YCJKV6WoEH", "MIDNIGHT SKY https://t.co/N9RrO6o5kO", "TEASE. https://t.co/TsFGvsGB4T", "Meet Miley Cyrus..... again. #SheIsComing #ButForRealThisTime 🎸🖤🎤 https://t.co/3Cc3UL1m8O", "@NachDiller ❤️", "That shady side eye to y’all who ain’t wearing your recommended, in many places MANDATORY masks. Psh. 😷 https://t.co/9QOzILDrjE", "RT @Z100NewYork: JUST ANNOUNCED Our iHeartRadio Music Festival is BACK for its 10th year on Sept. 18 + 19! ❤️\n\n@bts_bighit, @MileyCyrus, @k…", "RT @iHeartRadio: 🌟🖤 @MileyCyrus 🖤🌟\n\n#iHeartFestival https://t.co/znCmbBlCvn https://t.co/6HAUsBhvPu", "This was in 2017. Feels EVEN MORE relevant right NOW. It ain’t a Party In The USA until we see #LibertyandJusticeFORALL you heard me, FOR ALL! #fuckthefourthuntilthereisfreedom https://t.co/QNRrIknL0R", "RT @bbcglasto: 🚨 SPECIAL GUEST ANNOUNCEMENT 🚨 \n\nToday's addition to our Glastonbury Experience Channel is one of last years stand out Pyram…", "I look forward to working w you and @GlblCtzn in the future! This is not the end by any means, it is only the beginning. https://t.co/OShvpQm84k", "Truly honored to be a part of making sure everyone has equal access to testing, treatments and vaccines. We will keep working together to help fight COVID-19 #globalgoalunite ❤️ https://t.co/3YIZK6ybCa", "I dedicated this performance to everyone who is working tirelessly for testing, treatments and vaccines so all of us can come together in places like this empty stadium.... I can’t wait to be together again 💛 https://t.co/05zMGnZazZ #GlobalGoalUnite", "During this time of COVID-19, we are coming together in a different way...we are uniting with the goal of ensuring EVERYONE has access to the solutions to end this pandemic.", "For me, the magic of performing is sharing and celebrating music together...being surrounded by people and feeling their energy!", "Honored to join PM Solberg @erna_solberg and @GlblCtzn to talk about the disproportionate impact of covid-19 on marginalized communities and how our generation is speaking up to demand action and change! #GlobalGoalUnite https://t.co/OBSuw4sOGX", "RT @GlblCtznUK: 𝗪𝗘 𝗔𝗥𝗘 𝗟𝗜𝗩𝗘! Watch the #GlobalGoalUnite concert right here 👇\n\nWe've already mobilised $6.9 billion to get COVID-19 tests, t…", "❤️👏 https://t.co/ntxY1qTODV", "Starting soon! #GlobalGoalUnite https://t.co/zcnOxpXbBC", "RT @GlblCtzn: We’re LIVE for the #GlobalGoalUnite Summit, hosted by @katiecouric! Tune in as world leaders and philanthropists come togethe…", "RT @GlblCtznUK: T O D A Y ! 🥳 #GlobalGoalUnite @MileyCyrus \n\nWhen? Summit: 2pm BST // Concert: 7pm BST.\n\nWhere? All info: https://t.co/cYJJ…", "I’m joining @glblctzn &amp; @EU_Commission for the #GlobalGoalUnite Concert to fight for equal access to COVID-19 healthcare for everyone, everywhere. Join us tomorrow: https://t.co/9TZVUifjhs https://t.co/L01j5gxcpv", "RT @GlblCtzn: We can’t stop, and we won’t stop fighting for equal access to COVID-19 tests, treatments, and vaccines, and neither will @Mil…", "RT @marcmalkin: I've talked to @mileycyrus a lot over the years. But this is probably my favorite interview because we spent some real (Zoo…", "RT @GlblCtznCAN: .@shakira, @Usher, @MileyCyrus, and more are all on deck to perform at #GlobalGoalUnite For Our Future. See who else will…", "At a time when we have seen the injustices in our societies increase even more, we now have the opportunity to unite and take a stand for equality and health for all!! Join me on June 27 for a performance that I’m really excited about. https://t.co/9TZVUifjhs", "Honored to be a part of #GlobalGoalUnite for Our Future hosted by @GlblCtzn to make sure that EVERYONE, EVERYWHERE has access to the solutions that will help end the COVID-19 pandemic — testing, treatments, and vaccines. https://t.co/J6YHRJ5I8b", "@MCistheQUEEN @MileyCyrusBz ...I couldn’t stay Hannah Montana forever and they knew that, but they also didn’t want me to make a mistake that couldn’t be undone. Been so fortunate to have loyal fans (like you) who have always allowed me to experiment and evolve.", "@MCistheQUEEN @MileyCyrusBz First G.A.Y london performance! I wore a dress I knew would piss everybody off and that was around the time I really began to “spread my wings” &amp; felt free. But....also it took a lot of guts because people around me were saying I would lose all my fans and my career would be over", "@mileyshippie @MileyCyrusBz Heart beats for love feels even more relevant now. Celebrating pride month while being an out &amp; proud member of the LGBTQ+ community is such an honor and I am so lucky for those who paved the way for me to live a life full of freedom and love! #PrideWasAProtest", "@downfourit @MileyCyrusBz Now listening to Robot all I can think about is “Ashley Too” .... during those days I did feel a lot of pressure to “conform”  I was lucky I had no “ aunt Catherine” though. My parents have alway encouraged me to be experimental.", "@rootingforlove @MileyCyrusBz I grew up on rock n roll.  Nirvana, Joan Jett, Blondie..... so I was just super inspired and influenced by the artists my dad rotated on our juke box.", "@GlblCtzn https://t.co/mntvLIkDmC", "Hi @JustinTrudeau...there are WAY too many beliebers in Canada to ignore @JustinBieber’s call for support! Please join us and support funding for testing, treatments and vaccines for everyone, everywhere. #globalgoalunite. https://t.co/RqfTRiUM5D", "Grazie mille ! Looking forward to new funding commitments on June 27 needed to provide access to treatments &amp; a vaccine for everyone, everywhere. #GlobalGoalUnite https://t.co/aLjii17ymo", "Thank you! Will you join us on June 27 for #GlobalGoalUnite to help close the funding gap for the most vulnerable? Testing, treatments, and vaccines for everyone everywhere ... We need your leadership! https://t.co/c86AeO4DFz", "🇳🇱 https://t.co/Lf7sWglZVM", "🇮🇪 https://t.co/Lf7sWglZVM", "🇪🇸 https://t.co/Lf7sWglZVM", "🇮🇹 https://t.co/Lf7sWglZVM", "@MinPres", "All across Ireland 🇮🇪 citizens joined in solidarity with Black Lives Matter in the US. We must stay united with the world to tackle #COVID19 and the racial injustice of health inequalities. Please join us, PM @LeoVaradkar? #GlobalGoalUnite⭕", "Across the Netherlands🇳🇱 you united in solidarity with Black Lives Matter in the US. We must keep standing together to tackle #COVID19 and the racial injustice of health inequalities. Please join us, PM @MarkRutte? #GlobalGoalUnite⭕️", "Spain, you united in solidarity with Black Lives Matter in the US. We must keep standing together to tackle #COVID19 and its disproportionate impact on marginalized communities, especially communities of color. Please join us, PM @sanchezcastejon? #GlobalGoalUnite⭕️", "Italy🇮🇹 and the world united in solidarity with Black Lives Matter in the US. We must stay united to tackle #COVID19 and its disproportionate impact on marginalized communities, especially communities of color. Please join us, PM @GiuseppeConteIT? #GlobalGoalUnite⭕️", "BlackLivesMatter https://t.co/QN73WYcePA", "https://t.co/Htmw0rmpot", "A day to listen &amp; learn.... @happyhippiefdn and I will continue posting information and resources to amplify black voices and community organizations. Please do not forget that today is PRIMARY ELECTION DAY in several states! For more info visit https://t.co/9SovQwVBrm", "RT @BLMLA: We need everyone to show up...virtually...to tell LAPD that it's about more than #GeorgeFloyd...It's about the 601 of our people…", "RT @ACLU: In Minneapolis, Black people are 13 times more likely to be killed by cops than white people.\n\nOfficer Chauvin had 17 previous co…", "RT @AyannaPressley: Congress must ACT.\n\n@IlhanMN &amp; I just introduced A Resolution Condemning Police Brutality with @BLeeForCongress @KarenB…", "RT @ACLU: Derek Chauvin, the police officer who murdered George Floyd, was arrested.\n\nThis is not enough. We have much further to go — incl…", "@r6nchsauc9 Sample scripts in here! https://t.co/CXpPrCcRMW", "RT @ACLU: Join us in calling for justice for George Floyd. Take action now.", "Please call the Minnesota Governor at 651-201-3400 and Attorney General to demand #justiceforGeorgeFloyd. They need to be held accountable. We can’t stand by, we need to each do our part to make justice for everyone a reality. https://t.co/CXpPrCcRMW", "Like so many of you, I am angry, outraged and heartbroken about the injustice in our country that has been going on for way too long- centuries &amp; generations. To my fans, each one of us has a voice—I’m asking you to please use it right now. https://t.co/2Vfi2LvB1v", "RT @EU_Commission: We kick-off a campaign with @GLBLCTZN to step up the mobilisation of funding and overcome this pandemic\n\nIt will culmina…", "RT @GlblCtzn: An urgent message from @MileyCyrus: We need to come together as a global community to beat the COVID-19 pandemic. Join Global…", "The mullet is officially back when ‘08 Miley says so..... perioTTTTT https://t.co/D8FaEK2KWB", "RT @voguemagazine: .@CodySimpson's new music video is styled and directed by girlfriend @MileyCyrus. Watch it here: https://t.co/acTOfAfD5A", "Thank you @ddlovato ! ❤️ Thank you @thewebbyawards ! Thank you to everyone who made bright minded so magic! #StayLitInDarkTimes https://t.co/tYB67rijOC", "RT @TheWebbyAwards: For her Instagram Live show, Bright Minded, we're excited to present @MileyCyrus with a 2020 Webby Special Achievement…", "fresh perspective, innovation, and ACTION! The future is yours! I’m on your team! #Graduation2020", "Congrats to all of the high school and college graduates of 2020! It was my honor to celebrate all you’ve accomplished! This isn’t the end but just the beginning! I look forward to seeing how you all use the tools and skills you’ve been given to create a world fueled by - https://t.co/YP9wXsMRxP", "#Graduation2020 https://t.co/PLH6B3nwT2", "It is the 5 year anniversary of @happyhippiefdn and cover of Don’t Dream It’s Over with ⁦@ArianaGrande⁩ 💛 https://t.co/13kqCBrySa", "RT @MileyOfficial: Tune in today! @MileyCyrus will be part of #Graduation2020 on FB @ 11a PT/2p ET at https://t.co/NJN2qovyI3 https://t.co/…", "3 YEAR ANNIVERSARY OF MALIBU 🎈❤️🎈❤️🎈❤️🎈❤️🎈❤️🎈 https://t.co/QZjkzohtlA", "Mothers Daughter for life! @tishcyrus Most supportive mommy ever ! You always told me I would make it , so I did it! So thankful for you always! Love you! https://t.co/2eUxct2sjj", "Category is : Wear a mask for the safety of yourself and others .... but make it fashion! 👅 https://t.co/prpCQsknYL", "Bean is queen! 💚 https://t.co/wWAgl2jdPs", "https://t.co/wznvxDOX6o https://t.co/jXiSzb3GJY", "RT @AMarch4OurLives: Ahmaud Arbery should be alive with us today. He deserved for his life to be valued, and for justice to be served when…", "💛💙💚💜 https://t.co/wznvxDOX6o https://t.co/oruhcSiSPV", "Wash. Your. Hands ❤️❤️❤️ https://t.co/KbCjuxTqdS", "💜💚 @WSJMag https://t.co/wznvxDOX6o https://t.co/86CArlm6Qe", "RT @WSJMag: “Miley has never been afraid to take risks or put herself out there. This new role really seems to suit her, and you can tell s…", "RT @WSJMag: “I am protective of all my guests, no matter how famous or how not. I want people to shine,” says @MileyCyrus. We talked to the…", "Bringing the BRIGHTNESS to  @WSJMag 💚💜💚💜💚💜💚💜💚💜💚💜💚 #wsjmagazine\n\nhttps://t.co/wznvxDOX6o https://t.co/58iLOzjSvH", "RT @jessetyler: It’s Saturday Night! Let’s get turnt up! (Text &amp; music by @MileyCyrus. Piano by @ourladyj). https://t.co/5GyoQOU1js", "https://t.co/jS68rH2fWL https://t.co/W4Owohn5bR", "💔 #LoveLockdown with @MarkRonson in 30 mins ! Tune in https://t.co/Z6E2Xyuuue https://t.co/wS8oewYZgp", "RT @RockNRollPics: Paul McCartney, Joan Jett &amp; Miley Cyrus attend the 30th Annual Rock And Roll Hall Of Fame Induction Ceremony at Public H…", "RT @MileyOfficial: Miley Cyrus - Wish You Were Here (At Home) on ⁦@nbcsnl⁩ #SNLAtHome  https://t.co/KYzm5XDsC1", "@StevieAiello @nbcsnl 🖤🖤🖤", "WYWH SNL #SNLAtHome https://t.co/nHkM5NNJ7u", "#SNLAtHome .... performing “wish you were here” ❤️ @nbcsnl https://t.co/9zKK4VLCTt", "RT @nbcsnl: 🔥🔥 @MileyCyrus 🔥🔥\n#SNLAtHome https://t.co/fK3eXVk3gI", "RT @nbcsnl: Who's ready ⁉️\n#SNLAtHome https://t.co/iHax0BIXTf", "this is amazing ! #mileyvirtualconcert https://t.co/MqfaKIqmU2", "2015 version..... WAKE UP WORLD! #EarthDay 💚 https://t.co/5T5WjjjhK4", "RT @joanjett: .@MileyCyrus inducts Joan Jett into the Rock and Roll Hall of Fame-- Five years ago this week 🖤 https://t.co/OGJZCu15aL", "reflecting on earth day and thought back to this song I wrote &amp; released in 08 &amp; feel like these words are truer than ever! Especially after my conversations w/ climate change activists last week, I know that if we come together NOW we will create change &amp; action! Happy earth day https://t.co/IIHZByvam5", "I won’t be smokin’ but the rest of my fam sure will be tokin’ 💚Happy 4/20 y’all! 💨 https://t.co/307pdyYE6l", "Here's a playlist of all the #BrightMinded episodes on @youtube ! #StayHome https://t.co/rX0Saozq9M", "Bright Minded #HightlightingHeroes with Senator @ewarren on @youtube now! #stayhome https://t.co/ZvCqgPouM2", "Today on #BrightMinded #HighlightingHeroes @goodgoodgood @xiuhtezcatl https://t.co/SbtFG68ha3", "RT @ewarren: Nobody should have to choose between protecting their health and exercising their right to vote—and all of us should get invol…", "RT @ewarren: I’ll be live with @MileyCyrus’s #BrightMinded show on Instagram at 2:30pm ET. Hope you’ll tune in!", "Today on Bright Minded: #HighlightingHeroes Senator @ewarren https://t.co/IjmPYaU5yN", "Bright Minded #HighlightingHeroes! @7GenFund, @beauty2streetz, @MFPLA Ep 18 https://t.co/VNPZxGTIjZ #StayHome", "Today on #BrightMinded #HighlightingHeroes @MFPLA @beauty2streetz @7GenFund https://t.co/YWTrvTuhj2", "#HighlightingHeroes: \n@chefjoseandres, @2harvestMidTN -  Ep 17 now on \n@Youtube! https://t.co/22WpvAfZPC #StayHome", "Today on #BrightMinded #HighlightingHeroes: @chefjoseandres @2HarvestMidTN https://t.co/2foBrDtDLm", "#HighlightingHeroes Dr. Oscar L Maitas, Dr. Syra Madad -  Ep 16! https://t.co/T8Xh1UXBRj #StayHome", "Let’s highlight heroes who are making a difference in our communities during this time - use #HighlightingHeroes on IG and Twitter to submit so I can highlight on Bright Minded this week! https://t.co/DackSiUqJT", "Today on #brightminded! #HighlightingHeroes https://t.co/WslLuUMDo6", "Hoppy Easter 🐰 https://t.co/YccamTEHBp", "1 week special starting Monday! #BrightMinded #HighlightingHeroes https://t.co/Lw1Ys7FBEB", "RT @SSChospices: On #WorldHealthDay our amazing hospice nurses and carers have taken some inspiration from @MileyCyrus and put together thi…", "RT @MACcosmetics: Now’s your opportunity to help make a difference right from home. Get the Lipstick that gives back to those impacted by C…", "Episode 15 with @eltonofficial, @kerrywashington, @selenagomez, @jimmyfallon up now! https://t.co/9Vfy9MVQCn #stayhome", "RT @kerrywashington: Thank you for having me @MileyCyrus! &amp; for helping me uplift the work that @medshare’s doing to provide medical suppli…", "RT @FallonTonight: .@MileyCyrus reveals the truth behind the lyrics in her song “Malibu” https://t.co/ecc28kZKhx #FallonAtHome https://t.co…", "RT @FallonTonight: .@MileyCyrus shares how one of her favorite throwback songs “Can’t Be Tamed” foreshadowed her current career https://t.c…", "RT @FallonTonight: Jimmy talks with @MileyCyrus tonight on #FallonAtHome! https://t.co/4SOJGlJn6P", "RT @eltonofficial: Elton joins @MileyCyrus today for #BrightMinded: Live with Miley, her live @instagram show about \"staying lit with love\"…", "Tomorrow! Finale Friday! #BrightMinded @kerrywashington @eltonofficial @selenagomez @jimmyfallon https://t.co/7Q9fAPdP2X", "RT @FallonTonight: .@MileyCyrus is on the show Friday!\n\nIf you’re a fan and you’re currently volunteering or working on the frontlines, we…", "Tomorrows ep of # BrightMinded is all about Zero Waste &amp; Poetry! 💚 https://t.co/ENbsuQu3Sg", "Today on #BrightMinded! @Anitta @ZoeKravitz @diplo #ashleylongshore https://t.co/URD4FNOnh7", "Tomorrow! April Fools episode with Ashley Longshore @ZoeKravitz @diplo @anitta https://t.co/BehbbrXMGF", "RT @ashleygraham: Alsoooo super excited to be on Bright Minded with @MileyCyrus on her IG live today at 3:20pm 💕 ✨ 🌈", "Self care episode today on #BrightMinded! https://t.co/yA8xOQFajb", "episode 11 with Zion Clark, @aliciakeys, @SelmaBlair, @Milliestopshate up now on @Youtube! #StayHome \n\nhttps://t.co/5YpwQB5rx9", "🌈❤️ https://t.co/7DCga8LiQH", "Self care episode tomorrow! https://t.co/JJXi9vIixY", "Waaaayy tooooo late https://t.co/A0ttODNGEh", "Wayyyy to real. https://t.co/CdQIgBWRj2", "Today! https://t.co/c9Jz9SNggq", "Motivational Monday! Tune in tomorrow! @aliciakeys @SelmaBlair @Milliestopshate #ZionClark https://t.co/N10gyReknt", "Episode 10 up now on @Youtube! @nicolerichie @ParisHilton @Vijatm @michellevisage #lgbthistory\n\n#StayHome \n\nhttps://t.co/kH3dAacrdr", "Send in your questions for Paris on Bright Minded ! I’ll shout you out and get your 🔥 questions answered! https://t.co/1LLGYNvO6r", "#BrightMinded episode 9 with \n@antoni @MarkRonson @RyanTedder @ilsey UP NOW! \n\nhttps://t.co/Fspq3b7YQt", "RT @NikaraJohns: It’s 2020 and Miley Cyrus has the best guests on her MAKESHIFT INSTAGRAM TALK SHOW. Networks are shaking.", "Tomorrow! @nicolerichie @ParisHilton @Vijatm @michellevisage On bright minded! With 5  LGBTQ facts in 5 minutes by lgbt history ! Tune in! 11:30 AM PT https://t.co/FI2ArF1Uip", "RT @instagram: Mindfulness ✨ + music 🎶 + puppies 🐶= pure joy 🌈\n\n#TakeABreak with singer @MileyCyrus, right now on our IGTV. https://t.co/u9…", "#BrightMinded episode 8 with @ReeseW @HilaryDuff @BebeRexha @DUALIPA is up on YT now ! 🌈\nhttps://t.co/1WpAccDhvO", "Tomorrow! To start the show, Cooking lessons with @antoni on ways to keep food fun in times of limited options and responsible rationing! Then SONGWRITING camp with some of the best in the world! @MarkRonson @RyanTedder @ilsey #BrightMinded https://t.co/p98bx3Q1lV", "RT @BebeRexha: 💞 @MileyCyrus https://t.co/KBMycsEHSY", "🌈🎉❤️ https://t.co/QkoIZSxBWn", "RT @MileyOfficial: Miley will be joining @zanelowe at 9:30 AM PT. Listen live here: https://t.co/dw9Em883By", "It’s Women’s Wednesday! With 4 special guests! @ReeseW @hilaryduff @beberexha @dualipa #BrightMinded 11:30 AM PT https://t.co/Zgby4QEHYy", "RT @UKMileySupport: RT this tweet if you want @MileyCyrus to discuss heartbreak/break ups/love and what advice she would give to anyone str…", "#BrightMinded episode 7 with @tishcyrus @billyraycyrus @noahcyrus &amp; @stassi up now! 🌈\n\nhttps://t.co/ecaJ1p64H7", "RT @Z100NewYork: THANK YOU @MileyCyrus for your show #BrightMinded. You're creating a sense of community, positivity and support that is tr…", "@EmilyOsment @Claire_ifying Ready when you are! #MileyandEmilyForTeenVogue", "Tomorrow on #BrightMinded #LiveWithMiley #WomensWednesday 🌈 @ReeseW @HilaryDuff @beberexha @dualipa https://t.co/kCJlbL0yqO", "Ketchup may be a great hand moisturizer BUT NOT sanitizer! Happy Hannah-Versary! #14YearsOfHannahMontana ❤️ https://t.co/4Snz1hD86A", "My #BrightMinded official theme song is now up on YouTube ! Check it out ! Make your own #FanArt intro and I’ll post and tag ! Thanks for watching and I’ll see you tomorrow live on my Instagram!  https://t.co/X3vMW5kE6H", "my official intro for bright minded is up on youtube now ! Check it https://t.co/XcJIefh2Oe https://t.co/d6uq3lOrmv", "https://t.co/hd0CrItYDZ", "Tomorrow on #BrightMinded #LiveWithMiley 🌈💖🌈💖 https://t.co/LM7u5fQTuI", "#NewProfilePic https://t.co/SQepoSJrRo", "I am #FanFocused but really Hope everyone else out there is enjoying it too! I ❤️ you!", "Wow! What a first week of #BrightMinded  #🌈💖🌈💖@Kaqui_ slayed this recap!  My whole career , a lot of my life , all my accomplishments , so much of my joy has been created by my fans ! It’s only right that Bright Minded is #FanMade! https://t.co/GHm1Y6lIox", "RT @MTV: I've been working from home, which means I don't need to change out of my sweatpants because @MileyCyrus said so!!! #AloneTogether…", "RT @MTV: Pls enjoy these words of wisdom from Social Distancing Guru, @MileyCyrus! Being #AloneTogether just got a lot easier! 👏 https://t.…", "Watch #BrightMinded #LiveWithMiley Mon-Fri 11:30AM- 12:30PM PT !!!!! @billyraycyrus (aka Dad ) for Devotionals With Dad! 💕 Tune https://t.co/a0DBmlfyJC", "Tomorrow!! #BrightMinded https://t.co/5iSFYo8Q3L", "Keep checking in Mon-Fri 11:30am - 12:30pm PT for more ways to get involved and join the fight against Covid-19! Stay LIT! 💡", "So many of us are feeling helpless and hopeless! Let’s channel that energy into action! If possible, please join me in supporting @FeedingAmerica @2HarvestMidTN @oasisnashville \n@calfund 🌈 https://t.co/1mM2wGmx6P", "🌈❤️🌈 https://t.co/xsTlbQvy9w", "Tomorrow on #BrightMinded #LiveWithMiley 11:30am - 12:30 pm Special Guest @ITSJEREMYSCOTT https://t.co/SGGZbHVX1y", "RT @VogueRunway: “This may not be how Ellen does it, but it’s how I do it,” @MileyCyrus has a new IGTV program, Bright Minded: Live with Mi…", "@RitaOra all the way from the Uk on Bright Minded tomorrow! It will be so interesting to hear a perspective from somewhere so far from where I am located, the differences and similarities of the Covid-19 experience.... love you Rita thank u https://t.co/kl6GAS2xm5", "#BrightMinded #LiveWithMiley gets a little more official each day! What’s a talk show without a custom mug thooooooo?!?!?! Working on creating some for purchase and the profit will go towards supporting the foundations discussed on today’s episode! Stay tuned! https://t.co/MvY2qprfkt", "RT @StylishCyrus: Who else wants Bright Minded merch?! 🌈 @MileyCyrus https://t.co/LKpiO0A4YQ", "💛💛💛💛 @happyhippiefdn @tiktok_us https://t.co/PbV9lsB8Cz", "Quarantine puppy date #BrightMinded @ddlovato https://t.co/PsEadX0wBt", "😂🌈 #BrightMinded @tiktok_us https://t.co/PuH0lqsEq4", "#BrightMinded episode 2 with @ddlovato is up now !! 🌈https://t.co/rX0SaohPie https://t.co/w1D8eMavYW", "MOOD until further notice 🌈 ( Watch Bright Minded: Live With Miley Mon-Fri 11:30am-12:30pm PT ) on my IG live! https://t.co/3Nx6EBYsPg", "Mood at all times https://t.co/u4Tj3Ix1KQ", "@MCyrusArgentina Love !!! 🌈", "Uploaded the first episode of #BrightMinded #LiveWithMiley on YouTube! https://t.co/fsB4eM0ZTV", "TOMORROW 11:30 AM PT  Workout with winsorchoza pilates , Hangin’ with @amyschumer and her hubby Chris Fischer AND talking to @Need4LSpeed and @camrhamilton ALL about Love Is Blind! It’s gonna be LIT! https://t.co/R5lLsRYeWQ", "Lovatic for Life ! https://t.co/kQAt85mufs", "RT @iHeartRadio: .@MileyCyrus and @ddlovato talked staying positive, their Disney days and more on Miley's latest 'Bright Mind' Instagram L…", "RT @MileyOfficial: Who’s ready for #BrightMinded #LivewithMiley?! Special guest @ddlovato! https://t.co/G6DjUg8OM4", "BRIGHT MINDS = 🌈 https://t.co/A2w6ML9jD9", "Tune in tomorrow to my insta live series #BrightMinded #LiveWithMiley to see me and @ddlovato talking about keeping it LIT in dark times! https://t.co/tJOIr2ZMjw", "it’s incredibly difficult to make smart decisions while panicking , but think twice before following the fear and being inconsiderate. There is enough to go around if we take care of one another. This is a beautiful time to LEAD!", "Be thoughtful. Respectful. Compassionate. HUMAN. while preparing for social distancing.... NO ONE needs every soup in the store, The more we hoard the more expensive and sparse necessities will become, leaving many without essentials. This is a great time to practice restraint... https://t.co/LfLflFfG8c", "Day 2 Quarantine https://t.co/1oUZRi8PsJ", "https://t.co/0ZKt5jFXhs", "wash your damn hands. #WashYourLyrics https://t.co/hXF0HPrWi3", "I am so disappointed to not be there, but I have to do what is right to protect the health and safety of my band and crew. I will still be making a donation to help the victims of the Australian bush fire.  I’m sorry to miss everyone in Australia, but I will be back soon.", "Australia: Due to the recommendations of local, state, federal and international government authorities, including the Center for Disease Control, to reduce potential health risks in response to the current global health crisis, we are no longer traveling to Aus for the show.", "Look who came to rehearsal ?!?! @itsjojosiwa !!!!!!! world Tour Bushfire benefit concert! March 13 in Melbourne! https://t.co/WddGGa82OV", "I am Miley Cyrus &amp; this is my first “jitter gram” ...... #OnlyForAustralia #ILoveAustralia #AndObviAustralians ❤️🇦🇺❤️🇦🇺❤️🇦🇺❤️🇦🇺 @worldtour March 13th In Melbourne Bushfire Benefit Concert !!!! https://t.co/cfLWJoNJyf", "Get your tickets now, Party while saving animals and restoring Australia’s wildlife! 🖤 https://t.co/rIPNpH8edC", "Covering Aussie band @jet.theband CLASSIC WORLDWIDE SMASH RECORD “Are you gonna be my girl?” March 13th in Melbourne at the Bushfire Relief Concert! I’m bringing @lilnasx w me! You’ll never guess what we have up our sequined sleeves!!!!! https://t.co/PqflqVIaAL", "MT X THE WHOA https://t.co/9Rew7gKdmC", "Australia next week! Tix: https://t.co/rIPNpGQDm4 https://t.co/8i65yMrDKR", "RT @happyhippiefdn: Donate to the Middle Tennessee Emergency Response Fund at https://t.co/iGd2zmCzet. #nashvillestrong 💛 https://t.co/JJ7n…", "RT @happyhippiefdn: Sending all of our love and support to our #HappyHippie family in #Nashville affected by the tornadoes. The city is clo…", "Follow @happyhippiefdn for updates on shelter and ways to get active! I am receiving information just as fast as everyone else at this point so stay tuned and we will share info as quickly as possible!", "Thinking about my home and family in Nashville and how fortunate I am that my place and loved ones have remained safe in these deadly tornados . My heart is broken for my home state. So much loss and damage. We are #NashvilleStrong and will rebuild together! https://t.co/nPbGPbfNqy", "RT @sunriseon7: \"More than almost anywhere in the world, I think I've had more of a personal relationship with it because of the amount of…", "best friends forever https://t.co/VFOFMs7Eq8", "❤️❤️❤️ https://t.co/PutIczlhBd", "See you March 13th Melbourne! ❤️ https://t.co/7TWaPOHT2Q", "RT @ausgrandprix: Tickets for the @worldtour Bushfire Relief charity concert are on sale to the general public NOW! See @MileyCyrus &amp; speci…", "🇦🇺👋 https://t.co/CKSXeC94PC", "Australia - tix for the Bushfire Relief charity concert on Friday March 13th in Melbourne are on sale NOW! https://t.co/rIPNpH8edC https://t.co/Xue3CLTiGz", "RT @sheis_skye: IM SO READY!!! 🇦🇺🇦🇺 I wasn’t even able to sleep ahh. tixxx come my way, bring on 2pm @MileyCyrus🤞🏻", "Tix go on sale at 2pm AEDT https://t.co/rIPNpH8edC  🇦🇺 you ready? https://t.co/0lSWlGgtbK", "@ObsessedSmiler @Spotify thank you !!! 💚💚", "@sheisMC23 @Spotify Yas !", "❤️  @Spotify https://t.co/cl1p7j2aw5", "RT @ausgrandprix: Just announced! @MileyCyrus will headline the @worldtour Bushfire Relief charity concert to benefit Australian fire relie…", "Proceeds from ticket sales will go to Australian charities working to restore forests, wildlife, and communities affected by the devastating fires. \n\nTix on sale 2pm AEDT tomorrow: https://t.co/rIPNpH8edC", "AUSTRALIA! I’m so excited to announce I’m headlining the World Tour Bushfire Relief charity concert on Friday March 13th in Melbourne !! Bringing out @LilNasX + more! ❤️ https://t.co/X6vDqB6eeF", "Find u a dude that fuels your Brit fantasy ! https://t.co/Acu2JKGG0i", "Munich! On sale now https://t.co/LL5vESAqau https://t.co/PXajS0b8dj", "On sale now! @LollapaloozaDe https://t.co/4iBeY11yjn https://t.co/viEInEO7sI", "Happy V-Day! Love yourself ❤️ https://t.co/VIfLLhi6GZ", "Backstage shot by @Vijatm https://t.co/ymsiCCyRpm", "Fittings with @themarcjacobs shot by @vijatm https://t.co/fk2Z6OFucF", "Park Ave Armory with @marcjacobs shot by @Vijatm https://t.co/Nrijthwlj7", "genius design and execution 💀 @marcjacobs https://t.co/5xfeWcs2sg", "Marc Jacobs https://t.co/FhATJrBHui", "RT @voguemagazine: .@MileyCyrus's latest nostalgic look cements her status as one of Hollywood's top vintage mavens. https://t.co/CagSERXQEg", "you’ve been red. ❤️💋💯 https://t.co/Cv48m9bis7", "Why you gotta insist on croppin the boot tho?!?! #NYC https://t.co/KJ34FgcL9g", "Shot by @Vijatm https://t.co/6a3d3UfXGI", "https://t.co/KXMjVwz0ZI", "Tom Ford https://t.co/G5woIseBIr", "https://t.co/FAXkCGnBHU", "My fans with the next album drop https://t.co/6TzlMpyhI6", "All the female candidates competing in the 2020 election so they can get an EQUAL shot at the position they EQUALLY deserve no matter their own anatomy! I’d like to see women’s health and reproductive rights highlighted in upcoming debates! WBU?!?! https://t.co/gZQMESLCka", "everything is soooo divine these days ( and ALWAYS.  sometimes just harder to stay aware of the magic) I’m finding my vocal surgery at the end of last year to be a gift, made me take time to really hone my craft ! Watch out! 😈", "No No No No No more wall squat vocal rehabilitation exercises! (cool trick get another muscle to fire so your throat is distracted, it takes the pressure off your chords and doing this against a wall also helps keep the chin and neck parallel/back so you have less strain and pull https://t.co/IcnZ0dqcZc", "My cover of @arcticmonkeys Why’d you only ever call me when you’re high 6 years ago! Dude I can’t believe how much I sound like @noahcyrus Fuckin wild ! https://t.co/4wvvMqcWG8", "&amp; we wonder why I’m not invited to award shows anymore .... https://t.co/rmRdovVwGu", "https://t.co/tAaXj1F4jT", "Dolly’s setting world wide trends shouting out platforms she don’t even use #legendwithaflipphone #shestillsendsfaxes #ifyoudontknowhatafaxislookitup #myfairygodmotheristhequeen #queenofcountry #queenofthegram #therewillneverbeanotherdolly #allhaildollyparton https://t.co/vKoPfrv27g", "A day in Watt’s shoes 👢 ( is definitely safer than in his brain 🧠 🔞 ⚔️) ( btw that’s bean saying hurry up and take the damn picture) https://t.co/BvTasw5JkT", "💀💀 https://t.co/tAFg0TlkG4", "12 years ago today. Don’t say I haven’t always been punk. 💀 @jonasbrothers https://t.co/DVxxLS07UY", "On sale now! https://t.co/hFGNMrrwYm", "It was a year yesterday I had the honor of performing at the @chriscornell tribute concert. Will never forget that night OR you C.C. thank you for the music you left for us ..... you were and are a gift. https://t.co/HujbgsP9cB", "Watt The Fuck Is Happening ?!?! 📸 by @majidjordan https://t.co/CEw5sOGFIx", "Tix on sale tomorrow At 12pm ET! @GovBallNYC https://t.co/qdjNYPZxQn https://t.co/2fMdm1rDnk", "🖤🖤🖤 @joerogan @madflavor https://t.co/EKx8z25aOo", "https://t.co/dC7wl45wwp", "I’m unusual... not so typical .... https://t.co/HwaluZRrsp", "RT @BRITs: The nominees for #BRITs 2020 Song of the Year are: \n\n🎶 @Mabel - 'Don't Call Me Up'\n🎶 @MarkRonson feat. @MileyCyrus - 'Nothing Br…", "Billy Fucking Idol. Miley Fucking Cyrus. Andrew Fucking Watt. #NameAMoreIconicTrio #IWillWait @BillyIdol @thisiswatt ☠️🖤🏴‍☠️ https://t.co/CUJgR7RIHh", "RT @BottleRockNapa: Ready, set, rock! 🤘🎶 1-day tickets to #BottleRock are on sale NOW. Snag them while we have them: https://t.co/AUOO6yuW3…", "RT @justnlopez: @MileyCyrus what’s next? haha lmk! https://t.co/9cKI43swgi", "RT @IovingmiIey: @MileyCyrus JUST GOT MY TICKET !!! can’t believe i can finally say i’m seeing you 🥺 https://t.co/ltzOIbzqUh", "🎊 https://t.co/NFvjnJUspi", "RT @iHeartRadio: 🎤 @MileyCyrus 🎤\n\n#BlackDog #BestCoverSong #iHeartAwards\n\nhttps://t.co/aPueslpaIw https://t.co/aooiJWAxYm", "RT @MileyOfficial: Tix on sale THURSDAY 1/9 at Noon ET! https://t.co/pnAmQymXZp", "On sale now! https://t.co/SlpF03gw6P", "🖤 @Bonnaroo https://t.co/6svOScp8Ah https://t.co/aml55MhYib", "https://t.co/pPC7XREzvW", "New hair. New year. NEW MUSIC. 💀 https://t.co/Fpi7cauqie", "Dank je 🇳🇱 https://t.co/ra9zkPk1ol", "RT @AmericanExpress: Just announced! @ChiliPeppers, @davematthewsbnd, @MileyCyrus and more will be performing @BottleRockNapa 2020! Card Me…", "https://t.co/s1jwFeXjV3", "https://t.co/EhMc2D1wQS", "New Year. New Era. #HappyFuckingNewYear https://t.co/57c3J5tMGt", "10 Years in 10 minutes #NewYearStartsNow https://t.co/2Co0qqeFtY", "RT @EOnlineStyle: She's  ̶g̶o̶t̶ always had nerve!! @mileycyrus https://t.co/Td0qJ4FThU", "https://t.co/vqc0v5u0VZ", "RT @MTV: .@MileyCyrus at the beginning of the decade 𝙫𝙨 Miley Cyrus at the end of the decade: https://t.co/uPXaIAT4En", "FAN TWEET DECADE ROUND UP! Keep making and tagging me and I will repost! https://t.co/jNzlliuyrv", "start dating your bestfriend Asap https://t.co/tJyvJVd9qW", "Happy Holidays from America’s most dysfunctional family 🎄 https://t.co/U92jwvoAfH", "Getttttt in the fuckinnnnn spirit yalllllll! Rockin around the Christmas tree &amp; Sleigh Bells are both up on @Spotify from a few years ago! Oldies but goodies! These covers plus some punkinnnnn pie is sure to get ya vibey 🎄 &amp; maybe a holi-jay 💨 https://t.co/V5ShQIpMXs", "and joy knowing how singularly amazing YOU are! Love always wins! 🎄", "In ways that still feels relevant  and someone reading this right now could possibly relate! If you feel lonely this season just know YOU ARE COMPLETELY MADE OF MAGIC! You are as special as a  snowflake , beautifully unique and I hope inside your soul feels light, hope , peace...", "A sad Christmas song I wrote a few years back right before the holidays. Was feeling like shit cause I couldn’t be with the one I loved. Even with a house full of family and friends I still felt alone....  https://t.co/n1g3f2IsMh", "@postmates hooking it up for the @happyhippiefdn @mfpla #HappyHippieHolidays party!! Thank you for supporting the youth in our community this holiday season! 💛 #BetterThanSanta https://t.co/hyqLleNlLV", ".@happyhippiefdn holiday party @MFPLA was a success once again ! 🎄 always blown away by the young people I meet at MFP! There is always so much love and talent! Thank you to everyone who joined us in celebrating this special time of year with HH! 💛 #happyhippieholidays https://t.co/WsuzAtBSDS", "Last Christmas @ electric lady studios in NYC cutting War Is Over with this super group! 🎄❤️🎄❤️🎄 @seanonolennon @MarkRonson @Wyattish @ilsey to name just a few of the sick ass musicians accompanying me! https://t.co/g5mFdUVOsh", "Taking a creepy Christmas classic and giving it a modern feminist update! On @jimmyfallon with @MarkRonson last year! https://t.co/L0hmIYT3Jd", "Happy Birthday to THE QUEEN of the entire fucking universe! You own everything! @britneyspears ❤️ #SagSisters fuck yes https://t.co/8UbBN84E3z", "It’s already December 1st... another year almost over 🎄 throwback to this time last year performing a Christmas classic #WarIsOver @seanonolennon @MarkRonson @ilsey https://t.co/iLMPw8QRGg", "@MarkRonson*💔", "Can’t wait to release all the other sick shit we’ve made together ! Love you!", "Today “MARKs” the 1 year anniversary of NBLAH! @iammarkronson thank you for not only bringing me the beginning of a song that gave me the canvas of my dreams.... somewhere between Parton and Joplin but also allowing me to make a video with political charge! https://t.co/sLNjkUtMJ0", "It runs in the family. @billyraycyrus https://t.co/dURNW3pxQI", "https://t.co/7iW4AdJ6bV", "❤️🧡💛💙💙💜 https://t.co/bqYFxJqGst", "❤️🧡💛💙💜 https://t.co/nEcZam1nug", "https://t.co/6LkAKllWUT", "https://t.co/NRTJ3XFqz2"]}