{"tweets": "I’m glad to be part of the amazing Motorola Solutions team in Salt Lake City. https://t.co/XjGw8KQmbL I am thankful for this country and the freedoms we enjoy, including the freedom of religion, which created an environment where the full and complete gospel of Jesus Christ could be restored. I am grateful for the mercy and grace provided by the Savior Jesus Christ. #GiveThanks https://t.co/We9P6OJSot I'm grateful for woodworking tools and the opportunities to use these tools to build things for my wife and others. #GiveThanks https://t.co/nUSrZ2eSOo Today I am grateful for the doctors and nurses at Lakeview Hospital who took care of Nikki during her her knee replacement surgery and recovery yesterday. The staff at Lakeview is always so kind and helpful. (Yeah, we've been there more than once 😁.) #GiveThanks I am grateful for hot showers, a soft bed and a roof over my head. Even in the trough of the ups and downs cycle of life there is still much to be grateful for and evidences that God is aware of us and our needs. #GiveThanks https://t.co/07giZMuERP I am grateful for an amazing family including two stellar sons-in-law for my lovely daughters, a thoughtful and bright son, two bundles of joy (grandchildren) and best of all the love of my life my incredible wife. Family is one of my most cherished blessings! #GiveThanks https://t.co/eXiHRGNZ6Q I am grateful for wonderful friends and neighbors who come together and help one another in times of need. We are blessed to live in a beautiful area among so many good people. #GiveThanks President Russell M. Nelson on the Healing Power of Gratitude​ https://t.co/FUsOmnUFbk via @YouTube @DeborahKurata I just finished your Angular: Getting Started course on Pluralsight. The course was well done and a great intro to Angular. Thanks! RT @NelsonRussellM: Life without God is a life filled with fear. Life with God is a life filled with peace. #GeneralConference RT @BednarDavidA: We should find great comfort in the fact that ordinary people who faithfully, diligently, and consistently do simple thin… @jimcramer What are your thoughts on MSI? Is it a stock to own? #madmoney RT @mormonchannel: \"Remember that faith and doubt cannot exist in the same mind at the same time for one will dispel the other.\"  —Thomas S… @jimcramer What are your thoughts on Motorola Solutions (MSI)?", "bag_of_tweets": ["I’m glad to be part of the amazing Motorola Solutions team in Salt Lake City. https://t.co/XjGw8KQmbL", "I am thankful for this country and the freedoms we enjoy, including the freedom of religion, which created an environment where the full and complete gospel of Jesus Christ could be restored. I am grateful for the mercy and grace provided by the Savior Jesus Christ. #GiveThanks https://t.co/We9P6OJSot", "I'm grateful for woodworking tools and the opportunities to use these tools to build things for my wife and others. #GiveThanks https://t.co/nUSrZ2eSOo", "Today I am grateful for the doctors and nurses at Lakeview Hospital who took care of Nikki during her her knee replacement surgery and recovery yesterday. The staff at Lakeview is always so kind and helpful. (Yeah, we've been there more than once 😁.) #GiveThanks", "I am grateful for hot showers, a soft bed and a roof over my head. Even in the trough of the ups and downs cycle of life there is still much to be grateful for and evidences that God is aware of us and our needs. #GiveThanks https://t.co/07giZMuERP", "I am grateful for an amazing family including two stellar sons-in-law for my lovely daughters, a thoughtful and bright son, two bundles of joy (grandchildren) and best of all the love of my life my incredible wife. Family is one of my most cherished blessings! #GiveThanks https://t.co/eXiHRGNZ6Q", "I am grateful for wonderful friends and neighbors who come together and help one another in times of need. We are blessed to live in a beautiful area among so many good people. #GiveThanks", "President Russell M. Nelson on the Healing Power of Gratitude​ https://t.co/FUsOmnUFbk via @YouTube", "@DeborahKurata I just finished your Angular: Getting Started course on Pluralsight. The course was well done and a great intro to Angular. Thanks!", "RT @NelsonRussellM: Life without God is a life filled with fear. Life with God is a life filled with peace. #GeneralConference", "RT @BednarDavidA: We should find great comfort in the fact that ordinary people who faithfully, diligently, and consistently do simple thin…", "@jimcramer What are your thoughts on MSI? Is it a stock to own? #madmoney", "RT @mormonchannel: \"Remember that faith and doubt cannot exist in the same mind at the same time for one will dispel the other.\"  —Thomas S…", "@jimcramer What are your thoughts on Motorola Solutions (MSI)?"]}