{"tweets": "Equal Pay Day is a big deal around here. Right, @mPinoe and @100purcent? https://t.co/wYdJkp9QYa Equal pay for equal work is common sense — and it’s long overdue. As president, I’m committed to closing the gap once and for all. https://t.co/nJkEWCyCoo It doesn’t matter if you’re an electrician, an accountant, or part of the best soccer team in the world — the pay gap is real. But with Megan, Margaret, and countless others leading the fight for equal pay, I’m confident we’ll finally close it. https://t.co/lJOTc0HeVB The pandemic and economic crisis have greatly impacted women and families — but with the American Rescue Plan, help is here. The law increases the Child Tax Credit, cuts child poverty in half, expands child care assistance, and provides funding to open K-8 schools. 66% of the tax breaks in the American Rescue Plan go to folks making $90,000 or less.\n\nThe top one percent get zero. https://t.co/vPMlFSCDmS We’ve got to rebuild the middle class and ensure every worker is treated with dignity and respect. As the new Secretary of Labor, @SecMartyWalsh will play a crucial role in that effort. I know he’ll fight every single day for the hardworking Americans who make our country run. https://t.co/0uK8KhKvsf To mark Equal Pay Day, @FLOTUS and I are hosting an event with Megan Rapinoe, Margaret Purce, and members of the U.S. Soccer Women’s National Team. Tune in. https://t.co/fZBqoOLBv5 Ambassador Bill Burns has dealt with many of the most complex global challenges we face — and approached them with honesty, integrity, and skill. I know that’s exactly how he’ll lead the CIA every single day. https://t.co/iFryKAcuk6 This morning, I signed the SAVE LIVES Act into law — expanding the VA’s authority and allowing them to provide COVID-19 vaccinations to all veterans, their spouses, and caregivers. https://t.co/oAO3GCsnEX .@SecBecerra and I share the belief that health care is a right for all — not a privilege for the few. I look forward to working with him to ensure every single American has access to the quality, affordable care they deserve. https://t.co/zOU9kbOBt5 This afternoon in Columbus, I met with Ohio Governor Mike DeWine to discuss our coordinated response to COVID-19. The virus doesn’t just impact red or blue states — it impacts us all — and I’m committed to working across the aisle to defeat it. https://t.co/ghcDxs6FW3 Before the Affordable Care Act, the radiation oncology department at the James Cancer Center treated 60-70 patients a day. Now, they’re able to treat close to 300. The hospital is a source of hope for the community and an example of what America can achieve if we work together. https://t.co/SlzUyCDRjo When we opened a special enrollment period for health insurance in February, over 200,000 Americans gained coverage in the first two weeks. Today, we’re extending the enrollment period to August 15.\n \nHead to https://t.co/gRX1fGFEzj to find a plan that works best for you. https://t.co/Xv4Or7PsYu When it comes to trade, we need to pursue policies that put American businesses, workers, and communities first. There’s no one better qualified to carry out that mission than @AmbassadorTai. https://t.co/F53pYgOzSa I believe every American deserves access to quality, affordable health care. The American Rescue Plan is working to make that a reality by increasing subsidies, lowering costs, and expanding coverage for people across the country. Help is here. Small businesses are the backbone of communities across the country, but far too many are struggling to keep their doors open. I know @SBAIsabel will work every day to support our small businesses and help them emerge stronger from this pandemic. https://t.co/h70O31LV7K RT @WhiteHouse: President Biden believes every single American deserves access to quality, affordable health care. Here’s a breakdown of ho… Today marks eleven years since the Affordable Care Act was signed into law. The landmark legislation has changed countless lives, but our work isn’t done. I’m committed to ensuring every American has the peace of mind that comes with quality, affordable health care. https://t.co/mOlb6nWUTF The Affordable Care Act was signed into law eleven years ago today. Tune in as I deliver remarks on the anniversary and how we’re expanding Americans’ access to health care. https://t.co/fAs34Zd7Zy We can ban assault weapons and high-capacity magazines.\n \nWe can close loopholes in our gun background check system.\n \nThis is not a partisan issue — it’s an American issue that will save lives. Congress needs to act. There is a great deal we do not know about the killer, his motivation, and other critical aspects about this shooting, but know this: as president, I will use all the resources at my disposal to keep the American people safe. Jill and I are devastated for the lives that have been shattered by gun violence in Colorado. Less than a week after the horrific murders in Georgia, another American city is scarred by a senseless attack. Our hearts go out to the victims, their families, and the survivors. Less than a week after the horrific murders of eight people in Georgia, another American city has been scarred by gun violence. Tune in as I deliver remarks. https://t.co/yU7ReRfFko The faster America gets vaccinated, the sooner we can return to our lives with our loved ones. That’s why I’m proud to share we set another record this weekend with 6 million shots reported administered across the country. There are simply some core values and beliefs that should bring us together as Americans. One of them is standing together against racism — the ugly poison that has long haunted and plagued our nation.\n\nIt’s up to all of us to give hate no safe harbor in America. Under the American Rescue Plan, the typical family of four is getting a $5,600 check. That money helps folks keep a roof over their head and put food on the table. Help is here. Mask up, America. https://t.co/6yaUHYmzWC They really know how to make an Irishman feel special at the White House. https://t.co/NDSGJt5fI1 Progress. https://t.co/kFuqPoFcFZ The CDC represents the best of this nation. Brilliant minds. Deep faith in science. And a strong commitment to public service. On Friday, Vice President Harris and I stopped by to thank them for all the work they do. https://t.co/mzVMqxz1YK In two months, we’ve:\n\n- Passed the American Rescue Plan\n- Administered 100 million shots\n- Rejoined the Paris Agreement\n- Reversed the transgender military and Muslim bans\n- Expanded access to health care and voting\n- Acted to end private prisons\n\nAnd we're just getting started. Two months down. https://t.co/jlWNtLYYqo Like countless people across the country, Jocelyn and her family are struggling to make ends meet. I gave her a call to discuss how the American Rescue Plan will help. https://t.co/AIJIIevlgS This afternoon, Vice President Harris and I sat down with Asian American leaders in Atlanta. It was a heart-wrenching meeting that made clear the urgent work that lies ahead. We must come together as one America, stand against hate, and root out racism wherever we find it. https://t.co/Z2DOKdxklZ Silence is complicity — and we cannot be complicit.\n\nWe have to speak out. We have to act. https://t.co/zJXEoKXOMm Too many Asian Americans have been waking up each morning this past year fearing for their safety and the safety of their loved ones. https://t.co/LI3iLREoMr For all the good that laws can do, we have to change our hearts.\n\nHate can have no safe harbor in America.\n\nIt must stop — and it’s on all of us together to make it stop. Words have consequences. \n\nIt’s called the coronavirus.\n\nFull stop. I just finished meeting with Asian American leaders here in Atlanta. Tune in as I deliver remarks on our meeting, the ongoing attacks against the community, and more. https://t.co/0m2stIOWZ4 During my first week, I signed a memorandum to condemn and combat racism against the AAPI community. Now, it’s time for Congress to take further action with the COVID-19 Hate Crimes Act — because everyone deserves to live their lives with safety, dignity, and respect. This afternoon, Vice President Harris and I are meeting with Asian American leaders in Atlanta, Georgia. We’re going to discuss the ongoing attacks against the community and how we move forward. It’s up to all of us to root out racism and give hate no safe harbor in America. Tomorrow, we’re going to hit a big milestone: 100 million shots in people’s arms. https://t.co/Cj65chMhJJ Before I took office, I set an ambitious goal of administering 100 million shots in my first 100 days as president.\n\nI’m proud to say that we’ll reach that goal tomorrow, just 58 days in. History.\n\nCongratulations, @SecDebHaaland. There’s no one better suited to steward our nation’s public lands. https://t.co/cdVN7ksqFK No one should lose their home in the middle of a pandemic. The American Rescue Plan provides over $40 billion in relief to help families pay their rent, stay in their homes, and keep a roof over their heads. Help is here. RT @WhiteHouse: Across the country, millions of Americans are struggling to keep a roof over their head. Here’s a breakdown of how the Amer… As the new EPA Administrator, @EPAMichaelRegan will play a crucial role in our whole-of-government initiative to combat the climate crisis. I look forward to working with him to ensure every American has clean air and water while also delivering environmental justice. https://t.co/qEt0P0cSRv In honor of the victims of the senseless shootings in Atlanta, I’ve ordered the flag of the United States to be flown at half-staff. To the loved ones of those we lost on Tuesday, know the nation mourns with you. https://t.co/abZDiisNAf Our Administration has been working around the clock to ramp up vaccinations – and this afternoon, I’ll be giving an update on our progress. Tune in. https://t.co/Z10gZ7YSSe We can't keep waiting. I urge Congress to come together to find long term solutions to our entire immigration system so we can create a safe, orderly, and humane immigration system, tackle the root causes of migration and legalize the undocumented population in the United States. Undocumented farm workers feed America and have been on the frontlines of this pandemic making sure we have food on our tables. The Farm Workforce Modernization Act provides a path to citizenship for these essential workers. I urge Congress to pass the bill. It’s long past time Congress gives a path to citizenship for Dreamers and TPS recipients who strengthen our country and call our nation home. I strongly support the Dream and Promise Act and urge all members of the House to vote yes. Had to wear my lucky tie for St. Patrick’s Day. https://t.co/PqJqwglJQP Writing and passing the Violence Against Women Act is one of the accomplishments of which I’m most proud. While we have made significant progress, there is still much work to do. I’m grateful the House voted to strengthen and renew the law — and I urge the Senate to do the same. Jill and I are keeping everyone impacted by the shootings in Atlanta in our prayers. We don’t yet know the motive, but what we do know is that the Asian-American community is feeling enormous pain tonight. The recent attacks against the community are un-American. They must stop. To celebrate St. Patrick’s Day and to reaffirm our nation’s close partnership with Ireland, I hosted a bilateral meeting with Prime Minister Micheál Martin. We’re committed to working together to combat COVID-19, address global challenges, and increase our shared prosperity. https://t.co/U2CZB3Hzhv As a descendant of the Blewitts from Mayo County and the Finnegans from County Louth, I’m wishing everyone a happy St. Patrick’s Day. https://t.co/nbYHPO8nE7 Thank you Brayden, Jessica, and Michael for your beautiful reading of W. B. Yeats’ work.\n\nWhen I was a kid and working to overcome my stutter, I would recite Yeats’ words in the mirror. I’m glad they’ve helped you as well, Brayden, and I’m incredibly proud of how far you’ve come. https://t.co/QkD0JgCdJ1 As we celebrate St. Patrick’s Day, I’m reminded of my trip to Ireland in 2016 as vice president. The partnership between our two nations is historic and strong — and I look forward to renewing our bond during this afternoon’s bilateral meeting with Prime Minister Micheál Martin. https://t.co/XdILGVzv5L Across the country, Black- and Brown-owned small businesses have been devastated by the pandemic. Today, I stopped by Smith Flooring, a Black-owned union shop in Pennsylvania, to discuss how the American Rescue Plan will help them and countless other small business owners. https://t.co/jkbQ2UUePi The American Rescue Plan is investing over $60 billion to help small businesses keep their doors open. To every small business owner out there, know help is here. https://t.co/NBKUdaRIoq The last year has been tough for small businesses across the country, but with the American Rescue Plan, help is here. We’re investing over $60 billion to help small businesses keep their doors open and emerge from this pandemic stronger. With nearly 6 million doses administered over the weekend and over 2 million doses administered yesterday — we’re vaccinating the country at a record-breaking pace.\n\nThat’s progress — and there’s a lot more to come. That’s the American Rescue Plan. https://t.co/7pE89mi4C6 RT @FLOTUS: With the American Rescue Plan, #HelpIsHere. We’re going to open schools—and we’re going to do it safely. https://t.co/GuN0RlY4e5 The American Rescue Plan will deliver direct payments to 85% of American households — and checks have already started going out to folks across the country. Let me know if you’ve received yours by sharing below. Help is here — and sooner than many ever thought possible. https://t.co/4ntwrpxAXn The American Rescue Plan is already doing what it was designed to do: Making a difference in people’s lives. https://t.co/EVgY5QCnmA In the next ten days, we will reach two giant goals:\n\n- One hundred million shots in people’s arms.\n- One hundred million checks in people’s pockets.\n\nThat’s real progress. We’re working around the clock to ramp up vaccinations and get direct relief out to Americans. Tune in as I provide an update and discuss the implementation of the American Rescue Plan. https://t.co/4x796pyMfB If we all do our part, this country will be vaccinated soon, our economy will be on the mend, our kids will be back in school, and we will have proven once again that this country can do anything.\n\nAfter a long, dark year there are better days ahead. Last week, I signed the American Rescue Plan into law and direct payments have begun going out to folks across the country. I know there are a lot of questions about how to receive yours, so we put together this guide: https://t.co/p7m1hVmTCb Last week was a big week for our Administration, we:\n\n- Passed the American Rescue Plan\n- Began sending out stimulus checks\n- Announced every adult will be eligible for a vaccine by May 1\n- Averaged more than 2 million vaccinations per day The American Rescue Plan’s direct payments have begun going out. Help is here. Since taking office, I’ve been calling leaders from around the world with a simple message: America is back. We’re going to rebuild our international alliances and tackle the shared challenges we face. https://t.co/NC5zWmA3Ed Breonna Taylor’s death was a tragedy, a blow to her family, her community, and America. As we continue to mourn her, we must press ahead to pass meaningful police reform in Congress. I remain committed to signing a landmark reform bill into law. To everyone out there who’s hurting or struggling to get by: help is here. https://t.co/fkME0yMmBK W.S. Jenks &amp; Son is a historic hardware store in Washington, D.C. — and like countless other small businesses across the country, they’re hurting because of this pandemic. I stopped by this week to check in. https://t.co/3Dh6SAQwZ9 51 days down. https://t.co/DGsWdxEkz1 The American Rescue Plan’s $1,400 checks will start going out as early as this weekend. Here’s how folks plan to use theirs: https://t.co/z2TSMNX4XI Delivering for the American people. https://t.co/bLhvrsTnkR This morning, I met virtually with the Quad in the first multilateral summit I’ve hosted as president. The United States, Japan, India, and Australia are committed to working together to tackle the shared challenges we face and to secure a free and open Indo-Pacific region. https://t.co/m0AYfsEx6z This afternoon, I’m joining Vice President Harris and members of Congress to celebrate the passage of the American Rescue Plan. Tune in. https://t.co/qBHFdRxqle This is the United States of America. There’s nothing we can’t do if we do it together. https://t.co/ekS0dPRnUR Attorney General Merrick Garland is a man of impeccable character. I know he’ll work every day to reaffirm the integrity and independence of the Justice Department and build a more equitable justice system for all Americans. https://t.co/naJQDK49jm Over a year ago no one could’ve imagined what we were all about to live through, but now we are coming through it. It’s a shared experience that binds us together as a nation. https://t.co/CT7gl3p5KD Tonight, I am announcing that I will direct all states, tribes, and territories to make all adult Americans eligible for the vaccine no later than May 1. https://t.co/FEIDCFLORb In the loss, we’ve seen how much there is to gain — in appreciation, respect, and gratitude.\n\nFinding light in the darkness is a very American thing to do. https://t.co/MSTpMEPEBe If we all do our part, then by July 4th, there’s a good chance folks will be able to gather with family and close friends to celebrate Independence Day. Finally, we need every American to do their part — including getting vaccinated when it’s their turn and helping family, friends, and neighbors get vaccinated as well. Fourth, we will issue further guidance on what you can and cannot do once fully vaccinated — to lessen the confusion, keep people safe, and encourage more people to get vaccinated. Third, with the passage of the American Rescue Plan, and my announcement last month of a plan to vaccinate teachers and school staff, we can accelerate the massive nationwide effort to reopen our schools safely. Second, when every adult is eligible in May, we will launch new tools to make it easier for you to find a vaccine — including a website that will help you find a place to get a vaccination near you. First, I’m directing all states, tribes, and territories to make all adult Americans eligible for the vaccine no later than May 1. For all of you asking when things will get back to normal, here is the truth: The only way to get our lives back — and to get our economy back on track — is to beat the virus.\n\nHere are the next steps we’re taking to make that happen: We are proving once again something I have said time and time again: It is never a good bet to bet against the American people.\n\nThis nation is coming back. I will use every power I have and I will not relent until we beat this virus.\n\nBut I need you. I need every American to do their part.\n\nGet vaccinated when it’s your turn, keep washing your hands, stay socially distanced, and keep wearing masks. All adult Americans will be eligible to get the vaccine no later than May 1. Before I took office, I set a bold goal of administering 100 million shots in my first 100 days.\n\nI’m proud to share that we’re well ahead of schedule and on track to reach that goal by day 60. One year ago today, everything stopped because of COVID-19. Tune in as I deliver remarks on the progress we’ve made and the path that lies ahead. https://t.co/ffCllTxkLr Tune in tonight at 8 PM ET as we look back at the last year and discuss the road ahead. https://t.co/XUYJUs4QNb The last year has tested us in unimaginable ways, but there is light at the end of the tunnel.\n\nWe will emerge stronger. https://t.co/FJUnsVoKXX Before I took office, I promised you that help was on the way. Today, I signed the American Rescue Plan into law, and can officially say: help is here. https://t.co/uuEZAkGloz Vaccines are on the way. https://t.co/pIpvSqI4sx This afternoon, I’m signing the American Rescue Plan – a historic bill that will turn the page on this pandemic and jumpstart our economy. Tune in. https://t.co/hJiZRDFyAC One in four adults in the U.S. has received their first COVID-19 vaccine — and we’re now leading the world in vaccinations.\n\nThat’s progress. RT @WhiteHouse: Congress has officially passed President Biden’s American Rescue Plan. How will this help you and your family? Head to http… During World War II, one of our country’s slogans was “Together, we can do it.” And companies took it to heart.\n\nWe need that same kind of wartime effort today.\n\nThat’s why we brought together Johnson &amp; Johnson, Merck, and the federal government to defeat COVID-19. https://t.co/wz2vxn6Bj1 Housing should be a right — not a privilege. But far too many people are struggling to keep a roof over their head. I look forward to working with @SecFudge to help renters and homeowners get through this crisis and ensure every American has access to quality, affordable housing. https://t.co/GjfQS2H7tO Checks are on the way. https://t.co/rtODFOZ4OX To Speaker Pelosi, Majority Leader Schumer, and everyone who voted for the American Rescue Plan — thank you. This is a historic victory for the American people. https://t.co/RPZ04GTDOg This afternoon, I’m hosting an event with the CEOs of Johnson &amp; Johnson and Merck to discuss our historic partnership to produce more COVID-19 vaccines. Tune in. https://t.co/S3OxWrOUgt Help is here — and brighter days lie ahead. https://t.co/HSp8rPBxty Help is here. https://t.co/urZCiigeS1 Keep the faith, folks. We will get through this. https://t.co/AMlyu4pU6M From launching community vaccination centers around the country to deploying mobile vaccination units to hard-to-reach areas — the American Rescue Plan will help vaccinate America quickly and equitably. https://t.co/j05KQLPti0 I want every child to know that this is what vice presidents and generals in the United States Armed Forces look like. https://t.co/y2OFL1z29r I believe every worker deserves a free and fair choice to join a union — and the PRO Act will bring us closer to that reality. I urge Congress to send it to my desk so we can summon a new wave of worker power and create an economy that works for everyone. The American people need direct economic relief — and they need it now. On this #InternationalWomensDay, I signed two executive orders to establish the White House Gender Policy Council and ensure education free from sexual violence. As president, I’m committed to uplifting the rights of women and girls in the U.S. and around the world. https://t.co/60lYI8qhR8 Our Administration will honor the visionary women — known and unknown — who have helped build this country. And we’ll be guided by the belief our nation is at its best when there are endless possibilities for all women and girls. #WomensHistoryMonth https://t.co/pJ9byDgc59 This afternoon, I’m delivering remarks on International Women’s Day with Vice President Harris, Defense Secretary Austin, and two Combatant Commander nominees. Tune in. https://t.co/MJgoHWrTGI Women’s history is American history — and world history. On #InternationalWomensDay, we celebrate the achievements, contributions, and progress of women and girls — and recommit ourselves to the cause of equity and equality for women around the world. We can contain this virus.\nWe can vaccinate America.\nWe can begin to return to our normal lives.\n\nCongress needs to pass the American Rescue Plan to get it done. RT @CDCgov: #COVID19 vaccines are effective at protecting you from getting sick. Based on what we know, people who have been fully vaccinat… From rolling out the Johnson &amp; Johnson vaccine to securing enough doses for every American by the end of May — last week was a big week, but we still have further to go. Please keep wearing masks, stay socially distanced, and get vaccinated when it’s your turn. On this 56th anniversary of Bloody Sunday, I signed an executive order to promote voting access. The right to vote is sacred and fundamental – and this is just the beginning of our work to ensure every American can freely exercise that right. https://t.co/wKQq640FPB It’s time we pass the John Lewis Voting Rights Act and ensure every eligible American can make their voice heard at the ballot box. The legacy of Selma is that while nothing can stop free people from exercising their most sacred power as citizens, there are those who will do anything they can to take that power away. As we reflect on the anniversary of Bloody Sunday, we must stay focused on the work ahead. https://t.co/DDn1LFfqmi What will the American Rescue Plan do for you? https://t.co/ck7UYW0lvv The House should pass the American Rescue Plan quickly to get checks out the door starting this month. https://t.co/ru9PPhSxyT By passing the American Rescue Plan, we will have proved that this government can still do what it most has to do: Improve the lives of the American people. https://t.co/wB3XBnn8RD I want to thank all of the Senators who worked so hard to reach a compromise and voted to pass the American Rescue Plan.\n\nIt wasn’t easy — but it was so desperately needed. https://t.co/YPTJggPCyB When I was elected, I said we were going to get the government out of the business of battling on Twitter and back into the business of delivering for the American people. \n \nPassing the American Rescue Plan will do that. When I took office, I promised help was on the way. Thanks to @SenSchumer and Senate Democrats, we've taken one more giant step forward in delivering on that promise.\n\nI hope the American Rescue Plan receives a quick passage in the House so it can be sent to my desk to be signed. Today, the Senate passed the American Rescue Plan – bringing us one step closer to delivering much-needed relief. Tune in as I deliver remarks. https://t.co/wX8fXNGYqi Tammy — and countless other Americans across the country — are struggling to get by, through no fault of their own. I gave her a call to discuss how the American Rescue Plan will deliver direct relief and help her family get through this crisis. https://t.co/kZR2aSd9HQ Another week in the books. https://t.co/Q2u8fSS86Q Everyone in America who wants the COVID-19 vaccine should be able to get it free of charge.\n\nThe American Rescue Plan will make that a reality. Native American communities have been hit hard by COVID-19. But thanks to the Indian Health Service and strong partnerships with Tribal governments, organizations, and urban Indian groups, more than 500,000 vaccines have already been administered with more on the way. This afternoon, I’m sitting down with folks to listen to their stories and discuss how they’ll benefit from the American Rescue Plan. Tune in. https://t.co/6vsbnZieWj With the Johnson &amp; Johnson vaccine, we now have a third safe and effective COVID-19 vaccine being administered across the country. I’m grateful these folks are stepping up and getting vaccinated — and I encourage every American to do the same when it’s their turn. https://t.co/n6Xs8TyS6C This afternoon, I brought together a bipartisan group of lawmakers from the House Transportation and Infrastructure Committee. We’re committed to working across the aisle to build modern and sustainable infrastructure that once again leads the world. https://t.co/QpqhwPjVxJ Across the country, countless Americans are struggling through no fault of their own. The American Rescue Plan will provide direct relief and a bridge to the other side of this crisis. https://t.co/euMVlIx9Vi RT @WhiteHouse: Press Secretary Jen Psaki is back again to answer your questions. This week, she’s discussing everything from our vaccinati… The right to vote is sacred and fundamental — and H.R. 1 is urgently needed to protect that right, to safeguard the integrity of our elections, and to repair and strengthen our democracy. I look forward to signing it into law after it has passed through the legislative process. Building back better every day. https://t.co/dBxbxPsOLf We’re facing an economic crisis caused by a public health crisis, and @SecRaimondo will play a crucial role in helping us recover. I look forward to working with her to support American businesses and workers, create good-paying jobs, and build an economy that works for all. https://t.co/iryDfCcawF The fight against cancer is personal for me, like it is for so many Americans. And I’m committed to doing everything I can as president to end cancer as we know it. This afternoon, I brought together a bipartisan group of lawmakers to discuss how we can get it done. https://t.co/i6JUXGvHdI Your actions can save lives and change the course of this pandemic. https://t.co/zol6DDqDi1 A plan for all of America — supported by the majority of America. https://t.co/Rmd2DCaDNP On February 15, my Administration opened a special enrollment period for health insurance and more than 200,000 Americans have already gotten covered. It’s an encouraging sign, but we have further to go. Head to https://t.co/gRX1fGFEzj before May 15 to get covered. An educator is leading the Department of Education once again. I look forward to working with @SecCardona to safely reopen our nation’s schools and ensure every child has access to a quality education. https://t.co/5wO9lpR4ct I’m grateful House and Senate Democrats introduced legislation today to strengthen our background check system. I helped pass the Brady background check bill as a Senator — and I’m committed to continuing that work and passing common-sense gun safety reforms as president. The countless leaders who turned to Vernon Jordan for guidance did so because when he spoke, you could hear in his rich baritone the belief in an America that was capable of becoming an ever-more perfect union. It was a journey he’d lived. https://t.co/wE4A16zAUy The bottom line is this: We need the American Rescue Plan now. https://t.co/Aop0DoFych The fight against COVID-19 is a war-time effort — and to win, we need breakthrough approaches. Today, I’m announcing we’re bringing together Johnson &amp; Johnson, Merck, and the full power of the federal government to ramp up vaccine production and defeat this virus. https://t.co/knu1PIXOtl Today, I am directing every state to prioritize educators for vaccination. We want every educator, school staff member, and child-care worker to receive at least one shot by the end of this month.\n\nIt’s time to treat in-person learning like the essential service that it is. Three weeks ago, I announced we would have enough vaccine supply for all Americans by the end of July.\n\nNow, with our efforts to ramp up production, we will have enough vaccines for every American by the end of May. This afternoon, I’m announcing a new partnership between Johnson &amp; Johnson and Merck that will increase vaccine production and help defeat COVID-19. Tune in. https://t.co/e4WfFa4DXd The fact is that $600 is not enough. The Senate needs to pass the American Rescue Plan and finish the job of delivering $2,000 in direct relief. I had a great meeting with Mexican President Andrés Manuel López Obrador this afternoon. From migration to climate change — we’re committed to working closely together to make progress on the challenges we face. https://t.co/M7T6CF8Fel Wash your hands.\nStay socially distanced.\nWear a mask.\nGet vaccinated when it’s your turn.\n\nDespite our progress, we can’t let our guard down. During Women's History Month, let us honor the accomplished and visionary women who have helped build our country. And let us pay tribute to the trailblazers from the recent and distant past for building a nation of endless possibilities for all of its women and girls. This afternoon, I’ll be meeting virtually with Mexican President Andrés Manuel López Obrador. The U.S.-Mexico relationship is broad and deep — and I look forward to ushering in a new phase of cooperation and progress. No child in America should go hungry. The American Rescue Plan will extend and invest in critical food programs to help ensure every family gets the food they need. https://t.co/DlKYDM6bOM On Saturday, the FDA issued an emergency use authorization for the Johnson &amp; Johnson COVID-19 vaccine. Dr. Fauci sat down to answer your questions. https://t.co/KJQ2SrVclp RT @WhiteHouse: To celebrate Black History Month, the St. Augustine Gospel Choir was invited to the White House for a special performance.… Workers in Alabama – and all across America – are voting on whether to organize a union in their workplace. It’s a vitally important choice – one that should be made without intimidation or threats by employers.\n\nEvery worker should have a free and fair choice to join a union. https://t.co/2lzbyyii1g The more people that get vaccinated, the faster we will beat this pandemic. That’s why one of my first goals is to administer 100 million COVID-19 vaccine shots in our first 100 days.\n \nI’m proud to say we’re over halfway to our goal and weeks ahead of schedule. After a rigorous scientific review process, the FDA issued an emergency use authorization for a third safe and effective COVID-19 vaccine. It’s exciting news for all Americans, and an encouraging development in our efforts to bring an end to the crisis. https://t.co/jVRjdRie9V Yesterday I traveled to Texas to visit an emergency operations center, food bank, and vaccination site. Each stop represented our nation at its best—people coming together to help their fellow Americans. It’s a reminder that there’s nothing we can’t do when we do it together. https://t.co/6WgPbD0PCx Thank you to @SpeakerPelosi for your leadership and everyone in the House who supported the American Rescue Plan. Now, the bill heads to the Senate and there’s no time to waste. If we act quickly and decisively, we can finally get ahead of this virus and get our economy moving. This morning, I’m speaking about the American Rescue Plan. Tune in. https://t.co/8N5AZ8Y6H6 Because of the selfless dedication of nurses like Erica — and countless other folks across the country — we’re going to beat this virus. I called to thank her and discuss what we can do to help. https://t.co/XRfNDgwNkX RT @WhiteHouse: Tune in as the President, First Lady, Vice President, and Second Gentleman host a White House Black History Month Celebrati… This week, our Administration opened a new vaccination site at NRG Stadium in Houston, Texas. Tune in as I visit the site and deliver remarks. https://t.co/YD92UXX2sM If there is one message that needs to cut through it’s this: the vaccines are safe and effective. https://t.co/S2eA24D9Gj The week before I took office, 6 million COVID-19 vaccine shots were administered.\n\nThis coming week, our Administration will likely administer over 12 million shots.\n\nThat’s double the pace in just six weeks. COVID-19 vaccinations are up and cases and hospitalizations are down, but let me be clear: now is not the time to relax. https://t.co/oUuHCXl3s7 Transgender rights are human rights — and the House made that clear today by passing the Equality Act. \n\nNow it's time for the Senate to do the same. I launched a whole-of-government initiative to tackle the climate crisis during my first weeks in office — and as the Secretary of Energy, @SecGranholm will play a crucial role. I look forward to working with her to create good-paying, union jobs and build a clean energy economy. https://t.co/dVIGBtUBvE This afternoon, we’re reaching a big milestone: 50 million COVID-19 vaccine doses administered since I took office. Tune in as we mark our progress and chart the path forward. https://t.co/uJ27tu7LxB I believe every American deserves the peace of mind that comes with quality, affordable health care. That’s why we opened a special health insurance enrollment period to ensure everyone can get covered. Head to https://t.co/gRX1fGFEzj to find the plan that works best for you. I am pleased that the House will vote next week on the George Floyd Justice in Policing Act. I encourage the House to pass it. Following Senate consideration, I hope to be able to sign into law a landmark police reform bill. Yesterday, I met with a bipartisan group of House and Senate members to discuss U.S. supply chains and then took executive action to strengthen them. The American people should never face shortages when it comes to the goods and services they rely on. https://t.co/y342c3AX5C I’ve known Secretary Vilsack for years, and there’s no doubt the USDA is in good hands with him at the helm once again. I look forward to working with him to support America’s farmers, tackle hunger and climate change, and rebuild our rural economies. https://t.co/d0niNqQOsU Wearing a mask is one of the most important things we can do to protect others and change the course of this pandemic. That’s why over the next few weeks, we’re delivering over 25 million masks to community health centers, food pantries, and soup kitchens across the country. Just over a month ago, America had no real plan to vaccinate most of the country. That changed the moment we took office. https://t.co/RPEf6Ce16b This afternoon, I’m signing an executive order to create more resilient and secure supply chains for critical and essential goods. Tune in. https://t.co/7LyrNa38H5 Ambassador Linda Thomas-Greenfield is right: Diplomacy is back and it’s at the center of our foreign policy. I look forward to working with her to rebuild our alliances, take on global challenges, and restore America’s leadership on the world stage. https://t.co/I2Uj4C8lio When I met with Prime Minister @JustinTrudeau in 2016, I said the world needed more leaders like him. A lot has changed since then, but my sentiment remains the same. I can’t wait to see what we accomplish in the years ahead. https://t.co/jRJH7fpm2R Small businesses need relief, but many were muscled out of the way by big companies last year. That’s why starting today, we’re opening an exclusive 14-day loan application period for businesses and nonprofits with fewer than 20 employees.\n\nLearn more: https://t.co/JlLS2kNadK https://t.co/Nn36MTol8E Prime Minister @JustinTrudeau is right — it’ll take teamwork to tackle the biggest challenges our nations face. That’s why we’re announcing the U.S.-Canada Partnership Roadmap — a blueprint for the whole-of-government relationship between our two nations. https://t.co/9GlS9QcTWA We have been fighting this pandemic for far too long, but we have to resist becoming numb to the sorrow. Because in order to heal, we must remember. https://t.co/FOmIfI2JX6 It was great to be back with Prime Minister @JustinTrudeau this afternoon. Whether it’s combating COVID-19 or tackling the climate crisis — we’re committed to working side-by-side on the biggest challenges we face. https://t.co/eNm6uX6Bec I just met with Prime Minister @JustinTrudeau – my first bilateral meeting as president. Tune in as we discuss the meeting and how we’ll tackle the shared challenges we face. https://t.co/0vASM6lIKb I look forward to joining Prime Minister @JustinTrudeau this afternoon for my first bilateral meeting as president. The United States and Canada share a unique bond and close friendship — and I’m committed to strengthening our partnership in the years ahead. Not many people have Oval Office walk-in privileges. Happy to report that these two are on the list. https://t.co/DRfr9hMsyW This afternoon, I’m holding a roundtable discussion with Domestic Policy Advisor @AmbRice46 and Black essential workers. Tune in. https://t.co/8OEtENIJuf A Black man should be able to go for a jog without fearing for his life. Today, we remember Ahmaud Arbery’s life and we dedicate ourselves to making this country safer for people of color. We will get through this, I promise you. https://t.co/dtmi4C9WsM We often hear people described as ordinary Americans. There's no such thing. There's nothing ordinary about them. The people we’ve lost to COVID-19 were extraordinary. To heal, we must remember. https://t.co/LVfAnRpHlW It's not Democrats and Republicans who are dying from the virus. It's our fellow Americans. It's our neighbors, our friends, our mothers, our fathers, our sons, our daughters, husbands, wives.\n\nWe have to fight this together, as one people, as the United States. Today, our nation passed another grim milestone in this pandemic: 500,000 lives lost. Join us as we honor their memory. https://t.co/AzUzXoVUgb 500,000 lives lost to COVID-19. It’s an unfathomable number, but each one represents a family that will never again be whole. To those who have lost loved ones: I know no words can numb the pain, but I hope you find some solace in knowing the nation grieves with you. I know folks have a lot of questions about COVID-19 mutations, our vaccination progress, and much more. @CDCDirector Dr. Walensky sat down to provide answers. https://t.co/K0Rlkc4Ti2 Small businesses are the backbone of our communities – and far too many are on the brink of closing their doors. Tune in as I announce additional steps we’re taking to support them. https://t.co/BHhUV3nzng If there’s one message I want to cut through to everyone in this country, it’s this: The vaccines are safe.\n\nFor yourself, your family, your community, our country — take the vaccine when it’s your turn and available. That’s how we’ll beat this pandemic. When I said I would listen to the scientists as president, I meant it. https://t.co/VeC7qGESID Today would have been Congressman John Lewis’ 81st birthday. While my dear friend may no longer be with us, his life and legacy provide an eternal moral compass on which direction to march. May we carry on his mission in the fight for justice and equality for all. On Friday, I visited Kalamazoo, Michigan to tour a Pfizer manufacturing plant. I had an opportunity to see the COVID-19 vaccine production process up close and thank the workers for their tireless efforts – because of their hard work we’re going to beat COVID-19. https://t.co/tt0vYyskE9 Overcoming the COVID-19 pandemic needs to be our top priority as a nation. I joined members of my team to talk about our plan to get it done. https://t.co/LIiwFrwKRc One month down. https://t.co/mlpa5Pl9JQ The federal government has sent generators, blankets, water, and other critical supplies to Texas, but local organizations on the ground need help. Here’s how you can pitch in. https://t.co/gp6PaGe87G On Tuesday, I’ll be meeting virtually with @CanadianPM Justin Trudeau. I look forward to renewing the strong friendship between the United States and Canada and working to tackle the shared challenges we face. On Thursday, I joined the world and watched in awe as the Perseverance Rover touched down on the surface of Mars. It was a remarkable feat — one made possible by the hard work and ingenuity of the team at @NASA.\n\nI called to congratulate them on their historic landing. https://t.co/0Qjs2MDk4J I know a lot of folks have questions about when you’ll get your stimulus checks and how we’re increasing vaccine production, so I sat down to answer a few. https://t.co/tzAt5zeUnN This afternoon, I’m touring a Pfizer manufacturing site in Kalamazoo, Michigan, and delivering remarks on our efforts to vaccinate America. Tune in. https://t.co/UY2yHNjaXv This morning, I met with my fellow G7 leaders for the first time as president. I made clear that America is back at the table — and I’m committed to working with them to control the pandemic and address the shared challenges we face. https://t.co/TM1zAhWiPY Today, America is officially back in the Paris Climate Agreement. Let’s get to work. As vice president, I worked closely with America’s democratic partners to advance our shared vision and values. As president, I’ll work with our partners and allies to defeat COVID-19 and advance peace and shared prosperity around the world.\n\nAmerica is back. https://t.co/ZcrgonHh2N This morning, I’m delivering remarks on the partnership between Europe and the United States at a special event hosted by the Munich Security Conference. Tune in. https://t.co/QDhEw6oytK The Equality Act provides long overdue federal civil rights protections for LGBTQ+ Americans, preventing discrimination in our housing, education, public services, and lending systems. I urge Congress to swiftly pass this historic legislation. Tonight, I called Governor Greg Abbott to discuss the ongoing situation in Texas and identify ways we can support the state’s recovery from this storm. I made clear to the Governor that I’ll work relentlessly to get his state what they need. https://t.co/UBwH8DMep2 The truth is the last four years have exacerbated our already broken immigration system. The legislation I sent to Congress will bring about much-needed reform and restore humanity to our policies. I look forward to working with Congress to get it done. https://t.co/35U0J3NgQr Wear a mask.\nSocially distance.\nWash your hands.\n \nYour actions matter. https://t.co/taGajV5D4P When it comes to a COVID relief package, we have to go big. https://t.co/DJalq00JmF Congratulations to NASA and everyone whose hard work made Perseverance’s historic landing possible. Today proved once again that with the power of science and American ingenuity, nothing is beyond the realm of possibility. https://t.co/NzSxW6nw4k Texas — Hundreds of warming centers are open across the state. Head to https://t.co/hPJawls8rQ to find the center nearest you or call 211 for additional assistance. Jill and I are keeping Texas, Oklahoma, and other impacted states in our prayers. I’ve declared states of emergency, authorized FEMA to provide generators and supplies, and am ready to fulfill additional requests. Please heed the instructions of local officials and stay safe. Today I announced our Administration will:\n\n- Expand COVID-19 testing for schools and underserved communities\n- Increase manufacturing of testing supplies\n- Increase genome sequencing to track emerging strains\n\nThese steps will expand testing and help get the virus under control. As I’ve said throughout my whole career: The middle class built this country, and labor built the middle class. This afternoon, I met with labor leaders to discuss the American Rescue Plan and how we’ll rebuild our infrastructure—creating good-paying, union jobs in the process. https://t.co/3dyv23GvLq Today, I join Christians around the world in observing Ash Wednesday. As we enter the season of Lent, we know this moment of repentance, reflection, and renewal comes in the midst of a painful winter. Let us look with hope and anticipation toward Easter and brighter days ahead. As I said at last night’s CNN Town Hall, I’ll always level with the American people and tell it to you straight. The road ahead will be tough and the crises we face are daunting, but I’m confident that if we come together and act as one nation, we will overcome them. https://t.co/ZqUpA1jray I spoke today with @IsraeliPM Netanyahu and affirmed the United States’ steadfast commitment to our ally Israel’s security. Our teams are in constant touch to strengthen U.S.-Israel strategic cooperation on all regional security issues, including Iran. By the end of July, we will have enough doses to vaccinate every American. https://t.co/Wzmopn85RE The next four years, I want to make sure all the news is the American people. https://t.co/AINJ2ieDgL I know COVID-19 can be scary, but I want every kid out there to know things are going to be okay. https://t.co/wZIxHeNAFa RT @PressSec: I’ve gotten a ton of great questions on Twitter since our last video, so I took some time to answer a few more here. We cover… Tonight, I’ll be answering questions at my first town hall since taking office. Make sure to tune in to CNN at 9 PM ET / 8 PM CT to watch. https://t.co/tMjDVuNwXM I’m on my way to Wisconsin for tonight’s CNN Town Hall. See you soon, Milwaukee! https://t.co/7TwheCPqgy Starting this week, our Administration is:\n\n- Increasing weekly vaccine shipments to states to 13.5 million doses — a 57% increase from when I took office.\n- Doubling our direct shipments to local pharmacies.\n\nWe’re working hard to get America vaccinated quickly. Mask up, America. https://t.co/hkVFUh8v6K Before I took office, I set a big goal of administering 100 million shots in the first 100 days. With the progress we’re making I believe we’ll not only reach that, we’ll break it. Health care is a right — and I will do everything in my power to ensure that all Americans have access to quality, affordable care. Starting today, we’re opening a special enrollment period for health insurance. Head to https://t.co/gRX1fGFEzj to get covered. On this Presidents’ Day, I promise you as your president, my whole soul is in the work ahead of us. And if we do it together, as one nation, we will not fail. America never has. https://t.co/m8QGdWezch The love of my life and the life of my love. Happy Valentine’s Day, Jilly. https://t.co/LjLLIjvP1C Three years ago today, a lone gunman took the lives of 14 students and three educators in Parkland, Florida. In seconds, the lives of dozens of families were changed forever. As we mourn with the Parkland community, we mourn for all who have lost loved ones to gun violence. https://t.co/k050oDHXIi Congratulations, Prime Minister Mario Draghi. I look forward to working closely with you to deepen our strong bilateral relationship, cooperate during your leadership of the G20, and address global challenges from COVID to climate change. From COVID-19 to the economic crisis, we’re facing enormous challenges — and faith-based and community organizations are essential to addressing them. That’s why today, I reestablished the White House Office of Faith-Based and Neighborhood Partnerships. Let’s get to work. America’s governors and mayors understand the fight against COVID-19 and the urgency of another relief bill. Yesterday, I met with a bipartisan group of them to discuss the American Rescue Plan and how we can work together to meet the crises we face. https://t.co/QpJqaKQFuM Samir and Neal own NaanStop in Atlanta, Georgia — and like many small businesses around the country, they’ve been hit hard by the COVID-19 pandemic. I gave them a call to hear their story and talk about how the American Rescue Plan will help businesses like theirs. https://t.co/9FjudVGsMJ I know the last year has been difficult and painful for all of us. I hope Jill’s Valentine’s Day message helped brighten your day. https://t.co/jdEFMSDefm It’s also a goal we can meet if we follow the science. Today, the Centers for Disease Control and Prevention has provided the best available scientific evidence on how to reopen schools safely. https://t.co/IQVWO6iT0B Before taking office, I set a goal of opening most K-8 schools by the end of my first 100 days. It’s a national imperative—one that can only be achieved if Congress provides states and communities the resources they need to get it done safely through the American Rescue Plan. Earlier this week, Vice President Harris and I took a virtual tour of a vaccination site in Arizona. Because of the hard work of these folks — and countless others across the country — we’re going to beat this virus once and for all. https://t.co/xekXB967h5 From the Biden family to yours, happy #LunarNewYear. We wish you happiness, health, and prosperity in the Year of the Ox. https://t.co/sOHEzdFH0D I see enormous pain in this country. A lot of folks are out of work. A lot of folks are going hungry, staring at the ceiling at night wondering, “What am I going to do tomorrow?” That’s why I’m urging Congress to pass the American Rescue Plan and deliver much-needed relief. https://t.co/nROFWbZ44V To everyone at the NIH — all the doctors, scientists, and researchers fighting this pandemic and saving lives — thank you from the bottom of my heart. You're truly the best America has to offer. https://t.co/lLpdZSLdjX When I took office three weeks ago, America didn’t have a plan or enough supplies to vaccinate most of the country. But my team got right to work, and as of today, we’ve increased weekly vaccine shipments by nearly 30% and purchased enough vaccines to vaccinate all Americans. If we don’t take action, we won’t return to full employment until 2025.\n\nIf we pass the American Rescue Plan, we’ll return to full employment next year.\n\nThe choice couldn’t be clearer. https://t.co/Y4w9wzxgyh This morning, I met with a bipartisan group of Senators to discuss the need to invest in modern and sustainable infrastructure. This isn’t a partisan issue — and I’m committed to working across the aisle to deliver infrastructure and jobs to communities across the country. https://t.co/H2sdrRWndn This afternoon, I’m visiting the National Institutes of Health and delivering remarks to staff. Tune in. https://t.co/dyIijetOaP No child should grow up in poverty. The American Rescue Plan will expand the child tax credit and cut the child poverty rate in half. https://t.co/cMw8wCY2N6 We can reduce suffering in this country, put people back to work, and gain control of this virus.\n\nThat’s what the American Rescue Plan will do. https://t.co/vFxjLCbpj9 This afternoon, I visited the Department of Defense to meet with officials and deliver remarks to the incredible service members and civilians. Serving as Commander in Chief is the honor of my lifetime and an enormous responsibility — one that I promise I will never take lightly. https://t.co/u6JLUEnDs8 I spoke today with President Xi to offer good wishes to the Chinese people for Lunar New Year. I also shared concerns about Beijing’s economic practices, human rights abuses, and coercion of Taiwan. I told him I will work with China when it benefits the American people. The risk isn't that we do too much when it comes to a COVID relief package — it's that we don't do enough.\n\nWe have to go big. This afternoon, I’m visiting the @DeptofDefense and delivering remarks to our service members. Tune in. https://t.co/ReOiTXXeDj I’m delivering remarks on our Administration’s response to the coup in Burma. Tune in. https://t.co/GV9xYrUcNV We’re facing an economic crisis caused by a public health crisis — and we need bold action to address both. That’s why I’m urging Congress to pass the American Rescue Plan. https://t.co/jnmtVFVIlk Let me be clear: No one should lose their home in the middle of this pandemic. Congress needs to pass the American Rescue Plan to extend the ban on evictions and foreclosures and help millions of Americans keep a roof over their head. https://t.co/hJucMQjTxr This afternoon, I met with business leaders from across the country to discuss the state of our economy and the American Rescue Plan. I’m confident that by working together, we’ll get the economy growing again and get the American people back on their feet. https://t.co/0SmUe0lUxh The most sacred obligation our government has is to properly prepare and equip our troops when we send them into war — and to care for them when they return home. I know @DenisMcDonough will work to fulfill that obligation every single day as our Secretary of Veterans Affairs. https://t.co/rw8WWImrTo We can’t stand by as millions of Americans struggle to put food on the table. Congress needs to immediately pass the American Rescue Plan to extend and invest in critical food programs. https://t.co/GksnfKJ5si Now is the time for a big, bold COVID relief package that will change the course of the pandemic and jumpstart our economy. The American people agree. https://t.co/BSbswr6x1R There’s so much more work to be done, but we’ve been able to increase vaccine distribution by 28% in the first three weeks alone. We won’t rest until we make vaccines available to every American. https://t.co/qeDBSX6CJN Launching a national vaccination program to quickly and equitably vaccinate America — that’s the American Rescue Plan. https://t.co/DY3JvuXhuY I know a lot of folks out there are losing hope, so I want to make one thing clear: I’m going to act as fast as I can to get Americans the relief they so desperately need. https://t.co/4gohgWCeEx Lawrence — Thank you for your service to our nation and for continuing to serve as an example of what we can all do to protect our fellow Americans. https://t.co/9CthQA36gH Funding 100,000 public health workers to contain COVID-19 and vaccinate America — that’s the American Rescue Plan. https://t.co/rLYxmxRQE7 At sites across the country, folks are hard at work vaccinating their communities. And this afternoon, @VP Harris and I are virtually touring a COVID-19 vaccination site in Glendale, Arizona. Tune in. https://t.co/gwAz6SqBWk Making vaccines free and accessible for every American — that’s the American Rescue Plan. https://t.co/5GpH0VYWIE We don’t have a second to waste when it comes to delivering the American people the relief they desperately need. I’m calling on Congress to act quickly and pass the American Rescue Plan. Congratulations to the Tampa Bay Buccaneers on their #SuperBowl victory — a team whose season was a story of resilience, reinvention, and grit. Every year service members around the world gather to watch the Super Bowl — and tonight, I called into watch parties in Kabul and on the USS Nimitz to thank them for their service. We are forever in debt to those who sacrifice so much to keep us safe. https://t.co/kVmVm8BekS For your family, for your neighbors, for your country — wear a mask. Everyone who wants a vaccine should be able to get one free of charge. The American Rescue Plan will make that a reality. From using the Defense Production Act to contain COVID-19 to taking action to reunite families separated at the border — it was another busy week. https://t.co/Z4DYMvWUvQ RT @FLOTUS: Don’t forget to mask up – even when you’re out walking your dog. (P.S. – Champ and Major agree!) https://t.co/Ovedz4CdiQ If I have to choose between getting help right now to Americans who are hurting and getting bogged down in a lengthy negotiation — it’s an easy choice.\n\nI'm going to help the American people who are hurting. Last year, Michele lost her job because of the pandemic. I recently gave her a call to hear her story and discuss how my American Rescue Plan will help families like hers. https://t.co/SAqM2GytPf Second full week is in the books. https://t.co/PaTyszWFFU We can reduce suffering in this country.\nWe can put people back to work.\nWe can gain control of this virus.\n\nCongress needs to pass the American Rescue Plan to get it done. This morning, I met with House Democratic leaders to discuss the American Rescue Plan. As I said during the meeting: this isn’t just about numbers, it’s about people’s lives. Folks are really hurting, and we need to move quickly to deliver the relief they need. https://t.co/QeyfbX05Ha The Family and Medical Leave Act has helped many Americans take time off to care for themselves and their families, but it leaves far too many people forced to choose between a paycheck and caregiving. This has to change.\n\nWe need a national paid family and medical leave program. America is back. Diplomacy is back. https://t.co/03dFPQyYjw People are hurting across the country, and today’s jobs report made that clear. Tune in as I discuss the state of our economy and the need for the American Rescue Plan. https://t.co/JmFqJvPL8z This afternoon, I stopped by the State Department to meet with staff and thank them for their service to our nation. With their help, the United States will again lead not just by the example of our power, but by the power of our example. https://t.co/0VyLgrMIAX The fight against cancer is personal for my family, like it is for millions. But I’m confident that with the strength of dedicated scientists and researchers, tireless health care workers, and brave families like yours, we’ll win this fight once and for all. #WorldCancerDay I know folks are wondering how we’ll vaccinate America and get life back to normal — so we had Dr. Fauci answer those important questions and much more. https://t.co/5EB1aQ5Pmp This afternoon, I’m visiting the @StateDept and delivering remarks on America’s role in the world. Tune in. https://t.co/zWG3UETxGX Finishing the job of delivering $2,000 in direct relief to the hardest-hit Americans — that’s the American Rescue Plan. https://t.co/eWP0Dg4cuR Extending the moratorium on evictions and foreclosures to help countless Americans keep a roof over their head — that’s the American Rescue Plan. https://t.co/Xbviqqr47w Every American deserves the dignity and respect that comes with the right to union organize and collectively bargain. The policy of our government is to encourage union organizing, and employers should ensure their workers have a free and fair choice to join a union. Tonight, the House took an important step toward passing a COVID relief package and getting help to Americans who need it most. I’m grateful for @SpeakerPelosi’s continued leadership as we work to get this pandemic under control and build our economy back better. This morning, I met with a group of Democratic Senators to discuss the American Rescue Plan and how we emerge from the crises we face. One thing is clear: we all agree that now is the time for big, bold action to change the course of the pandemic and begin economic recovery. https://t.co/jmDQB67Jbf Let me be clear: The risk in this moment isn’t that we do too much — it’s that we don’t do enough. Congress must pass the American Rescue Plan to change the course of this pandemic and start our economic recovery. Officer Brian Sicknick was a hero who died in the line of duty defending our democracy and the citadel of liberty itself. To his family and loved ones, I know no words can dull the pain of this moment, but know Jill and I and the entire nation join you in mourning his loss. https://t.co/hH0Da0NIkQ History made. Congratulations, @SecretaryPete — now let’s get to work building our nation’s infrastructure back better, creating good-paying, union jobs, and addressing the climate crisis. https://t.co/DMAa9lxFrj A Cuban refugee, Secretary Mayorkas understands to his core the importance of welcoming those seeking safety and a better life. I look forward to working with him at the Department of Homeland Security to keep Americans safe and live up to our values as a nation. https://t.co/p9NHU4SypD No one should lose their home in the middle of this pandemic. My American Rescue Plan will extend the moratorium on evictions and foreclosures and provide emergency relief to those who need it. It’s simple: We are stronger when we welcome immigrants — not shut them out. https://t.co/aF43c65cDI Families belong together. Period. https://t.co/5xWHGQ2Mk2 To meet the moment and crises we’re facing, my American Rescue Plan will help contain the virus, deliver direct relief to hardest hit Americans, and dig us out of this economic crisis. https://t.co/XiC9rqSL1N I promised immediate action and I kept my word. https://t.co/QzTUmCEuZg Each and every generation of immigrants has made our nation stronger — our diversity is one of our greatest strengths. Today, I’ll take action to rebuild and strengthen our immigration system. It’s long past time we raise the minimum wage to $15 an hour. The American Rescue Plan will get it done. We will be judged for how we resolve the cascading crises of our era.\n \nWill we rise to the occasion? Will we master this rare and difficult hour? Will we meet our obligations and pass along a new and better world for our children?\n \nI believe we must and I believe we will. https://t.co/DcKyw3yO0r We’ve never fully lived up to the founding principles of this nation, but our Administration is committed to finishing the work left undone. It’s long past time to confront deep racial inequities and systemic racism and fulfill the promise of America for all. #BlackHistoryMonth Hardworking Americans need help and they need it now. That’s why I’m calling on Congress to immediately pass my American Rescue Plan that will deliver direct relief, extend unemployment insurance, help folks put food on the table and keep a roof over their heads, and more. We’re facing an economic crisis brought on by a public health crisis, and we need urgent action to combat both. My American Rescue Plan will dig us out of the depths of these crises and put our nation on a path to build back better. Grateful for the short commute on days like these. https://t.co/unUej4WhpB In order to get America vaccinated, we need more:\n\n- Places for people to get vaccinated\n- Medical teams to get shots into arms\n- Vaccine supply and to get it out the door as soon as possible\n\nMy American Rescue Plan provides the necessary funding to get it done. The sooner that we get our kids and educators back in the classroom, the sooner parents can go back to work — but we need the funding to do it. My American Rescue Plan will deliver much-needed support to our nation’s schools to help them reopen and operate safely. Millions of Americans, through no fault of their own, have lost the dignity and respect that comes with a job and a paycheck. My American Rescue Plan will extend unemployment insurance, ensuring folks can count on the checks continuing to be there in the middle of this crisis. Yesterday, I visited Walter Reed for the first time as president to thank our frontline workers and members of our armed forces. Selfless, humble, and dedicated to service — these folks truly represent the best of America. https://t.co/PaSwO6Np3P Over the last 10 days, I’ve taken action on:\n\n- COVID-19\n- The economy\n- Climate change\n- Racial equity\n- Immigration\n- Health care \n- LGBTQ+ rights\n\nAnd I’m just getting started. $600 is simply not enough when you have to choose between paying your rent and putting food on the table. That’s why my American Rescue Plan finishes the job of getting $2,000 to folks who need it most. Wear a mask. Save lives. As Treasury Secretary @JanetYellen said during today’s meeting, the price of doing nothing when it comes to economic relief is too high. Congress must act quickly and pass the American Rescue Plan to deliver relief and help dig us out of this crisis. https://t.co/5phSmHHnbp RT @VP: Cicely Tyson broke barriers and paved the way for so many. She inspired the world with her art, activism, and altruism. Cicely, tha… RT @VP: Get vaccinated. Save lives. https://t.co/5ZNXerlmIJ Together, we shall write an American story of hope, not fear. Of unity, not division. Of light, not darkness. Today, I issued a Presidential Memorandum to protect and expand access to reproductive health care. I am fully committed to protecting women’s health here at home and around the world. This afternoon, I took action to restore and strengthen Americans’ access to quality, affordable health care. The issue is personal to me — and now more than ever, I’m committed to ensuring everyone has access to the care they need. https://t.co/2tFsLc7DW7 Today’s actions are the first step in ensuring every American has access to quality, affordable health care. https://t.co/Csj6nQxc9m I believe every American deserves the peace of mind that comes with having access to quality, affordable health care. That’s why today, I’ll take action to strengthen Americans’ access to care. To overcome the challenges we face as a nation requires that most elusive of things in a democracy: Unity. https://t.co/TYulZakoDV RT @VP: Congratulations to our new Secretary of State, Antony Blinken. @SecBlinken will revitalize American diplomacy, advance our values i… When I think of climate change I think of jobs. We're going to tackle the climate crisis and create good-paying, union jobs at the same time. https://t.co/2VXwVmp7QZ One week down. https://t.co/yxrkWAXlkL Science will always guide my Administration. Tackling climate change will take every lever and agency of the federal government. That's why I've launched a whole-of-government approach to deal with the crisis. Today, we join with the world to commemorate International Holocaust Remembrance Day. We must never forget the truth of what happened across Europe or brush aside the horrors inflicted on our fellow humans because of the doctrines of hatred and division. https://t.co/nXvfDeQ0Gy I set ambitious goals of achieving a carbon pollution-free power sector by 2035 and net-zero emissions by 2050. Today, I took bold action to advance those goals. This afternoon, I’ll be taking action to meet the climate crisis with the urgency it demands. Tune in. https://t.co/TaCmltDZ6X RT @WHCOVIDResponse: Tune in as the COVID-19 Response Team hosts the first of regular briefings featuring our public health experts: Dr. An… We have no time to waste when it comes to tackling the threat of climate change. That’s why today, I’ll be taking action to address the climate crisis with the urgency science demands. It’s been a busy first week of calls with foreign leaders, and yesterday I spoke with NATO Secretary General @JensStoltenberg. I reiterated my strong commitment to NATO and to working together to tackle the shared challenges we face. https://t.co/rXhP8m5QvO The fact is systemic racism touches every facet of American life, and everyone — no matter your race or ethnicity — benefits when we build a more equitable America. No one should be profiteering off of our criminal justice system. That’s why today, I ordered the Department of Justice to end the use of private prisons by the federal government. RT @VP: Today I swore in @JanetYellen as @USTreasury Secretary. Secretary Yellen is a trailblazer, whose deep commitment to working familie… We’re less than a week in, but my Administration is already hard at work fighting to contain COVID-19. Tune in as I give an update on our efforts. https://t.co/VXcC4mimQH Today’s actions are an important first step when it comes to advancing racial equity and fulfilling the promise of our nation. https://t.co/PNVu1JGpiv This afternoon, I’ll be taking action to advance racial equity for Americans who have been underserved and left behind for far too long. Tune in. https://t.co/1W3cHLeBMf America has never lived up to its founding promise of equality for all, but we’ve never stopped trying. Today, I’ll take action to advance racial equity and push us closer to that more perfect union we’ve always strived to be. It's simple: When we spend taxpayer money, we should use it to buy products made in America and support jobs here at home. My Buy American Executive Order does just that. https://t.co/N6mZU6lBi5 RT @WhiteHouse: Because of the action President Biden took today, Shawn Skelly and countless other transgender service members will be able… I spoke today with German Chancellor Merkel, conveying my commitment to multilateralism, the transatlantic alliance, and close coordination with allies on the range of global challenges from COVID-19 and climate change to China and Russia. The first Black and South Asian American woman Vice President swearing in the first Black Secretary of Defense.\n \nHistory. https://t.co/SolGqpF4Qb I believe there’s no greater economic engine in the world than the hard work and ingenuity of the American people. Today’s Buy American Executive Order will invest in the future of American industry and ensure workers are treated with the dignity and respect they deserve. https://t.co/WzaMJgDCNW This afternoon, I’m taking action to ensure the future is made in America by all of America’s workers. Tune in. https://t.co/zyGtHwqFmj RT @FLOTUS: Champ and Major have joined us in the White House! 💕🐾 https://t.co/R035YnavVo Today, I repealed the discriminatory ban on transgender people serving in the military. It’s simple: America is safer when everyone qualified to serve can do so openly and with pride. Across the country, far too many businesses are on the brink of closing their doors due to the crises we face. They need urgent relief — that's why today, I'll be taking action to support them and their workers. Can confirm it’s chocolate chip. https://t.co/8pUXRmfTRK I gave you my word as a Biden — and I kept that word. https://t.co/MdpmoTvTXT Dreamers are Americans — and I want them to know they have an advocate and ally with me in the White House. That's why I took immediate action to fortify DACA. We’re facing a historic moment in our nation’s history — one that requires bold and swift action. That’s why this week, I took historic action to deliver relief to American families and address the challenges we face. We will get through this, together. https://t.co/W03wlb2m8o Each time Henry Aaron rounded the bases, he wasn’t just chasing a record, he was helping us chase a better version of ourselves — melting away the ice of bigotry to show that we can be better as a nation. He was an American hero. God bless, Henry “Hank” Aaron. Federal employees have dedicated their careers to serving the American people — and they are worthy of the utmost dignity and respect. Today, I took action to improve the wages, benefits, and bargaining rights of federal workers and contractors. Hardworking Americans need help and they need it now. That's why today, I took action to provide relief to those who are struggling across the country. I know times are tough, but help is on the way. https://t.co/BVi3b6NoBv This afternoon, I’ll be taking action to provide much-needed relief to communities and small businesses impacted by COVID-19. Tune in. https://t.co/VCXSO3ZRh9 Today, I signed H.R. 335 into law, clearing the way for Lloyd Austin to serve as the next Secretary of Defense. I look forward to working with him to lead our military, revitalize our alliances, and ensure the safety of the American people. https://t.co/joPIeG1pWN As we mark the 48th anniversary of Roe v. Wade, now is the time to rededicate ourselves to the work ahead. From codifying Roe to eliminating maternal and infant health disparities, our Administration is committed to ensuring everyone has access to the health care they need. I’m grateful for the Senate’s continued bipartisanship and swift confirmation of Lloyd Austin. His confirmation is historic — and there’s no question that he’s the right person to lead the @DeptofDefense at this moment. With unity, we can do great things. https://t.co/BMCgyZkdH1 We will get this virus under control. https://t.co/59iC1nyR0N I give you my word: I will always level with you.\n\nI will defend the Constitution, our democracy, and America.\n\nAnd I will give my all in your service thinking not of power, but of possibilities. https://t.co/8fbFUjzVZu America is back at the table. https://t.co/IXYa9HHXeF I’ve worked with Director Haines for over a decade – and I look forward to working with her in the years ahead. The nation is safer with Avril on the watch. https://t.co/JTKU47SyFj Equity is at the core of our COVID-19 response. That's why today, I signed an executive order to establish the COVID-19 Health Equity Task Force, protect those most at risk, and address racial and other disparities. Democracy has prevailed. https://t.co/dnx9HBD0zT Today, I announced my COVID-19 National Action Plan. We're mounting an aggressive, coordinated, equitable, and professional response to get the virus under control as soon as possible. RT @WHCOVIDResponse: We are building a partnership with the American people to confront COVID-19.\n \nA partnership rooted in transparency an… This afternoon, I’ll be taking decisive action to change the course of this pandemic and get COVID-19 under control. Tune in. https://t.co/v23hhuTktf Yesterday, I took the first of many steps toward building our nation back better. https://t.co/2o1S9pTjzk We don't have a second to waste when it comes to getting this virus under control. That's why today, I'll be signing executive actions to expand testing, administer vaccines, and safely reopen schools and businesses. RT @FLOTUS: Every four years, we celebrate the beginning of a new administration.  It’s the start of a bright new chapter. A time for us al… Wearing masks isn't a partisan issue — it's a patriotic act that can save countless lives. That's why I signed an executive order today issuing a mask mandate on federal property. It's time to mask up, America. I applaud the Senate for putting partisanship aside to prioritize our national security. Americans can rest easy tonight knowing Avril Haines has been confirmed as the Director of National Intelligence. We're back in the Paris Climate Agreement. RT @WhiteHouse: Tune in for the first press briefing of the Biden-Harris Administration with Press Secretary Jen Psaki. https://t.co/psa19e… After taking the oath of office this afternoon, I got right to work taking action to:\n\n- Control the pandemic\n- Provide economic relief\n- Tackle climate change\n- Advance racial equity The time to move forward is now. https://t.co/IrUUu0bxGO There is no time to waste when it comes to tackling the crises we face. That's why today, I am heading to the Oval Office to get right to work delivering bold action and immediate relief for American families. Folks — This will be the account for my official duties as President. At 12:01 PM on January 20th, it will become @POTUS. Until then, I'll be using @JoeBiden. And while you're here, follow @FLOTUSBiden @SenKamalaHarris @SecondGentleman and @Transition46.", "bag_of_tweets": ["Equal Pay Day is a big deal around here. Right, @mPinoe and @100purcent? https://t.co/wYdJkp9QYa", "Equal pay for equal work is common sense — and it’s long overdue. As president, I’m committed to closing the gap once and for all. https://t.co/nJkEWCyCoo", "It doesn’t matter if you’re an electrician, an accountant, or part of the best soccer team in the world — the pay gap is real. But with Megan, Margaret, and countless others leading the fight for equal pay, I’m confident we’ll finally close it. https://t.co/lJOTc0HeVB", "The pandemic and economic crisis have greatly impacted women and families — but with the American Rescue Plan, help is here. The law increases the Child Tax Credit, cuts child poverty in half, expands child care assistance, and provides funding to open K-8 schools.", "66% of the tax breaks in the American Rescue Plan go to folks making $90,000 or less.\n\nThe top one percent get zero. https://t.co/vPMlFSCDmS", "We’ve got to rebuild the middle class and ensure every worker is treated with dignity and respect. As the new Secretary of Labor, @SecMartyWalsh will play a crucial role in that effort. I know he’ll fight every single day for the hardworking Americans who make our country run. https://t.co/0uK8KhKvsf", "To mark Equal Pay Day, @FLOTUS and I are hosting an event with Megan Rapinoe, Margaret Purce, and members of the U.S. Soccer Women’s National Team. Tune in. https://t.co/fZBqoOLBv5", "Ambassador Bill Burns has dealt with many of the most complex global challenges we face — and approached them with honesty, integrity, and skill. I know that’s exactly how he’ll lead the CIA every single day. https://t.co/iFryKAcuk6", "This morning, I signed the SAVE LIVES Act into law — expanding the VA’s authority and allowing them to provide COVID-19 vaccinations to all veterans, their spouses, and caregivers. https://t.co/oAO3GCsnEX", ".@SecBecerra and I share the belief that health care is a right for all — not a privilege for the few. I look forward to working with him to ensure every single American has access to the quality, affordable care they deserve. https://t.co/zOU9kbOBt5", "This afternoon in Columbus, I met with Ohio Governor Mike DeWine to discuss our coordinated response to COVID-19. The virus doesn’t just impact red or blue states — it impacts us all — and I’m committed to working across the aisle to defeat it. https://t.co/ghcDxs6FW3", "Before the Affordable Care Act, the radiation oncology department at the James Cancer Center treated 60-70 patients a day. Now, they’re able to treat close to 300. The hospital is a source of hope for the community and an example of what America can achieve if we work together. https://t.co/SlzUyCDRjo", "When we opened a special enrollment period for health insurance in February, over 200,000 Americans gained coverage in the first two weeks. Today, we’re extending the enrollment period to August 15.\n \nHead to https://t.co/gRX1fGFEzj to find a plan that works best for you. https://t.co/Xv4Or7PsYu", "When it comes to trade, we need to pursue policies that put American businesses, workers, and communities first. There’s no one better qualified to carry out that mission than @AmbassadorTai. https://t.co/F53pYgOzSa", "I believe every American deserves access to quality, affordable health care. The American Rescue Plan is working to make that a reality by increasing subsidies, lowering costs, and expanding coverage for people across the country. Help is here.", "Small businesses are the backbone of communities across the country, but far too many are struggling to keep their doors open. I know @SBAIsabel will work every day to support our small businesses and help them emerge stronger from this pandemic. https://t.co/h70O31LV7K", "RT @WhiteHouse: President Biden believes every single American deserves access to quality, affordable health care. Here’s a breakdown of ho…", "Today marks eleven years since the Affordable Care Act was signed into law. The landmark legislation has changed countless lives, but our work isn’t done. I’m committed to ensuring every American has the peace of mind that comes with quality, affordable health care. https://t.co/mOlb6nWUTF", "The Affordable Care Act was signed into law eleven years ago today. Tune in as I deliver remarks on the anniversary and how we’re expanding Americans’ access to health care. https://t.co/fAs34Zd7Zy", "We can ban assault weapons and high-capacity magazines.\n \nWe can close loopholes in our gun background check system.\n \nThis is not a partisan issue — it’s an American issue that will save lives. Congress needs to act.", "There is a great deal we do not know about the killer, his motivation, and other critical aspects about this shooting, but know this: as president, I will use all the resources at my disposal to keep the American people safe.", "Jill and I are devastated for the lives that have been shattered by gun violence in Colorado. Less than a week after the horrific murders in Georgia, another American city is scarred by a senseless attack. Our hearts go out to the victims, their families, and the survivors.", "Less than a week after the horrific murders of eight people in Georgia, another American city has been scarred by gun violence. Tune in as I deliver remarks. https://t.co/yU7ReRfFko", "The faster America gets vaccinated, the sooner we can return to our lives with our loved ones. That’s why I’m proud to share we set another record this weekend with 6 million shots reported administered across the country.", "There are simply some core values and beliefs that should bring us together as Americans. One of them is standing together against racism — the ugly poison that has long haunted and plagued our nation.\n\nIt’s up to all of us to give hate no safe harbor in America.", "Under the American Rescue Plan, the typical family of four is getting a $5,600 check. That money helps folks keep a roof over their head and put food on the table. Help is here.", "Mask up, America. https://t.co/6yaUHYmzWC", "They really know how to make an Irishman feel special at the White House. https://t.co/NDSGJt5fI1", "Progress. https://t.co/kFuqPoFcFZ", "The CDC represents the best of this nation. Brilliant minds. Deep faith in science. And a strong commitment to public service. On Friday, Vice President Harris and I stopped by to thank them for all the work they do. https://t.co/mzVMqxz1YK", "In two months, we’ve:\n\n- Passed the American Rescue Plan\n- Administered 100 million shots\n- Rejoined the Paris Agreement\n- Reversed the transgender military and Muslim bans\n- Expanded access to health care and voting\n- Acted to end private prisons\n\nAnd we're just getting started.", "Two months down. https://t.co/jlWNtLYYqo", "Like countless people across the country, Jocelyn and her family are struggling to make ends meet. I gave her a call to discuss how the American Rescue Plan will help. https://t.co/AIJIIevlgS", "This afternoon, Vice President Harris and I sat down with Asian American leaders in Atlanta. It was a heart-wrenching meeting that made clear the urgent work that lies ahead. We must come together as one America, stand against hate, and root out racism wherever we find it. https://t.co/Z2DOKdxklZ", "Silence is complicity — and we cannot be complicit.\n\nWe have to speak out. We have to act. https://t.co/zJXEoKXOMm", "Too many Asian Americans have been waking up each morning this past year fearing for their safety and the safety of their loved ones. https://t.co/LI3iLREoMr", "For all the good that laws can do, we have to change our hearts.\n\nHate can have no safe harbor in America.\n\nIt must stop — and it’s on all of us together to make it stop.", "Words have consequences. \n\nIt’s called the coronavirus.\n\nFull stop.", "I just finished meeting with Asian American leaders here in Atlanta. Tune in as I deliver remarks on our meeting, the ongoing attacks against the community, and more. https://t.co/0m2stIOWZ4", "During my first week, I signed a memorandum to condemn and combat racism against the AAPI community. Now, it’s time for Congress to take further action with the COVID-19 Hate Crimes Act — because everyone deserves to live their lives with safety, dignity, and respect.", "This afternoon, Vice President Harris and I are meeting with Asian American leaders in Atlanta, Georgia. We’re going to discuss the ongoing attacks against the community and how we move forward. It’s up to all of us to root out racism and give hate no safe harbor in America.", "Tomorrow, we’re going to hit a big milestone: 100 million shots in people’s arms. https://t.co/Cj65chMhJJ", "Before I took office, I set an ambitious goal of administering 100 million shots in my first 100 days as president.\n\nI’m proud to say that we’ll reach that goal tomorrow, just 58 days in.", "History.\n\nCongratulations, @SecDebHaaland. There’s no one better suited to steward our nation’s public lands. https://t.co/cdVN7ksqFK", "No one should lose their home in the middle of a pandemic. The American Rescue Plan provides over $40 billion in relief to help families pay their rent, stay in their homes, and keep a roof over their heads. Help is here.", "RT @WhiteHouse: Across the country, millions of Americans are struggling to keep a roof over their head. Here’s a breakdown of how the Amer…", "As the new EPA Administrator, @EPAMichaelRegan will play a crucial role in our whole-of-government initiative to combat the climate crisis. I look forward to working with him to ensure every American has clean air and water while also delivering environmental justice. https://t.co/qEt0P0cSRv", "In honor of the victims of the senseless shootings in Atlanta, I’ve ordered the flag of the United States to be flown at half-staff. To the loved ones of those we lost on Tuesday, know the nation mourns with you. https://t.co/abZDiisNAf", "Our Administration has been working around the clock to ramp up vaccinations – and this afternoon, I’ll be giving an update on our progress. Tune in. https://t.co/Z10gZ7YSSe", "We can't keep waiting. I urge Congress to come together to find long term solutions to our entire immigration system so we can create a safe, orderly, and humane immigration system, tackle the root causes of migration and legalize the undocumented population in the United States.", "Undocumented farm workers feed America and have been on the frontlines of this pandemic making sure we have food on our tables. The Farm Workforce Modernization Act provides a path to citizenship for these essential workers. I urge Congress to pass the bill.", "It’s long past time Congress gives a path to citizenship for Dreamers and TPS recipients who strengthen our country and call our nation home. I strongly support the Dream and Promise Act and urge all members of the House to vote yes.", "Had to wear my lucky tie for St. Patrick’s Day. https://t.co/PqJqwglJQP", "Writing and passing the Violence Against Women Act is one of the accomplishments of which I’m most proud. While we have made significant progress, there is still much work to do. I’m grateful the House voted to strengthen and renew the law — and I urge the Senate to do the same.", "Jill and I are keeping everyone impacted by the shootings in Atlanta in our prayers. We don’t yet know the motive, but what we do know is that the Asian-American community is feeling enormous pain tonight. The recent attacks against the community are un-American. They must stop.", "To celebrate St. Patrick’s Day and to reaffirm our nation’s close partnership with Ireland, I hosted a bilateral meeting with Prime Minister Micheál Martin. We’re committed to working together to combat COVID-19, address global challenges, and increase our shared prosperity. https://t.co/U2CZB3Hzhv", "As a descendant of the Blewitts from Mayo County and the Finnegans from County Louth, I’m wishing everyone a happy St. Patrick’s Day. https://t.co/nbYHPO8nE7", "Thank you Brayden, Jessica, and Michael for your beautiful reading of W. B. Yeats’ work.\n\nWhen I was a kid and working to overcome my stutter, I would recite Yeats’ words in the mirror. I’m glad they’ve helped you as well, Brayden, and I’m incredibly proud of how far you’ve come. https://t.co/QkD0JgCdJ1", "As we celebrate St. Patrick’s Day, I’m reminded of my trip to Ireland in 2016 as vice president. The partnership between our two nations is historic and strong — and I look forward to renewing our bond during this afternoon’s bilateral meeting with Prime Minister Micheál Martin. https://t.co/XdILGVzv5L", "Across the country, Black- and Brown-owned small businesses have been devastated by the pandemic. Today, I stopped by Smith Flooring, a Black-owned union shop in Pennsylvania, to discuss how the American Rescue Plan will help them and countless other small business owners. https://t.co/jkbQ2UUePi", "The American Rescue Plan is investing over $60 billion to help small businesses keep their doors open. To every small business owner out there, know help is here. https://t.co/NBKUdaRIoq", "The last year has been tough for small businesses across the country, but with the American Rescue Plan, help is here. We’re investing over $60 billion to help small businesses keep their doors open and emerge from this pandemic stronger.", "With nearly 6 million doses administered over the weekend and over 2 million doses administered yesterday — we’re vaccinating the country at a record-breaking pace.\n\nThat’s progress — and there’s a lot more to come.", "That’s the American Rescue Plan. https://t.co/7pE89mi4C6", "RT @FLOTUS: With the American Rescue Plan, #HelpIsHere. We’re going to open schools—and we’re going to do it safely. https://t.co/GuN0RlY4e5", "The American Rescue Plan will deliver direct payments to 85% of American households — and checks have already started going out to folks across the country. Let me know if you’ve received yours by sharing below.", "Help is here — and sooner than many ever thought possible. https://t.co/4ntwrpxAXn", "The American Rescue Plan is already doing what it was designed to do: Making a difference in people’s lives. https://t.co/EVgY5QCnmA", "In the next ten days, we will reach two giant goals:\n\n- One hundred million shots in people’s arms.\n- One hundred million checks in people’s pockets.\n\nThat’s real progress.", "We’re working around the clock to ramp up vaccinations and get direct relief out to Americans. Tune in as I provide an update and discuss the implementation of the American Rescue Plan. https://t.co/4x796pyMfB", "If we all do our part, this country will be vaccinated soon, our economy will be on the mend, our kids will be back in school, and we will have proven once again that this country can do anything.\n\nAfter a long, dark year there are better days ahead.", "Last week, I signed the American Rescue Plan into law and direct payments have begun going out to folks across the country. I know there are a lot of questions about how to receive yours, so we put together this guide: https://t.co/p7m1hVmTCb", "Last week was a big week for our Administration, we:\n\n- Passed the American Rescue Plan\n- Began sending out stimulus checks\n- Announced every adult will be eligible for a vaccine by May 1\n- Averaged more than 2 million vaccinations per day", "The American Rescue Plan’s direct payments have begun going out. Help is here.", "Since taking office, I’ve been calling leaders from around the world with a simple message: America is back. We’re going to rebuild our international alliances and tackle the shared challenges we face. https://t.co/NC5zWmA3Ed", "Breonna Taylor’s death was a tragedy, a blow to her family, her community, and America. As we continue to mourn her, we must press ahead to pass meaningful police reform in Congress. I remain committed to signing a landmark reform bill into law.", "To everyone out there who’s hurting or struggling to get by: help is here. https://t.co/fkME0yMmBK", "W.S. Jenks &amp; Son is a historic hardware store in Washington, D.C. — and like countless other small businesses across the country, they’re hurting because of this pandemic. I stopped by this week to check in. https://t.co/3Dh6SAQwZ9", "51 days down. https://t.co/DGsWdxEkz1", "The American Rescue Plan’s $1,400 checks will start going out as early as this weekend. Here’s how folks plan to use theirs: https://t.co/z2TSMNX4XI", "Delivering for the American people. https://t.co/bLhvrsTnkR", "This morning, I met virtually with the Quad in the first multilateral summit I’ve hosted as president. The United States, Japan, India, and Australia are committed to working together to tackle the shared challenges we face and to secure a free and open Indo-Pacific region. https://t.co/m0AYfsEx6z", "This afternoon, I’m joining Vice President Harris and members of Congress to celebrate the passage of the American Rescue Plan. Tune in. https://t.co/qBHFdRxqle", "This is the United States of America. There’s nothing we can’t do if we do it together. https://t.co/ekS0dPRnUR", "Attorney General Merrick Garland is a man of impeccable character. I know he’ll work every day to reaffirm the integrity and independence of the Justice Department and build a more equitable justice system for all Americans. https://t.co/naJQDK49jm", "Over a year ago no one could’ve imagined what we were all about to live through, but now we are coming through it. It’s a shared experience that binds us together as a nation. https://t.co/CT7gl3p5KD", "Tonight, I am announcing that I will direct all states, tribes, and territories to make all adult Americans eligible for the vaccine no later than May 1. https://t.co/FEIDCFLORb", "In the loss, we’ve seen how much there is to gain — in appreciation, respect, and gratitude.\n\nFinding light in the darkness is a very American thing to do. https://t.co/MSTpMEPEBe", "If we all do our part, then by July 4th, there’s a good chance folks will be able to gather with family and close friends to celebrate Independence Day.", "Finally, we need every American to do their part — including getting vaccinated when it’s their turn and helping family, friends, and neighbors get vaccinated as well.", "Fourth, we will issue further guidance on what you can and cannot do once fully vaccinated — to lessen the confusion, keep people safe, and encourage more people to get vaccinated.", "Third, with the passage of the American Rescue Plan, and my announcement last month of a plan to vaccinate teachers and school staff, we can accelerate the massive nationwide effort to reopen our schools safely.", "Second, when every adult is eligible in May, we will launch new tools to make it easier for you to find a vaccine — including a website that will help you find a place to get a vaccination near you.", "First, I’m directing all states, tribes, and territories to make all adult Americans eligible for the vaccine no later than May 1.", "For all of you asking when things will get back to normal, here is the truth: The only way to get our lives back — and to get our economy back on track — is to beat the virus.\n\nHere are the next steps we’re taking to make that happen:", "We are proving once again something I have said time and time again: It is never a good bet to bet against the American people.\n\nThis nation is coming back.", "I will use every power I have and I will not relent until we beat this virus.\n\nBut I need you. I need every American to do their part.\n\nGet vaccinated when it’s your turn, keep washing your hands, stay socially distanced, and keep wearing masks.", "All adult Americans will be eligible to get the vaccine no later than May 1.", "Before I took office, I set a bold goal of administering 100 million shots in my first 100 days.\n\nI’m proud to share that we’re well ahead of schedule and on track to reach that goal by day 60.", "One year ago today, everything stopped because of COVID-19. Tune in as I deliver remarks on the progress we’ve made and the path that lies ahead. https://t.co/ffCllTxkLr", "Tune in tonight at 8 PM ET as we look back at the last year and discuss the road ahead. https://t.co/XUYJUs4QNb", "The last year has tested us in unimaginable ways, but there is light at the end of the tunnel.\n\nWe will emerge stronger. https://t.co/FJUnsVoKXX", "Before I took office, I promised you that help was on the way. Today, I signed the American Rescue Plan into law, and can officially say: help is here. https://t.co/uuEZAkGloz", "Vaccines are on the way. https://t.co/pIpvSqI4sx", "This afternoon, I’m signing the American Rescue Plan – a historic bill that will turn the page on this pandemic and jumpstart our economy. Tune in. https://t.co/hJiZRDFyAC", "One in four adults in the U.S. has received their first COVID-19 vaccine — and we’re now leading the world in vaccinations.\n\nThat’s progress.", "RT @WhiteHouse: Congress has officially passed President Biden’s American Rescue Plan. How will this help you and your family? Head to http…", "During World War II, one of our country’s slogans was “Together, we can do it.” And companies took it to heart.\n\nWe need that same kind of wartime effort today.\n\nThat’s why we brought together Johnson &amp; Johnson, Merck, and the federal government to defeat COVID-19. https://t.co/wz2vxn6Bj1", "Housing should be a right — not a privilege. But far too many people are struggling to keep a roof over their head. I look forward to working with @SecFudge to help renters and homeowners get through this crisis and ensure every American has access to quality, affordable housing. https://t.co/GjfQS2H7tO", "Checks are on the way. https://t.co/rtODFOZ4OX", "To Speaker Pelosi, Majority Leader Schumer, and everyone who voted for the American Rescue Plan — thank you. This is a historic victory for the American people. https://t.co/RPZ04GTDOg", "This afternoon, I’m hosting an event with the CEOs of Johnson &amp; Johnson and Merck to discuss our historic partnership to produce more COVID-19 vaccines. Tune in. https://t.co/S3OxWrOUgt", "Help is here — and brighter days lie ahead. https://t.co/HSp8rPBxty", "Help is here. https://t.co/urZCiigeS1", "Keep the faith, folks. We will get through this. https://t.co/AMlyu4pU6M", "From launching community vaccination centers around the country to deploying mobile vaccination units to hard-to-reach areas — the American Rescue Plan will help vaccinate America quickly and equitably. https://t.co/j05KQLPti0", "I want every child to know that this is what vice presidents and generals in the United States Armed Forces look like. https://t.co/y2OFL1z29r", "I believe every worker deserves a free and fair choice to join a union — and the PRO Act will bring us closer to that reality. I urge Congress to send it to my desk so we can summon a new wave of worker power and create an economy that works for everyone.", "The American people need direct economic relief — and they need it now.", "On this #InternationalWomensDay, I signed two executive orders to establish the White House Gender Policy Council and ensure education free from sexual violence. As president, I’m committed to uplifting the rights of women and girls in the U.S. and around the world. https://t.co/60lYI8qhR8", "Our Administration will honor the visionary women — known and unknown — who have helped build this country. And we’ll be guided by the belief our nation is at its best when there are endless possibilities for all women and girls. #WomensHistoryMonth https://t.co/pJ9byDgc59", "This afternoon, I’m delivering remarks on International Women’s Day with Vice President Harris, Defense Secretary Austin, and two Combatant Commander nominees. Tune in. https://t.co/MJgoHWrTGI", "Women’s history is American history — and world history. On #InternationalWomensDay, we celebrate the achievements, contributions, and progress of women and girls — and recommit ourselves to the cause of equity and equality for women around the world.", "We can contain this virus.\nWe can vaccinate America.\nWe can begin to return to our normal lives.\n\nCongress needs to pass the American Rescue Plan to get it done.", "RT @CDCgov: #COVID19 vaccines are effective at protecting you from getting sick. Based on what we know, people who have been fully vaccinat…", "From rolling out the Johnson &amp; Johnson vaccine to securing enough doses for every American by the end of May — last week was a big week, but we still have further to go. Please keep wearing masks, stay socially distanced, and get vaccinated when it’s your turn.", "On this 56th anniversary of Bloody Sunday, I signed an executive order to promote voting access. The right to vote is sacred and fundamental – and this is just the beginning of our work to ensure every American can freely exercise that right. https://t.co/wKQq640FPB", "It’s time we pass the John Lewis Voting Rights Act and ensure every eligible American can make their voice heard at the ballot box.", "The legacy of Selma is that while nothing can stop free people from exercising their most sacred power as citizens, there are those who will do anything they can to take that power away. As we reflect on the anniversary of Bloody Sunday, we must stay focused on the work ahead. https://t.co/DDn1LFfqmi", "What will the American Rescue Plan do for you? https://t.co/ck7UYW0lvv", "The House should pass the American Rescue Plan quickly to get checks out the door starting this month. https://t.co/ru9PPhSxyT", "By passing the American Rescue Plan, we will have proved that this government can still do what it most has to do: Improve the lives of the American people. https://t.co/wB3XBnn8RD", "I want to thank all of the Senators who worked so hard to reach a compromise and voted to pass the American Rescue Plan.\n\nIt wasn’t easy — but it was so desperately needed. https://t.co/YPTJggPCyB", "When I was elected, I said we were going to get the government out of the business of battling on Twitter and back into the business of delivering for the American people. \n \nPassing the American Rescue Plan will do that.", "When I took office, I promised help was on the way. Thanks to @SenSchumer and Senate Democrats, we've taken one more giant step forward in delivering on that promise.\n\nI hope the American Rescue Plan receives a quick passage in the House so it can be sent to my desk to be signed.", "Today, the Senate passed the American Rescue Plan – bringing us one step closer to delivering much-needed relief. Tune in as I deliver remarks. https://t.co/wX8fXNGYqi", "Tammy — and countless other Americans across the country — are struggling to get by, through no fault of their own. I gave her a call to discuss how the American Rescue Plan will deliver direct relief and help her family get through this crisis. https://t.co/kZR2aSd9HQ", "Another week in the books. https://t.co/Q2u8fSS86Q", "Everyone in America who wants the COVID-19 vaccine should be able to get it free of charge.\n\nThe American Rescue Plan will make that a reality.", "Native American communities have been hit hard by COVID-19. But thanks to the Indian Health Service and strong partnerships with Tribal governments, organizations, and urban Indian groups, more than 500,000 vaccines have already been administered with more on the way.", "This afternoon, I’m sitting down with folks to listen to their stories and discuss how they’ll benefit from the American Rescue Plan. Tune in. https://t.co/6vsbnZieWj", "With the Johnson &amp; Johnson vaccine, we now have a third safe and effective COVID-19 vaccine being administered across the country. I’m grateful these folks are stepping up and getting vaccinated — and I encourage every American to do the same when it’s their turn. https://t.co/n6Xs8TyS6C", "This afternoon, I brought together a bipartisan group of lawmakers from the House Transportation and Infrastructure Committee. We’re committed to working across the aisle to build modern and sustainable infrastructure that once again leads the world. https://t.co/QpqhwPjVxJ", "Across the country, countless Americans are struggling through no fault of their own. The American Rescue Plan will provide direct relief and a bridge to the other side of this crisis. https://t.co/euMVlIx9Vi", "RT @WhiteHouse: Press Secretary Jen Psaki is back again to answer your questions. This week, she’s discussing everything from our vaccinati…", "The right to vote is sacred and fundamental — and H.R. 1 is urgently needed to protect that right, to safeguard the integrity of our elections, and to repair and strengthen our democracy. I look forward to signing it into law after it has passed through the legislative process.", "Building back better every day. https://t.co/dBxbxPsOLf", "We’re facing an economic crisis caused by a public health crisis, and @SecRaimondo will play a crucial role in helping us recover. I look forward to working with her to support American businesses and workers, create good-paying jobs, and build an economy that works for all. https://t.co/iryDfCcawF", "The fight against cancer is personal for me, like it is for so many Americans. And I’m committed to doing everything I can as president to end cancer as we know it. This afternoon, I brought together a bipartisan group of lawmakers to discuss how we can get it done. https://t.co/i6JUXGvHdI", "Your actions can save lives and change the course of this pandemic. https://t.co/zol6DDqDi1", "A plan for all of America — supported by the majority of America. https://t.co/Rmd2DCaDNP", "On February 15, my Administration opened a special enrollment period for health insurance and more than 200,000 Americans have already gotten covered. It’s an encouraging sign, but we have further to go. Head to https://t.co/gRX1fGFEzj before May 15 to get covered.", "An educator is leading the Department of Education once again. I look forward to working with @SecCardona to safely reopen our nation’s schools and ensure every child has access to a quality education. https://t.co/5wO9lpR4ct", "I’m grateful House and Senate Democrats introduced legislation today to strengthen our background check system. I helped pass the Brady background check bill as a Senator — and I’m committed to continuing that work and passing common-sense gun safety reforms as president.", "The countless leaders who turned to Vernon Jordan for guidance did so because when he spoke, you could hear in his rich baritone the belief in an America that was capable of becoming an ever-more perfect union. It was a journey he’d lived. https://t.co/wE4A16zAUy", "The bottom line is this: We need the American Rescue Plan now. https://t.co/Aop0DoFych", "The fight against COVID-19 is a war-time effort — and to win, we need breakthrough approaches. Today, I’m announcing we’re bringing together Johnson &amp; Johnson, Merck, and the full power of the federal government to ramp up vaccine production and defeat this virus. https://t.co/knu1PIXOtl", "Today, I am directing every state to prioritize educators for vaccination. We want every educator, school staff member, and child-care worker to receive at least one shot by the end of this month.\n\nIt’s time to treat in-person learning like the essential service that it is.", "Three weeks ago, I announced we would have enough vaccine supply for all Americans by the end of July.\n\nNow, with our efforts to ramp up production, we will have enough vaccines for every American by the end of May.", "This afternoon, I’m announcing a new partnership between Johnson &amp; Johnson and Merck that will increase vaccine production and help defeat COVID-19. Tune in. https://t.co/e4WfFa4DXd", "The fact is that $600 is not enough. The Senate needs to pass the American Rescue Plan and finish the job of delivering $2,000 in direct relief.", "I had a great meeting with Mexican President Andrés Manuel López Obrador this afternoon. From migration to climate change — we’re committed to working closely together to make progress on the challenges we face. https://t.co/M7T6CF8Fel", "Wash your hands.\nStay socially distanced.\nWear a mask.\nGet vaccinated when it’s your turn.\n\nDespite our progress, we can’t let our guard down.", "During Women's History Month, let us honor the accomplished and visionary women who have helped build our country. And let us pay tribute to the trailblazers from the recent and distant past for building a nation of endless possibilities for all of its women and girls.", "This afternoon, I’ll be meeting virtually with Mexican President Andrés Manuel López Obrador. The U.S.-Mexico relationship is broad and deep — and I look forward to ushering in a new phase of cooperation and progress.", "No child in America should go hungry. The American Rescue Plan will extend and invest in critical food programs to help ensure every family gets the food they need. https://t.co/DlKYDM6bOM", "On Saturday, the FDA issued an emergency use authorization for the Johnson &amp; Johnson COVID-19 vaccine. Dr. Fauci sat down to answer your questions. https://t.co/KJQ2SrVclp", "RT @WhiteHouse: To celebrate Black History Month, the St. Augustine Gospel Choir was invited to the White House for a special performance.…", "Workers in Alabama – and all across America – are voting on whether to organize a union in their workplace. It’s a vitally important choice – one that should be made without intimidation or threats by employers.\n\nEvery worker should have a free and fair choice to join a union. https://t.co/2lzbyyii1g", "The more people that get vaccinated, the faster we will beat this pandemic. That’s why one of my first goals is to administer 100 million COVID-19 vaccine shots in our first 100 days.\n \nI’m proud to say we’re over halfway to our goal and weeks ahead of schedule.", "After a rigorous scientific review process, the FDA issued an emergency use authorization for a third safe and effective COVID-19 vaccine. It’s exciting news for all Americans, and an encouraging development in our efforts to bring an end to the crisis. https://t.co/jVRjdRie9V", "Yesterday I traveled to Texas to visit an emergency operations center, food bank, and vaccination site. Each stop represented our nation at its best—people coming together to help their fellow Americans. It’s a reminder that there’s nothing we can’t do when we do it together. https://t.co/6WgPbD0PCx", "Thank you to @SpeakerPelosi for your leadership and everyone in the House who supported the American Rescue Plan. Now, the bill heads to the Senate and there’s no time to waste. If we act quickly and decisively, we can finally get ahead of this virus and get our economy moving.", "This morning, I’m speaking about the American Rescue Plan. Tune in. https://t.co/8N5AZ8Y6H6", "Because of the selfless dedication of nurses like Erica — and countless other folks across the country — we’re going to beat this virus. I called to thank her and discuss what we can do to help. https://t.co/XRfNDgwNkX", "RT @WhiteHouse: Tune in as the President, First Lady, Vice President, and Second Gentleman host a White House Black History Month Celebrati…", "This week, our Administration opened a new vaccination site at NRG Stadium in Houston, Texas. Tune in as I visit the site and deliver remarks. https://t.co/YD92UXX2sM", "If there is one message that needs to cut through it’s this: the vaccines are safe and effective. https://t.co/S2eA24D9Gj", "The week before I took office, 6 million COVID-19 vaccine shots were administered.\n\nThis coming week, our Administration will likely administer over 12 million shots.\n\nThat’s double the pace in just six weeks.", "COVID-19 vaccinations are up and cases and hospitalizations are down, but let me be clear: now is not the time to relax. https://t.co/oUuHCXl3s7", "Transgender rights are human rights — and the House made that clear today by passing the Equality Act. \n\nNow it's time for the Senate to do the same.", "I launched a whole-of-government initiative to tackle the climate crisis during my first weeks in office — and as the Secretary of Energy, @SecGranholm will play a crucial role. I look forward to working with her to create good-paying, union jobs and build a clean energy economy. https://t.co/dVIGBtUBvE", "This afternoon, we’re reaching a big milestone: 50 million COVID-19 vaccine doses administered since I took office. Tune in as we mark our progress and chart the path forward. https://t.co/uJ27tu7LxB", "I believe every American deserves the peace of mind that comes with quality, affordable health care. That’s why we opened a special health insurance enrollment period to ensure everyone can get covered. Head to https://t.co/gRX1fGFEzj to find the plan that works best for you.", "I am pleased that the House will vote next week on the George Floyd Justice in Policing Act. I encourage the House to pass it. Following Senate consideration, I hope to be able to sign into law a landmark police reform bill.", "Yesterday, I met with a bipartisan group of House and Senate members to discuss U.S. supply chains and then took executive action to strengthen them. The American people should never face shortages when it comes to the goods and services they rely on. https://t.co/y342c3AX5C", "I’ve known Secretary Vilsack for years, and there’s no doubt the USDA is in good hands with him at the helm once again. I look forward to working with him to support America’s farmers, tackle hunger and climate change, and rebuild our rural economies. https://t.co/d0niNqQOsU", "Wearing a mask is one of the most important things we can do to protect others and change the course of this pandemic. That’s why over the next few weeks, we’re delivering over 25 million masks to community health centers, food pantries, and soup kitchens across the country.", "Just over a month ago, America had no real plan to vaccinate most of the country. That changed the moment we took office. https://t.co/RPEf6Ce16b", "This afternoon, I’m signing an executive order to create more resilient and secure supply chains for critical and essential goods. Tune in. https://t.co/7LyrNa38H5", "Ambassador Linda Thomas-Greenfield is right: Diplomacy is back and it’s at the center of our foreign policy. I look forward to working with her to rebuild our alliances, take on global challenges, and restore America’s leadership on the world stage. https://t.co/I2Uj4C8lio", "When I met with Prime Minister @JustinTrudeau in 2016, I said the world needed more leaders like him. A lot has changed since then, but my sentiment remains the same. I can’t wait to see what we accomplish in the years ahead. https://t.co/jRJH7fpm2R", "Small businesses need relief, but many were muscled out of the way by big companies last year. That’s why starting today, we’re opening an exclusive 14-day loan application period for businesses and nonprofits with fewer than 20 employees.\n\nLearn more: https://t.co/JlLS2kNadK https://t.co/Nn36MTol8E", "Prime Minister @JustinTrudeau is right — it’ll take teamwork to tackle the biggest challenges our nations face. That’s why we’re announcing the U.S.-Canada Partnership Roadmap — a blueprint for the whole-of-government relationship between our two nations. https://t.co/9GlS9QcTWA", "We have been fighting this pandemic for far too long, but we have to resist becoming numb to the sorrow. Because in order to heal, we must remember. https://t.co/FOmIfI2JX6", "It was great to be back with Prime Minister @JustinTrudeau this afternoon. Whether it’s combating COVID-19 or tackling the climate crisis — we’re committed to working side-by-side on the biggest challenges we face. https://t.co/eNm6uX6Bec", "I just met with Prime Minister @JustinTrudeau – my first bilateral meeting as president. Tune in as we discuss the meeting and how we’ll tackle the shared challenges we face. https://t.co/0vASM6lIKb", "I look forward to joining Prime Minister @JustinTrudeau this afternoon for my first bilateral meeting as president. The United States and Canada share a unique bond and close friendship — and I’m committed to strengthening our partnership in the years ahead.", "Not many people have Oval Office walk-in privileges. Happy to report that these two are on the list. https://t.co/DRfr9hMsyW", "This afternoon, I’m holding a roundtable discussion with Domestic Policy Advisor @AmbRice46 and Black essential workers. Tune in. https://t.co/8OEtENIJuf", "A Black man should be able to go for a jog without fearing for his life. Today, we remember Ahmaud Arbery’s life and we dedicate ourselves to making this country safer for people of color.", "We will get through this, I promise you. https://t.co/dtmi4C9WsM", "We often hear people described as ordinary Americans. There's no such thing. There's nothing ordinary about them. The people we’ve lost to COVID-19 were extraordinary.", "To heal, we must remember. https://t.co/LVfAnRpHlW", "It's not Democrats and Republicans who are dying from the virus. It's our fellow Americans. It's our neighbors, our friends, our mothers, our fathers, our sons, our daughters, husbands, wives.\n\nWe have to fight this together, as one people, as the United States.", "Today, our nation passed another grim milestone in this pandemic: 500,000 lives lost. Join us as we honor their memory. https://t.co/AzUzXoVUgb", "500,000 lives lost to COVID-19. It’s an unfathomable number, but each one represents a family that will never again be whole. To those who have lost loved ones: I know no words can numb the pain, but I hope you find some solace in knowing the nation grieves with you.", "I know folks have a lot of questions about COVID-19 mutations, our vaccination progress, and much more. @CDCDirector Dr. Walensky sat down to provide answers. https://t.co/K0Rlkc4Ti2", "Small businesses are the backbone of our communities – and far too many are on the brink of closing their doors. Tune in as I announce additional steps we’re taking to support them. https://t.co/BHhUV3nzng", "If there’s one message I want to cut through to everyone in this country, it’s this: The vaccines are safe.\n\nFor yourself, your family, your community, our country — take the vaccine when it’s your turn and available. That’s how we’ll beat this pandemic.", "When I said I would listen to the scientists as president, I meant it. https://t.co/VeC7qGESID", "Today would have been Congressman John Lewis’ 81st birthday. While my dear friend may no longer be with us, his life and legacy provide an eternal moral compass on which direction to march. May we carry on his mission in the fight for justice and equality for all.", "On Friday, I visited Kalamazoo, Michigan to tour a Pfizer manufacturing plant. I had an opportunity to see the COVID-19 vaccine production process up close and thank the workers for their tireless efforts – because of their hard work we’re going to beat COVID-19. https://t.co/tt0vYyskE9", "Overcoming the COVID-19 pandemic needs to be our top priority as a nation. I joined members of my team to talk about our plan to get it done. https://t.co/LIiwFrwKRc", "One month down. https://t.co/mlpa5Pl9JQ", "The federal government has sent generators, blankets, water, and other critical supplies to Texas, but local organizations on the ground need help. Here’s how you can pitch in. https://t.co/gp6PaGe87G", "On Tuesday, I’ll be meeting virtually with @CanadianPM Justin Trudeau. I look forward to renewing the strong friendship between the United States and Canada and working to tackle the shared challenges we face.", "On Thursday, I joined the world and watched in awe as the Perseverance Rover touched down on the surface of Mars. It was a remarkable feat — one made possible by the hard work and ingenuity of the team at @NASA.\n\nI called to congratulate them on their historic landing. https://t.co/0Qjs2MDk4J", "I know a lot of folks have questions about when you’ll get your stimulus checks and how we’re increasing vaccine production, so I sat down to answer a few. https://t.co/tzAt5zeUnN", "This afternoon, I’m touring a Pfizer manufacturing site in Kalamazoo, Michigan, and delivering remarks on our efforts to vaccinate America. Tune in. https://t.co/UY2yHNjaXv", "This morning, I met with my fellow G7 leaders for the first time as president. I made clear that America is back at the table — and I’m committed to working with them to control the pandemic and address the shared challenges we face. https://t.co/TM1zAhWiPY", "Today, America is officially back in the Paris Climate Agreement. Let’s get to work.", "As vice president, I worked closely with America’s democratic partners to advance our shared vision and values. As president, I’ll work with our partners and allies to defeat COVID-19 and advance peace and shared prosperity around the world.\n\nAmerica is back. https://t.co/ZcrgonHh2N", "This morning, I’m delivering remarks on the partnership between Europe and the United States at a special event hosted by the Munich Security Conference. Tune in. https://t.co/QDhEw6oytK", "The Equality Act provides long overdue federal civil rights protections for LGBTQ+ Americans, preventing discrimination in our housing, education, public services, and lending systems. I urge Congress to swiftly pass this historic legislation.", "Tonight, I called Governor Greg Abbott to discuss the ongoing situation in Texas and identify ways we can support the state’s recovery from this storm. I made clear to the Governor that I’ll work relentlessly to get his state what they need. https://t.co/UBwH8DMep2", "The truth is the last four years have exacerbated our already broken immigration system. The legislation I sent to Congress will bring about much-needed reform and restore humanity to our policies. I look forward to working with Congress to get it done. https://t.co/35U0J3NgQr", "Wear a mask.\nSocially distance.\nWash your hands.\n \nYour actions matter. https://t.co/taGajV5D4P", "When it comes to a COVID relief package, we have to go big. https://t.co/DJalq00JmF", "Congratulations to NASA and everyone whose hard work made Perseverance’s historic landing possible. Today proved once again that with the power of science and American ingenuity, nothing is beyond the realm of possibility. https://t.co/NzSxW6nw4k", "Texas — Hundreds of warming centers are open across the state. Head to https://t.co/hPJawls8rQ to find the center nearest you or call 211 for additional assistance.", "Jill and I are keeping Texas, Oklahoma, and other impacted states in our prayers. I’ve declared states of emergency, authorized FEMA to provide generators and supplies, and am ready to fulfill additional requests. Please heed the instructions of local officials and stay safe.", "Today I announced our Administration will:\n\n- Expand COVID-19 testing for schools and underserved communities\n- Increase manufacturing of testing supplies\n- Increase genome sequencing to track emerging strains\n\nThese steps will expand testing and help get the virus under control.", "As I’ve said throughout my whole career: The middle class built this country, and labor built the middle class. This afternoon, I met with labor leaders to discuss the American Rescue Plan and how we’ll rebuild our infrastructure—creating good-paying, union jobs in the process. https://t.co/3dyv23GvLq", "Today, I join Christians around the world in observing Ash Wednesday. As we enter the season of Lent, we know this moment of repentance, reflection, and renewal comes in the midst of a painful winter. Let us look with hope and anticipation toward Easter and brighter days ahead.", "As I said at last night’s CNN Town Hall, I’ll always level with the American people and tell it to you straight. The road ahead will be tough and the crises we face are daunting, but I’m confident that if we come together and act as one nation, we will overcome them. https://t.co/ZqUpA1jray", "I spoke today with @IsraeliPM Netanyahu and affirmed the United States’ steadfast commitment to our ally Israel’s security. Our teams are in constant touch to strengthen U.S.-Israel strategic cooperation on all regional security issues, including Iran.", "By the end of July, we will have enough doses to vaccinate every American. https://t.co/Wzmopn85RE", "The next four years, I want to make sure all the news is the American people. https://t.co/AINJ2ieDgL", "I know COVID-19 can be scary, but I want every kid out there to know things are going to be okay. https://t.co/wZIxHeNAFa", "RT @PressSec: I’ve gotten a ton of great questions on Twitter since our last video, so I took some time to answer a few more here. We cover…", "Tonight, I’ll be answering questions at my first town hall since taking office. Make sure to tune in to CNN at 9 PM ET / 8 PM CT to watch. https://t.co/tMjDVuNwXM", "I’m on my way to Wisconsin for tonight’s CNN Town Hall. See you soon, Milwaukee! https://t.co/7TwheCPqgy", "Starting this week, our Administration is:\n\n- Increasing weekly vaccine shipments to states to 13.5 million doses — a 57% increase from when I took office.\n- Doubling our direct shipments to local pharmacies.\n\nWe’re working hard to get America vaccinated quickly.", "Mask up, America. https://t.co/hkVFUh8v6K", "Before I took office, I set a big goal of administering 100 million shots in the first 100 days. With the progress we’re making I believe we’ll not only reach that, we’ll break it.", "Health care is a right — and I will do everything in my power to ensure that all Americans have access to quality, affordable care. Starting today, we’re opening a special enrollment period for health insurance. Head to https://t.co/gRX1fGFEzj to get covered.", "On this Presidents’ Day, I promise you as your president, my whole soul is in the work ahead of us. And if we do it together, as one nation, we will not fail. America never has. https://t.co/m8QGdWezch", "The love of my life and the life of my love. Happy Valentine’s Day, Jilly. https://t.co/LjLLIjvP1C", "Three years ago today, a lone gunman took the lives of 14 students and three educators in Parkland, Florida. In seconds, the lives of dozens of families were changed forever. As we mourn with the Parkland community, we mourn for all who have lost loved ones to gun violence. https://t.co/k050oDHXIi", "Congratulations, Prime Minister Mario Draghi. I look forward to working closely with you to deepen our strong bilateral relationship, cooperate during your leadership of the G20, and address global challenges from COVID to climate change.", "From COVID-19 to the economic crisis, we’re facing enormous challenges — and faith-based and community organizations are essential to addressing them. That’s why today, I reestablished the White House Office of Faith-Based and Neighborhood Partnerships. Let’s get to work.", "America’s governors and mayors understand the fight against COVID-19 and the urgency of another relief bill. Yesterday, I met with a bipartisan group of them to discuss the American Rescue Plan and how we can work together to meet the crises we face. https://t.co/QpJqaKQFuM", "Samir and Neal own NaanStop in Atlanta, Georgia — and like many small businesses around the country, they’ve been hit hard by the COVID-19 pandemic. I gave them a call to hear their story and talk about how the American Rescue Plan will help businesses like theirs. https://t.co/9FjudVGsMJ", "I know the last year has been difficult and painful for all of us. I hope Jill’s Valentine’s Day message helped brighten your day. https://t.co/jdEFMSDefm", "It’s also a goal we can meet if we follow the science. Today, the Centers for Disease Control and Prevention has provided the best available scientific evidence on how to reopen schools safely. https://t.co/IQVWO6iT0B", "Before taking office, I set a goal of opening most K-8 schools by the end of my first 100 days. It’s a national imperative—one that can only be achieved if Congress provides states and communities the resources they need to get it done safely through the American Rescue Plan.", "Earlier this week, Vice President Harris and I took a virtual tour of a vaccination site in Arizona. Because of the hard work of these folks — and countless others across the country — we’re going to beat this virus once and for all. https://t.co/xekXB967h5", "From the Biden family to yours, happy #LunarNewYear. We wish you happiness, health, and prosperity in the Year of the Ox. https://t.co/sOHEzdFH0D", "I see enormous pain in this country. A lot of folks are out of work. A lot of folks are going hungry, staring at the ceiling at night wondering, “What am I going to do tomorrow?” That’s why I’m urging Congress to pass the American Rescue Plan and deliver much-needed relief. https://t.co/nROFWbZ44V", "To everyone at the NIH — all the doctors, scientists, and researchers fighting this pandemic and saving lives — thank you from the bottom of my heart. You're truly the best America has to offer. https://t.co/lLpdZSLdjX", "When I took office three weeks ago, America didn’t have a plan or enough supplies to vaccinate most of the country. But my team got right to work, and as of today, we’ve increased weekly vaccine shipments by nearly 30% and purchased enough vaccines to vaccinate all Americans.", "If we don’t take action, we won’t return to full employment until 2025.\n\nIf we pass the American Rescue Plan, we’ll return to full employment next year.\n\nThe choice couldn’t be clearer. https://t.co/Y4w9wzxgyh", "This morning, I met with a bipartisan group of Senators to discuss the need to invest in modern and sustainable infrastructure. This isn’t a partisan issue — and I’m committed to working across the aisle to deliver infrastructure and jobs to communities across the country. https://t.co/H2sdrRWndn", "This afternoon, I’m visiting the National Institutes of Health and delivering remarks to staff. Tune in. https://t.co/dyIijetOaP", "No child should grow up in poverty. The American Rescue Plan will expand the child tax credit and cut the child poverty rate in half. https://t.co/cMw8wCY2N6", "We can reduce suffering in this country, put people back to work, and gain control of this virus.\n\nThat’s what the American Rescue Plan will do. https://t.co/vFxjLCbpj9", "This afternoon, I visited the Department of Defense to meet with officials and deliver remarks to the incredible service members and civilians. Serving as Commander in Chief is the honor of my lifetime and an enormous responsibility — one that I promise I will never take lightly. https://t.co/u6JLUEnDs8", "I spoke today with President Xi to offer good wishes to the Chinese people for Lunar New Year. I also shared concerns about Beijing’s economic practices, human rights abuses, and coercion of Taiwan. I told him I will work with China when it benefits the American people.", "The risk isn't that we do too much when it comes to a COVID relief package — it's that we don't do enough.\n\nWe have to go big.", "This afternoon, I’m visiting the @DeptofDefense and delivering remarks to our service members. Tune in. https://t.co/ReOiTXXeDj", "I’m delivering remarks on our Administration’s response to the coup in Burma. Tune in. https://t.co/GV9xYrUcNV", "We’re facing an economic crisis caused by a public health crisis — and we need bold action to address both. That’s why I’m urging Congress to pass the American Rescue Plan. https://t.co/jnmtVFVIlk", "Let me be clear: No one should lose their home in the middle of this pandemic. Congress needs to pass the American Rescue Plan to extend the ban on evictions and foreclosures and help millions of Americans keep a roof over their head. https://t.co/hJucMQjTxr", "This afternoon, I met with business leaders from across the country to discuss the state of our economy and the American Rescue Plan. I’m confident that by working together, we’ll get the economy growing again and get the American people back on their feet. https://t.co/0SmUe0lUxh", "The most sacred obligation our government has is to properly prepare and equip our troops when we send them into war — and to care for them when they return home. I know @DenisMcDonough will work to fulfill that obligation every single day as our Secretary of Veterans Affairs. https://t.co/rw8WWImrTo", "We can’t stand by as millions of Americans struggle to put food on the table. Congress needs to immediately pass the American Rescue Plan to extend and invest in critical food programs. https://t.co/GksnfKJ5si", "Now is the time for a big, bold COVID relief package that will change the course of the pandemic and jumpstart our economy. The American people agree. https://t.co/BSbswr6x1R", "There’s so much more work to be done, but we’ve been able to increase vaccine distribution by 28% in the first three weeks alone. We won’t rest until we make vaccines available to every American. https://t.co/qeDBSX6CJN", "Launching a national vaccination program to quickly and equitably vaccinate America — that’s the American Rescue Plan. https://t.co/DY3JvuXhuY", "I know a lot of folks out there are losing hope, so I want to make one thing clear: I’m going to act as fast as I can to get Americans the relief they so desperately need. https://t.co/4gohgWCeEx", "Lawrence — Thank you for your service to our nation and for continuing to serve as an example of what we can all do to protect our fellow Americans. https://t.co/9CthQA36gH", "Funding 100,000 public health workers to contain COVID-19 and vaccinate America — that’s the American Rescue Plan. https://t.co/rLYxmxRQE7", "At sites across the country, folks are hard at work vaccinating their communities. And this afternoon, @VP Harris and I are virtually touring a COVID-19 vaccination site in Glendale, Arizona. Tune in. https://t.co/gwAz6SqBWk", "Making vaccines free and accessible for every American — that’s the American Rescue Plan. https://t.co/5GpH0VYWIE", "We don’t have a second to waste when it comes to delivering the American people the relief they desperately need. I’m calling on Congress to act quickly and pass the American Rescue Plan.", "Congratulations to the Tampa Bay Buccaneers on their #SuperBowl victory — a team whose season was a story of resilience, reinvention, and grit.", "Every year service members around the world gather to watch the Super Bowl — and tonight, I called into watch parties in Kabul and on the USS Nimitz to thank them for their service. We are forever in debt to those who sacrifice so much to keep us safe. https://t.co/kVmVm8BekS", "For your family, for your neighbors, for your country — wear a mask.", "Everyone who wants a vaccine should be able to get one free of charge. The American Rescue Plan will make that a reality.", "From using the Defense Production Act to contain COVID-19 to taking action to reunite families separated at the border — it was another busy week. https://t.co/Z4DYMvWUvQ", "RT @FLOTUS: Don’t forget to mask up – even when you’re out walking your dog. (P.S. – Champ and Major agree!) https://t.co/Ovedz4CdiQ", "If I have to choose between getting help right now to Americans who are hurting and getting bogged down in a lengthy negotiation — it’s an easy choice.\n\nI'm going to help the American people who are hurting.", "Last year, Michele lost her job because of the pandemic. I recently gave her a call to hear her story and discuss how my American Rescue Plan will help families like hers. https://t.co/SAqM2GytPf", "Second full week is in the books. https://t.co/PaTyszWFFU", "We can reduce suffering in this country.\nWe can put people back to work.\nWe can gain control of this virus.\n\nCongress needs to pass the American Rescue Plan to get it done.", "This morning, I met with House Democratic leaders to discuss the American Rescue Plan. As I said during the meeting: this isn’t just about numbers, it’s about people’s lives. Folks are really hurting, and we need to move quickly to deliver the relief they need. https://t.co/QeyfbX05Ha", "The Family and Medical Leave Act has helped many Americans take time off to care for themselves and their families, but it leaves far too many people forced to choose between a paycheck and caregiving. This has to change.\n\nWe need a national paid family and medical leave program.", "America is back. Diplomacy is back. https://t.co/03dFPQyYjw", "People are hurting across the country, and today’s jobs report made that clear. Tune in as I discuss the state of our economy and the need for the American Rescue Plan. https://t.co/JmFqJvPL8z", "This afternoon, I stopped by the State Department to meet with staff and thank them for their service to our nation. With their help, the United States will again lead not just by the example of our power, but by the power of our example. https://t.co/0VyLgrMIAX", "The fight against cancer is personal for my family, like it is for millions. But I’m confident that with the strength of dedicated scientists and researchers, tireless health care workers, and brave families like yours, we’ll win this fight once and for all. #WorldCancerDay", "I know folks are wondering how we’ll vaccinate America and get life back to normal — so we had Dr. Fauci answer those important questions and much more. https://t.co/5EB1aQ5Pmp", "This afternoon, I’m visiting the @StateDept and delivering remarks on America’s role in the world. Tune in. https://t.co/zWG3UETxGX", "Finishing the job of delivering $2,000 in direct relief to the hardest-hit Americans — that’s the American Rescue Plan. https://t.co/eWP0Dg4cuR", "Extending the moratorium on evictions and foreclosures to help countless Americans keep a roof over their head — that’s the American Rescue Plan. https://t.co/Xbviqqr47w", "Every American deserves the dignity and respect that comes with the right to union organize and collectively bargain. The policy of our government is to encourage union organizing, and employers should ensure their workers have a free and fair choice to join a union.", "Tonight, the House took an important step toward passing a COVID relief package and getting help to Americans who need it most. I’m grateful for @SpeakerPelosi’s continued leadership as we work to get this pandemic under control and build our economy back better.", "This morning, I met with a group of Democratic Senators to discuss the American Rescue Plan and how we emerge from the crises we face. One thing is clear: we all agree that now is the time for big, bold action to change the course of the pandemic and begin economic recovery. https://t.co/jmDQB67Jbf", "Let me be clear: The risk in this moment isn’t that we do too much — it’s that we don’t do enough. Congress must pass the American Rescue Plan to change the course of this pandemic and start our economic recovery.", "Officer Brian Sicknick was a hero who died in the line of duty defending our democracy and the citadel of liberty itself. To his family and loved ones, I know no words can dull the pain of this moment, but know Jill and I and the entire nation join you in mourning his loss. https://t.co/hH0Da0NIkQ", "History made. Congratulations, @SecretaryPete — now let’s get to work building our nation’s infrastructure back better, creating good-paying, union jobs, and addressing the climate crisis. https://t.co/DMAa9lxFrj", "A Cuban refugee, Secretary Mayorkas understands to his core the importance of welcoming those seeking safety and a better life. I look forward to working with him at the Department of Homeland Security to keep Americans safe and live up to our values as a nation. https://t.co/p9NHU4SypD", "No one should lose their home in the middle of this pandemic. My American Rescue Plan will extend the moratorium on evictions and foreclosures and provide emergency relief to those who need it.", "It’s simple: We are stronger when we welcome immigrants — not shut them out. https://t.co/aF43c65cDI", "Families belong together. Period. https://t.co/5xWHGQ2Mk2", "To meet the moment and crises we’re facing, my American Rescue Plan will help contain the virus, deliver direct relief to hardest hit Americans, and dig us out of this economic crisis. https://t.co/XiC9rqSL1N", "I promised immediate action and I kept my word. https://t.co/QzTUmCEuZg", "Each and every generation of immigrants has made our nation stronger — our diversity is one of our greatest strengths. Today, I’ll take action to rebuild and strengthen our immigration system.", "It’s long past time we raise the minimum wage to $15 an hour. The American Rescue Plan will get it done.", "We will be judged for how we resolve the cascading crises of our era.\n \nWill we rise to the occasion? Will we master this rare and difficult hour? Will we meet our obligations and pass along a new and better world for our children?\n \nI believe we must and I believe we will. https://t.co/DcKyw3yO0r", "We’ve never fully lived up to the founding principles of this nation, but our Administration is committed to finishing the work left undone. It’s long past time to confront deep racial inequities and systemic racism and fulfill the promise of America for all. #BlackHistoryMonth", "Hardworking Americans need help and they need it now. That’s why I’m calling on Congress to immediately pass my American Rescue Plan that will deliver direct relief, extend unemployment insurance, help folks put food on the table and keep a roof over their heads, and more.", "We’re facing an economic crisis brought on by a public health crisis, and we need urgent action to combat both. My American Rescue Plan will dig us out of the depths of these crises and put our nation on a path to build back better.", "Grateful for the short commute on days like these. https://t.co/unUej4WhpB", "In order to get America vaccinated, we need more:\n\n- Places for people to get vaccinated\n- Medical teams to get shots into arms\n- Vaccine supply and to get it out the door as soon as possible\n\nMy American Rescue Plan provides the necessary funding to get it done.", "The sooner that we get our kids and educators back in the classroom, the sooner parents can go back to work — but we need the funding to do it. My American Rescue Plan will deliver much-needed support to our nation’s schools to help them reopen and operate safely.", "Millions of Americans, through no fault of their own, have lost the dignity and respect that comes with a job and a paycheck. My American Rescue Plan will extend unemployment insurance, ensuring folks can count on the checks continuing to be there in the middle of this crisis.", "Yesterday, I visited Walter Reed for the first time as president to thank our frontline workers and members of our armed forces. Selfless, humble, and dedicated to service — these folks truly represent the best of America. https://t.co/PaSwO6Np3P", "Over the last 10 days, I’ve taken action on:\n\n- COVID-19\n- The economy\n- Climate change\n- Racial equity\n- Immigration\n- Health care \n- LGBTQ+ rights\n\nAnd I’m just getting started.", "$600 is simply not enough when you have to choose between paying your rent and putting food on the table. That’s why my American Rescue Plan finishes the job of getting $2,000 to folks who need it most.", "Wear a mask. Save lives.", "As Treasury Secretary @JanetYellen said during today’s meeting, the price of doing nothing when it comes to economic relief is too high. Congress must act quickly and pass the American Rescue Plan to deliver relief and help dig us out of this crisis. https://t.co/5phSmHHnbp", "RT @VP: Cicely Tyson broke barriers and paved the way for so many. She inspired the world with her art, activism, and altruism. Cicely, tha…", "RT @VP: Get vaccinated. Save lives. https://t.co/5ZNXerlmIJ", "Together, we shall write an American story of hope, not fear. Of unity, not division. Of light, not darkness.", "Today, I issued a Presidential Memorandum to protect and expand access to reproductive health care. I am fully committed to protecting women’s health here at home and around the world.", "This afternoon, I took action to restore and strengthen Americans’ access to quality, affordable health care. The issue is personal to me — and now more than ever, I’m committed to ensuring everyone has access to the care they need. https://t.co/2tFsLc7DW7", "Today’s actions are the first step in ensuring every American has access to quality, affordable health care. https://t.co/Csj6nQxc9m", "I believe every American deserves the peace of mind that comes with having access to quality, affordable health care. That’s why today, I’ll take action to strengthen Americans’ access to care.", "To overcome the challenges we face as a nation requires that most elusive of things in a democracy: Unity. https://t.co/TYulZakoDV", "RT @VP: Congratulations to our new Secretary of State, Antony Blinken. @SecBlinken will revitalize American diplomacy, advance our values i…", "When I think of climate change I think of jobs. We're going to tackle the climate crisis and create good-paying, union jobs at the same time. https://t.co/2VXwVmp7QZ", "One week down. https://t.co/yxrkWAXlkL", "Science will always guide my Administration.", "Tackling climate change will take every lever and agency of the federal government. That's why I've launched a whole-of-government approach to deal with the crisis.", "Today, we join with the world to commemorate International Holocaust Remembrance Day. We must never forget the truth of what happened across Europe or brush aside the horrors inflicted on our fellow humans because of the doctrines of hatred and division. https://t.co/nXvfDeQ0Gy", "I set ambitious goals of achieving a carbon pollution-free power sector by 2035 and net-zero emissions by 2050. Today, I took bold action to advance those goals.", "This afternoon, I’ll be taking action to meet the climate crisis with the urgency it demands. Tune in. https://t.co/TaCmltDZ6X", "RT @WHCOVIDResponse: Tune in as the COVID-19 Response Team hosts the first of regular briefings featuring our public health experts: Dr. An…", "We have no time to waste when it comes to tackling the threat of climate change. That’s why today, I’ll be taking action to address the climate crisis with the urgency science demands.", "It’s been a busy first week of calls with foreign leaders, and yesterday I spoke with NATO Secretary General @JensStoltenberg. I reiterated my strong commitment to NATO and to working together to tackle the shared challenges we face. https://t.co/rXhP8m5QvO", "The fact is systemic racism touches every facet of American life, and everyone — no matter your race or ethnicity — benefits when we build a more equitable America.", "No one should be profiteering off of our criminal justice system. That’s why today, I ordered the Department of Justice to end the use of private prisons by the federal government.", "RT @VP: Today I swore in @JanetYellen as @USTreasury Secretary. Secretary Yellen is a trailblazer, whose deep commitment to working familie…", "We’re less than a week in, but my Administration is already hard at work fighting to contain COVID-19. Tune in as I give an update on our efforts. https://t.co/VXcC4mimQH", "Today’s actions are an important first step when it comes to advancing racial equity and fulfilling the promise of our nation. https://t.co/PNVu1JGpiv", "This afternoon, I’ll be taking action to advance racial equity for Americans who have been underserved and left behind for far too long. Tune in. https://t.co/1W3cHLeBMf", "America has never lived up to its founding promise of equality for all, but we’ve never stopped trying. Today, I’ll take action to advance racial equity and push us closer to that more perfect union we’ve always strived to be.", "It's simple: When we spend taxpayer money, we should use it to buy products made in America and support jobs here at home. My Buy American Executive Order does just that. https://t.co/N6mZU6lBi5", "RT @WhiteHouse: Because of the action President Biden took today, Shawn Skelly and countless other transgender service members will be able…", "I spoke today with German Chancellor Merkel, conveying my commitment to multilateralism, the transatlantic alliance, and close coordination with allies on the range of global challenges from COVID-19 and climate change to China and Russia.", "The first Black and South Asian American woman Vice President swearing in the first Black Secretary of Defense.\n \nHistory. https://t.co/SolGqpF4Qb", "I believe there’s no greater economic engine in the world than the hard work and ingenuity of the American people. Today’s Buy American Executive Order will invest in the future of American industry and ensure workers are treated with the dignity and respect they deserve. https://t.co/WzaMJgDCNW", "This afternoon, I’m taking action to ensure the future is made in America by all of America’s workers. Tune in. https://t.co/zyGtHwqFmj", "RT @FLOTUS: Champ and Major have joined us in the White House! 💕🐾 https://t.co/R035YnavVo", "Today, I repealed the discriminatory ban on transgender people serving in the military. It’s simple: America is safer when everyone qualified to serve can do so openly and with pride.", "Across the country, far too many businesses are on the brink of closing their doors due to the crises we face. They need urgent relief — that's why today, I'll be taking action to support them and their workers.", "Can confirm it’s chocolate chip. https://t.co/8pUXRmfTRK", "I gave you my word as a Biden — and I kept that word. https://t.co/MdpmoTvTXT", "Dreamers are Americans — and I want them to know they have an advocate and ally with me in the White House. That's why I took immediate action to fortify DACA.", "We’re facing a historic moment in our nation’s history — one that requires bold and swift action. That’s why this week, I took historic action to deliver relief to American families and address the challenges we face.", "We will get through this, together. https://t.co/W03wlb2m8o", "Each time Henry Aaron rounded the bases, he wasn’t just chasing a record, he was helping us chase a better version of ourselves — melting away the ice of bigotry to show that we can be better as a nation. He was an American hero. God bless, Henry “Hank” Aaron.", "Federal employees have dedicated their careers to serving the American people — and they are worthy of the utmost dignity and respect. Today, I took action to improve the wages, benefits, and bargaining rights of federal workers and contractors.", "Hardworking Americans need help and they need it now. That's why today, I took action to provide relief to those who are struggling across the country.", "I know times are tough, but help is on the way. https://t.co/BVi3b6NoBv", "This afternoon, I’ll be taking action to provide much-needed relief to communities and small businesses impacted by COVID-19. Tune in. https://t.co/VCXSO3ZRh9", "Today, I signed H.R. 335 into law, clearing the way for Lloyd Austin to serve as the next Secretary of Defense. I look forward to working with him to lead our military, revitalize our alliances, and ensure the safety of the American people. https://t.co/joPIeG1pWN", "As we mark the 48th anniversary of Roe v. Wade, now is the time to rededicate ourselves to the work ahead. From codifying Roe to eliminating maternal and infant health disparities, our Administration is committed to ensuring everyone has access to the health care they need.", "I’m grateful for the Senate’s continued bipartisanship and swift confirmation of Lloyd Austin. His confirmation is historic — and there’s no question that he’s the right person to lead the @DeptofDefense at this moment.", "With unity, we can do great things. https://t.co/BMCgyZkdH1", "We will get this virus under control. https://t.co/59iC1nyR0N", "I give you my word: I will always level with you.\n\nI will defend the Constitution, our democracy, and America.\n\nAnd I will give my all in your service thinking not of power, but of possibilities. https://t.co/8fbFUjzVZu", "America is back at the table. https://t.co/IXYa9HHXeF", "I’ve worked with Director Haines for over a decade – and I look forward to working with her in the years ahead. The nation is safer with Avril on the watch. https://t.co/JTKU47SyFj", "Equity is at the core of our COVID-19 response. That's why today, I signed an executive order to establish the COVID-19 Health Equity Task Force, protect those most at risk, and address racial and other disparities.", "Democracy has prevailed. https://t.co/dnx9HBD0zT", "Today, I announced my COVID-19 National Action Plan. We're mounting an aggressive, coordinated, equitable, and professional response to get the virus under control as soon as possible.", "RT @WHCOVIDResponse: We are building a partnership with the American people to confront COVID-19.\n \nA partnership rooted in transparency an…", "This afternoon, I’ll be taking decisive action to change the course of this pandemic and get COVID-19 under control. Tune in. https://t.co/v23hhuTktf", "Yesterday, I took the first of many steps toward building our nation back better. https://t.co/2o1S9pTjzk", "We don't have a second to waste when it comes to getting this virus under control. That's why today, I'll be signing executive actions to expand testing, administer vaccines, and safely reopen schools and businesses.", "RT @FLOTUS: Every four years, we celebrate the beginning of a new administration.  It’s the start of a bright new chapter. A time for us al…", "Wearing masks isn't a partisan issue — it's a patriotic act that can save countless lives. That's why I signed an executive order today issuing a mask mandate on federal property. It's time to mask up, America.", "I applaud the Senate for putting partisanship aside to prioritize our national security. Americans can rest easy tonight knowing Avril Haines has been confirmed as the Director of National Intelligence.", "We're back in the Paris Climate Agreement.", "RT @WhiteHouse: Tune in for the first press briefing of the Biden-Harris Administration with Press Secretary Jen Psaki. https://t.co/psa19e…", "After taking the oath of office this afternoon, I got right to work taking action to:\n\n- Control the pandemic\n- Provide economic relief\n- Tackle climate change\n- Advance racial equity", "The time to move forward is now. https://t.co/IrUUu0bxGO", "There is no time to waste when it comes to tackling the crises we face. That's why today, I am heading to the Oval Office to get right to work delivering bold action and immediate relief for American families.", "Folks — This will be the account for my official duties as President. At 12:01 PM on January 20th, it will become @POTUS. Until then, I'll be using @JoeBiden. And while you're here, follow @FLOTUSBiden @SenKamalaHarris @SecondGentleman and @Transition46."]}