{"tweets": "Scientists are analyzing a possible link between the coronavirus and tinnitus, the medical term for a constant ringing in the ears. The suicide of Kent Taylor, the founder of the Texas Roadhouse restaurant chain, has drawn attention to the research. https://t.co/FBYmXouVX3 Ask the Ethicist in @NYTmag: “My friends, like me, are Jewish; unlike me, they are children of Holocaust survivors. Should they not feel greater compassion for the suffering of those recent immigrants escaping violence and ethnic cleansing?” https://t.co/W0yOeyMXyg Videos obtained by The Times show how Brian Sicknick, a Capitol Police officer who died after the Jan. 6 riot, was attacked with chemical spray.\nhttps://t.co/nrrp5NoiIn RT @Karan_Singhs: India's farmers want change. Just not the way Mr. Modi wants. @emilyschmall and I report from a village in Punjab, roughl… The shooting in Boulder, Colorado, on Monday brought back memories for Frank DeAngelis, who was the principal of Columbine High School when it was attacked in 1999.\n\n“It’s overwhelming,” he told The New York Times. “Colorado’s been through so much.”\nhttps://t.co/REsp2L8JzF RT @ckoettl: #China is undermining international sanctions by allowing tankers that smuggle oil to #NorthKorea to use its infrastructure &amp;… RT @satariano: A recovering gambling addict shared documents with me that detail how a popular gambling app used data-profiling software on… RT @AndrewDasNYT: It's equal pay day, so expect to hear a lot from the USWNT players today. But here's Rapinoe getting 'LFG' into the Congr… “1-800 Happy Birthday,” an online audio art project, lets people listen to and leave messages for people of color who were killed by the police.\n\nThe project’s founder said it was designed to humanize the victims and give families an opportunity to heal.\nhttps://t.co/Bt9zRf3uRu RT @evanchill: New from Visual Investigations: Videos obtained by The Times show for the first time how U.S. Capitol Police Officer Brian S… In Opinion\n\n“The first two months of the Biden presidency have gone about as well as anyone in a new administration could reasonably hope,” writes @DouthatNYT. “But it’s also possible, already, to see three places where a shadow might fall.”\n\nhttps://t.co/3eJjL7LOxo A stockpile of 29 million doses of AstraZeneca’s Covid-19 vaccine were found languishing in a facility in Italy, further raising tensions between the pharmaceutical company and the EU.\nhttps://t.co/32RuIQjnkD George Segal, who received an Oscar nomination for “Who’s Afraid of Virginia Woolf?” but became known for his roles on TV comedies, died on Tuesday. He was 87.\nhttps://t.co/IhzD29l9kz Tesla will accept Bitcoin as payment for cars in the U.S., Elon Musk, the carmaker’s chief executive, said on Wednesday.\n\nThe company disclosed last month that it had bought $1.5 billion in the digital currency. \n\nhttps://t.co/ude38bHCbl Here's what we know so far about the shooting on Monday at a grocery store in Boulder, Colorado. https://t.co/qZepsVgLnp RT @PatrickKingsley: 👉As things stand, Israel's groundhog election has returned yet another stalemate.\n\n👉With over 90% of votes counted, a… Instead of using data to help problem gamblers like Gregg, critics said, information is used to keep players hooked. Sky Bet declined to comment on the record. https://t.co/nmGTepJAiG https://t.co/usE5yz1Ds8 To a group of gambling addiction experts, data-privacy activists and industry critics in Britain, the documents Gregg obtained and shared with The New York Times offer a warning to countries like the U.S., where similar services are growing rapidly. https://t.co/nmGTepJAiG Sky Bet or its partners had access to Gregg’s financial information, location coordinates and an intimate portrait of his gambling habit. After he stopped gambling, Sky Bet’s data-profiling software labeled him a customer to “win back.” https://t.co/nmGTepJAiG Sky Bet, the most popular gambling app in Britain, compiled extensive records about Gregg, a user who had lost $15,000 during a nine-month betting binge, tracking him in ways he never imagined. https://t.co/MWCdPDMk74 Fourteen people were arrested in Bristol, England, on Tuesday night at a rally to denounce a bill that would create new restrictions for protests and grant broad new powers to the police.\nhttps://t.co/tkbtTH59ad A huge container ship ran aground in the Suez Canal, blocking one of the biggest maritime arteries. More than 100 ships are stuck on either end.\nhttps://t.co/Q1TCNL1hOH Exclusive: New videos obtained by The New York Times show publicly for the first time how Brian Sicknick, the U.S. Capitol Police officer who died after facing off with rioters on Jan. 6, was attacked with chemical spray.\n\nHere’s what the videos show.\nhttps://t.co/puV56KYlrE With 90% of the votes counted in Israel’s fourth election in two years, no party has yet won enough support to form a coalition government with a majority in Parliament. The prospect of another stalemate has prompted debate over the political system.\nhttps://t.co/w8r5upwWZ4 Jensen Karp ate a bowl of his favorite cereal, Cinnamon Toast Crunch, on Monday morning. As he began filling a second bowl, “something plopped out of the box.”\nhttps://t.co/q9SVwZHOtG President Biden called for a ban on assault weapons in the U.S. after 18 people were killed in two mass shootings in the span of a week.\n\nHow likely is his latest attempt at gun control to succeed?\n\nListen to today’s episode of The Daily.\nhttps://t.co/lYx9492GUY The suspect in the mass shooting at a grocery store in Boulder, Colorado, was charged with 10 counts of first-degree murder on Tuesday. Officials have not yet released details about a possible motive.\n\nFollow updates on the fallout from the shooting here. \nhttps://t.co/fXd8NNpnaA In the forests of Myanmar, students, activists and ordinary office workers are training in warfare skills to strike back at the military.\n\n“We have to attack them back,” one trainee said. “This sounds aggressive, but I believe we have to defend ourselves.”\nhttps://t.co/Dtpo4WMw6N RT @motokorich: Tokyo 2020’s organizers pitched the Olympics as a symbol of recovery. Now, the event itself threatens to become a trial fro… Hong Kong on Wednesday suspended use of the Pfizer-BioNTech vaccine after packaging defects, including cracked containers and loose caps, were discovered in a batch of doses. Officials called the halt a precaution. https://t.co/fL31kp6R9w The European Union drafted legislation to curb exports of Covid-19 vaccines for six weeks, a move that could badly affect supply in the U.K., among other places. https://t.co/fE3JZhYydR A senior official will be chosen to focus on Asian-American priorities, the White House said, after two Democratic senators said they would support only “diversity candidates” until President Biden addressed a lack of representation in his administration. https://t.co/1SyTvDpTYS In Opinion\n\n\"By killing measures that make voting more open to everyone, Republicans might make their fears of terminal decline a self-fulfilling prophecy,\" writes Jamelle Bouie.\nhttps://t.co/b5DwEgrURv An enormous container ship became stuck in the Suez Canal late Tuesday, blocking traffic through one of the world’s most important shipping arteries.\n\nThe ship ran aground amid poor visibility and high winds from a sandstorm, local officials said.\nhttps://t.co/09rxdf0dFc The 2020 Tokyo Olympics were framed as a symbol of recovery for Japan: from an economic slump; from a devastating earthquake, tsunami and nuclear disaster; and from a crippling pandemic.\n\nBut the Games, beset by problems, may not deliver such a legacy.\nhttps://t.co/rz5YxmAk9S Gov. Greg Gianforte of Montana violated state hunting rules last month when he trapped and shot a black wolf near Yellowstone National Park without first taking a mandatory education course, officials said. He received a written warning.\nhttps://t.co/HE9pFA06xj RT @emilyschmall: Our report from the Punjab on the perverse economics of farming in one of the world's most fertile regions. With gorgeous… RT @MatinaStevis: E.U. set to arm itself w/ broad new legal powers to halt covid vaccine exports for the next 6 weeks, draft legislation se… Prime Minister Narendra Modi of India last year pushed through new laws that would reduce the government’s role in agriculture, aimed at fixing a system that has led to huge rice surpluses. But the laws could make many farmers' livelihoods unsustainable. https://t.co/gclCBkCiI8 North Korea test-fired two short-range cruise missiles over the weekend, South Korean defense officials confirmed. The test came just days after North Korea accused the U.S. and South Korea of raising “a stink” on the Korean Peninsula. https://t.co/cnJPPKd02K Try browning store-bought gnocchi in a pan for a mix of crispy outsides and chewy middles, no boiling required. https://t.co/OGZRgWt81P Health officials in Hong Kong and Macau said that they have suspended shots of the BioNTech vaccine after the company’s Chinese distributor uncovered packaging defects. https://t.co/1PK76HRTw8 In a beat-up RV with his two best friends, Andrew Callaghan documented the outrageous and infuriating aspects of American life on his popular Youtube series, “All Gas No Brakes.” This month, he announced that he’d left the show. Here’s what happened. https://t.co/2plpQ3f6rj Video: At least 15 people have died after a devastating fire ripped through the Rohingya refugee camp in Cox’s Bazar, leaving hundreds injured and tens of thousands homeless once again, the Bangladesh authorities said. https://t.co/8aOaKMQlu0 25 recordings, including Janet Jackson’s \"Rhythm Nation 1814\" and Kermit the Frog’s \"The Rainbow Connection,\" have been designated by the Library of Congress as audio treasures worthy of preservation. https://t.co/j7oKVKVKb4 Prime Minister Benjamin Netanyahu’s party held a lead in Israel’s fourth election in two years, but updated exit polls projected neither his right-wing alliance nor a bloc of opposition parties had a clear path to a majority coalition. https://t.co/cX8QyfPLc1 Paul Brock, who helped found the National Association of Black Journalists, has died. He was 89. https://t.co/rgG0iKgezx Faced with the second mass shooting in a week, President Biden called on lawmakers to enact stricter gun laws, saying tighter gun laws should not be a partisan issue. But Republicans in Congress showed little interest in Democratic proposals. https://t.co/hZIUqMFFIa George Segal, who received an Oscar nomination for “Who’s Afraid of Virginia Woolf?” but became known for his roles on TV comedies, died at 87. https://t.co/e8M7hliVsB “It’s overwhelming. Colorado’s been through so much.”\n\nAfter a gunman killed 10 people at a supermarket in Boulder, people across Colorado, a state scarred by a barrage of other mass shootings, wondered how it had happened again. https://t.co/4ymashOSte Fuller planes, higher airfares and less flexibility: Here are five things to expect if you fly this summer.\nhttps://t.co/VExN2wpzef President Biden announced on Tuesday that the Obamacare enrollment period, for Americans who need health insurance, would be extended until Aug. 15. https://t.co/kl9k9ubGcn https://t.co/LLSeCS7pcr Republican leaders and outside groups are coordinating efforts to usher in a raft of new voting restrictions in states where the party holds control, in what it sees as a path to regaining a foothold in Washington. https://t.co/eko3jEABml RT @NYTSports: As MLB (and, seemingly, everyone else) tries to catch up to NFTs and the NBA’s Top Shot craze, Taijuan Walker of the Mets cr… Breaking News: The E.U. drafted legislation to curb exports of Covid-19 vaccines for six weeks, a move that could badly affect supply in the U.K., among other places. https://t.co/pVB3NRxwNo Since 2012, 13 states, all controlled by Democrats, have enacted or expanded background checks for new gun purchases. Meanwhile, 14 states, all controlled by Republicans, have passed laws allowing their citizens to carry guns with no permit process at all. https://t.co/uzmVBcY5lb RT @katie_robertson: Medium editorial staff were told they did not have to accept the voluntary buyouts, but their jobs were not likely to… A police officer, a prolific gardener, a sister who was \"a beam of light\" and a father of seven were among those killed in the Boulder shooting. https://t.co/MMlnBGhSid This one-pan meal is inspired by the flavors of pasta con le Sarde, a classic Sicilian dish made with sardines and fennel. https://t.co/kjUpid0rsy When Kim Janey was 11, she was bused into a neighborhood of Boston where Black students were pelted with rocks. As the city's new acting mayor — the first Black person in the role — she hopes to help Boston step out of the shadow of that era. https://t.co/rI9Pqa2bQk RT @reidepstein: NEW: The Boulder shooting happened at the same time -- to the minute -- that the Iowa State Senate was voting to gut a sta… From 2017: While mass shootings can happen anywhere, they are only a matter of routine in the U.S. The only variable that can explain the high rate of mass shootings in America is its astronomical number of guns.\nhttps://t.co/Xg95dnbvLw RT @tarasbernard: Receive a stimulus check for less than expected? The I.R.S. said at least some delays may be tied to spousal debts -- and… \"This is clearly a shrimp tail.\" 🍤\nhttps://t.co/Q3ZVaCNf9d President Biden’s infrastructure plan represents a major shift in the way Democrats talk about tackling climate change: It’s no longer a side element. https://t.co/lEJevaFjze https://t.co/FIrqu4RKcX In Opinion \n\n“The younger generation today is the most progressive generation in the modern history of this country,” Senator Bernie Sanders tells @ezraklein. Listen to today’s episode of The Ezra Klein Show. https://t.co/hxcrkIWnjm “There are photo shoots, there are presidential photo shoots — and then there are Vladimir Putin presidential photo shoots,” our fashion critic @VVFriedman writes.\nhttps://t.co/FWM1kIm3d8 Here’s what we know about the Colorado grocery store shooting so far.\nhttps://t.co/85zc5XRokf Dr. Vivek Murthy, who served as surgeon general during the Obama administration, was confirmed by the Senate on Tuesday to reprise that role for President Biden. https://t.co/4nCCAe29F8 Senator Tammy Duckworth said she would refuse to vote for any of President Biden’s nominees “other than diversity nominees” until the White House addressed what she called an unacceptable dearth of Asian-Americans and Pacific Islanders serving in top jobs. https://t.co/kvRc2XlN89 The jury for the murder trial of Derek Chauvin in the death of George Floyd includes two white men, four white women, three Black men, one Black woman and two women who identify as mixed race, according to information provided by the court. https://t.co/mdLeD89yla Mayor Bill de Blasio announced on Tuesday the formation of a Racial Justice Commission that he said would make policy recommendations designed to “dismantle structural racism for all New Yorkers.” Here’s what that might look like for the city. https://t.co/WDfaAApEGB At segregated baseball's peak, Black players were barred from earning equal wages and playing official major-league games. In @NYTMag, Rowan Ricardo Phillips asks: Are Major League Baseball's plans to add some Negro-leagues stats to its record books enough?https://t.co/9DnQ2Ninzz RT @PatrickKingsley: Prime Minister Netanyahu has a path to a majority and sixth term, exit polls show, potentially paving the way for one… Trump Hotels have been dropped by the luxury travel group Virtuoso. The global network of travel advisors will no longer offer the 10 hotels that operate under the Trump brand to its high-end clients.\nhttps://t.co/L0NiP1bQFx Breaking News: Prime Minister Benjamin Netanyahu’s party held a lead in Israel’s election, exit polls indicated, giving him a chance of staying in power for a sixth term. https://t.co/vG2owRfuPB RT @herbertnyt: Netanyahu wins a plurality, exit polls show, and has a path to a sixth term. https://t.co/HrPpvnp8iF RT @MichaelPaulson: To work or not to work? The labor union Actors' Equity is increasingly under pressure, from performers and producers, o… RT @jimtankersley: A driving philosophy behind Biden's emerging infrastructure plan: The admin's belief that there is no way to separate Am… President Vladimir Putin got a coronavirus vaccine on Tuesday, the Kremlin said, ending months of holding out even while he was promoting Russia’s domestically made shots. https://t.co/nAs4SRu1hU Israelis are voting today and Palestinians are scheduled to have their own elections in May.\n\nWhile many Israelis feel numbed by their fourth election in two years, Palestinians are excited about the chance to vote for the first time in more than a decade. https://t.co/z55W3do06r Breaking News: U.S. officials and an independent panel accused AstraZeneca of essentially cherry-picking trial data on the effectiveness of its vaccine. https://t.co/sQ0Bric7ub After international spectators were banned from this summer’s Tokyo Olympics, fans are realizing that getting refunds for their tickets may not be easy, or fast. https://t.co/U4fegu74x6 Months after the presidential election highlighted problems in the Postal Service, the agency has failed to restore its target delivery times. In mid-December, as little as 62% of first-class mail was delivered on time, according to Postal Service data. https://t.co/n6k5wElBys https://t.co/bGzTHBq1oC AstraZeneca’s latest blunder has further undercut the effort to sell people on one of the most potent and indispensable coronavirus vaccines, scientists say. https://t.co/OH46GTKUHk Disney has pushed back the release of “Black Widow,\" the hotly anticipated Marvel superhero film, from May 7 to July 9. When it does hit theaters, the film will also be available on Disney+. https://t.co/i96tIvT4KX RT @PatrickKingsley: It's Groundhog Day in Israel — the 4th election in 2 years\n\n👉Who are Bibi's main rivals?\n👉What are voters saying?\n👉Wha… 10 people were killed on Monday by a gunman who opened fire at a grocery store in Boulder, Colorado. They included a police officer, a young grocery store worker and a retiree filing orders for Instacart. https://t.co/kPLW9lyKgE https://t.co/PzAEP6tune RT @NYTSports: When Olympics organizers barred foreign fans from the Tokyo Games, travelers who had invested thousands of dollars in ticket… RT @TaylorLorenz: Andrew produced groundbreaking reporting from Burning Man, the Area 51 raid, a Flat Earth conference and more. As the BLM… The suspect charged with the murders of 10 people at a Boulder, Colorado grocery store is a 21-year-old man from a nearby Denver suburb who used an AR-15 type of assault rifle, law enforcement officials said.\nhttps://t.co/5DCCqdjcpw It's very rare for people who have been partly or fully vaccinated to get Covid, but the few cases serve as a reminder that you should still wear a mask after you get the shot. https://t.co/6WCfFzdiR5 RT @herbertnyt: Israel votes today for the 4th time in 2 years, hoping to break the gridlock. Live coverage here: https://t.co/KQKqOHlzEr Breaking News: President Biden urged lawmakers to renew bans on assault rifles and high-capacity ammunition magazines. This “should not be a partisan issue,” he said. https://t.co/mxpoSr84Qm “Cold? What cold?” asks our fashion critic, @VVFriedman, who writes that few global leaders embrace the staged photo shoot with “such creative, yet clichéd, fervor,” as President Vladimir Putin of Russia.\nhttps://t.co/OFJwVkONbC https://t.co/qX2CnbRknW RT @nytopinion: Join @jbouie to discuss how the Republicans have given up trying to win a national majority https://t.co/GzOeoeTtGX It represents gravediggers, cereal makers, cannabis growers and fast fashion salespeople.\n\nThe Retail, Wholesale and Department Store Union may be one of the most eclectic labor unions in the U.S., and it is on the cusp of organizing Amazon workers. https://t.co/7Ym0CgSsOS RT @PatrickKingsley: 👉Why is Israel holding a 4th vote in 2 years?\n👉How has the stasis affected Israeli life?\n👉Who are the main candidates?… Senator Chuck Schumer will ask President Biden to name Damian Williams the next U.S. attorney in Manhattan, virtually ensuring that the famously powerful office will be led for the first time by a Black man, a person briefed on the decision said. https://t.co/412hBbxm5c RT @cliffordlevy: Schumer Seeks Appointment of First Black U.S. Attorney in Manhattan\nNo Black prosecutor has led the office, which has han… A new study illuminates long-term neurological symptoms in people who had mild cases of Covid, underscoring an emerging understanding that for many people, long Covid can be worse than their initial bouts with the infection. https://t.co/5Z9i2xK0gl Survivors of the grocery store shooting in Boulder, Colorado, described a chaotic scene and the urgent calls they made to loved ones as they hid from the gunman. https://t.co/4avUahXDtt https://t.co/XQGIrVKVyl There have been at least 29 shootings with four or more fatalities in the last five years in the U.S., according to a database compiled by the Violence Project. https://t.co/GO5KG3Bwxe RT @nytimesbusiness: Watch live: Federal Reserve Chair Jerome Powell and Treasury Secretary Janet Yellen testify before the House Financial… Today’s Great Read\n\nOwning a home in Houston has long been a promise of upward mobility for working-class families. After years of surviving hurricanes, floods and now a winter storm, these houses are no longer the safety net they were intended to be. \nhttps://t.co/0hAdECATuk The prime minister is on trial. There's no national budget. The cabinet is in disarray. And now, in the middle of a pandemic, another election.\n\nIsraelis vote on Tuesday for the fourth time in two years, hoping to end a political deadlock. Follow live. https://t.co/S62Gm3C6hJ Texas will make all adults eligible for coronavirus vaccinations starting Monday. https://t.co/yUcc31Hyzn RT @nytgraphics: Les CDC - Centres américains de prévention des maladies —  encouragent les écoles à rouvrir le plus rapidement possible, m… Residents of England who travel abroad without a valid reason could be fined 5,000 pounds, or $6,900, starting Monday if new regulations are approved. https://t.co/B7TPFzbsoS RT @VVFriedman: The latest notable addition to the canon of Vladimir Putin he-man photo ops. It's like an absurdist art form unto itself -… Interstellar comet? Cosmic iceberg? Alien space wreck?\n\nTwo astronomers have a new explanation for Oumuamua, the mysterious rock that zoomed through our solar system in 2017.\nhttps://t.co/RBPofNNCuj Breaking News: A 21-year-old man was charged with 10 counts of murder after a shooting on Monday at a grocery store in Boulder, Colorado. https://t.co/ANkQ6trztn RT @MarkLandler: A year after European leaders first locked down their countries, clashes between police and protesters are becoming common… In a changed Washington, Sen. Elizabeth Warren is wielding influence her own way. She has shepherded former staff members into powerful jobs and kept her progressive ideas in the policy conversation with a steady stream of legislative proposals. https://t.co/LS3ynROTMp RT @cliffordlevy: NEW: NYC’s municipal workers will begin to return to offices on May 3. The change is expected to affect about 80,000 empl… RT @Karan_Singhs: \"This is the second time I lost everything in my life.\" Our @nytimes report on the deadly fire that ripped through Rohing… Tesla is facing renewed scrutiny of its Autopilot technology in the U.S. The National Highway Traffic Safety Administration is investigating 23 recent crashes in which drivers were, or may have been, using the automatic steering and braking system.\nhttps://t.co/TYrVe2HcZs RT @migold: A massive fire tore through an assisted-living home in Rockland County this morning.\n\n• One resident was killed. Two firefighte… RT @emmagf: *NEW* Mayor Bill de Blasio is creating the New York City Racial Justice Commission to recommend major policy reforms to \"disman… A fire at a sprawling Rohingya refugee camp in Bangladesh killed at least 15 people, injured hundreds and left tens of thousands homeless on Monday.\n\n“This is the second time I lost everything in my life,” said one person whose home was destroyed.\nhttps://t.co/UIaTrYZBTP One resident was killed and several others were seriously injured in a large fire at an assisted living home in Spring Valley, New York, on Tuesday morning, officials said. One firefighter is missing. https://t.co/Je3jSpvfqt A gunman opened fire inside a grocery store in Boulder, Colorado, on Monday, killing 10 people, including a police officer, officials said. A suspect is in custody. https://t.co/3cgOK6RL5t A familiar partisan divide on U.S. gun regulation has re-emerged after 18 people were killed in two mass shootings within the span of a week. The Senate Judiciary Committee will hold a hearing on gun violence on Tuesday morning as advocates plea for action.https://t.co/r3gTp7AJeU A tenement building in Madrid, captured in a famous photograph by Robert Capa, will be transformed into a cultural center for his work and the city’s wartime history.\nhttps://t.co/GEjGzQ4MIJ The Supreme Court on Monday looked for a middle ground in a case pitting union campaigns against private property rights. It seemed poised to rule that a California regulation allowing labor organizers to enter farms 120 days a year was too broad. https://t.co/8Lwp3bQCAp New York City’s municipal workers will begin to return to offices on May 3, according to documents shared with The New York Times. Some workers and union leaders fear it is premature.\nhttps://t.co/4EEeZzgmSG Follow live updates here. \n\nhttps://t.co/zoFxI9J9Fs Taylor Shaver, who works at a dry cleaning and laundry business near the supermarket, said she heard at least 10 gunshots and saw people running.\n\nhttps://t.co/hBXc7lj5om https://t.co/2dQcjx6Z80 Sarah Moonshadow was at the checkout with her son when she, too, heard shots.\n\nhttps://t.co/hBXc7lj5om https://t.co/y6zuxBG5VD A gunman killed 10 people at a grocery store in Boulder, Colorado, on Monday. Witnesses recounted moments of terror.\n\nAlex Arellano was working at the supermarket, King Soopers, in the meat department when he heard gunshots. \n\nhttps://t.co/mFbQZbPmgL https://t.co/B00lHxD2qO “Numerous” residents and firefighters were injured in a large fire at an assisted living home in Spring Valley, New York, on Tuesday morning, officials said. More than 100 residents were evacuated. https://t.co/Ke86SwTvRi Some investors have started distancing themselves from the photo-sharing app Dispo over its co-founder, the YouTube creator David Dobrik. He has been accused of playing a role in a sexual assault scandal involving a former member of his “Vlog Squad.” https://t.co/AObB1NNmqj A sense of smell is crucial to what @tejalrao, a New York Times restaurant critic, does. But after she contracted the coronavirus, it disappeared.\n\nToday’s episode of The Daily follows her quest to regain her ability to smell.\nhttps://t.co/CsUJCxDi2V RT @sangerkatz: New health insurance benefits under the American Rescue Plan are substantial. But getting them may be a slog.\n\nRead me and… U.S. officials said AstraZeneca might have included outdated information from its Covid-19 vaccine trial, providing an “incomplete” view of the data. https://t.co/aiYIKwVwYL Eric Talley, an 11-year veteran of the Boulder Police Department, was one the 10 people who died in a shooting at a Colorado grocery story on Monday.\n\n“He was the first on the scene, and he was fatally shot,” Chief Maris Herold said, holding back tears.\n\nhttps://t.co/SdZIkYPbeQ Facing a surge in coronavirus cases, Mumbai, India’s financial hub, has begun randomly testing people in crowded places. The tests are performed without consent, officials said, and anyone who resists is in violation of India’s colonial-era epidemic act. https://t.co/kVTSZV5lC5 RT @Kellen_Browning: Microsoft has been in talks to buy the chat app Discord in a deal that could top $10 billion. That'd be a big get for… Soaring housing prices have long been a source of tension in South Korea. Now several government officials are under investigation for contributing to the problem. Young people are especially angry, saying they're fed up with corruption and failed policies.https://t.co/iDqhkFEbml RT @Lattif: Last week, I spoke to a Kenyan nurse recovering from Covid who watched vaccines first being doled out on TV. My latest report w… A gunman opened fire at a grocery store in Boulder, Colorado, on Monday, killing 10 people, including a police officer. A suspect was taken into custody, officials said.\n\nFollow live updates here.\n\nhttps://t.co/JbTbZU7F75 A proposed crime bill that would give the police in Britain more power to deal with nonviolent demonstrations has set off a string of \"kill the bill\" protests across the country. Here's what you need to know.  https://t.co/6Yb6ZF8tC3 RT @ConstantMeheut: Emblematic bookstores in the Latin Quarter are closing, the latest episode in a slow cultural erosion of the area.\n\n“It… Protesters on both the left and right across Europe have poured into the streets to lash out against coronavirus restrictions. The often harsh responses from the police are raising questions about the legitimacy of law enforcement.\nhttps://t.co/iencynoP6R Largely overshadowed by their Egyptian counterparts, Sudan’s ancient pyramids and archaeological sites may finally be poised to receive broader recognition.\nhttps://t.co/aYe8OUctpI RT @MatinaStevis: Germany introduces strict five-day lockdown over Easter, asks people to stay home \n\nhttps://t.co/g7beVUaPPl Here's a look at some of the highlights worth watching from late-night TV. https://t.co/YkoT9m93il RT @RebeccaDRobbins: News: NIH just put out a highly unusual statement saying the monitoring board for the $AZN US trial \"expressed concern… A Turkish driver was arrested on suspicion of trying to smuggle people to France from England after 16 people were found in his truck. There were no deaths, but the case had echoes of a 2019 smuggling case in which 39 people from Vietnam died in a truck. https://t.co/Z6nTv1JydN Discord, a social media company popular with gamers, has held deal talks with Microsoft for a transaction that could top $10 billion, according to people briefed on the situation. https://t.co/2AkPPFQkbC Nicola Sturgeon, Scotland's first minister, did not knowingly breach rules or mislead the Scottish Parliament about an investigation of her predecessor, an inquiry found. The report effectively clears her of allegations that led to calls for her to resign. https://t.co/AjnXhVaaVP The Shigir Idol, newly dated at 12,500 years old, “represents a unique and unparalleled find in Europe,” one archaeologist said. “One could wonder how many similar pieces have been lost over time due to poor preservation conditions.” https://t.co/PCklvxAm7F Breaking News: U.S. officials said AstraZeneca might have included outdated information from its Covid-19 vaccine trial, providing an “incomplete” view of the data. https://t.co/FApsgV6AKG House Democrats convened a panel on Monday to consider a renewed push to grant statehood to Washington, D.C. According to a bill passed by the House last summer, the 51st U.S. state would be called Washington, Douglass Commonwealth. https://t.co/MuJLdngjxI Ten people, including a police officer, were killed when a gunman opened fire at a grocery store in Boulder, Colorado, on Monday, the authorities said. A suspect was in custody, according to the city’s police chief. Here's what we know. https://t.co/2zBnXBfnvV The deadly shooting in Boulder, Colorado, on Monday was the second mass shooting in the U.S. in less than a week. Before the Atlanta-area shootings last week, there had been no such killings since March 2020, according to the Violence Project. https://t.co/7epHn4ZEDd Justice Department officials have reviewed potential sedition charges against members of the Oath Keepers militia group who attacked the Capitol on Jan. 6, and they have been weighing whether to file them for weeks. https://t.co/5ShRHH8Y56 A judge ruled this month that Boulder, Colorado, could not enforce bans on assault-style weapons and large-capacity magazines. It was not known whether any weapons covered by the bans were involved in the grocery store shooting on Monday.\nhttps://t.co/e8W1qKmk77 When the Canadian police arrived at the home of Debbie Baptiste in August 2016, encircling the house and carrying rifles, they informed her that her son was dead. Then they asked if she had been drinking and told her to “get it together.” https://t.co/OilwKzw0ns Breaking News: Ten people, including a police officer, were killed in a shooting at a grocery store in Boulder, Colorado on Monday. The suspect is in custody, the police said. https://t.co/y9pX40eZ4i Witnesses of a shooting on Monday at a grocery store in Boulder, Colorado, recalled moments of terror as they hid and fled.\n\n\"The shots are getting closer,\" a man who was working in the store recounted. \"I’m thinking of my parents, and I was freaking out.\" https://t.co/Gqqgr3OC37 A pair of hard-right Republicans announced Senate bids in Missouri and Alabama on Monday, igniting what are expected to be contentious primary races for open seats in two conservative states. https://t.co/lLO7Kp16p4 Colorado has been the scene of a number of fatal shootings in recent years. Here are a few that made national headlines. https://t.co/uh0AfDTg5W Here's what we know so far about the shooting at a grocery store in Boulder, Colorado:\n— Multiple people were killed, including a police officer.\n— A suspect was in custody and was injured.\n— President Biden was briefed.\n\nFollow our live updates here: https://t.co/aungPLZO11 “The wealthy that used to spend money on travel aren’t using it, so everything collectible is skyrocketing in value,” the editor of a watch site said. A number of retailers were reticent to speak about the trend during a time of growing wealth inequality. https://t.co/wQrEsU1D3j Breaking News: Multiple people, including a police officer, were killed when a gunman opened fire inside a grocery store in Boulder, Colorado. A suspect is in custody, the police said. https://t.co/DJe25OYOXk Watch live: The police in Boulder, Colorado, are offering an update on today's shooting at a grocery store. https://t.co/HzIlFeakau A proposal in Evanston, Illinois, would offer a blueprint for distributing $10 million in reparations to Black residents in the form of housing grants.\n\n“It is the reckoning,” said Robin Rue Simmons, an architect of the plan. https://t.co/CvV1sxnxrB You’ll just need a few things from the pantry. \nhttps://t.co/sm3PmWgA0w There were at least five different attacks against people of Asian descent in New York City over the weekend, the police said, and at least four of them are being investigated as possible hate crimes. https://t.co/nF2YyHXqtz Dozens of police officers in Boulder, Colorado, were responding to reports of a shooting at a grocery store on Monday, where witnesses reported hearing gunshots and seeing several people wounded in and around the building. https://t.co/n0ayys0Vjo Missed today's #MarchMadness action so far? We've got you covered:\n— Gonzaga's men's team cruised into the Sweet 16\n— Oregon upset second-seeded Iowa in the men's tournament\n— The first women's tournament upsets included wins for Belmont and Wright State\nhttps://t.co/hu21cXeAdM RT @katierogers: On the road with Harris, an all-purpose messenger for an administration grappling with sizable problems on multiple fronts… The U.S. placed sanctions on top Chinese officials, as part of a multinational effort to punish Beijing for human rights abuses against the largely Muslim Uighur minority group, which American officials have called a genocide. https://t.co/xQoPPzeoBu A fossil dig in Tunisia highlights the way the next generation of paleontologists are trying to change scientific practices which exploited native peoples and their natural histories. https://t.co/Q9quj47UCP https://t.co/dbXIebDyoK The award-winning filmmaker Charles Ferguson is suing the company that owns the History Channel, saying that it suppressed his “Watergate” documentary out of fear that allusions made to the Trump administration would offend viewers. https://t.co/Bs3VaMk3XD RT @nytimesworld: The remains of 13 Guatemalan migrants massacred in northern Mexico were returned home this month, where @Volpe_Daniele do… Indoor fitness classes, which often result in heavy breathing in poorly ventilated rooms, can be risky. Here’s a guide to help you decide if your gym is doing enough to prevent the spread of Covid-19. https://t.co/2uAZo4cZDP A digital artwork by the artist Beeple recently sold for $69 million. Instead of a physical object, the highest bidder received a “nonfungible token.”\n\nIf you still find NFTs hard to wrap your head around, here’s what you need to know. https://t.co/0ntD8bO3NC A U.S. trial found AstraZeneca’s Covid-19 vaccine was 79% effective with no serious side effects. Dr. Anthony Fauci on Monday discussed the results of the trial. https://t.co/0TqoNi5icc https://t.co/qOO5EsjMIx For $75 a person, fans can walk around Disney California Adventure — where no rides are running but costumed characters wave from a distance — and buy food and merchandise. The demand has been astronomical. https://t.co/FQv08zJq18 In Opinion\n\nThe most visible Christians in recent years have been white conservatives who emphasize issues that Jesus never explicitly mentioned, @NickKristof writes. But now more progressive Christians are moving onto center stage. https://t.co/2VjRY0w108 If Lana Del Rey’s great “Norman _____ Rockwell!” seemed to capture a generational malaise, her latest album, “Chemtrails Over the Country Club,” offers insights that are more sharply personal, Lindsay Zoladz writes.\nhttps://t.co/iCeD2cbxB7 RT @koblin: In the summer, there were accusations of a toxic workplace. And in the six months since, a million viewers have tuned out of Th… Roughly three-quarters of the Covid vaccines given globally have gone to only 10 countries. At least 30 countries have not yet injected a single person. Scientists warn that such unfair treatment could not only haunt poorer countries, but also rich ones. https://t.co/PIX8DmTW1Q Millions of older Americans cannot leave home to go to a vaccination site. Doctors across the U.S. have set out to solve the logistical challenge by bringing the shots to them. https://t.co/112RC9qhg4 RT @arappeport: Elizabeth Warren plans to roll out a \"real corporate income tax\" this week and she's going to keep selling Janet Yellen on… In Opinion\n\n“For too long, women have been punished and killed because of men’s inability to deal with issues around rejection, desire and shame,” writes @JessicaValenti. She asks: “How many women have to die for men’s sexual issues?” https://t.co/flQxndPdoz Ellen DeGeneres loses 1 million viewers after reports of a toxic workplace\nhttps://t.co/p3GWgf8qVj Officials in Miami Beach on Sunday extended an emergency curfew for up to three weeks. The move came a day after South Beach descended into chaos, with the police struggling to control spring break crowds and making scores of arrests. https://t.co/InLNgCaUd6 https://t.co/1CzD7axbyG LeBron James’s ownership stake in the Boston Red Sox is the latest example of athletes realizing that power lies not only in grass-roots activism and championships, but also in having a seat in team boardrooms, our columnist @kurtstreeter writes. https://t.co/VeqAQ81O5i The loss of more than a million viewers since September translates to a 43% decline for “The Ellen DeGeneres Show,\" representing a steeper drop than any of its competitors. https://t.co/E8V7MDxS5C https://t.co/xAttEAvp6j Elgin Baylor, the Lakers’ Hall of Fame forward whose acrobatic brilliance made him one of the NBA’s greatest players, died at 86. https://t.co/LhdwaldpHb The Atlanta-area shootings underscored for many women how racism and sexism are inextricably linked, leaving them uniquely vulnerable to violence and discrimination. https://t.co/Cawec5giqF https://t.co/GpaXm3LtJk Enrollment in health insurance under the Affordable Care Act has surged during the first two weeks of an open enrollment period created by President Biden. Alabama and Wyoming, two deeply conservative states, are considering its Medicaid expansion. https://t.co/Vq8A1zAeYA A small number of people, like Ivan Agerton, have developed psychotic symptoms as a mysterious aftereffect of Covid-19. After a mild case of Covid, he described being seized by paranoid delusions that turned life into a nightmare. https://t.co/YrDt7CYgZF https://t.co/QUKZMnRvgf Violent protests erupted Sunday night in the British city of Bristol over a proposed police and crime bill that would create sweeping new restrictions on protests and grant broad new powers to the police. https://t.co/szcksbBDr5 https://t.co/K7cTOYO0uU RT @nytrealestate: Jeffrey Epstein's mansion on the Upper East Side was purchased for $51 million by Michael D. Daffey, a former Goldman Sa… Ellen DeGeneres has faced a steep ratings decline, losing more than a million viewers since September, after reports of a toxic workplace at her show. It is a startling setback for one of daytime television’s most successful franchises. https://t.co/01cmSorOgU Many Americans know they’ve put on weight during the pandemic, but it’s been difficult for experts to detail the scope. One small study suggests that adults under shelter-in-place orders across the U.S. gained nearly two pounds a month. https://t.co/LpRziUcKZJ As Asian-American New Yorkers experience violence and more subtle forms of bigotry, Andrew Yang's mayoral candidacy has received new attention. His critics say that some of his past comments have fed racial stereotypes. https://t.co/rmSFeHT50q RT @nytgraphics: New York City high schools on Monday reopened for in-person learning.\n\nThe New York Times worked with experts to better un… President Biden’s advisers are preparing to propose up to $3 trillion in spending on efforts to boost the economy, improve infrastructure, minimize carbon emissions and reduce inequality — paid for, in part, by tax increases on corporations and the rich. https://t.co/6rnPrluUzM https://t.co/OATHj48VZb The phantom odors and distorted sense of smell that can linger after Covid-19 have made an already-isolating year worse for people affected by the condition, parosmia. \n\nPleasant aromas, like a delicious meal or the scent of a romantic partner, turn foul.\nhttps://t.co/TlcDNzl8IK Congress may enact a ban of menthol cigarettes, which have been aggressively marketed to Black Americans. 85% of Black smokers use menthol brands that are easier to become addicted to and harder to quit than plain tobacco, according to the FDA. https://t.co/qTmuuUjZ1O RT @PamBelluck: After Covid came psychosis: “Single-handedly the most terrifying thing I’ve ever experienced,” said Ivan Agerton. He and hi… A more intense phase has emerged in the campaign for New York City mayor: Criticism of Andrew Yang is getting sharper. Here are 5 takeaways from the race.\n\nhttps://t.co/LzzhUkWck6 RT @jimtankersley: EXCLUSIVE: Biden's economic advisers are preparing to present him with $3 trillion in new spending for the next phase of… This vegan chocolate cake could not be easier. \nhttps://t.co/Qt0oT2j6eu RT @katieglueck: As NY’s diverse Asian-American constituencies grapple w/violence,Yang&amp;other candidates are racing to show how they would l… In Opinion\n\nAre the digital assets known as nonfungible tokens, or NFTs, the new frontier for ownership on the internet? @karaswisher talks to the artist Beeple, who recently sold an encrypted digital collage for $69 million, on a new episode of Sway. https://t.co/q8d9tT5kBk How North Korea evades strict international sanctions to get oil\nhttps://t.co/jq9aXfEeiH Junior Goldman Sachs analysts put together a presentation detailing what they described as workplace abuse, including 100-hour weeks.\n\nAfter it came to light last week, we heard from many current and former investment bankers. Here’s what they said.\n\nhttps://t.co/1P7agG0kaA New York City public school students who have been learning remotely this year will have another opportunity to sign up for in-person learning, starting this Wednesday until April 7, Mayor Bill de Blasio said on Monday. https://t.co/4ZrbspsHKc New York will allow anyone 50 and older to get vaccinated beginning on Tuesday, Gov. Andrew Cuomo said on Monday. https://t.co/R9QHr5beDq Today’s Great Read: \n\nYounger paleontologists are attempting to change scientific practices that descend directly from 19th century colonialism, which exploited native peoples and their natural histories.\nhttps://t.co/nBRxkkye9O In Opinion\n\n“In our scientific rush to develop, manufacture and deliver vaccines more rapidly than ever in history, countries around the world have failed to engage the public,” writes Heidi Larson, an anthropologist and expert on vaccine confidence. https://t.co/IitvV6pFNG More than a dozen of our journalists examined the maze of connections involved in these illicit oil transfers, and used findings from a new analysis by @RUSI_org and @C4ADS. This is how they approached their months of reporting.\nhttps://t.co/8otSaYweQm We unraveled murky networks around the oil transfers. Many connect to the Taiwan operation of a major oil trader, the Winson Group. Several individuals have ties to a small village in China. Here are five takeaways from our investigation. https://t.co/u8cK4yiUqk North Korea needs oil for civilian purposes, but also uses it for its nuclear and ballistic missile program. The United Nations Security Council has imposed strict sanctions aimed at limiting North Korea’s imports of refined petroleum. https://t.co/ZPLBpLE13Z https://t.co/b461f9SNDQ We focused on one ship: the Diamond 8. Months of combing through records, satellite imagery and ship-tracking data revealed how it made illicit voyages to North Korea and the companies around it. Watch our visual investigation. https://t.co/ZPLBpLE13Z https://t.co/cH9VLzVDYu A mysterious tanker. Oil transfers at sea. A retired sailor and a multinational oil trader. They all are part of the same convoluted web that reveals one way North Korea evades strict international sanctions to get oil. \nhttps://t.co/ZPLBpLE13Z RT @asher_elbein: For @NYTScience, I wrote about the lingering imperialist roots of paleontology—and how some researchers are trying to pus… A year ago, Georgia was one of four states that had no hate crime legislation. But the Atlanta area shootings last week that left eight people dead, six of them women of Asian descent, is now providing a test of the state's new law. https://t.co/n7A5piNhPj The word “sedition” has a complicated history in the United States. Here’s a look at what the term means.\nhttps://t.co/ZMQ95Kpzda Donald Trump endorsed Jody Hice, a Republican congressman running against the Georgia secretary of state, Brad Raffensperger. Trump has been critical of Raffensperger since he refused to overturn the state’s presidential election results. https://t.co/qKqwVHLlAf The U.S. Supreme Court has been asked to decide whether the requirement for only men to register for the draft is unconstitutional.\n\nIt “reinforces the notion that women are not full and equal citizens,” lawyers wrote in a petition.\nhttps://t.co/G7jIMh6hOx RT @jestei: I met some fun seniors who have two shots.....https://t.co/D14uWUNmu1 RT @cegoldbaum: The MTA was pulled from crisis by billions in federal aid. But as an agency that relies on fares to operate, it needs rider… Leon Black, the Wall Street billionaire who was the main client of the disgraced financier Jeffrey Epstein, is stepping down as chief executive of Apollo Global Management, several months ahead of schedule. https://t.co/XedtI9vVin Breaking News: The Supreme Court said it would review an appeals court’s decision that overturned the death sentence of one of the 2013 Boston Marathon bombers.\nhttps://t.co/w8D320W2rv RT @AlanYuhas: Tom Garvey, 78, says he lived in a concession stand in Philly’s Veterans Stadium for three years, 1979-81. Four people told… \"It is repressed and treated with denial. That doesn’t make it go away. It’s controlling how people respond to new trauma, whether it’s a diagnosis or a pandemic or a January 6th.\" @NYTMag talks to a palliative-care doctor on trauma and healing in the U.S. https://t.co/mGd2R7sc0f RT @SherylNYT: NEW: The Biden White House, spending millions in stimulus dollars, is setting aggressive benchmarks to mark a full recovery:… New York City’s transit agency was pulled from crisis by billions in aid. But its ridership may never fully return, threatening its future.\nhttps://t.co/GOEhlcmb0U Prosecutors in Tokyo on Monday charged a father and son from the U.S. with helping Carlos Ghosn, the former Nissan chief, flee Japan, where he was awaiting trial on four counts of financial wrongdoing.\nhttps://t.co/CBtl4dRybC Rep. Tom Reed, Republican of New York, apologized on Sunday to a woman who accused him of touching her inappropriately and said he would not run for any political office in 2022, including governor. https://t.co/EMYNwV7QSf Microsoft announced Monday that more workers would be allowed back into its headquarters in Redmond, Washington, starting on March 29. \n\nThe company said employees will be required to wear masks and maintain social distancing.\nhttps://t.co/hRNEg6bo5D The Turkish lira plunged 10% against the U.S. dollar on Monday after President Recep Tayyip Erdogan fired the head of the central bank, who had been in the job just four months. https://t.co/t0hS5T2Dr9 “I don’t necessarily represent or identify with everybody in law enforcement,” said Aaron Appelhans, the first Black sheriff in Wyoming's history. “I come in with some different ideas of how to go about doing things.” https://t.co/KfeRgqxAsp In Opinion\n\n\"I thought my mother and I would react the same way over the horrific events in Atlanta,\" writes Jennifer Hope Choi, who has written about the Korean community in the American South. \"Why didn’t we?\"\n\nhttps://t.co/BevUwHS6FV RT @ckoettl: A mysterious tanker. Oil transfers at sea. A retired sailor &amp; a multinational oil trader. What do these four things have in co… RT @mikiebarb: On today's Daily: Even as vaccinations ramp up there's a group of people for whom the lingering affects of the pandemic neve… “To look out there at rush hour and see nobody, it finally hit me,” one subway conductor in New York City said. “It was actually scary. I thought, ‘Wow, this is bad. This is really, really bad.’”\nhttps://t.co/alyQaQC3Gl RT @emmagf: The story behind Andrew Yang’s omnipresent scarf, and who got donations from Steven Spielberg and Norman Lear? \nOur weekly roun… David Dobrik amassed millions of subscribers on YouTube as part of a group called the Vlog Squad. But an investigation detailing sexual assault allegations against a former Vlog Squad member has led many viewers to angrily re-evaluate his work.\nhttps://t.co/jpcNBl9FzP Canadian Pacific and Kansas City Southern announced plans to combine in a $29 billion deal that would create the first railroad network connecting the U.S., Mexico and Canada. https://t.co/K0jrBCgMh8 Kent Taylor, the founder and chief executive of the Texas Roadhouse restaurant chain, died by suicide on Thursday after suffering “post-Covid-related symptoms, including severe tinnitus,” the company and his family said in a statement. He was 65.\nhttps://t.co/ocpQoKfPok RT @RebeccaDRobbins: Long-awaited $AZN data from the n=32k US trial (79% efficacy, 80% in over 65s, no severe cases in vaccine group, no sa… Mario González heard the gunfire from inside Young’s Asian Massage. He immediately worried for his wife, Delaina Ashley Yaun, but says police detained him before he could check on her. Only later was he informed that she had been killed. https://t.co/q906TqZecK American and European officials signed away opportunities that would have guaranteed access to coronavirus vaccines to billions of people in developing countries, a choice that could prolong the pandemic globally. https://t.co/iOKgKSflqL A U.S. trial found AstraZeneca’s Covid-19 vaccine was 79% effective and completely prevented the worst outcomes from the disease while causing no serious side effects.\nhttps://t.co/FZM7H8ztpd https://t.co/ZaF70g326S Officials in Miami Beach on Sunday extended an emergency curfew for up to three weeks. The move came a day after South Beach descended into chaos, with the police struggling to control spring break crowds and making scores of arrests.\nhttps://t.co/7bHh67VYc9 RT @muyixiao: [THREAD] A tanker repeatedly delivered illicit oil to North Korea. We investigated it.\n\nWe found elaborate networks, many con… RT @damiencave: From fires to floods, Australia's vulnerability to climate change continues to become more and more apparent. https://t.co/… The closure of the Gibert Jeune bookstores, a beloved institution in the Latin Quarter of Paris, strikes at the heart of the neighborhood’s identity: access to culture at an affordable price.\nhttps://t.co/3UBpG5YCZG Evidence in the Capitol riot investigation most likely supports sedition charges for some of the suspects, a federal prosecutor told “60 Minutes.” https://t.co/pBTJSlHNHD RT @FatmaFaizi: In Kabul’s Street, Dogs Rule the Night \n\nDogs are the reflection of people’s situation in Kabul. They are sad, hungry, angr… Ivan Agerton, a 50-year-old adventure photographer, experienced psychosis after contracting the coronavirus. Ivan’s story is uncommon, but it is not unique.\n\nToday’s episode of The Daily looks at the potential long-term neurological effects of Covid-19.\nhttps://t.co/YkAW4ppPmQ RT @stefsaul: We interviewed @bjaypak  @ChuckEfstration and other Georgia leaders on hate crimes legislation, and whether it should be used… Nearly 20,000 people in eastern Australia have been evacuated after a deluge from two massive storms.\n\n“There is a very strong link between global warming and that intensification in rainfall,” a scientist from the University of New South Wales said.\n\nhttps://t.co/8Ws3CUJaku “There are dogs and armed thieves who make people’s lives here hell.”\n\nAs an unrelenting war drags on, civilians in Kabul, Afghanistan, live in fear of targeted attacks. But at night, another war is being fought – against criminals and packs of stray dogs. https://t.co/MNf8wH09NW RT @KeithBradsher: How hard is it now to travel to China? “Leave your partner and children behind. Quarantine for up to a month. Get inocul… A Chinese court tried Michael Kovrig, a former Canadian diplomat, on accusations of spying. It was the second such trial in recent days and one that will most likely intensify tensions among China, Canada and the U.S. https://t.co/qJhq47yymo For the past year, people trying to go to China have run into some of the world’s toughest border controls. The restrictions have hampered companies’ operations, separated families and upended the lives of thousands of international students. https://t.co/FiQbQYqJAV RT @TaylorLorenz: David Dobrik has stepped down from Dispo, the photo sharing app he co-founded https://t.co/LLYngZT9SV https://t.co/kPyb8c… Breaking News: Breaking News: A U.S. trial found AstraZeneca’s Covid-19 vaccine was 79% effective with no serious side effects. The company will seek emergency FDA authorization. https://t.co/aZRJ6axpJs Violent protests broke out in the British city of Bristol over a proposed bill that would create sweeping new restrictions on protests and grant the police new powers. The “kill the bill” rally deteriorated into chaos as protesters attacked the police. https://t.co/eBElb11CMi “I’m in front of the class and will get killed anyway. So to protect my students, I will go and hug the attacker.”\n\nEven when facing the threat of suicide attacks by the Islamic State, young Afghans from the Hazara minority keep returning to classrooms. https://t.co/bcDlUy13k6 This meditation in 10 easy steps is an exercise to help your body release the stress of constantly bracing for a disaster. https://t.co/aBhlQo22xg Months after the presidential election highlighted problems in the Postal Service, the agency has failed to restore its target delivery times. In mid-December, as little as 62% of first-class mail was delivered on time, according to Postal Service data. https://t.co/7nV2E4P5IT A 35-year-old man's sister died after suffering episodes of confusion. Then he started experiencing the same psychological symptoms.\nWhat was causing it? Dr. Lisa Sanders investigates the mysterious illness in @NYTMag.\nhttps://t.co/EQ1jWMWR2X Officials in Miami Beach decided to extend an emergency curfew for up to three weeks. The move came one day after South Beach descended into chaos, with the police struggling to control overwhelming Spring Break crowds and making scores of arrests. https://t.co/rs24wVvgQS Behold, the war tuba. https://t.co/bItKTT0k07 We want to hear what readers predict, fear and hope for a gradual shift to a post-pandemic world. Tell us what you imagine your After will look like using the form inside this article. https://t.co/aAO4MSMPds For the past year, people trying to go to China have run into some of the world’s most formidable barriers to entry. The restrictions have hampered companies’ operations, separated families and upended the lives of thousands of international students. https://t.co/FMVr3X3ESv Our media columnist @benyt spoke to Ibram X. Kendi and Bina Venkataraman about their new venture with The Boston Globe: an online publication focused on racism, inspired by 19th-century abolitionist newspapers. https://t.co/K1nFHMnglK Breaking News: Evidence in the Capitol riot investigation most likely supports sedition charges for some of the suspects, a federal prosecutor told \"60 Minutes.\" https://t.co/Aca2s68xDl The most significant determinant of resilience — noted in nearly every review or study of resilience in the last 50 years — is the quality of our close personal relationships, especially with parents and primary caregivers, Eilene Zimmerman writes. https://t.co/VT06bSezJp If wearing a face mask makes your glasses fog up, health workers have a few tricks that might help.\nhttps://t.co/PSdP0MnJjJ A year ago, Georgia was one of four states that had no hate crime legislation. But the deadly rampage last week that left eight people dead, six of them women of Asian descent, is now providing a test of their new law. https://t.co/1hMKyXmuFE RT @Volpe_Daniele: When I moved to Guatemala, 14 years ago, I lived two years in this region, San Marcos. Last week I went back for a @nyti… Mario González heard the gunfire from inside Young’s Asian Massage. He immediately worried for his wife but says police detained him before he could check on her.\n\nOnly later was he informed his wife, Delaina Ashley Yaun, had been killed. https://t.co/uIByjd4ZgS Canadian Pacific and Kansas City Southern announced plans on Sunday to combine in a $29 billion deal that would create the first railroad network connecting the United States, Mexico and Canada. https://t.co/pi7q2jHBT9 See more photos of protests and vigils around the U.S. https://t.co/SZJYaP5EHj Mourners held a moment of silence for the victims at Gold Spa in Atlanta on Thursday, where flowers had been placed in front of the building. https://t.co/SZJYaP5EHj https://t.co/QjLqJ8w7PG Students embraced at a vigil for the victims of the Atlanta shootings at the University of Virginia in Charlottesville. https://t.co/SZJYaP5EHj https://t.co/7UZP6LoxLo At a rally in Portsmouth Square in San Francisco, people painted messages of love and unity on the ground. https://t.co/SZJYaP5EHj https://t.co/9llkqhcnMR In New York City, a march in solidarity wove through the streets of Chinatown in Manhattan. https://t.co/SZJYaP5EHj https://t.co/XcPXxI3932 At rallies and events in cities across the country, people gathered to grieve the killing of eight people, six of whom were women of Asian descent, in shootings that targeted three Atlanta-area massage businesses. https://t.co/m9POSaFn8r Senator Ron Johnson has become Republicans’ foremost amplifier of disinformation, pushing falsehoods on the election, the virus and vaccines. https://t.co/86sWkNqo0s After 37 years in a very cheap walkup apartment, a 70-year-old piano teacher is forced out, but manages to find a $1,600 ground floor apartment she loves by using an old school email chain. https://t.co/m61FcRU7DV This hearty main dish needs nothing more than some lightly cooked greens to eat alongside. https://t.co/jZZQi1lOXK Nawal el Saadawi, an Egyptian author, activist and physician who became an emblem of the struggle for women’s rights in the patriarchal Arab world and campaigned against female genital mutilation, which she endured at age 6, is dead at 89. https://t.co/asOGtSt7ez If you are having thoughts of suicide, call the National Suicide Prevention Lifeline in the United States at 1-800-273-8255 (TALK). You can find a list of additional resources at https://t.co/29x9YTrWbg Kent Taylor, founder and chief executive of the Texas Roadhouse restaurant chain, died by suicide on Thursday after suffering from post-Covid-19 symptoms. He was 65. https://t.co/pXG1Kgv9NL Want to clean your floor without using toxic chemicals? Make like a Victorian scullery maid and break out the skim milk. https://t.co/8GOVlezt9k Older people, who represent the vast majority of Americans who are fully vaccinated against the coronavirus, are emerging this spring, filling restaurants, hugging grandchildren and booking flights. https://t.co/6B31l3l7UF RT @nytopinion: When Washington began withholding income taxes during World War II, it was viewed as a way to ensure that everyone paid. Ir… We're following March Madness 🏀. Check here for live updates: https://t.co/WtKAJ6SIxA Here's more than you needed to know about the Snyder cut. https://t.co/gkWNdmOOjz The NCAA men’s tournament has its first upset of a No. 1 seed: No. 8 Loyola-Chicago stunned Illinois, 71-58, in the second round. https://t.co/W1HthPJyWa Highly-paid soccer stars are expanding their lists of must-have luxury items to include not only expensive jewelry and the latest electronics but also fearsome dogs, private guards and even panic rooms after a series of brazen game-day home robberies.  https://t.co/NxOIVDJk9r For his new photo book, “Gentlemen’s Club,” Chris Buck spent six years interviewing and taking portraits of strippers and their romantic partners. \n\nOne question drove many of the interviews: How do you feel about your partner’s work? https://t.co/1Jw4XIrrVW In Opinion\n\n\"In Asia, massage is legal, normal and necessary. In America, it’s stained by sexism, imperialism and sex trafficking,\" Claudine Ko writes. https://t.co/6t7by1xzEQ The city of Miami Beach, concerned about crowds of spring breakers and the threat of a resurgent coronavirus, declared a state of emergency and moved up its curfew to shut down late-night partying that it said had gotten out of control. https://t.co/0jhiHUCGMi Defense Secretary Lloyd Austin landed in Afghanistan’s capital Sunday morning, becoming the first member of President Biden’s cabinet to set foot in the country that is home to America’s longest war. https://t.co/WLyaRkbvGo How a loose alliance of lawyers, lobbyists and Orthodox Jewish leaders won clemency from Donald Trump for white collar criminals. https://t.co/Dql1uTQPJ2 On the season premiere of our Still Processing podcast, the co-hosts Jenna Wortham and Wesley Morris confront one of the most offensive words in the English language. Listen to the full episode here: https://t.co/tPdL9JIeTe https://t.co/lr0I3xmEhZ RT @heytherehaIey: “Do what we’re trained to do!” We obtained recordings of internal Metropolitan Police radio traffic from the day of the… Los restos de 13 migrantes guatemaltecos que fueron baleados, quemados y hallados amontonados en la parte trasera de una camioneta a la que se le prendió fuego en Tamaulipas, México fueron repatriados el viernes. https://t.co/NJz7nO9tE9 The remains of 13 Guatemalan migrants who were shot, burned and found piled in the back of a pickup truck that had been set on fire in the Mexican state of Tamaulipas were repatriated on Friday. https://t.co/gHvTt5FQND Plan ahead and time it right: How to enjoy the great outdoors safely and conveniently in the warmer months ahead. https://t.co/qvjRmVSxlC Following former Zappos CEO Tony Hsieh's untimely death, his successor, Kedar Deshpande, faces the challenge of leading the shoe seller out of the pandemic, while also maintaining what his predecessor built. https://t.co/g111UYEzm6 A new generation of biologists is rewriting the standard explanation of how beauty evolves and the way we think about evolution itself. Listen to the narrated story on The Sunday Read and @audmapp. https://t.co/oAvW6VTuIo Women in London are furious not just about the death of Sarah Everard, but about what they see as a heavy-handed and misogynist response from the police. Some are pushing to scrap a proposed bill that would grant broad new powers to law enforcement. https://t.co/XgqFB0HTqV Stimulus payments have been a lifeline for some. Others see their \"stimmies\" as a small-scale investment opportunity. https://t.co/XfVO3cKico A New Jersey teacher says her school's administration told her to remove a reference to Donald Trump from a student’s shirt in a photo. She was suspended in 2017 after the edit ignited a national firestorm over free expression and political opinion. https://t.co/dHnU1Ku8LZ Elsa Peretti, the jewelry designer whose elegant, sculptural creations for Tiffany &amp; Company redefined tastes in accessories, has died at 80. https://t.co/8HVT0qfPN9 New York has reported its first confirmed case of the worrisome coronavirus variant first found in Brazil.\n\nThe variant, known as P.1, is highly contagious and has in some cases reinfected people who have already recovered from the virus. https://t.co/Dd37IfqXrf", "bag_of_tweets": ["Scientists are analyzing a possible link between the coronavirus and tinnitus, the medical term for a constant ringing in the ears. The suicide of Kent Taylor, the founder of the Texas Roadhouse restaurant chain, has drawn attention to the research. https://t.co/FBYmXouVX3", "Ask the Ethicist in @NYTmag: “My friends, like me, are Jewish; unlike me, they are children of Holocaust survivors. Should they not feel greater compassion for the suffering of those recent immigrants escaping violence and ethnic cleansing?” https://t.co/W0yOeyMXyg", "Videos obtained by The Times show how Brian Sicknick, a Capitol Police officer who died after the Jan. 6 riot, was attacked with chemical spray.\nhttps://t.co/nrrp5NoiIn", "RT @Karan_Singhs: India's farmers want change. Just not the way Mr. Modi wants. @emilyschmall and I report from a village in Punjab, roughl…", "The shooting in Boulder, Colorado, on Monday brought back memories for Frank DeAngelis, who was the principal of Columbine High School when it was attacked in 1999.\n\n“It’s overwhelming,” he told The New York Times. “Colorado’s been through so much.”\nhttps://t.co/REsp2L8JzF", "RT @ckoettl: #China is undermining international sanctions by allowing tankers that smuggle oil to #NorthKorea to use its infrastructure &amp;…", "RT @satariano: A recovering gambling addict shared documents with me that detail how a popular gambling app used data-profiling software on…", "RT @AndrewDasNYT: It's equal pay day, so expect to hear a lot from the USWNT players today. But here's Rapinoe getting 'LFG' into the Congr…", "“1-800 Happy Birthday,” an online audio art project, lets people listen to and leave messages for people of color who were killed by the police.\n\nThe project’s founder said it was designed to humanize the victims and give families an opportunity to heal.\nhttps://t.co/Bt9zRf3uRu", "RT @evanchill: New from Visual Investigations: Videos obtained by The Times show for the first time how U.S. Capitol Police Officer Brian S…", "In Opinion\n\n“The first two months of the Biden presidency have gone about as well as anyone in a new administration could reasonably hope,” writes @DouthatNYT. “But it’s also possible, already, to see three places where a shadow might fall.”\n\nhttps://t.co/3eJjL7LOxo", "A stockpile of 29 million doses of AstraZeneca’s Covid-19 vaccine were found languishing in a facility in Italy, further raising tensions between the pharmaceutical company and the EU.\nhttps://t.co/32RuIQjnkD", "George Segal, who received an Oscar nomination for “Who’s Afraid of Virginia Woolf?” but became known for his roles on TV comedies, died on Tuesday. He was 87.\nhttps://t.co/IhzD29l9kz", "Tesla will accept Bitcoin as payment for cars in the U.S., Elon Musk, the carmaker’s chief executive, said on Wednesday.\n\nThe company disclosed last month that it had bought $1.5 billion in the digital currency. \n\nhttps://t.co/ude38bHCbl", "Here's what we know so far about the shooting on Monday at a grocery store in Boulder, Colorado. https://t.co/qZepsVgLnp", "RT @PatrickKingsley: 👉As things stand, Israel's groundhog election has returned yet another stalemate.\n\n👉With over 90% of votes counted, a…", "Instead of using data to help problem gamblers like Gregg, critics said, information is used to keep players hooked. Sky Bet declined to comment on the record. https://t.co/nmGTepJAiG https://t.co/usE5yz1Ds8", "To a group of gambling addiction experts, data-privacy activists and industry critics in Britain, the documents Gregg obtained and shared with The New York Times offer a warning to countries like the U.S., where similar services are growing rapidly. https://t.co/nmGTepJAiG", "Sky Bet or its partners had access to Gregg’s financial information, location coordinates and an intimate portrait of his gambling habit. After he stopped gambling, Sky Bet’s data-profiling software labeled him a customer to “win back.” https://t.co/nmGTepJAiG", "Sky Bet, the most popular gambling app in Britain, compiled extensive records about Gregg, a user who had lost $15,000 during a nine-month betting binge, tracking him in ways he never imagined. https://t.co/MWCdPDMk74", "Fourteen people were arrested in Bristol, England, on Tuesday night at a rally to denounce a bill that would create new restrictions for protests and grant broad new powers to the police.\nhttps://t.co/tkbtTH59ad", "A huge container ship ran aground in the Suez Canal, blocking one of the biggest maritime arteries. More than 100 ships are stuck on either end.\nhttps://t.co/Q1TCNL1hOH", "Exclusive: New videos obtained by The New York Times show publicly for the first time how Brian Sicknick, the U.S. Capitol Police officer who died after facing off with rioters on Jan. 6, was attacked with chemical spray.\n\nHere’s what the videos show.\nhttps://t.co/puV56KYlrE", "With 90% of the votes counted in Israel’s fourth election in two years, no party has yet won enough support to form a coalition government with a majority in Parliament. The prospect of another stalemate has prompted debate over the political system.\nhttps://t.co/w8r5upwWZ4", "Jensen Karp ate a bowl of his favorite cereal, Cinnamon Toast Crunch, on Monday morning. As he began filling a second bowl, “something plopped out of the box.”\nhttps://t.co/q9SVwZHOtG", "President Biden called for a ban on assault weapons in the U.S. after 18 people were killed in two mass shootings in the span of a week.\n\nHow likely is his latest attempt at gun control to succeed?\n\nListen to today’s episode of The Daily.\nhttps://t.co/lYx9492GUY", "The suspect in the mass shooting at a grocery store in Boulder, Colorado, was charged with 10 counts of first-degree murder on Tuesday. Officials have not yet released details about a possible motive.\n\nFollow updates on the fallout from the shooting here. \nhttps://t.co/fXd8NNpnaA", "In the forests of Myanmar, students, activists and ordinary office workers are training in warfare skills to strike back at the military.\n\n“We have to attack them back,” one trainee said. “This sounds aggressive, but I believe we have to defend ourselves.”\nhttps://t.co/Dtpo4WMw6N", "RT @motokorich: Tokyo 2020’s organizers pitched the Olympics as a symbol of recovery. Now, the event itself threatens to become a trial fro…", "Hong Kong on Wednesday suspended use of the Pfizer-BioNTech vaccine after packaging defects, including cracked containers and loose caps, were discovered in a batch of doses. Officials called the halt a precaution. https://t.co/fL31kp6R9w", "The European Union drafted legislation to curb exports of Covid-19 vaccines for six weeks, a move that could badly affect supply in the U.K., among other places. https://t.co/fE3JZhYydR", "A senior official will be chosen to focus on Asian-American priorities, the White House said, after two Democratic senators said they would support only “diversity candidates” until President Biden addressed a lack of representation in his administration. https://t.co/1SyTvDpTYS", "In Opinion\n\n\"By killing measures that make voting more open to everyone, Republicans might make their fears of terminal decline a self-fulfilling prophecy,\" writes Jamelle Bouie.\nhttps://t.co/b5DwEgrURv", "An enormous container ship became stuck in the Suez Canal late Tuesday, blocking traffic through one of the world’s most important shipping arteries.\n\nThe ship ran aground amid poor visibility and high winds from a sandstorm, local officials said.\nhttps://t.co/09rxdf0dFc", "The 2020 Tokyo Olympics were framed as a symbol of recovery for Japan: from an economic slump; from a devastating earthquake, tsunami and nuclear disaster; and from a crippling pandemic.\n\nBut the Games, beset by problems, may not deliver such a legacy.\nhttps://t.co/rz5YxmAk9S", "Gov. Greg Gianforte of Montana violated state hunting rules last month when he trapped and shot a black wolf near Yellowstone National Park without first taking a mandatory education course, officials said. He received a written warning.\nhttps://t.co/HE9pFA06xj", "RT @emilyschmall: Our report from the Punjab on the perverse economics of farming in one of the world's most fertile regions. With gorgeous…", "RT @MatinaStevis: E.U. set to arm itself w/ broad new legal powers to halt covid vaccine exports for the next 6 weeks, draft legislation se…", "Prime Minister Narendra Modi of India last year pushed through new laws that would reduce the government’s role in agriculture, aimed at fixing a system that has led to huge rice surpluses. But the laws could make many farmers' livelihoods unsustainable. https://t.co/gclCBkCiI8", "North Korea test-fired two short-range cruise missiles over the weekend, South Korean defense officials confirmed. The test came just days after North Korea accused the U.S. and South Korea of raising “a stink” on the Korean Peninsula. https://t.co/cnJPPKd02K", "Try browning store-bought gnocchi in a pan for a mix of crispy outsides and chewy middles, no boiling required. https://t.co/OGZRgWt81P", "Health officials in Hong Kong and Macau said that they have suspended shots of the BioNTech vaccine after the company’s Chinese distributor uncovered packaging defects. https://t.co/1PK76HRTw8", "In a beat-up RV with his two best friends, Andrew Callaghan documented the outrageous and infuriating aspects of American life on his popular Youtube series, “All Gas No Brakes.” This month, he announced that he’d left the show. Here’s what happened. https://t.co/2plpQ3f6rj", "Video: At least 15 people have died after a devastating fire ripped through the Rohingya refugee camp in Cox’s Bazar, leaving hundreds injured and tens of thousands homeless once again, the Bangladesh authorities said. https://t.co/8aOaKMQlu0", "25 recordings, including Janet Jackson’s \"Rhythm Nation 1814\" and Kermit the Frog’s \"The Rainbow Connection,\" have been designated by the Library of Congress as audio treasures worthy of preservation. https://t.co/j7oKVKVKb4", "Prime Minister Benjamin Netanyahu’s party held a lead in Israel’s fourth election in two years, but updated exit polls projected neither his right-wing alliance nor a bloc of opposition parties had a clear path to a majority coalition. https://t.co/cX8QyfPLc1", "Paul Brock, who helped found the National Association of Black Journalists, has died. He was 89. https://t.co/rgG0iKgezx", "Faced with the second mass shooting in a week, President Biden called on lawmakers to enact stricter gun laws, saying tighter gun laws should not be a partisan issue. But Republicans in Congress showed little interest in Democratic proposals. https://t.co/hZIUqMFFIa", "George Segal, who received an Oscar nomination for “Who’s Afraid of Virginia Woolf?” but became known for his roles on TV comedies, died at 87. https://t.co/e8M7hliVsB", "“It’s overwhelming. Colorado’s been through so much.”\n\nAfter a gunman killed 10 people at a supermarket in Boulder, people across Colorado, a state scarred by a barrage of other mass shootings, wondered how it had happened again. https://t.co/4ymashOSte", "Fuller planes, higher airfares and less flexibility: Here are five things to expect if you fly this summer.\nhttps://t.co/VExN2wpzef", "President Biden announced on Tuesday that the Obamacare enrollment period, for Americans who need health insurance, would be extended until Aug. 15. https://t.co/kl9k9ubGcn https://t.co/LLSeCS7pcr", "Republican leaders and outside groups are coordinating efforts to usher in a raft of new voting restrictions in states where the party holds control, in what it sees as a path to regaining a foothold in Washington. https://t.co/eko3jEABml", "RT @NYTSports: As MLB (and, seemingly, everyone else) tries to catch up to NFTs and the NBA’s Top Shot craze, Taijuan Walker of the Mets cr…", "Breaking News: The E.U. drafted legislation to curb exports of Covid-19 vaccines for six weeks, a move that could badly affect supply in the U.K., among other places. https://t.co/pVB3NRxwNo", "Since 2012, 13 states, all controlled by Democrats, have enacted or expanded background checks for new gun purchases. Meanwhile, 14 states, all controlled by Republicans, have passed laws allowing their citizens to carry guns with no permit process at all. https://t.co/uzmVBcY5lb", "RT @katie_robertson: Medium editorial staff were told they did not have to accept the voluntary buyouts, but their jobs were not likely to…", "A police officer, a prolific gardener, a sister who was \"a beam of light\" and a father of seven were among those killed in the Boulder shooting. https://t.co/MMlnBGhSid", "This one-pan meal is inspired by the flavors of pasta con le Sarde, a classic Sicilian dish made with sardines and fennel. https://t.co/kjUpid0rsy", "When Kim Janey was 11, she was bused into a neighborhood of Boston where Black students were pelted with rocks. As the city's new acting mayor — the first Black person in the role — she hopes to help Boston step out of the shadow of that era. https://t.co/rI9Pqa2bQk", "RT @reidepstein: NEW: The Boulder shooting happened at the same time -- to the minute -- that the Iowa State Senate was voting to gut a sta…", "From 2017: While mass shootings can happen anywhere, they are only a matter of routine in the U.S. The only variable that can explain the high rate of mass shootings in America is its astronomical number of guns.\nhttps://t.co/Xg95dnbvLw", "RT @tarasbernard: Receive a stimulus check for less than expected? The I.R.S. said at least some delays may be tied to spousal debts -- and…", "\"This is clearly a shrimp tail.\" 🍤\nhttps://t.co/Q3ZVaCNf9d", "President Biden’s infrastructure plan represents a major shift in the way Democrats talk about tackling climate change: It’s no longer a side element. https://t.co/lEJevaFjze https://t.co/FIrqu4RKcX", "In Opinion \n\n“The younger generation today is the most progressive generation in the modern history of this country,” Senator Bernie Sanders tells @ezraklein. Listen to today’s episode of The Ezra Klein Show. https://t.co/hxcrkIWnjm", "“There are photo shoots, there are presidential photo shoots — and then there are Vladimir Putin presidential photo shoots,” our fashion critic @VVFriedman writes.\nhttps://t.co/FWM1kIm3d8", "Here’s what we know about the Colorado grocery store shooting so far.\nhttps://t.co/85zc5XRokf", "Dr. Vivek Murthy, who served as surgeon general during the Obama administration, was confirmed by the Senate on Tuesday to reprise that role for President Biden. https://t.co/4nCCAe29F8", "Senator Tammy Duckworth said she would refuse to vote for any of President Biden’s nominees “other than diversity nominees” until the White House addressed what she called an unacceptable dearth of Asian-Americans and Pacific Islanders serving in top jobs. https://t.co/kvRc2XlN89", "The jury for the murder trial of Derek Chauvin in the death of George Floyd includes two white men, four white women, three Black men, one Black woman and two women who identify as mixed race, according to information provided by the court. https://t.co/mdLeD89yla", "Mayor Bill de Blasio announced on Tuesday the formation of a Racial Justice Commission that he said would make policy recommendations designed to “dismantle structural racism for all New Yorkers.” Here’s what that might look like for the city. https://t.co/WDfaAApEGB", "At segregated baseball's peak, Black players were barred from earning equal wages and playing official major-league games. In @NYTMag, Rowan Ricardo Phillips asks: Are Major League Baseball's plans to add some Negro-leagues stats to its record books enough?https://t.co/9DnQ2Ninzz", "RT @PatrickKingsley: Prime Minister Netanyahu has a path to a majority and sixth term, exit polls show, potentially paving the way for one…", "Trump Hotels have been dropped by the luxury travel group Virtuoso. The global network of travel advisors will no longer offer the 10 hotels that operate under the Trump brand to its high-end clients.\nhttps://t.co/L0NiP1bQFx", "Breaking News: Prime Minister Benjamin Netanyahu’s party held a lead in Israel’s election, exit polls indicated, giving him a chance of staying in power for a sixth term. https://t.co/vG2owRfuPB", "RT @herbertnyt: Netanyahu wins a plurality, exit polls show, and has a path to a sixth term. https://t.co/HrPpvnp8iF", "RT @MichaelPaulson: To work or not to work? The labor union Actors' Equity is increasingly under pressure, from performers and producers, o…", "RT @jimtankersley: A driving philosophy behind Biden's emerging infrastructure plan: The admin's belief that there is no way to separate Am…", "President Vladimir Putin got a coronavirus vaccine on Tuesday, the Kremlin said, ending months of holding out even while he was promoting Russia’s domestically made shots. https://t.co/nAs4SRu1hU", "Israelis are voting today and Palestinians are scheduled to have their own elections in May.\n\nWhile many Israelis feel numbed by their fourth election in two years, Palestinians are excited about the chance to vote for the first time in more than a decade. https://t.co/z55W3do06r", "Breaking News: U.S. officials and an independent panel accused AstraZeneca of essentially cherry-picking trial data on the effectiveness of its vaccine. https://t.co/sQ0Bric7ub", "After international spectators were banned from this summer’s Tokyo Olympics, fans are realizing that getting refunds for their tickets may not be easy, or fast. https://t.co/U4fegu74x6", "Months after the presidential election highlighted problems in the Postal Service, the agency has failed to restore its target delivery times. In mid-December, as little as 62% of first-class mail was delivered on time, according to Postal Service data. https://t.co/n6k5wElBys https://t.co/bGzTHBq1oC", "AstraZeneca’s latest blunder has further undercut the effort to sell people on one of the most potent and indispensable coronavirus vaccines, scientists say. https://t.co/OH46GTKUHk", "Disney has pushed back the release of “Black Widow,\" the hotly anticipated Marvel superhero film, from May 7 to July 9. When it does hit theaters, the film will also be available on Disney+. https://t.co/i96tIvT4KX", "RT @PatrickKingsley: It's Groundhog Day in Israel — the 4th election in 2 years\n\n👉Who are Bibi's main rivals?\n👉What are voters saying?\n👉Wha…", "10 people were killed on Monday by a gunman who opened fire at a grocery store in Boulder, Colorado. They included a police officer, a young grocery store worker and a retiree filing orders for Instacart. https://t.co/kPLW9lyKgE https://t.co/PzAEP6tune", "RT @NYTSports: When Olympics organizers barred foreign fans from the Tokyo Games, travelers who had invested thousands of dollars in ticket…", "RT @TaylorLorenz: Andrew produced groundbreaking reporting from Burning Man, the Area 51 raid, a Flat Earth conference and more. As the BLM…", "The suspect charged with the murders of 10 people at a Boulder, Colorado grocery store is a 21-year-old man from a nearby Denver suburb who used an AR-15 type of assault rifle, law enforcement officials said.\nhttps://t.co/5DCCqdjcpw", "It's very rare for people who have been partly or fully vaccinated to get Covid, but the few cases serve as a reminder that you should still wear a mask after you get the shot. https://t.co/6WCfFzdiR5", "RT @herbertnyt: Israel votes today for the 4th time in 2 years, hoping to break the gridlock. Live coverage here: https://t.co/KQKqOHlzEr", "Breaking News: President Biden urged lawmakers to renew bans on assault rifles and high-capacity ammunition magazines. This “should not be a partisan issue,” he said. https://t.co/mxpoSr84Qm", "“Cold? What cold?” asks our fashion critic, @VVFriedman, who writes that few global leaders embrace the staged photo shoot with “such creative, yet clichéd, fervor,” as President Vladimir Putin of Russia.\nhttps://t.co/OFJwVkONbC https://t.co/qX2CnbRknW", "RT @nytopinion: Join @jbouie to discuss how the Republicans have given up trying to win a national majority https://t.co/GzOeoeTtGX", "It represents gravediggers, cereal makers, cannabis growers and fast fashion salespeople.\n\nThe Retail, Wholesale and Department Store Union may be one of the most eclectic labor unions in the U.S., and it is on the cusp of organizing Amazon workers. https://t.co/7Ym0CgSsOS", "RT @PatrickKingsley: 👉Why is Israel holding a 4th vote in 2 years?\n👉How has the stasis affected Israeli life?\n👉Who are the main candidates?…", "Senator Chuck Schumer will ask President Biden to name Damian Williams the next U.S. attorney in Manhattan, virtually ensuring that the famously powerful office will be led for the first time by a Black man, a person briefed on the decision said. https://t.co/412hBbxm5c", "RT @cliffordlevy: Schumer Seeks Appointment of First Black U.S. Attorney in Manhattan\nNo Black prosecutor has led the office, which has han…", "A new study illuminates long-term neurological symptoms in people who had mild cases of Covid, underscoring an emerging understanding that for many people, long Covid can be worse than their initial bouts with the infection. https://t.co/5Z9i2xK0gl", "Survivors of the grocery store shooting in Boulder, Colorado, described a chaotic scene and the urgent calls they made to loved ones as they hid from the gunman. https://t.co/4avUahXDtt https://t.co/XQGIrVKVyl", "There have been at least 29 shootings with four or more fatalities in the last five years in the U.S., according to a database compiled by the Violence Project. https://t.co/GO5KG3Bwxe", "RT @nytimesbusiness: Watch live: Federal Reserve Chair Jerome Powell and Treasury Secretary Janet Yellen testify before the House Financial…", "Today’s Great Read\n\nOwning a home in Houston has long been a promise of upward mobility for working-class families. After years of surviving hurricanes, floods and now a winter storm, these houses are no longer the safety net they were intended to be. \nhttps://t.co/0hAdECATuk", "The prime minister is on trial. There's no national budget. The cabinet is in disarray. And now, in the middle of a pandemic, another election.\n\nIsraelis vote on Tuesday for the fourth time in two years, hoping to end a political deadlock. Follow live. https://t.co/S62Gm3C6hJ", "Texas will make all adults eligible for coronavirus vaccinations starting Monday. https://t.co/yUcc31Hyzn", "RT @nytgraphics: Les CDC - Centres américains de prévention des maladies —  encouragent les écoles à rouvrir le plus rapidement possible, m…", "Residents of England who travel abroad without a valid reason could be fined 5,000 pounds, or $6,900, starting Monday if new regulations are approved. https://t.co/B7TPFzbsoS", "RT @VVFriedman: The latest notable addition to the canon of Vladimir Putin he-man photo ops. It's like an absurdist art form unto itself -…", "Interstellar comet? Cosmic iceberg? Alien space wreck?\n\nTwo astronomers have a new explanation for Oumuamua, the mysterious rock that zoomed through our solar system in 2017.\nhttps://t.co/RBPofNNCuj", "Breaking News: A 21-year-old man was charged with 10 counts of murder after a shooting on Monday at a grocery store in Boulder, Colorado. https://t.co/ANkQ6trztn", "RT @MarkLandler: A year after European leaders first locked down their countries, clashes between police and protesters are becoming common…", "In a changed Washington, Sen. Elizabeth Warren is wielding influence her own way. She has shepherded former staff members into powerful jobs and kept her progressive ideas in the policy conversation with a steady stream of legislative proposals. https://t.co/LS3ynROTMp", "RT @cliffordlevy: NEW: NYC’s municipal workers will begin to return to offices on May 3. The change is expected to affect about 80,000 empl…", "RT @Karan_Singhs: \"This is the second time I lost everything in my life.\" Our @nytimes report on the deadly fire that ripped through Rohing…", "Tesla is facing renewed scrutiny of its Autopilot technology in the U.S. The National Highway Traffic Safety Administration is investigating 23 recent crashes in which drivers were, or may have been, using the automatic steering and braking system.\nhttps://t.co/TYrVe2HcZs", "RT @migold: A massive fire tore through an assisted-living home in Rockland County this morning.\n\n• One resident was killed. Two firefighte…", "RT @emmagf: *NEW* Mayor Bill de Blasio is creating the New York City Racial Justice Commission to recommend major policy reforms to \"disman…", "A fire at a sprawling Rohingya refugee camp in Bangladesh killed at least 15 people, injured hundreds and left tens of thousands homeless on Monday.\n\n“This is the second time I lost everything in my life,” said one person whose home was destroyed.\nhttps://t.co/UIaTrYZBTP", "One resident was killed and several others were seriously injured in a large fire at an assisted living home in Spring Valley, New York, on Tuesday morning, officials said. One firefighter is missing. https://t.co/Je3jSpvfqt", "A gunman opened fire inside a grocery store in Boulder, Colorado, on Monday, killing 10 people, including a police officer, officials said. A suspect is in custody. https://t.co/3cgOK6RL5t", "A familiar partisan divide on U.S. gun regulation has re-emerged after 18 people were killed in two mass shootings within the span of a week. The Senate Judiciary Committee will hold a hearing on gun violence on Tuesday morning as advocates plea for action.https://t.co/r3gTp7AJeU", "A tenement building in Madrid, captured in a famous photograph by Robert Capa, will be transformed into a cultural center for his work and the city’s wartime history.\nhttps://t.co/GEjGzQ4MIJ", "The Supreme Court on Monday looked for a middle ground in a case pitting union campaigns against private property rights. It seemed poised to rule that a California regulation allowing labor organizers to enter farms 120 days a year was too broad. https://t.co/8Lwp3bQCAp", "New York City’s municipal workers will begin to return to offices on May 3, according to documents shared with The New York Times. Some workers and union leaders fear it is premature.\nhttps://t.co/4EEeZzgmSG", "Follow live updates here. \n\nhttps://t.co/zoFxI9J9Fs", "Taylor Shaver, who works at a dry cleaning and laundry business near the supermarket, said she heard at least 10 gunshots and saw people running.\n\nhttps://t.co/hBXc7lj5om https://t.co/2dQcjx6Z80", "Sarah Moonshadow was at the checkout with her son when she, too, heard shots.\n\nhttps://t.co/hBXc7lj5om https://t.co/y6zuxBG5VD", "A gunman killed 10 people at a grocery store in Boulder, Colorado, on Monday. Witnesses recounted moments of terror.\n\nAlex Arellano was working at the supermarket, King Soopers, in the meat department when he heard gunshots. \n\nhttps://t.co/mFbQZbPmgL https://t.co/B00lHxD2qO", "“Numerous” residents and firefighters were injured in a large fire at an assisted living home in Spring Valley, New York, on Tuesday morning, officials said. More than 100 residents were evacuated. https://t.co/Ke86SwTvRi", "Some investors have started distancing themselves from the photo-sharing app Dispo over its co-founder, the YouTube creator David Dobrik. He has been accused of playing a role in a sexual assault scandal involving a former member of his “Vlog Squad.” https://t.co/AObB1NNmqj", "A sense of smell is crucial to what @tejalrao, a New York Times restaurant critic, does. But after she contracted the coronavirus, it disappeared.\n\nToday’s episode of The Daily follows her quest to regain her ability to smell.\nhttps://t.co/CsUJCxDi2V", "RT @sangerkatz: New health insurance benefits under the American Rescue Plan are substantial. But getting them may be a slog.\n\nRead me and…", "U.S. officials said AstraZeneca might have included outdated information from its Covid-19 vaccine trial, providing an “incomplete” view of the data. https://t.co/aiYIKwVwYL", "Eric Talley, an 11-year veteran of the Boulder Police Department, was one the 10 people who died in a shooting at a Colorado grocery story on Monday.\n\n“He was the first on the scene, and he was fatally shot,” Chief Maris Herold said, holding back tears.\n\nhttps://t.co/SdZIkYPbeQ", "Facing a surge in coronavirus cases, Mumbai, India’s financial hub, has begun randomly testing people in crowded places. The tests are performed without consent, officials said, and anyone who resists is in violation of India’s colonial-era epidemic act. https://t.co/kVTSZV5lC5", "RT @Kellen_Browning: Microsoft has been in talks to buy the chat app Discord in a deal that could top $10 billion. That'd be a big get for…", "Soaring housing prices have long been a source of tension in South Korea. Now several government officials are under investigation for contributing to the problem. Young people are especially angry, saying they're fed up with corruption and failed policies.https://t.co/iDqhkFEbml", "RT @Lattif: Last week, I spoke to a Kenyan nurse recovering from Covid who watched vaccines first being doled out on TV. My latest report w…", "A gunman opened fire at a grocery store in Boulder, Colorado, on Monday, killing 10 people, including a police officer. A suspect was taken into custody, officials said.\n\nFollow live updates here.\n\nhttps://t.co/JbTbZU7F75", "A proposed crime bill that would give the police in Britain more power to deal with nonviolent demonstrations has set off a string of \"kill the bill\" protests across the country. Here's what you need to know.  https://t.co/6Yb6ZF8tC3", "RT @ConstantMeheut: Emblematic bookstores in the Latin Quarter are closing, the latest episode in a slow cultural erosion of the area.\n\n“It…", "Protesters on both the left and right across Europe have poured into the streets to lash out against coronavirus restrictions. The often harsh responses from the police are raising questions about the legitimacy of law enforcement.\nhttps://t.co/iencynoP6R", "Largely overshadowed by their Egyptian counterparts, Sudan’s ancient pyramids and archaeological sites may finally be poised to receive broader recognition.\nhttps://t.co/aYe8OUctpI", "RT @MatinaStevis: Germany introduces strict five-day lockdown over Easter, asks people to stay home \n\nhttps://t.co/g7beVUaPPl", "Here's a look at some of the highlights worth watching from late-night TV. https://t.co/YkoT9m93il", "RT @RebeccaDRobbins: News: NIH just put out a highly unusual statement saying the monitoring board for the $AZN US trial \"expressed concern…", "A Turkish driver was arrested on suspicion of trying to smuggle people to France from England after 16 people were found in his truck. There were no deaths, but the case had echoes of a 2019 smuggling case in which 39 people from Vietnam died in a truck. https://t.co/Z6nTv1JydN", "Discord, a social media company popular with gamers, has held deal talks with Microsoft for a transaction that could top $10 billion, according to people briefed on the situation. https://t.co/2AkPPFQkbC", "Nicola Sturgeon, Scotland's first minister, did not knowingly breach rules or mislead the Scottish Parliament about an investigation of her predecessor, an inquiry found. The report effectively clears her of allegations that led to calls for her to resign. https://t.co/AjnXhVaaVP", "The Shigir Idol, newly dated at 12,500 years old, “represents a unique and unparalleled find in Europe,” one archaeologist said. “One could wonder how many similar pieces have been lost over time due to poor preservation conditions.” https://t.co/PCklvxAm7F", "Breaking News: U.S. officials said AstraZeneca might have included outdated information from its Covid-19 vaccine trial, providing an “incomplete” view of the data. https://t.co/FApsgV6AKG", "House Democrats convened a panel on Monday to consider a renewed push to grant statehood to Washington, D.C. According to a bill passed by the House last summer, the 51st U.S. state would be called Washington, Douglass Commonwealth. https://t.co/MuJLdngjxI", "Ten people, including a police officer, were killed when a gunman opened fire at a grocery store in Boulder, Colorado, on Monday, the authorities said. A suspect was in custody, according to the city’s police chief. Here's what we know. https://t.co/2zBnXBfnvV", "The deadly shooting in Boulder, Colorado, on Monday was the second mass shooting in the U.S. in less than a week. Before the Atlanta-area shootings last week, there had been no such killings since March 2020, according to the Violence Project. https://t.co/7epHn4ZEDd", "Justice Department officials have reviewed potential sedition charges against members of the Oath Keepers militia group who attacked the Capitol on Jan. 6, and they have been weighing whether to file them for weeks. https://t.co/5ShRHH8Y56", "A judge ruled this month that Boulder, Colorado, could not enforce bans on assault-style weapons and large-capacity magazines. It was not known whether any weapons covered by the bans were involved in the grocery store shooting on Monday.\nhttps://t.co/e8W1qKmk77", "When the Canadian police arrived at the home of Debbie Baptiste in August 2016, encircling the house and carrying rifles, they informed her that her son was dead. Then they asked if she had been drinking and told her to “get it together.” https://t.co/OilwKzw0ns", "Breaking News: Ten people, including a police officer, were killed in a shooting at a grocery store in Boulder, Colorado on Monday. The suspect is in custody, the police said. https://t.co/y9pX40eZ4i", "Witnesses of a shooting on Monday at a grocery store in Boulder, Colorado, recalled moments of terror as they hid and fled.\n\n\"The shots are getting closer,\" a man who was working in the store recounted. \"I’m thinking of my parents, and I was freaking out.\" https://t.co/Gqqgr3OC37", "A pair of hard-right Republicans announced Senate bids in Missouri and Alabama on Monday, igniting what are expected to be contentious primary races for open seats in two conservative states. https://t.co/lLO7Kp16p4", "Colorado has been the scene of a number of fatal shootings in recent years. Here are a few that made national headlines. https://t.co/uh0AfDTg5W", "Here's what we know so far about the shooting at a grocery store in Boulder, Colorado:\n— Multiple people were killed, including a police officer.\n— A suspect was in custody and was injured.\n— President Biden was briefed.\n\nFollow our live updates here: https://t.co/aungPLZO11", "“The wealthy that used to spend money on travel aren’t using it, so everything collectible is skyrocketing in value,” the editor of a watch site said. A number of retailers were reticent to speak about the trend during a time of growing wealth inequality. https://t.co/wQrEsU1D3j", "Breaking News: Multiple people, including a police officer, were killed when a gunman opened fire inside a grocery store in Boulder, Colorado. A suspect is in custody, the police said. https://t.co/DJe25OYOXk", "Watch live: The police in Boulder, Colorado, are offering an update on today's shooting at a grocery store. https://t.co/HzIlFeakau", "A proposal in Evanston, Illinois, would offer a blueprint for distributing $10 million in reparations to Black residents in the form of housing grants.\n\n“It is the reckoning,” said Robin Rue Simmons, an architect of the plan. https://t.co/CvV1sxnxrB", "You’ll just need a few things from the pantry. \nhttps://t.co/sm3PmWgA0w", "There were at least five different attacks against people of Asian descent in New York City over the weekend, the police said, and at least four of them are being investigated as possible hate crimes. https://t.co/nF2YyHXqtz", "Dozens of police officers in Boulder, Colorado, were responding to reports of a shooting at a grocery store on Monday, where witnesses reported hearing gunshots and seeing several people wounded in and around the building. https://t.co/n0ayys0Vjo", "Missed today's #MarchMadness action so far? We've got you covered:\n— Gonzaga's men's team cruised into the Sweet 16\n— Oregon upset second-seeded Iowa in the men's tournament\n— The first women's tournament upsets included wins for Belmont and Wright State\nhttps://t.co/hu21cXeAdM", "RT @katierogers: On the road with Harris, an all-purpose messenger for an administration grappling with sizable problems on multiple fronts…", "The U.S. placed sanctions on top Chinese officials, as part of a multinational effort to punish Beijing for human rights abuses against the largely Muslim Uighur minority group, which American officials have called a genocide. https://t.co/xQoPPzeoBu", "A fossil dig in Tunisia highlights the way the next generation of paleontologists are trying to change scientific practices which exploited native peoples and their natural histories. https://t.co/Q9quj47UCP https://t.co/dbXIebDyoK", "The award-winning filmmaker Charles Ferguson is suing the company that owns the History Channel, saying that it suppressed his “Watergate” documentary out of fear that allusions made to the Trump administration would offend viewers. https://t.co/Bs3VaMk3XD", "RT @nytimesworld: The remains of 13 Guatemalan migrants massacred in northern Mexico were returned home this month, where @Volpe_Daniele do…", "Indoor fitness classes, which often result in heavy breathing in poorly ventilated rooms, can be risky. Here’s a guide to help you decide if your gym is doing enough to prevent the spread of Covid-19. https://t.co/2uAZo4cZDP", "A digital artwork by the artist Beeple recently sold for $69 million. Instead of a physical object, the highest bidder received a “nonfungible token.”\n\nIf you still find NFTs hard to wrap your head around, here’s what you need to know. https://t.co/0ntD8bO3NC", "A U.S. trial found AstraZeneca’s Covid-19 vaccine was 79% effective with no serious side effects. Dr. Anthony Fauci on Monday discussed the results of the trial. https://t.co/0TqoNi5icc https://t.co/qOO5EsjMIx", "For $75 a person, fans can walk around Disney California Adventure — where no rides are running but costumed characters wave from a distance — and buy food and merchandise. The demand has been astronomical. https://t.co/FQv08zJq18", "In Opinion\n\nThe most visible Christians in recent years have been white conservatives who emphasize issues that Jesus never explicitly mentioned, @NickKristof writes. But now more progressive Christians are moving onto center stage. https://t.co/2VjRY0w108", "If Lana Del Rey’s great “Norman _____ Rockwell!” seemed to capture a generational malaise, her latest album, “Chemtrails Over the Country Club,” offers insights that are more sharply personal, Lindsay Zoladz writes.\nhttps://t.co/iCeD2cbxB7", "RT @koblin: In the summer, there were accusations of a toxic workplace. And in the six months since, a million viewers have tuned out of Th…", "Roughly three-quarters of the Covid vaccines given globally have gone to only 10 countries. At least 30 countries have not yet injected a single person. Scientists warn that such unfair treatment could not only haunt poorer countries, but also rich ones. https://t.co/PIX8DmTW1Q", "Millions of older Americans cannot leave home to go to a vaccination site. Doctors across the U.S. have set out to solve the logistical challenge by bringing the shots to them. https://t.co/112RC9qhg4", "RT @arappeport: Elizabeth Warren plans to roll out a \"real corporate income tax\" this week and she's going to keep selling Janet Yellen on…", "In Opinion\n\n“For too long, women have been punished and killed because of men’s inability to deal with issues around rejection, desire and shame,” writes @JessicaValenti. She asks: “How many women have to die for men’s sexual issues?” https://t.co/flQxndPdoz", "Ellen DeGeneres loses 1 million viewers after reports of a toxic workplace\nhttps://t.co/p3GWgf8qVj", "Officials in Miami Beach on Sunday extended an emergency curfew for up to three weeks. The move came a day after South Beach descended into chaos, with the police struggling to control spring break crowds and making scores of arrests. https://t.co/InLNgCaUd6 https://t.co/1CzD7axbyG", "LeBron James’s ownership stake in the Boston Red Sox is the latest example of athletes realizing that power lies not only in grass-roots activism and championships, but also in having a seat in team boardrooms, our columnist @kurtstreeter writes. https://t.co/VeqAQ81O5i", "The loss of more than a million viewers since September translates to a 43% decline for “The Ellen DeGeneres Show,\" representing a steeper drop than any of its competitors. https://t.co/E8V7MDxS5C https://t.co/xAttEAvp6j", "Elgin Baylor, the Lakers’ Hall of Fame forward whose acrobatic brilliance made him one of the NBA’s greatest players, died at 86. https://t.co/LhdwaldpHb", "The Atlanta-area shootings underscored for many women how racism and sexism are inextricably linked, leaving them uniquely vulnerable to violence and discrimination. https://t.co/Cawec5giqF https://t.co/GpaXm3LtJk", "Enrollment in health insurance under the Affordable Care Act has surged during the first two weeks of an open enrollment period created by President Biden. Alabama and Wyoming, two deeply conservative states, are considering its Medicaid expansion. https://t.co/Vq8A1zAeYA", "A small number of people, like Ivan Agerton, have developed psychotic symptoms as a mysterious aftereffect of Covid-19. After a mild case of Covid, he described being seized by paranoid delusions that turned life into a nightmare. https://t.co/YrDt7CYgZF https://t.co/QUKZMnRvgf", "Violent protests erupted Sunday night in the British city of Bristol over a proposed police and crime bill that would create sweeping new restrictions on protests and grant broad new powers to the police. https://t.co/szcksbBDr5 https://t.co/K7cTOYO0uU", "RT @nytrealestate: Jeffrey Epstein's mansion on the Upper East Side was purchased for $51 million by Michael D. Daffey, a former Goldman Sa…", "Ellen DeGeneres has faced a steep ratings decline, losing more than a million viewers since September, after reports of a toxic workplace at her show. It is a startling setback for one of daytime television’s most successful franchises. https://t.co/01cmSorOgU", "Many Americans know they’ve put on weight during the pandemic, but it’s been difficult for experts to detail the scope. One small study suggests that adults under shelter-in-place orders across the U.S. gained nearly two pounds a month. https://t.co/LpRziUcKZJ", "As Asian-American New Yorkers experience violence and more subtle forms of bigotry, Andrew Yang's mayoral candidacy has received new attention. His critics say that some of his past comments have fed racial stereotypes. https://t.co/rmSFeHT50q", "RT @nytgraphics: New York City high schools on Monday reopened for in-person learning.\n\nThe New York Times worked with experts to better un…", "President Biden’s advisers are preparing to propose up to $3 trillion in spending on efforts to boost the economy, improve infrastructure, minimize carbon emissions and reduce inequality — paid for, in part, by tax increases on corporations and the rich. https://t.co/6rnPrluUzM https://t.co/OATHj48VZb", "The phantom odors and distorted sense of smell that can linger after Covid-19 have made an already-isolating year worse for people affected by the condition, parosmia. \n\nPleasant aromas, like a delicious meal or the scent of a romantic partner, turn foul.\nhttps://t.co/TlcDNzl8IK", "Congress may enact a ban of menthol cigarettes, which have been aggressively marketed to Black Americans. 85% of Black smokers use menthol brands that are easier to become addicted to and harder to quit than plain tobacco, according to the FDA. https://t.co/qTmuuUjZ1O", "RT @PamBelluck: After Covid came psychosis: “Single-handedly the most terrifying thing I’ve ever experienced,” said Ivan Agerton. He and hi…", "A more intense phase has emerged in the campaign for New York City mayor: Criticism of Andrew Yang is getting sharper. Here are 5 takeaways from the race.\n\nhttps://t.co/LzzhUkWck6", "RT @jimtankersley: EXCLUSIVE: Biden's economic advisers are preparing to present him with $3 trillion in new spending for the next phase of…", "This vegan chocolate cake could not be easier. \nhttps://t.co/Qt0oT2j6eu", "RT @katieglueck: As NY’s diverse Asian-American constituencies grapple w/violence,Yang&amp;other candidates are racing to show how they would l…", "In Opinion\n\nAre the digital assets known as nonfungible tokens, or NFTs, the new frontier for ownership on the internet? @karaswisher talks to the artist Beeple, who recently sold an encrypted digital collage for $69 million, on a new episode of Sway. https://t.co/q8d9tT5kBk", "How North Korea evades strict international sanctions to get oil\nhttps://t.co/jq9aXfEeiH", "Junior Goldman Sachs analysts put together a presentation detailing what they described as workplace abuse, including 100-hour weeks.\n\nAfter it came to light last week, we heard from many current and former investment bankers. Here’s what they said.\n\nhttps://t.co/1P7agG0kaA", "New York City public school students who have been learning remotely this year will have another opportunity to sign up for in-person learning, starting this Wednesday until April 7, Mayor Bill de Blasio said on Monday. https://t.co/4ZrbspsHKc", "New York will allow anyone 50 and older to get vaccinated beginning on Tuesday, Gov. Andrew Cuomo said on Monday. https://t.co/R9QHr5beDq", "Today’s Great Read: \n\nYounger paleontologists are attempting to change scientific practices that descend directly from 19th century colonialism, which exploited native peoples and their natural histories.\nhttps://t.co/nBRxkkye9O", "In Opinion\n\n“In our scientific rush to develop, manufacture and deliver vaccines more rapidly than ever in history, countries around the world have failed to engage the public,” writes Heidi Larson, an anthropologist and expert on vaccine confidence. https://t.co/IitvV6pFNG", "More than a dozen of our journalists examined the maze of connections involved in these illicit oil transfers, and used findings from a new analysis by @RUSI_org and @C4ADS. This is how they approached their months of reporting.\nhttps://t.co/8otSaYweQm", "We unraveled murky networks around the oil transfers. Many connect to the Taiwan operation of a major oil trader, the Winson Group. Several individuals have ties to a small village in China. Here are five takeaways from our investigation. https://t.co/u8cK4yiUqk", "North Korea needs oil for civilian purposes, but also uses it for its nuclear and ballistic missile program. The United Nations Security Council has imposed strict sanctions aimed at limiting North Korea’s imports of refined petroleum. https://t.co/ZPLBpLE13Z https://t.co/b461f9SNDQ", "We focused on one ship: the Diamond 8. Months of combing through records, satellite imagery and ship-tracking data revealed how it made illicit voyages to North Korea and the companies around it. Watch our visual investigation. https://t.co/ZPLBpLE13Z https://t.co/cH9VLzVDYu", "A mysterious tanker. Oil transfers at sea. A retired sailor and a multinational oil trader. They all are part of the same convoluted web that reveals one way North Korea evades strict international sanctions to get oil. \nhttps://t.co/ZPLBpLE13Z", "RT @asher_elbein: For @NYTScience, I wrote about the lingering imperialist roots of paleontology—and how some researchers are trying to pus…", "A year ago, Georgia was one of four states that had no hate crime legislation. But the Atlanta area shootings last week that left eight people dead, six of them women of Asian descent, is now providing a test of the state's new law. https://t.co/n7A5piNhPj", "The word “sedition” has a complicated history in the United States. Here’s a look at what the term means.\nhttps://t.co/ZMQ95Kpzda", "Donald Trump endorsed Jody Hice, a Republican congressman running against the Georgia secretary of state, Brad Raffensperger. Trump has been critical of Raffensperger since he refused to overturn the state’s presidential election results. https://t.co/qKqwVHLlAf", "The U.S. Supreme Court has been asked to decide whether the requirement for only men to register for the draft is unconstitutional.\n\nIt “reinforces the notion that women are not full and equal citizens,” lawyers wrote in a petition.\nhttps://t.co/G7jIMh6hOx", "RT @jestei: I met some fun seniors who have two shots.....https://t.co/D14uWUNmu1", "RT @cegoldbaum: The MTA was pulled from crisis by billions in federal aid. But as an agency that relies on fares to operate, it needs rider…", "Leon Black, the Wall Street billionaire who was the main client of the disgraced financier Jeffrey Epstein, is stepping down as chief executive of Apollo Global Management, several months ahead of schedule. https://t.co/XedtI9vVin", "Breaking News: The Supreme Court said it would review an appeals court’s decision that overturned the death sentence of one of the 2013 Boston Marathon bombers.\nhttps://t.co/w8D320W2rv", "RT @AlanYuhas: Tom Garvey, 78, says he lived in a concession stand in Philly’s Veterans Stadium for three years, 1979-81. Four people told…", "\"It is repressed and treated with denial. That doesn’t make it go away. It’s controlling how people respond to new trauma, whether it’s a diagnosis or a pandemic or a January 6th.\" @NYTMag talks to a palliative-care doctor on trauma and healing in the U.S. https://t.co/mGd2R7sc0f", "RT @SherylNYT: NEW: The Biden White House, spending millions in stimulus dollars, is setting aggressive benchmarks to mark a full recovery:…", "New York City’s transit agency was pulled from crisis by billions in aid. But its ridership may never fully return, threatening its future.\nhttps://t.co/GOEhlcmb0U", "Prosecutors in Tokyo on Monday charged a father and son from the U.S. with helping Carlos Ghosn, the former Nissan chief, flee Japan, where he was awaiting trial on four counts of financial wrongdoing.\nhttps://t.co/CBtl4dRybC", "Rep. Tom Reed, Republican of New York, apologized on Sunday to a woman who accused him of touching her inappropriately and said he would not run for any political office in 2022, including governor. https://t.co/EMYNwV7QSf", "Microsoft announced Monday that more workers would be allowed back into its headquarters in Redmond, Washington, starting on March 29. \n\nThe company said employees will be required to wear masks and maintain social distancing.\nhttps://t.co/hRNEg6bo5D", "The Turkish lira plunged 10% against the U.S. dollar on Monday after President Recep Tayyip Erdogan fired the head of the central bank, who had been in the job just four months. https://t.co/t0hS5T2Dr9", "“I don’t necessarily represent or identify with everybody in law enforcement,” said Aaron Appelhans, the first Black sheriff in Wyoming's history. “I come in with some different ideas of how to go about doing things.” https://t.co/KfeRgqxAsp", "In Opinion\n\n\"I thought my mother and I would react the same way over the horrific events in Atlanta,\" writes Jennifer Hope Choi, who has written about the Korean community in the American South. \"Why didn’t we?\"\n\nhttps://t.co/BevUwHS6FV", "RT @ckoettl: A mysterious tanker. Oil transfers at sea. A retired sailor &amp; a multinational oil trader. What do these four things have in co…", "RT @mikiebarb: On today's Daily: Even as vaccinations ramp up there's a group of people for whom the lingering affects of the pandemic neve…", "“To look out there at rush hour and see nobody, it finally hit me,” one subway conductor in New York City said. “It was actually scary. I thought, ‘Wow, this is bad. This is really, really bad.’”\nhttps://t.co/alyQaQC3Gl", "RT @emmagf: The story behind Andrew Yang’s omnipresent scarf, and who got donations from Steven Spielberg and Norman Lear? \nOur weekly roun…", "David Dobrik amassed millions of subscribers on YouTube as part of a group called the Vlog Squad. But an investigation detailing sexual assault allegations against a former Vlog Squad member has led many viewers to angrily re-evaluate his work.\nhttps://t.co/jpcNBl9FzP", "Canadian Pacific and Kansas City Southern announced plans to combine in a $29 billion deal that would create the first railroad network connecting the U.S., Mexico and Canada. https://t.co/K0jrBCgMh8", "Kent Taylor, the founder and chief executive of the Texas Roadhouse restaurant chain, died by suicide on Thursday after suffering “post-Covid-related symptoms, including severe tinnitus,” the company and his family said in a statement. He was 65.\nhttps://t.co/ocpQoKfPok", "RT @RebeccaDRobbins: Long-awaited $AZN data from the n=32k US trial (79% efficacy, 80% in over 65s, no severe cases in vaccine group, no sa…", "Mario González heard the gunfire from inside Young’s Asian Massage. He immediately worried for his wife, Delaina Ashley Yaun, but says police detained him before he could check on her. Only later was he informed that she had been killed. https://t.co/q906TqZecK", "American and European officials signed away opportunities that would have guaranteed access to coronavirus vaccines to billions of people in developing countries, a choice that could prolong the pandemic globally. https://t.co/iOKgKSflqL", "A U.S. trial found AstraZeneca’s Covid-19 vaccine was 79% effective and completely prevented the worst outcomes from the disease while causing no serious side effects.\nhttps://t.co/FZM7H8ztpd https://t.co/ZaF70g326S", "Officials in Miami Beach on Sunday extended an emergency curfew for up to three weeks. The move came a day after South Beach descended into chaos, with the police struggling to control spring break crowds and making scores of arrests.\nhttps://t.co/7bHh67VYc9", "RT @muyixiao: [THREAD] A tanker repeatedly delivered illicit oil to North Korea. We investigated it.\n\nWe found elaborate networks, many con…", "RT @damiencave: From fires to floods, Australia's vulnerability to climate change continues to become more and more apparent. https://t.co/…", "The closure of the Gibert Jeune bookstores, a beloved institution in the Latin Quarter of Paris, strikes at the heart of the neighborhood’s identity: access to culture at an affordable price.\nhttps://t.co/3UBpG5YCZG", "Evidence in the Capitol riot investigation most likely supports sedition charges for some of the suspects, a federal prosecutor told “60 Minutes.” https://t.co/pBTJSlHNHD", "RT @FatmaFaizi: In Kabul’s Street, Dogs Rule the Night \n\nDogs are the reflection of people’s situation in Kabul. They are sad, hungry, angr…", "Ivan Agerton, a 50-year-old adventure photographer, experienced psychosis after contracting the coronavirus. Ivan’s story is uncommon, but it is not unique.\n\nToday’s episode of The Daily looks at the potential long-term neurological effects of Covid-19.\nhttps://t.co/YkAW4ppPmQ", "RT @stefsaul: We interviewed @bjaypak  @ChuckEfstration and other Georgia leaders on hate crimes legislation, and whether it should be used…", "Nearly 20,000 people in eastern Australia have been evacuated after a deluge from two massive storms.\n\n“There is a very strong link between global warming and that intensification in rainfall,” a scientist from the University of New South Wales said.\n\nhttps://t.co/8Ws3CUJaku", "“There are dogs and armed thieves who make people’s lives here hell.”\n\nAs an unrelenting war drags on, civilians in Kabul, Afghanistan, live in fear of targeted attacks. But at night, another war is being fought – against criminals and packs of stray dogs. https://t.co/MNf8wH09NW", "RT @KeithBradsher: How hard is it now to travel to China? “Leave your partner and children behind. Quarantine for up to a month. Get inocul…", "A Chinese court tried Michael Kovrig, a former Canadian diplomat, on accusations of spying. It was the second such trial in recent days and one that will most likely intensify tensions among China, Canada and the U.S. https://t.co/qJhq47yymo", "For the past year, people trying to go to China have run into some of the world’s toughest border controls. The restrictions have hampered companies’ operations, separated families and upended the lives of thousands of international students. https://t.co/FiQbQYqJAV", "RT @TaylorLorenz: David Dobrik has stepped down from Dispo, the photo sharing app he co-founded https://t.co/LLYngZT9SV https://t.co/kPyb8c…", "Breaking News: Breaking News: A U.S. trial found AstraZeneca’s Covid-19 vaccine was 79% effective with no serious side effects. The company will seek emergency FDA authorization. https://t.co/aZRJ6axpJs", "Violent protests broke out in the British city of Bristol over a proposed bill that would create sweeping new restrictions on protests and grant the police new powers. The “kill the bill” rally deteriorated into chaos as protesters attacked the police. https://t.co/eBElb11CMi", "“I’m in front of the class and will get killed anyway. So to protect my students, I will go and hug the attacker.”\n\nEven when facing the threat of suicide attacks by the Islamic State, young Afghans from the Hazara minority keep returning to classrooms. https://t.co/bcDlUy13k6", "This meditation in 10 easy steps is an exercise to help your body release the stress of constantly bracing for a disaster. https://t.co/aBhlQo22xg", "Months after the presidential election highlighted problems in the Postal Service, the agency has failed to restore its target delivery times. In mid-December, as little as 62% of first-class mail was delivered on time, according to Postal Service data. https://t.co/7nV2E4P5IT", "A 35-year-old man's sister died after suffering episodes of confusion. Then he started experiencing the same psychological symptoms.\nWhat was causing it? Dr. Lisa Sanders investigates the mysterious illness in @NYTMag.\nhttps://t.co/EQ1jWMWR2X", "Officials in Miami Beach decided to extend an emergency curfew for up to three weeks. The move came one day after South Beach descended into chaos, with the police struggling to control overwhelming Spring Break crowds and making scores of arrests. https://t.co/rs24wVvgQS", "Behold, the war tuba. https://t.co/bItKTT0k07", "We want to hear what readers predict, fear and hope for a gradual shift to a post-pandemic world. Tell us what you imagine your After will look like using the form inside this article. https://t.co/aAO4MSMPds", "For the past year, people trying to go to China have run into some of the world’s most formidable barriers to entry. The restrictions have hampered companies’ operations, separated families and upended the lives of thousands of international students. https://t.co/FMVr3X3ESv", "Our media columnist @benyt spoke to Ibram X. Kendi and Bina Venkataraman about their new venture with The Boston Globe: an online publication focused on racism, inspired by 19th-century abolitionist newspapers. https://t.co/K1nFHMnglK", "Breaking News: Evidence in the Capitol riot investigation most likely supports sedition charges for some of the suspects, a federal prosecutor told \"60 Minutes.\" https://t.co/Aca2s68xDl", "The most significant determinant of resilience — noted in nearly every review or study of resilience in the last 50 years — is the quality of our close personal relationships, especially with parents and primary caregivers, Eilene Zimmerman writes. https://t.co/VT06bSezJp", "If wearing a face mask makes your glasses fog up, health workers have a few tricks that might help.\nhttps://t.co/PSdP0MnJjJ", "A year ago, Georgia was one of four states that had no hate crime legislation. But the deadly rampage last week that left eight people dead, six of them women of Asian descent, is now providing a test of their new law. https://t.co/1hMKyXmuFE", "RT @Volpe_Daniele: When I moved to Guatemala, 14 years ago, I lived two years in this region, San Marcos. Last week I went back for a @nyti…", "Mario González heard the gunfire from inside Young’s Asian Massage. He immediately worried for his wife but says police detained him before he could check on her.\n\nOnly later was he informed his wife, Delaina Ashley Yaun, had been killed. https://t.co/uIByjd4ZgS", "Canadian Pacific and Kansas City Southern announced plans on Sunday to combine in a $29 billion deal that would create the first railroad network connecting the United States, Mexico and Canada. https://t.co/pi7q2jHBT9", "See more photos of protests and vigils around the U.S. https://t.co/SZJYaP5EHj", "Mourners held a moment of silence for the victims at Gold Spa in Atlanta on Thursday, where flowers had been placed in front of the building. https://t.co/SZJYaP5EHj https://t.co/QjLqJ8w7PG", "Students embraced at a vigil for the victims of the Atlanta shootings at the University of Virginia in Charlottesville. https://t.co/SZJYaP5EHj https://t.co/7UZP6LoxLo", "At a rally in Portsmouth Square in San Francisco, people painted messages of love and unity on the ground. https://t.co/SZJYaP5EHj https://t.co/9llkqhcnMR", "In New York City, a march in solidarity wove through the streets of Chinatown in Manhattan. https://t.co/SZJYaP5EHj https://t.co/XcPXxI3932", "At rallies and events in cities across the country, people gathered to grieve the killing of eight people, six of whom were women of Asian descent, in shootings that targeted three Atlanta-area massage businesses. https://t.co/m9POSaFn8r", "Senator Ron Johnson has become Republicans’ foremost amplifier of disinformation, pushing falsehoods on the election, the virus and vaccines. https://t.co/86sWkNqo0s", "After 37 years in a very cheap walkup apartment, a 70-year-old piano teacher is forced out, but manages to find a $1,600 ground floor apartment she loves by using an old school email chain. https://t.co/m61FcRU7DV", "This hearty main dish needs nothing more than some lightly cooked greens to eat alongside. https://t.co/jZZQi1lOXK", "Nawal el Saadawi, an Egyptian author, activist and physician who became an emblem of the struggle for women’s rights in the patriarchal Arab world and campaigned against female genital mutilation, which she endured at age 6, is dead at 89. https://t.co/asOGtSt7ez", "If you are having thoughts of suicide, call the National Suicide Prevention Lifeline in the United States at 1-800-273-8255 (TALK). You can find a list of additional resources at https://t.co/29x9YTrWbg", "Kent Taylor, founder and chief executive of the Texas Roadhouse restaurant chain, died by suicide on Thursday after suffering from post-Covid-19 symptoms. He was 65. https://t.co/pXG1Kgv9NL", "Want to clean your floor without using toxic chemicals? Make like a Victorian scullery maid and break out the skim milk. https://t.co/8GOVlezt9k", "Older people, who represent the vast majority of Americans who are fully vaccinated against the coronavirus, are emerging this spring, filling restaurants, hugging grandchildren and booking flights. https://t.co/6B31l3l7UF", "RT @nytopinion: When Washington began withholding income taxes during World War II, it was viewed as a way to ensure that everyone paid. Ir…", "We're following March Madness 🏀. Check here for live updates: https://t.co/WtKAJ6SIxA", "Here's more than you needed to know about the Snyder cut. https://t.co/gkWNdmOOjz", "The NCAA men’s tournament has its first upset of a No. 1 seed: No. 8 Loyola-Chicago stunned Illinois, 71-58, in the second round. https://t.co/W1HthPJyWa", "Highly-paid soccer stars are expanding their lists of must-have luxury items to include not only expensive jewelry and the latest electronics but also fearsome dogs, private guards and even panic rooms after a series of brazen game-day home robberies.  https://t.co/NxOIVDJk9r", "For his new photo book, “Gentlemen’s Club,” Chris Buck spent six years interviewing and taking portraits of strippers and their romantic partners. \n\nOne question drove many of the interviews: How do you feel about your partner’s work? https://t.co/1Jw4XIrrVW", "In Opinion\n\n\"In Asia, massage is legal, normal and necessary. In America, it’s stained by sexism, imperialism and sex trafficking,\" Claudine Ko writes. https://t.co/6t7by1xzEQ", "The city of Miami Beach, concerned about crowds of spring breakers and the threat of a resurgent coronavirus, declared a state of emergency and moved up its curfew to shut down late-night partying that it said had gotten out of control. https://t.co/0jhiHUCGMi", "Defense Secretary Lloyd Austin landed in Afghanistan’s capital Sunday morning, becoming the first member of President Biden’s cabinet to set foot in the country that is home to America’s longest war. https://t.co/WLyaRkbvGo", "How a loose alliance of lawyers, lobbyists and Orthodox Jewish leaders won clemency from Donald Trump for white collar criminals. https://t.co/Dql1uTQPJ2", "On the season premiere of our Still Processing podcast, the co-hosts Jenna Wortham and Wesley Morris confront one of the most offensive words in the English language. Listen to the full episode here: https://t.co/tPdL9JIeTe https://t.co/lr0I3xmEhZ", "RT @heytherehaIey: “Do what we’re trained to do!” We obtained recordings of internal Metropolitan Police radio traffic from the day of the…", "Los restos de 13 migrantes guatemaltecos que fueron baleados, quemados y hallados amontonados en la parte trasera de una camioneta a la que se le prendió fuego en Tamaulipas, México fueron repatriados el viernes. https://t.co/NJz7nO9tE9", "The remains of 13 Guatemalan migrants who were shot, burned and found piled in the back of a pickup truck that had been set on fire in the Mexican state of Tamaulipas were repatriated on Friday. https://t.co/gHvTt5FQND", "Plan ahead and time it right: How to enjoy the great outdoors safely and conveniently in the warmer months ahead. https://t.co/qvjRmVSxlC", "Following former Zappos CEO Tony Hsieh's untimely death, his successor, Kedar Deshpande, faces the challenge of leading the shoe seller out of the pandemic, while also maintaining what his predecessor built. https://t.co/g111UYEzm6", "A new generation of biologists is rewriting the standard explanation of how beauty evolves and the way we think about evolution itself. Listen to the narrated story on The Sunday Read and @audmapp. https://t.co/oAvW6VTuIo", "Women in London are furious not just about the death of Sarah Everard, but about what they see as a heavy-handed and misogynist response from the police. Some are pushing to scrap a proposed bill that would grant broad new powers to law enforcement. https://t.co/XgqFB0HTqV", "Stimulus payments have been a lifeline for some. Others see their \"stimmies\" as a small-scale investment opportunity. https://t.co/XfVO3cKico", "A New Jersey teacher says her school's administration told her to remove a reference to Donald Trump from a student’s shirt in a photo. She was suspended in 2017 after the edit ignited a national firestorm over free expression and political opinion. https://t.co/dHnU1Ku8LZ", "Elsa Peretti, the jewelry designer whose elegant, sculptural creations for Tiffany &amp; Company redefined tastes in accessories, has died at 80. https://t.co/8HVT0qfPN9", "New York has reported its first confirmed case of the worrisome coronavirus variant first found in Brazil.\n\nThe variant, known as P.1, is highly contagious and has in some cases reinfected people who have already recovered from the virus. https://t.co/Dd37IfqXrf"]}