{"tweets": "@SaneleRingane Thanks for reaching out, Sanele! It looks like you restricted who can reply to your tweets, so @NikeService is unable to respond. Let's have you give them a follow, tag them in your next tweet, or send them a DM. They'll be able to assist you further! @bishnoikrishan Hey, Krishan! Let's have you follow and reach out to @ NikeService, as they'll be able to assist you. It looks like you restricted who can reply to your tweets, so they're unable to respond. Feel free to tag them in your next tweet or send them a DM. 👍 @kinleygene Keep showing us what you’re made of, Andrea. Those legs are made for running! 🏃‍♀️💨 @brithotwife Hey, if you're looking to get this addressed you can direct message ourselves with order details or you can chat or call us on: +442076604453, to talk you through the process. 🤔 To every mother, everywhere: you are the toughest athlete. https://t.co/9qa88DlkAZ @thesundancesyd Happy Birthday, Sydney! Can't wait to run with you. 🎉 (5/5) Nike, Inc. invested $89.9 million in community impact in fiscal year 2020, and targets an increase to an industry leading 2% investment of prior year pre-tax income to drive community impact the next five years.\n\n#NikeImpactReport https://t.co/DrAErF2mdg https://t.co/N0VgcYGhii (4/5) By 2025, Nike, Inc. targets 70% absolute reduction of greenhouse gas emissions in owned or operated facilities and 10x the amount of finished product waste refurbished, recycled or donated.\n\n#NikeImpactReport https://t.co/jmSVHaBIgU https://t.co/iWLl2prNfl (3/5) By 2025, Nike, Inc. targets $125 million investment leveling the playing field and a $10 million investment earmarked for Historically Black Colleges and Universities, and Hispanic-Serving Institutions. \n\n#NikeImpactReport https://t.co/6p8I7yZNJ8 (2/5) Nike, Inc. targets 50% representation of women in global corporate workforce and 50% girl participation in Made to Play community programs by 2025. \n\n#NikeImpactReport https://t.co/BAXTuxD541 https://t.co/bZH4PSnfIP (1/5) Today, we are proud to unveil the #NikeImpactReport and 2025 Targets. In the report you will find that we are currently using 100% renewable energy in the US and Canada in our owned or operated facilities. \n\nLearn more at https://t.co/S0QlzY2AMA @EMTballers Snuggle buddies are good for the sole. ❤️ @Charloadr Salut ! Contents de voir que tu sois prêt, cependant, nous n'acceptons pas encore les demandes de sponsor, nous choisissons nos partenaires. Mais ne perd pas espoir, on t'invite à bien rester visible sur les réseaux sociaux, et on te remarquera peut-être un jour 😀 ! Black women are rarely recognized for the hard work they put in. It’s not just magic, they are the real thing. \n\nJoin us in celebrating their hard work and help level the playing field. #WePlayReal \n\n🎙:@domfishback https://t.co/X7RJvzfBlZ @citgooooo Happy to help, Caleb. Can you DM us your Nike Member email address and also let us know which product you're looking to buy? https://t.co/klmMF0Q8Tn @MattyBP7 Hi Harland, sorry to hear that. You can direct message us with the codes details to have a look. Sounds like you might mean promotion. Let us know? 💭 @Its_D_100 Hey, sorry about the issue with adding to cart. We have captured the feedback and passed it along to get addressed. You can call us on: +442076604453, to help place order if needed. @CArunagiri Hi Chithra, sorry to hear that. You can call us on: +442076604452, to talk you through the trouble shooting, and get you back on track. 👂 @KALISFINEST23 Hey Lamar, we can see that you restricted who can reply to this tweet. That doesn't appear to be one of our order numbers. If you placed the order directly through us, send your Nike Member email over to @ NikeService via DM and they'll be able to assist you further. @AE9941 Got the Run Club going up on a Tuesday! ✌️ @mxlczk Hey @mxlczk, nous allons regarder ça ensemble. 👍 Peux-tu venir en DM nous communiquer ton numéro de commande ainsi que le nom, le prénom et l'adresse e-mail liés à la commande ? 😉 https://t.co/klmMF0Q8Tn @adamlnz Hi Adam, eligibility for the code would mean having been logged into APP/NRC/NTC no less than 10 days before. If you are app- eligible but not opted in, you still get promo. You can call us on: +442076604453, to talk you through the process and attempt to place. 👌 @neruaelle Give the phone what it wants. 🙏 @dmmaher1317 Now those are some dope kicks! Check out a pair we customized for you. 👇 🔥 \n\nhttps://t.co/kpge6Z73Wp @blackjack4494 Hi, we can assist you with returning. Returns can be done within 60 days of arrival. Let us know. 🤔 @JStephs77 We love it! Give him a big high five for us! 🖐️ @ElGrandeAbdul Hey @ElGrandeAbdul, nous gardons le suspens sur les sorties et les réapprovisionnements à venir 😉. Mais nous t'invitons à garder un œil sur notre site et nos actualités pour ne rien manquer ! @SandileVezi8 Get after it, Sandile. 💪 @stevenharageib Early bird gets the worm! We see you crushing it out there, Steven! 💪 \"One of the greatest things a person can do is inspire others.”\n\nFrom a quiet winner to a vocal champion, the effects of @naomiosaka's transformation can be felt far beyond the tennis court.\n\nCongrats on major title number 4 to the one raising more than her game. https://t.co/2AZMA6fCMW Our hearts are with our Asian community. We stand united with our partners to create a more inclusive future.\n\nLearn more: https://t.co/HDGa5BCi2M #StopAsianHate https://t.co/He9UDp0pCY @mollrob Hi Moll, sorry to hear that, for security cannot be done over chat, we can help to place over the phone. Here's the number: +442076604453. 📞 @ALaurirob Look like the 👑 by shopping below.\nhttps://t.co/BFhd6s8ZUd @LiamSmith_515 @liamsmith_515 Try clearing your browser's cache and cookies and let us know if that does the trick. @LiamSmith_515 @liamsmith_515 We'll take this one. We don't have any info on that at this time. Keep an eye on our feed for updates.  Test response @SEASportDiaries @SwingmanBrand Taking 𝘴𝘪𝘨𝘯𝘢𝘵𝘶𝘳𝘦 𝘴𝘯𝘦𝘢𝘬𝘦𝘳 to a whole 'nother level. @LiamSmith_515 @liamsmith_515 Try clearing your browser's cache and cookies and let us know if that does the trick. @Mwaka_Coco Salut @Mwaka_Coco ! Nous ne communiquons malheureusement pas sur nos futurs approvisionnements. Nous te conseillons donc de garder un œil sur notre site ou de visiter ceux de nos revendeurs autorisés 👍 ! @augustinesims15 When do these beauties make their big debut? 😍 @JMHorcher24 Put him in, Coach! ⚾ @xbabyazul That's odd. Firstly let's have you follow/reach out to @NikeService. They'll be able to assist you. We're seeing you restricted who can reply to your tweets, so they're unable to respond. Let's have you tag them in your next tweet or send them a DM. 👍 @lovedgoIden Is this the info that you're after... 👀 https://t.co/M2K0nnUB21 @XxYoungxLeeXx We're loving the new T-shirts, Lee! It's only a crazy dream until you do it. 🙌 @Lauren_OReilly Hey, Lauren! We don't have any restock info to share, but feel free to DM @NikeService with your size + location, and we'll see what we can find. @adele_delbert Hi, apologies about this! Please send us a DM with more details 🙂 @thebighomieKT Good question! We are working with our athletes and allies to honor MLK day and BHM on-court but will not sell BHM product in 2021. We’ll focus on doing more externally and doing better internally to generate change and create platforms for athletes* to raise their voices. @Physio_HJWright Hey Hannah, sorry to hear of the trouble! Could you please DM our friends at NikeService, your Nike Member email and the information you need corrected? They'll be able to assist. @sasha_amberxox When do these beauties make their debut? 😍💛 @Ant_Judge Lace up those trainers, Anthony. We're getting after it today, rain or shine! @SurajSodha Hi Suraj, thanks for the heads up. We'll pass along the feedback. It's not that price. 💶 @xonukababy You can't go wrong with the Sage Low. 🤷‍♀️ https://t.co/djqQMn2XUE @sadhotgirI Hi, Can't confirm this yet but keep an eye on the website! 🙂 @TVTalkerGuy Hi, can't confirm this at the moment. Stay on the look out 🙂 @Andrey79111630 Send us a picture in the new shirt once it arrives. 😁 @BAHdeDAH Great question! Those are the 5 states that already have girls Flag Football programs. The voting is to help identify states that don’t have programs underway. @winkywink84 Hey there! We are working with our athletes and allies to honor MLK day and BHM on-court but will not sell BHM product in 2021. We’ll focus on doing more externally and doing better internally to generate change and create platforms for athletes* to raise their voices. @tunaeP_ Sorry to see that happen. Unfortunately, we do not have replacement/spare lacelocks for that style. If you purchased it on our site, send over your order numbre and we'll explore your options. @passion4spas Hi David, you can put Chelsea into search bar on our site. Megastore may also be a good choice, once open. 👌 @Kieraan93 Hi Kieran, there's no guarantee of restocking as we capture feedback on needed sizes and colours. We're always looking to push forward with new products/materials, normally restocking is within 2-3 weeks. Keep an eye on our site. 👀 🤞 @Laurence_Kbl Salut @Laurence_Kbl, nous sommes désolés si les Flyknit Chukka ne sont plus disponibles actuellement. Nous gardons le suspens sur les sorties et réapprovisionnements à venir. 😉 Mais nous t'invitons à garder un œil sur notre site et nos actualités pour ne rien manquer ! 🧐 @ap_bonner You can find all our career postings on our website here: https://t.co/SODFUskdDB @ap_bonner Hey, April. We are partnering with our athletes and allies to honor MLK day and BHM on-court but will not sell BHM product in 2021. We’ll focus on doing more externally and doing better internally to generate change and create platforms for athletes* to raise their voices. @Project_Man4ger Hey there. Please reach out to our @NikeService handle for further assistance. @Big_Dave81 Hey, Dave. We are partnering with our athletes and allies to honor MLK day and BHM on-court but will not sell BHM product in 2021. We’ll focus on doing more externally and doing better internally to generate change and create platforms for athletes* to raise their voices. @DavidW3344 Hi David, sorry about this. try closing the app and reopening or try ordering on the website. Contact us if problems persist. @Chaitanya99995 Apologies for the confusion. We recommend contacting our team via live chat or email with the link above. @jakescherrer That just means you've got style, Jake! 😉 If that's her reaction now, we can't wait to see her face when she sees you in these...... https://t.co/7zAaIpCn5n @Chaitanya99995 Hey! You'll need to reach out to our team in your region to get this sorted.\n\nhttps://t.co/wGncrZH1Io @jstnthmsn Hi JT, You can chat or call us on: +442076604453 to help look for products, or just capture your feedback. Let us know. 👂 🤔 @CestTjrMalek Salut @CestTjrMalek, merci pour l'intérêt que tu nous portes. Nous approchons nous-mêmes les agences de mannequinat lorsque nous recherchons des modèles. Pour tenter ta chance, il te faut donc transmettre ton book à une agence puis peut-être seras-tu sélectionné. 😉 @sausages1974 Hi Henry, appreciate the offer. Hold onto that heat 🔥, real passion piece. @bk_lr390 Hey @bk_lr390, n'attends plus ! 😉 @Jay_Perkins Hi Jay, good choice 😀. Products can go down or up in price, you need to get it when you see it. Currently, there's only student discount on our site. @keil144 So sorry to hear that! Did you buy these in store or online? 🙂 If online, you can DM us your order number and we can help you from there 👍 @10goal14 Hey @10goal14, nous sommes navrés si la paire que tu souhaitais n'est plus disponible. Nous gardons le suspens concernant les sorties à venir et te conseillons de garder un œil sur les Air Jordan 1 dans l'application Nike afin de t'assurer de ne rien louper ! 😉 @librebenou Hey @librebenou, nous sommes désolés d'apprendre les 5 jours de retard de livraison. Peux-tu venir en DM nous communiquer ton numéro de commande accompagné de ton nom, ton prénom et ton adresse e-mail ? On va regarder ensemble ce qui a pu se passer lors de ta livraison. 😉 https://t.co/klmMF0Q8Tn @Feinte_D Hey @Feinte_D, nous sommes désolés d'apprendre que tu rencontres des soucis pour commander sur notre site et notre application. Peux-tu venir en DM nous informer de ce qu'il se passe ? On va regarder ça ensemble. 😉 https://t.co/klmMF0Q8Tn @GoodLifeBoss We define this as \"crushing it.\" 🏃‍♂️💨 @PenBotter We love to see those wins. 🙌 Make sure you show us the fit with the first photoshoot! 📸 @MarionFlx Hey @MarionFlx, nous sommes désolés que la livraison ne se soit passée comme prévu et qu'il y ait eu autant de retard. Peux-tu venir en DM nous communiquer ton nom, ton prénom et ton adresse e-mail ? Nous allons voir où en est ton remboursement 😉. https://t.co/klmMF0Q8Tn @martysneakrs Hey @martysneakrs, nous sommes désolés d'apprendre l'état dans lequel ton colis est arrivé. Il y a dû y avoir un problème de livraison. Peux-tu venir en DM nous communiquer ton numéro de commande ainsi que ton nom, ton prénom et ton adresse e-mail? On va regarder ça ensemble. 😉 https://t.co/klmMF0Q8Tn @armellekb Salut Armelle ! Nous sommes désolés de voir que 2 commandes se soient annulées. As-tu contacté notre service client afin qu'un agent regarde la raison de cette annulation ? Si non, viens en DM avec le numéro de commande, ton nom, prénom et e-mail, nous allons regarder cela 😉 ! https://t.co/klmMF0Q8Tn @SFribbens Hi Sarah, our team @NikeService can help you out. We're seeing you restricted who can reply to your tweets, so they're unable to respond. Let's have you tag them in your next tweet or send them a DM. 👍 @FreireManuel_ Hey @FreireManuel_! On est navrés de voir que ta commande soit en retard ! Viens en DM avec le numéro de ta commande, ton nom, prénom et adresse e-mail, nous allons regarder ou se trouve ta commande 👍 ! https://t.co/klmMF0Q8Tn @victoriachris_ Hi Victoria, happy to hear you got the heat you ordered 🔥, let us know if you need something else. 👍 @J60931656 Hi J, great choice cannot find that specific jacket  but here's a link to the jackets we do have in blue: https://t.co/oqMA2ioCvA. 👀 @davevsworld Hi Davey, Trouble shooting would be different device/browser or clearing cookie/cache. You can chat or call us on: +442076604453, to talk you through the process or attempt to assist with placing. 👌 @EmmiMaryann Hi Maryann, You can chat or call us on: +442076604453, to talk you through the processes and further assist, if you need help. 👍 Let us know. @maximebesse Hey Maxime, viens en DM en expliquant le problème que tu rencontres. S'il est relatif à une de tes commandes, partage nous aussi le numéro de celle-ci, ton nom, prénom ainsi que ton adresse e-mail, nous allons regarder ça avec toi 👍 ! https://t.co/klmMF0Q8Tn @Bala47858991 Hey, Bala. Please DM us @NikeService with your Nike Member email, and we'll look into this further. @tomamrn Hi, apologies about this. Send us a DM with more details on order and we will look into this for you 🙂 @Adzmillions Hi, sorry to hear this. are you still having difficulties using the app? @YNNCH Hey @YNNCH, nous sommes désolés d'apprendre les déchirures sur tes Pegasus Turbo 2, peux-tu venir en DM nous communiquer ton numéro de commande, ton nom et ton prénom ainsi que ton adresse e-mail? On va regarder tout ça ensemble 😉 https://t.co/klmMF0Q8Tn @awthentik Tomorrow's the big day. What's the final design looking like? 👀 @shuusaku82 Hey @shuusaku82 ! Nous ne communiquons pas sur les dates de sorties de nos articles. On te conseille de garder un oeil sur l'application SNKRS 👍! @MikeSpadafino We're glad you reached out, Mike! For privacy reasons, please delete your original tweet and meet us in the DMs below. Pass along your Nike Member email and this screenshot as well. We'll assist you here! 👇 https://t.co/klmMF0Q8Tn @SIOBHAN75 Hello, Siobhan! Our team wasn't able to track down your order via the order number you attached? For privacy reasons, let's have you delete you original message and meet us in the DMs below. Please pass along your Nike Member email as well. We'll assist you there! 👇 https://t.co/klmMF0Q8Tn @SayenDz13 Hey @SayenDz13 , malheureusement on ne peut pas recontacter les agents mais ce n'est pas grave. Viens en DM avec le numéro de la commande, ton e-mail et une confirmation de ton nom prénom, on va voir ce qu'on peut faire pour toi ! 👍 😀 @ZauceGod Hey @ZauceGod, viens en DM avec le numéro de ta commande, ton nom, prénom et e-mail si tu as acheté ta paire sur notre site ou avec ton ticket de caisse si tu les as achetées en magasin, on va regarder ce que l'on peut faire pour toi ! https://t.co/klmMF0Q8Tn @dylan_vmt Salut @dylan_vmt ! Tout d'abord toutes nos félicitations pour ton titre de champion de France sur 100m ! Nous te remercions pour l'intérêt que tu nous portes, et nous pouvons seulement te conseiller de rester actif sur les réseaux sociaux, on te sélectionnera peut-être un jour ! @angellee_vcn Hey @angellee_vcn ! Les appels à notre service client sont gratuits 💥! Tu trouveras le numéro de support en fonction de ta demande en suivant ce lien : https://t.co/MRhKSFm6y4. 😀 @BaldwinPainting Hey, Jeff. We're sorry that happened. Please DM our NikeStore Twitter page with where you purchased your pair. We'll take a look into your options. @mrnastygrenades No news to share at this time, please keep it locked to https://t.co/yYv8xSbp4x and SNKRS for all the latest info and release news! ⬇️ \nhttps://t.co/N3VEl14qSp Knowing what to do is one thing, knowing why you do it is everything. What’s your why?\n\nJoin us for guidance to reach your goals: https://t.co/htrnwt6ryz https://t.co/kh33Pzgzl0 @AlbertoRomeroBe ¡Hola, Alberto! Será un gusto ayudarte. Por favor contáctanos a través de este enlace: https://t.co/KFISeava1Z así revisamos las posibilidades de cambio existentes. Cualquier otra cosa, no dudes en avisarnos. ¡Felices fiestas! @MasumJamil Hi Jamil, please reference; 22731240. You can chat or call us on: +442076604453, to talk you through the process and the ongoing refund. @Littlesassou Salut @Littlesassou, nous sommes désolés que l'article ne te convienne pas. Pour ce qui est des retours en boutiques Nike nous t'invitons à contacter le magasin en question car il peut y avoir des politiques de retour différentes entre chaque magasin. 😉 @dimehh213 Salut @dimehh213, nous travaillons tous les jours sur les sorties et les réapprovisionnements de nos produits et nous t'invitons à garder un œil sur notre site et nos actualités pour ne rien manquer et trouver ton bonheur ! 🧐 @AlexisPrimetime Hey @AlexisPrimetime, nous sommes désolés pour toi mais ne perd pas espoir, nous avons hâte de voir ta réaction quand tu gagneras ! 💥 @gaellesds Hey @gaellesds, on va regarder ça ensemble 😉. Peux-tu venir en DM nous communiquer ton nom, ton prénom ainsi que ton numéro de commande et ton adresse e-mail s'il te plaît ? https://t.co/klmMF0Q8Tn @allersalam Hey @allersalam, on aime beaucoup cette collection mais nous gardons le suspens sur les prochaines sorties 🤐. Reste attentif pour ne rien manquer 😉! @kantguardme Right back at ya, friend. ❤️ @Gaipadinspi3 Hey @Gaipadinspi3 ! Ça dépend des magasins, nous te conseillons de les appeler avant 📱 car ils ne sont pas obligés d'accepter un retour d'article acheté sur notre site 👍 ! @thaaiislvs Salut @thaaiislvs ! Nous sommes navrés du défaut de tes Mid 77'. Viens en DM avec ton numéro de commande, e-mail, nom et prénom si tu les as acheté sur notre site ou avec le ticket de caisse si tu les as acheté en magasin, nous allons voir ce que nous pouvons faire pour toi 😉 ! https://t.co/klmMF0Q8Tn @MarckFfrela ¡Hola! Vamos a revisar el estado de tu reembolso ya mismo. Por favor, envíanos tu e-mail y número de pedido por MD. ¡Gracias! https://t.co/klmMF0Q8Tn @di2pra Hey @di2pra, nous sommes navrés de voir que tu n'aies toujours pas reçu ta commande. Quand as-tu retourné ton colis retour ? Viens en DM avec le numéro de celle-ci, ton adresse e-mail et ton nom prénom, nous allons regardez cela pour toi 😀 ! https://t.co/klmMF0Q8Tn @Gaipadinspi3 Hey, on est navré d'entendre que ta livraison ne se soit pas passée comme prévue. Viens en DM avec le numéro de la commande, ton e-mail et une confirmation de ton nom prénom, on va voir ce qu'on peut faire pour toi ! 😀 @AdhamAqil4 We are not able to verify authenticity through this channel. The best way to ensure that you're buying genuine products, is to order directly from https://t.co/yYv8xSbp4x, or from any of our authorized retailers to guarantee you're getting authentic Nike product. @ThoCros Hey @ThoCros  , nous sommes désolés d'entendre le problème que tu rencontres et de ton expérience avec notre équipe. Voici un lien où tu peux trouver des informations utiles pour tes Nike Adapt : https://t.co/Pu62We8YaU 😀 @snake7613 Hey, on est navré d'entendre que ta livraison ne se soit pas passée comme prévu. Viens en DM avec le numéro de la commande, ton e-mail et une confirmation de ton nom prénom, on va voir ce qu'on peut faire pour toi ! 😀 @LKiz23 Hi Ikxxiii, thank you very much for your interest in our products. However, I hope you understand that Nike does not currently accept requests for donations. Let us know if you need something else. 👌 @lye4 Hey, on est navré d'entendre que ta livraison ne se soit pas passée comme prévu. Viens en DM avec le numéro de la commande, ton e-mail et une confirmation de ton nom prénom, on va voir ce qu'on peut faire pour toi ! 😀 @SimplyKelsss Hi, Size 6 was the first to go. Really popular. 😀 @erikhughes20 It's all downhill from here. 💪 @lilashee1 We love your passion and completely understand where you are coming from. Our best recommendation to increase your chances for future drops is to stay active on our apps, engage through social media, and be sure to have your profile fully up to date. We're rooting for you! 🙏 @xcen_a So are we. ❤️ @ZZFrero Hey @ZZFrero , on est navré que ta paire de chaussures ne te convienne pas. Viens en DM avec ta preuve d'achat, ton email et une confirmation de ton nom prenom, on va voir ce qu'on peut faire pour toi ! 😀 @lae_kl Hey @lae_kl c'est un très bon retour, nous le prenons en compte et qui sait, nous sortirons peut-être bientôt cette ligne de vêtement \"Tall\" pour femme ! 😀 @NotoriousMarco Hi Marco, here's the information on release through SNKRS APP for Italy Air Jordan 1 Dark Mocha €159.99 Available on 19/12 at 8:00 am. Here's a link to our page: https://t.co/tfkFcha2Si. 👍 @la_bim Salut ! Nous ne communiquons pas sur les réapprovisionnements de nos produits, nous gardons le suspens ! On t'invite à regarder notre site de temps en temps ou nos revendeurs officiels 👍 ! @jillrooney15 We'll get this sorted for you, Jill. Please delete the message with your order number to protect your privacy. Head over to @NikeService, and send us a DM with your email and order number. @r_royalty 💪 💪 💪 @r_royalty They're back. Act quickly:\n\nhttps://t.co/rHM2jX0OJa @jillrooney15 We're sorry to hear this, Jill. We suggest contacting the courier and requesting another attempt at delivering your partial. In the meantime, please contact our team by phone at your earliest convenience, and we'll assist you there! 👇 \nhttps://t.co/Kd9Z2poBVd @NmkEnV Hey @NmkEnV, merci beaucoup de l'intérêt que tu nous portes 👍 ! Cependant, pour le moment, nous approchons nous-mêmes les partenaires qui nous intéressent. Nous te souhaitons plein de réussite 😉 . @jillrooney15 Not to worry, Jill -- we're here to help! Meet our Nike Service team in the DMs with your Nike Member email and order confirmation number. We'll assist you there! 👇 @KateAmeliaReed Hi, very sorry to hear this. Did you purchase this online? Send us more details via DM if you can @Tanguy6Tricoire Hey @Tanguy6Tricoire, nous sommes désolés si tu rencontres des soucis pour appliquer ton code promo étudiant. N'hésite pas à lire les conditions générales https://t.co/Nqj3zDovR2 et à revenir vers nous en DM en nous communiquant ton adresse e-mail si ça ne fonctionne pas. 😉 https://t.co/klmMF0Q8Tn @Jerry_K 100 completed workouts?! 🤯 You're crushing it, Jerry! 💪 @KingJames 🙌🔥👑 @Floregereau @Floregereau Ce sont les paires SNKRS qui choisissent leurs propriétaires 😜 Bonne chance à toi ! ⚡ @kiki_limited @kiki_limited Il y a plus de 160 gammes de paire de chaussure disponibles en 36 sur le site, n'hésite pas à fouiller  --&gt; https://t.co/sWqkOMqkNQ. On prend note de ton retour d'information sur la collab 😉. @Hopelessisfun Joyeux anniverssaire @Hopelessisfun 🎉 ! Peux-tu venir en DM nous communiquer ton adresse e-mail? On va voir ce qu'on peut faire pour le code birthday 😉. https://t.co/klmMF0Q8Tn @Anasse_drs Hey @Anasse_drs, tu as raison... tes nouveaux gants sont trop gang ⚡ ! @Floregereau Salut Flo, nous sommes ravis que les prochaines Sacai VaporWaffle te plaisent 👍 ! Rendez-vous Jeudi à 9h00 💥 ! @marandeloo Salut @marandeloo, on garde le suspens sur les sorties et les réapprovisionnements à venir mais nous t'invitons à garder un oeil sur notre site et nos actualités pour ne rien manquer 😉 ! @carbone23yt Hey @carbone23yt, rendez-vous le 19 Décembre ! Bonne chance à toi 😉 ! @kiki_limited Salut @kiki_limited, nous comprenons ta demande, nos paires pour hommes vont de la taille 35.5 à 52.5 👍. Cela dépends des produits et des stocks disponibles, on espère que tu trouveras ton bonheur ! @fiftee943 Hey @fiftee943, nous sommes désolés que ton survêtement ne sois plus disponible en L. Malheureusement, nous ne communiquons pas sur les sorties et les réapprovisionnements à venir mais nous t'invitons à garder un oeil sur notre site et nos actualités pour ne rien manquer 😉 ! @yasbylkaa Hey @yasbylkaa, nous sommes désolés mais la pointure 39.5 n'est pas disponible. Nous t'invitons à essayer en 40 et si la chaussure ne te vas pas, tu pourras toujours faire un retour et être remboursé 😉. @Bent_Elbow We're checking our list. 🔍 @adamwelch84 Hi, send us a DM with this issue please 🙁 @JenLikesUK She's rocking the Air Tech Challenge 2! Did we do that? 🤓 @kingchenks Hi, we're sorry to see that you are experiencing a problem with your order. Send us a private message with the order number, your email, your name and surname and describe the problem, we will look into it with you! 🙂 @rbn_gmzz What matters is that you got out there and ran today. Way to work! 💪 @soriba_svn Salut @soriba_svn, nous sommes désolés que tu aies des problèmes sur le site, peux-tu venir en DM nous expliquer en détails les soucis que tu rencontres ? On va gérer ça ensemble 😉 https://t.co/klmMF0Q8Tn @moonalysun Salut @moonalysun, nous sommes désolés d'apprendre l'annulation de ta paire de Nike Blazer Mid '77 en 38.5, peux-tu venir en DM et nous indiquer ton numéro de commande, ton adresse e-mail, ton nom et ton prénom? On va regarder tout ça ensemble 😉 ! https://t.co/klmMF0Q8Tn @abs_olute1 Hi, you can direct message us with the order number, also can you please verify the full name on the order, and the email address please to get this addressed. @Batesyk7 Hi Jonathan, we try to stop that very same issue with raffles and draws. We are more than happy to capture your feedback. @bootylisab Hi Lisa, keep up the great work. 🏃‍♀️ @MrsCheeks91 Hi Corina, You can chat or call us on: +442076604453, to talk you through the process, and see what was organized, when you contacted us. @itskatherine888 Hi Katherine, there's no guarantee of the restocking of the shoes. We take all feedback to help with products moving. So keep an eye our site. 👀 @MsB1983 Happy Birthday, Fallon! 🎉 It's what we do, don't mention it. 😉 @ninacharissexo Getting stronger never goes out of style. Here's to many more years! https://t.co/QSPDgaBqgd @jxavss We will have a global launch for the NOCTA collection on December 18. Visit https://t.co/cWSv8Q2eh2 more. 👊 @Mr_Satter Hi, Sorry to hear that, we can assist with stock on the product. You can direct message us the orders details to look, can we please have the order number, also can you please verify the full name on the order, and the email address please. @hervertsillo We'll do our best. To start, where are you located and what size are you after? @AdamKelly283 Hi Adam, you can direct message us to try to assist further, for the query on parcel. @Grumpy_Noo Hey @Grumpy_Noo , as-tu bien reçu l'e-mail t'annonçant ta réduction ? Viens en DM en nous donnant ton adresse e-mail, ton nom, prénom et ta date de naissance on va regarder ça ensemble ! 😉 @RemiLthl Salut Rémi ! Nous sommes ravis que tu sois satisfait de nos délais de livraison ⚡ ! On te souhaite une bonne journée ! @AnaisGlb Hey @AnaisGlb, un grand merci de toute l'équipe pour ton commentaire 💕, nos agents font leur maximum pour vous aider ! 👍 @OVANASIL ¡Hola de nuevo! ¡Puedes borrar el email con tu correo electrónico y mandármelo por privado? Saludos. @OVANASIL ¡Hola Silvia! ¿me puedes mandar un DM con tu dirección de correo electrónico? Así podemos ver tu pedido y tramitar lo oportuno. Saludos. @AlbeerBeto ¡Hola Alberto! ¿me puedes  pasar por DM tu correo electrónico y ver qué es lo que pasa con tu pedido?\nSaludos @JackieAbiKhalil Hey Jackie! First, we recommend deleting the message with your order number as it is linked to private information. Can you send us a DM over at @NikeService with your Nike Member email and that order number? We'll meet you there! @tom333x2 Hey @tom333x2, nous sommes navrés pour toi, mais le rayon est bien de 10KM ! Nous prenons cependant ton retour en compte, et qui sait, nous étendrons peut-être le rayon ! @andrewsneill Hi Andrew, seems to be a communication error. Trouble shooting would be different device/browser or clearing cookie/cache. Let us know if this persists. @HelloHi12538623 Hey @HelloHi12538623, au moment où tu passes commande, une demande d'autorisation de prélèvement est faite auprès de ta banque, et le montant est mis de côté. Il est ensuite prélevé à l'expédition de ta commande. Vérifies tes comptes, la 1ère demande devrait disparaître ! @adamwelch84 Ok. 👌 @adamwelch84 Hi Adam, be ready to take any organized call. @linglingmany Hey @linglingmany, viens en DM avec le numéro de ta commande, ton adresse e-mail et ton nom et prénom, nous allons regarder ça ensemble ! https://t.co/klmMF0Q8Tn @HribanV Nous ne pourrons malheureusement rien faire pour toi sur ce site, de plus, Stock X n'est pas un revendeur officiel. @HribanV Salut @HribanV, ta commande a en effet été remboursée car le transporteur n'a pas réussi à la livrer. Nous sommes navrés et nous comprenons ta déception, nous ne pouvons cependant pas livrer ta commande à nouveau. @izaigs Hi Izabela, JD is authorized retailer. We cannot see their systems so you would need to contact the company of transaction, to get an update. 👍 @nikki_barrs Hey Nikki, so sorry to hear this. While we don't have an email to share, please contact our team using the link below, and we'll do our best to help.\n\n https://t.co/IbBglcEsSc @flashLight_rv Hi, you can direct message us with order details. Can we please have the order number, also can you please verify the full name on the order, and the email address please. @MKY3737 Hi Mikey, you can chat or call us on: +442076604453, to look into the claim for yourself. Please let us know. 👌 @Johann_Onyszko Hey @Johann_Onyszko, si tu n'as pas reçu d'e-mail de confirmation, c'est que nous n'avons pas pu vérifier tes informations avec ta banque lorsque nous avons demandé l'autorisation de prélèvement. N'hésite pas à vérifier tes informations de facturation ! @seagullswim Hi,\n\nVery sorry about this. please send us a DM with the order number, your name and email address.\nThank you @Liv_maeXX Hello, Olivia! 👋 How can we help you today? @maccaboy657 ☕🤩 @NancyHayward10 The purrfect pair. 🐱 @Empiretiling Hi, Apologies for the inconvenience. Please send us a DM with your email address and name. @Condorito_AR Buenos días, ¿nos puedes enviar un mensaje privado con tu dirección de correo y número de pedido? Así podemos localizar tu pedido. Saludos @juanton316 If it's meant to be, it will always find a way. 🔮 @ayam_yow_fazer Hey @ayam_yow_fazer, nous ne livrons pas encore aux Antilles, mais nous t'invitons à faire un tour sur les sites de nos revendeurs officiels ! @JayBeackz We hope so 🤞, we always gather the feedback to help towards colours and sizes materials, to help to improve products and services. @Gpasdefollower Salut @Gpasdefollower, nous sommes navrés de voir le problème que tu rencontres sur ton application. Essaie de commander depuis un ordinateur, cela devrait fonctionner. Sinon, n'hésite pas à contacter notre service client en suivant ce lien https://t.co/vZDAw3uWNm. @XavierLafeuille Hey @XavierLafeuille, les chaussures personnalisées sont en effet exclues de la promotion anniversaire. @mona_rahimpour Hope it's as crisp as our latest kicks. 😉 @TheFourDragons 😍😍 @bootylisab Whatever it takes. Blue isn't ready. 💪 @Justin32294 Let's take a closer look, Justin. Please DM us at @NikeService with your email and what you're attempting to purchase, and we'll go from there. @lukasdebret1 Salut @lukasdebret1, nous te remercions pour l'intérêt que tu portes à notre marque, et nous t'invitons à rester actif sur les réseaux sociaux afin que nous te remarquions car nous n'acceptons pas encore les demandes de sponsorisation. Bonne chance ! @Dimkun12 Salut @Dimkun12, envoie ton numéro de commande, adresse e-mail et nom prénom en DM pour qu'on regarde cela ensemble. https://t.co/klmMF0Q8Tn @Mil0uzz Hey @Mil0uzz, nous ne donnons pas d'information sur nos réapprovisionnements, mais garde un œil sur notre site voir si les Blazer Low reviennent en personnalisables ! 📱 @christinaHRltd Happy birthday, Christina! 🎉 No better way to kick off your birthday than by putting some kilometres on those beauties. @Ismaeel_AJ Hi Ismaeel, you can direct message us with order number, also can you please verify the full name on the order, and the email address please, for security. @whotfdis2 Hi, we'll take your feedback and pass that along, as it helps us move forward as a company. 👍 @_xDGee You can contact us on direct message, chat or call: +44207 660 4453. So we can discuss the issue with the cancellations. @Yassine_mrg Hey @Yassine_mrg, viens en DM en envoyant le numéro de ta commande, ainsi que ton adresse e-mail, ton nom et ton prénom, nous allons regarder ça ensemble. https://t.co/klmMF0Q8Tn @Letervis Dans ce cas, contacte notre service client en suivant ce lien : https://t.co/xZHtEnRWDz. @bulla_scrunchie We understand that you're still awaiting update from the team who are dealing with it, from official Gift card issuer. Let us know what they say, via direct message. @talibhane Hey @talibhane, fais bien opposition auprès de ta banque, afin qu'elle puisse te rembourser de ces sommes, et ensuite contacte notre service client afin que nous puissions t'aider : https://t.co/gPwcOW0jje. @tentete1234 弊社カスタマーサービスまで状況をお知らせ頂けないでしょうか。ご利用環境等詳細をお伺いし引き続きサポートします。こちらのページをご活用いただけますとと幸いです:https://t.co/c5hTusUsMw @bulla_scrunchie Hi, sorry you feel that way. We can see they're trying to assist, and have asked you to reach out to the original supplier of Gift Card for assistance if possible. Please let us know if you have already done so. call or chat on: tel:+442076604453. @WesVernon No pain no gain, right? @She_Hate_Me23 Hey Sha! Pass us a DM at @NikeService with info on where and when you purchased your shoes. We'll be happy to help there. @dwkern01 We'll do our best to help, David! Please DM us over at @nikestore with where you're located and what specific size you're after. @Luis_EnriqueRdz Hola Luis Enrique, te recomeindo que hagas la compra por PC para que no pierdas más artículos, no sé que pudo pasar con la App pero para las próximas ocasiones que tengas el mismo problema te recomiendo que hagas la compra por PC. Saludos @earom05 ¡Hola Eduardo! ¿nos puedes enviar un mensaje privado con tu correo electrónico y tu número de pedido? Así podremos ver qué es lo que te pasa. Saludos @Tricepsgod Hey @Tricepsgod nous n'avons malheureusement pas de flocages officiels pour les maillots de la Norvège. @100drineLP Pas de soucis, il faut que tu nous suives pour pouvoir nous écrire en DM. @100drineLP Hey @100drineLP, nous sommes désolés de lire le problème que tu rencontres avec tes Jordan. Viens en DM avec ton adresse e-mail et la preuve d'achat de ta paire, nous allons voir cela ensemble. https://t.co/klmMF0Q8Tn @Mamgory Voici le lien pour nous DM. https://t.co/klmMF0Q8Tn @Mamgory Salut @Mamgory, viens en DM avec ton adresse e-mail et une capture écran du message d'erreur s'il te plaît. @mirsah Hey @mirsah, peux-tu nous envoyer une capture écran du message d'erreur ainsi que ton adresse e-mail en DM ? https://t.co/klmMF0Q8Tn @No_Lasagna Salut @No_Lasagna, peux-tu nous envoyer une capture écran du message d'erreur en DM ainsi que ton adresse e-mail ? https://t.co/klmMF0Q8Tn @sabthecool Salut @sabthecool, viens en DM avec ton adresse e-mail et une capture écran du problème s'il te plaît. https://t.co/klmMF0Q8Tn @IziSilver Voilà le lien pour le DM. https://t.co/klmMF0Q8Tn @IziSilver Hey @IziSilver, tu peux venir en DM avec ton adresse e-mail s'il te plaît ? @whyimsodumb Hey @whyimsodumb, peux-tu venir en DM et nous donner ton adresse e-mail ? https://t.co/klmMF0Q8Tn @cjayamsterdam We can confirm that the Air Max game has no age restrictions. ⛲ @XavierEN2 En ese caso tendrás que seguir nuestra página. Saludos @Official_Bailin Hello! We're sorry to hear your experiencing issues on https://t.co/yYv8xSbp4x. We've responded to your DM request, and we'll continue the conversation there! 👍 @https_phora Hi,\n\nPlease call in, and we can help troubleshoot +442076604453 @CClemzz Hey @CClemzz, ne t'inquiète pas, nous allons regarder ça ensemble. Envoie nous en DM le numéro de ta commande, l'adresse e-mail et ton nom, nous allons voir ou en est ta commande. https://t.co/klmMF0Q8Tn @XavierEN2 ¡Hola! ¿me puedes enviar por DM tu dirección de correo electrónico?\nSaludos @lisainog Preseason is starting early. 👀 @Guazu91 ¡Hola Guadalupe! ¿me puedes enviar un DM con tu correo electrónico? \nSaludos @M2Dynamics Hey there. Please DM @NikeService and let us know where you purchased your pair specifically. If they're from https://t.co/yYv8xSbp4x, include the order number and your Nike Member email. We'll meet you there to see what options are available for you. @Cyrillecaron Hey @Cyrillecaron, nous sommes navrés de voir le défaut sur ta paire. Ne t'inquiète pas, nous allons trouver une solution pour toi. Viens en DM avec le nom du magasin où tu as acheté ton article. https://t.co/klmMF0Q8Tn @KilluaMx Follow Nike afin de pouvoir nous écrire en DM. https://t.co/klmMF0Q8Tn @KilluaMx Hey @KilluaMx, pas de soucis, rejoins-nous en DM avec le numéro de ta commande et ton adresse e-mail, nous allons regarder ça pour toi. https://t.co/klmMF0Q8Tn @toroz_13 @SneakerAdmirals @SneakerNews @kicksonfire Shout out to YOU for your sacrifice on the frontlines! 🙌 @Lamesuka Tendrías que enviarlo por DM :) @Lamesuka ¡Hola Luis! ¿me puedes psaar tu correo electrónico y tu número de pedido por privado? , así vemos lo que pasa con tu pedido.\nSaludos @juanzavala91 ¡Hola Juan! Para nada es normal que te haya pasado eso, te paso el contacto de Atención al Consumidor de Mexico para que soluciones el incidente. Aquí tienes:  https://t.co/ai6PJ9r34d\nSaludos @Manini_amnh Hey @Manini_amnh, pas de soucis, peux-tu nous envoyer le numéro de ta commande ainsi que ton adresse e-mail en DM ? Nous allons regarder ça ensemble. https://t.co/klmMF17JKV @soyarturogg ¡Hola Mayel! ¿desde qué dispositivo estás intentando hacer la compra?\nSaludos .@mathewfras has done it again. And again. And again. And again. 5x CrossFit Games champion. Undisputed 🐐. #YouCantStopUs #HWPO https://t.co/PP5a0VCHHl You don't need to be a star to have a voice. #YouCantStopOurVoice\n\nLearn more: https://t.co/skpLvbw81r https://t.co/ougrmgjnm1 @lgjujuco Salut Justine, nous apprécions ton envie de faire partie de l'univers Nike, mais nous n'acceptons pas les demandes de sponsorisation. Nous te conseillons de rester active sur les réseaux sociaux, et qui sait, nous te sélectionnerons peut-être un jour. @andrewoski Buenos días! ¿me puedes facilitar tu correo electrónico y tu número de pedido por mensaje privado?\nSaludos @knxwledgepxwer Champ-pa with the mentality. 🏆🏆🏆🏆🏆 @juan_ozuna Don't make us wait too long! 🔥 @DanHelesfay 😍 😍 😍 @js_rodriguez_ Hola Don Viejo, si quieres puedes enviarnos un MD con el número de pedido y lo miramos. Un saludo. @MandFullard Sorry to hear this, Amanda! Feel free to DM @teamnike info on when and where this pair was purchased from, and we'll take a look at your options. 📩 @DaMediaGuy Hey there! Apologies for the confusion. The Día de Muertos collection will be dropping at a later date. We recommend staying tuned to the SNKRS app and https://t.co/QeFYQHpO76. Sorry for the inconvenience. @GraftMusic Got it. While we don't have any 720s in Grey to share currently, keep it locked here for any updates: https://t.co/bRAiIWIsXQ @nhpaulao So sorry for your loss, Paula. But, we're glad you were able to overcome and turn the negative into a positive! 👏 @GraftMusic Hey, here's a link to the available 720's on https://t.co/Q5h4vQiSJ5: https://t.co/6vzZNO8UdY. @ReissBeckford Hi Reiss, We proactively seek athletes to wear the Swoosh and represent the Nike brand. While we appreciate your love of sport and interest in Nike, we don't accept unsolicited sponsorship requests. RT @NikeLA: In a year unlike anything, this win means everything. #YouCantStopLA\n\n@KingJames @AntDavis23 @Lakers https://t.co/5y2EVJAmok 🏆 🏆 🏆 🏆 🏆\n🏆 🏆 🏆 🏆 🏆\n🏆 🏆 🏆 🏆 🏆\n🏆 🏆 🏆 🏆 🏆\nAnd not stopping now.  \n \n@RafaelNadal makes it 20 Major titles. #YouCantStopUs https://t.co/G1pstyWsXo @orbazz Hey there, those are the Air Force 1 Low. You're in luck because that style is currently available from our friends at Foot Locker! 👇🍀 \n\nhttps://t.co/m35OUL7CGZ @turtlepace5 We 🧡 this. @EVLASH20 Those 26 years flew by. We missed you! @James882James Hi James,\n\nThats great to hear!\nThere is no knowledge from our end on any general 30% discount. Might have been a special promotion at that outlet. Happy days  😎 @pascujmr En su defecto si no tienes ticket de compra nos podrías aportar captura de la transacción de pago. Puedes contactarnos a través de nuestra sección de ayuda; https://t.co/KaAfi5DiUe. Saludos. @Vale28512059 Hola Vale, si te parece envíanos un MD con el número de pedido y lo miramos. Te esperamos. Saludos. @pascujmr te comento, sin el ticket de compra no podríamos hacer nada ya que nuestro departamento de calidad tendría que hacer un estudio del defecto. @pascujmr ¡Gracias! para poder atenderte con ese  defecto en nuestro artículo, tendrás que darme tu número de pedido y pais en el que has hecho la compra. Saludos @loretov_18 Hola Loreto. Si quieres puedes enviarnos un MD con el número de pedido y le echamos un vistazo. Tamgbién puedes contactarnos a través de nuestra sección de ayuda: https://t.co/W5E9iEg8si. Saludos. @CA2WTT ¡Hola @CA2WTT! ¿Me puedes enviar tu número de pedido o correo lectrónico para poder ayudarte? Saludos @_matiasmella ¡Hola! ¿nos puedes enviar un DM con tu número de pedido? ¡estaremos encantados de ayudarte! Saludos @pascujmr ¡Hola! ¿nos puedes enviar un DM?,¡ estaremos encantados de ayudarte! Saludos @Ricardo09237664 ¡Hola! ¿me puedes enviar un DM con lo que te pasa en ese pedido? Estaremos encantados de ayudarte. Saludos An unfamiliar course. An isolated stadium. A challenging training season. Through it all, Brigid Kosgei kept going.\nBecause greatness is unstoppable. 👟 🥇 https://t.co/BPdniN6CK8 @c_bangs 💪❤️ @itsgabecamacho We're just returning the favor, Gabriel. 🤝 @cooka1219 We love to hear it! Make sure you keep your eyes peeled for your ballot. 👏 @thawoo1031 That's odd! Feel free to DM @teamnike your Nike Member email so that we can take a closer look. 📩 @thawoo1031 Hey Pat, you'll want to visit the page linked below. Be sure to sign in to your Nike Member profile so that you're all set and ready to go for the next 🔥 drop.\n\nSNKRS desktop: https://t.co/YFy06RfrHI @cdgehring This drop is 🔥. @ismarygarcia1 ¿me puedes envia tu número de pedido por un mensaje privado? @willyrodrigz ¿qué modelo es? ¿has actualizado app o caché y cookies? @KaviarKicks Love the passion! Unfortunately, we don't have information to provide on the midsole materials, and we don't have plans to sell accessories. Let us know if you need any help tracking down some Air Max 1s! @Hillt1 Congrats on crushing your first marathon, Terry! 🏅 Cheers to many more kilometres in your Infinity Runs! @JunicMe Let's get you back in the game! Pass us the following via DM and we'll take a closer look:\n\n- Nike Member email\n- Device + OS\n- Version of the NTC app https://t.co/klmMF0Q8Tn @SushilM17566647 That's no good, Sushil. Mind letting us know when and where you purchased these? Meet us in the DM and we'll look at your options. ⬇️ https://t.co/klmMF0Q8Tn @schopp_case We're digging how these kicks turned out! 🔥🙌 @jocy_fredes Hola Joy, encantados de ayudarte. Sí por favor, ¿puedes mandarnos tu número de pedido y el correo electrónico que usaste para hacer la comra?. Te esperamos https://t.co/klmMF0Q8Tn @macaren21783218 Hola Macarena. ¿Podrías mandarnos un DM indicando el correo electrónico con el que hiciste la compra y tu número de pedido para echarle un vistazo?. Saludos. https://t.co/klmMF0Q8Tn @mariotouc Hola Mario, ¿podrías mandarnos un DM indicando el correo electrónico con el que hiciste la compra y tu número de pedido para echarle un vistazo?. Saludos. https://t.co/klmMF0Q8Tn @JacobBrough3 Let's figure this out, Jacob. Did you manually enter or edit the run? Was Power Saving mode enabled? DM your answers to @teamnike, along with your Nike Member email and some screenshots of what you're seeing. @realrentvp Hola Renato, para poder ayudarte mejor ¿podrías mandarnos un DM indicando el correo electrónico con el que hiciste la compra y tu número de pedido para echarle un vistazo?. Saludos. https://t.co/klmMF0Q8Tn @evelynh39155657 Hola Evelyn, vamos a averiguar qué ha pasado. ¿Podrías mandarnos un DM indicando el correo electrónico con el que hiciste la compra y tu número de pedido para echarle un vistazo?. Saludos. https://t.co/klmMF0Q8Tn @angelmrn701 Hola Ángel ¿Podrías mandarnos un DM indicando el correo electrónico con el que hiciste la compra y tu número de pedido para echarle un vistazo?. Saludos. https://t.co/klmMF0Q8Tn @ricardo10064781 Hola Ricardo, encantados de ayudar. ¿Podrías mandarnos un DM indicando el correo electrónico con el que hiciste la compra y tu número de pedido para echarle un vistazo?. Saludos. https://t.co/klmMF0Q8Tn @guidomark Hola Guido, vamos a averiguar qué ha pasado. ¿Podrías mandarnos un DM indicando el correo electrónico con el que hiciste la compra y tu número de pedido para echarle un vistazo?. Saludos. https://t.co/klmMF0Q8Tn @deepans2301 No word to share at the moment, Deepanshu. Please stay tuned to our site for any updates or availability info. We also recommend taking a peek at our University Red colourway available now via this link: https://t.co/0T0dg6qDur @StiveGodoy ¡A por los 5km! 🏃‍♂️ 🔥 @l_pancho Hola Francisco, vamos a averiguar qué ha pasado. ¿Podrías mandarnos un DM indicando el correo electrónico con el que hiciste la compra y tu número de pedido para echarle un vistazo?. Saludos. https://t.co/klmMF0Q8Tn @MarcosMato22 ¡Sigue así, Marcos! 🏃 🏃‍♂️ @Tatanisky Hola Tatán, encantados de ayudar. ¿Podrías mandarnos un DM indicando el correo electrónico con el que hiciste la compra y tu número de pedido para echarle un vistazo?. Saludos. https://t.co/klmMF0Q8Tn @debhevia Hola, ¿podrías mandarnos un DM indicando el correo electrónico con el que hiciste la compra y tu número de pedido para echarle un vistazo?. Saludos. https://t.co/klmMF0Q8Tn @lunchboxdad Now she's set up for success. Can't wait to see what you cook up next, Dad! 🙌 @iamjodeane We love the drive, Jodeane! 💪 @NossonWeissman Happy to look into this with you, Nosson! Feel free to DM @teamnike your Nike Member email and some screenshots of what you're seeing. 📩 @PalavecinoAyala Hola Maximiliano, vamos a averiguar qué ha pasado. ¿Podrías mandarnos un DM indicando el correo electrónico con el que hiciste la compra y tu número de pedido para echarle un vistazo?. Saludos. https://t.co/klmMF0Q8Tn @l_reeyes Hola. Estamos optimizando algunas secciones para ofreceros la mejor experiencia de compra posible. ¡Muchas gracias por tu feedback! Sigue atenta a nuestra web para no perderte ningún cambio y recuerda que puedes visitarnos en tu tienda oficial más cercana. Te esperamos. @beto720423 Hola Beto, encantados de leerte. Estamos evaluando la selección de productos y categorías ofrecidas de acuerdo con vuestras preferencias. Ten por seguro que tomamos nota de tu interés. Mientras tanto, puedes visitarnos en tu tienda oficial más cercana. ¡Te esperamos! @IanParry_ That's not what we like to see. Meet us in the DM with the following and we'll take a look:\n\n- Nike Member email\n- Device type + OS\n- Version of the Adapt app @itskartikjoshi We've got your back, Kartik! 💪 @wullzdee Sorry to hear about your experience, Wullie. Please DM us @TeamNike with your Nike Member email, and we'll do our best to help. @pris_ayala13 Hola Pris, vamos a averiguar qué ha pasado. ¿Podrías mandarnos un DM indicando el correo electrónico con el que hiciste la compra y tu número de pedido para echarle un vistazo?. Saludos. https://t.co/klmMF0Q8Tn @nicolasagm206 Hola Nicolás, vamos a averiguar qué ha pasado. ¿Podrías mandarnos un DM indicando el correo electrónico con el que hiciste la compra y tu número de pedido para echarle un vistazo?. Saludos. https://t.co/klmMF0Q8Tn @rorrocampos Hola, vamos a averiguar qué ha pasado. ¿Podrías mandarnos un DM indicando el correo electrónico con el que hiciste la compra y tu número de pedido para echarle un vistazo?. Saludos. https://t.co/klmMF0Q8Tn @MauricioPlace13 Hola Mauricio, sentimos mucho lo ocurrido. ¿Podrías mandarnos un DM indicando el correo electrónico con el que hiciste la compra y tu número de pedido para echarle un vistazo?. Saludos. https://t.co/klmMF0Q8Tn @carlosadan011 Hola Carlos, vamos a averiguar qué ha pasado. ¿Podrías mandarnos un DM indicando el correo electrónico con el que hiciste la compra y tu número de pedido para echarle un vistazo?. Saludos. https://t.co/klmMF0Q8Tn @BarbaraSawalha Hola Bárbara,  ¿podrías enviarnos un DM con el correo electrónico con el que hiciste la compra y tu número de pedido para echarle un vistazo?. Saludos. https://t.co/klmMF0Q8Tn @Ivancmpj Hola Iván, échale un vistazo a tu tienda oficial más cercana. ¡Te esperamos! @Solosu7 Hola, vamos a averiguar qué ha pasado. ¿Podrías enviarnos un DM con el correo electrónico con el que hiciste la compra y tu número de pedido para echarle un vistazo?. Saludos. https://t.co/klmMF0Q8Tn @iamsaratomovic Welcome to the club! We can't wait to see your progress. 💪 @rebegg95 Hola Rebeca, medio número más debería de ser suficiente pero si no lo fuera no te preocupes porque los cambios y devoluciones son gratuitos 📏 https://t.co/klmMF0Q8Tn @Greicy12518 ¡Genial Greicy, ahora a darlo todo!🏃‍♀️ @profedafne Hola Dafne, para poder ayudarte mejor, ¿podrías enviarnos un DM con los datos del pedido y le echamos un ojo? https://t.co/klmMF0Q8Tn @kim_lotus Hey, Kim! We recommend reaching out to your local Nike stores for more information. @EmerickCarter Hey Emerick , nous sommes désolés pour tes Hyper Adapt. Nous t’invitons à venir en message privé avec ton numéro de commande ou ton adresse e-mail afin que l'on puisse regarder cela ensemble. @LeBelhandisme Hey @LeBelhandisme , nous allons t’aider ne t’inquiète pas. Nous t’invitons à venir en message privé avec ton numéro de commande ou plus d’informations sur ta situation et nous pourrons regarder ce qu’il se passe ensemble. @BigNorm72 We specialize in that lighter than air feeling.😉☁️ @MatttttJohnson They grow up so fast.🥺 @haley_weininger 😍😍😍 @RBainesy Pumped to see you found your perfect pair! Cheers to many more kilometres together 👟 @smoove02 We got you covered! Check out our cleaning guide here: https://t.co/GtnFq8a3ia @Victori68766884 Hola Victoria, lamentamos mucho el retraso, te hemos enviado un e-mail, favor de revisar bandeja principal y de correo no deseado. Saludos. @Damochi We love to see you set goals for yourself, Dee! Keep us updated as you take on this fitness journey with your new running and training shoes. 👊 @Marco_Malavasi Score! What's the first thing you're doing in your new trainers? When one of us wins, we both win. You can't stop sisters. #YouCantStopUs\n\nJoin Us | https://t.co/1m48qkTOkV https://t.co/kdttLvN60s https://t.co/dbx5DP5MYB @claudialever Hey Claudia, some products are excluded from that promo. Feel free to DM @teamnike your Nike Member email and a screenshot of what you have in your bag. You can also view the exclusions list here: https://t.co/he2XqTQWr6 RT @nikebasketball: Never fear failure.\n\nWhat can you do today to be better than yesterday?\n\nLearn more about Kobe’s Fearlessness: https://… RT @nikebasketball: Be honest with yourself. Your team. The world.\n\nWhat can you do today to be better than yesterday?\n\n#MambaMentality \n\nL… RT @nikebasketball: Focus on your goal and how to get there.\n\nWhat can you do today to be better than yesterday?\n\n#MambaMentality\n\nLearn mo… RT @nikebasketball: To kick off Mamba Week, we asked our athletes to tell us how Kobe’s passion inspired them to be better. #MambaMentality… RT @nikebasketball: Kobe taught us to be better. A better scorer, better mentor, better father, better champion. Today, on his birthday, we… @mar_smello No time like the present. 🏃‍♀️ @keharker They never left. 😎 https://t.co/1Y0eDqXsMY @AdrianHuertaPhD @USCRossier @USCPullias Fight on! ✌️ @Chad_2Cool You were saying? \n\nhttps://t.co/NxirsP9Cph @chotsky7 Post your pair on IG using #SNKRSKickCheck for a chance to be featured next! @gbucarey Hola Gonzalo, te recomendamos revisar bandeja principal y de spam del e-mail que proporcionaste. Si no, puedes contactarnos directamente a través de nuestro centro de atención telefónica, encontrarás más información en la sección de ayuda. Saludos. @Tomtrooper4 Hey @Tomtrooper4. La promotion anniversaire est un tirage au sort parmi tous les Membres Nike nés le même mois que toi. Un e-mail est envoyé afin d'informer les personnes sélectionnées. On espère que tu seras plus chanceux l'année prochaine. @CAvilaH7 Hola, de ser así te recomendamos te comuniques a nuestro centro de atención telefónica, que estaremos encantados de ayudarte. Encontrarás nuestras diversas vías de contacto en la sección de ayuda. Saludos. @Carol_HzR Hola Carol, ¿has revisado bandeja principal y de spam del correo que proporcionaste? te sugerimos echarle un ojo ya que deberías de tenerlo si el pedido se realizó correctamente. Un saludo. @eddie_rockss Hola Eduardo, lo más recomendable es devolver el producto que tienes utilizando la etiqueta que incluimos en tu paquete y realizar un pedido nuevo con la talla que deseas. Saludos. @batlly_25 Hola Bárbara, vemos que ya te has comunicado a nuestro centro de atención telefónica, podrás rastrear tu paquete con el número de seguimiento que te hemos proporcionado, que disfrutes mucho de tu compra. Un gran saludo. @juanluisggarcia Hola Juan, lamentamos mucho lo ocurrido, la verdad es que no es nada normal que pasen estas cosas ¿podrías enviarnos un privado con tu e-mail registrado? así podemos echarle un vistazo. Saludos https://t.co/klmMF0Q8Tn @Bichitabuena Hola Lucía, el tiempo que tarde en reflejarse dependerá de tu método de pago y de tu entidad bancaria, considera que si pagaste con tarjeta el reembolso deberá reflejarse en un plazo aproximado de 9 días, a partir de que se haya procesado. Saludos. @mitzyGa19978935 Hola Mitzy, en este caso te sugerimos te comuniques directamente a nuestro centro de atención telefónica, encontrarás nuestras diversas vías de contacto en la sección de ayuda. Saludos. @jchm_mx Hola, para cambios de talla lo más recomendable es realizar un pedido nuevo con el producto que deseas y devolver el que ya tienes utilizando la etiqueta que incluimos en tu paquete. Saludos. @saranthula Hola Sarah, los pedidos Nike pueden llegar en paquetes separados, por lo que te sugerimos estar al pendiente de tu e-mail donde te estaremos enviando actualizaciones sobre el envío. Saludos. @Elabogadoebrio Hola Alex, a todas las compras Nike que se hayan realizado después del 14 de febrero de 2020 se les aplicará una política de devoluciones ampliada de 60 días (hay algunas excepciones). Saludos. @HernanTmara Hola Rommy, ¿ podrías enviarnos un MD indicándonos el email que usaste para hacer el pedido ? Saludos. https://t.co/klmMF0Q8Tn @SeguradoPablo Hola Pablo, hemos procedido a realizarte la devolución de tu pedido, en los próximos días laborables verás de vuelta la cantidad reflejada en tu tarjeta. Saludos. https://t.co/klmMF0Q8Tn @SeguradoPablo Hola Pablo, si te parece envíanos un MD con el número de pedido y lo miramos. Un saludo. https://t.co/klmMF0Q8Tn @amadopedrero Hola Amado, te dejo por aquí el link que espero te sirva de interés: https://t.co/ZdDWYoSAGC. Saludos. @WaBiiiiZ Hey @WaBiiiiZ, pas de disponibilité en ce moment pour cette paire d'Air Max 1. Restes connecté sur nos nouveautés et notre SNKRS app 🙂. @TexazMane Light work. 😤 @DreKingston The 🍒 on top to any fit 💯 @KGOLO_KAY Those Air Force 1 Mid Utility shoes dropped early last year and are sold out. The classic black AF1 Mid is available though. Have a look: https://t.co/XjQBnCoNrV @Rodack_p Hola C.Rodrigo,  según el sistema tu pedido está en tránsito. Si quieres también puedes contactarnos a través del siguiente link: https://t.co/FlfpmB3yWc. Saludos. @NadineSnchezLa1 Hola Nadine, te recomendamos contactarnos a través del siguiente link: https://t.co/SyXgFBWqgz. Te esperamos. Saludos. Nothing can stop what we can do together. You can’t stop sport. Because #YouCantStopUs.\n\nJoin Us | https://t.co/fQUWzDVH3q https://t.co/YAig7FIL6G @cotita_beans Hola Cotita, te recomendamos seguirnos a través de nuestra APP y web donde irán saliendo todas las novedades. Saludos. @Richardeko Hola R Dave, si quieres puedes mandarnos un MD con el número de pedido y lo miramos. Te esperamos. Saludos. @cotita_beans Hola Cotita, ¿ has probado a enviarnos un email ? Si quieres también puedes indicarnos el número de modelo y lo miramos. Saludos. @Carolin54415718 Hola Carolina, te recomendamos contactar con nuestro servicio de ayuda a través del siguiente link: https://t.co/fPeJtb3bXS. Te esperamos. Saludos. @ManatiVazquez Hola Cristina, si quieres puedes mandarnos un MD con el número de pedido y lo miramos. Un saludo. @Rodack_p Hola C.Rodrigo, ¿ nos podrías enviar un MD con el número de pedido y así le echamos un vistacito ? Te esperamos. Un saludo. @atcheeylaurenn Trails beware. Speed is coming! 🔥 @BasinStRecords When you hit it let us know. We can't wait to hear about it! @BasinStRecords Congrats! Here's to 3000 more. 🎉 @piscean219 😍 😍 😍 @neondunker Hola Antonio, lamentamos mucho el retraso en tu entrega ¿podrías contactarnos a través de nuestro centro de atención telefónica?, te dejamos por aquí el dato: https://t.co/pYAKnhyWl8\nSaludos. @alioli03 Hola Alioli, te recomendamos seguirnos por nuestra web y APP donde iremos anunciando todas nuestras novedades. Saludos. @Rico_MarLou Hola Marlou, si te parece envianos un MD con el número de pedido y así poder ver el seguimiento del mismo. Un saludo. @CARLOXYZ2 Hola Carlos, si quieres envianos un MD con la dirección de email que usaste para hacer el pedido y así echarle un vistacito. Te esperamos. Saludos. https://t.co/klmMF0Q8Tn @rubanal En este caso te sugerimos intentarlo nuevamente o si no puedes contactarnos directamente a través de nuestro centro de atención a clientes que estaremos encantados de ayudarte: https://t.co/7XFscqTndX\nSaludos. https://t.co/klmMF0Q8Tn @rubanal Hola Rubén, ¿ Podrías intentarlo ahora de nuevo porfi? Te esperamos. Un saludo. https://t.co/klmMF0Q8Tn @alioli03 Hola, ¿podrías intentarlo ahora de nuevo porfi? Te esperamos. Un saludo. https://t.co/klmMF0Q8Tn @rubanal Hola Rubén, si quieres puedes enviarnos un MD con el número de pedido y lo miramos. Un saludo. @alioli03 Hola, ¿nos puedes enviar un privado con tu número de pedido y correo electrónico? Que lo revisamos enseguida. Saludos. @Bhaloy Calvin, this is vAIRy cute!😍 @Francis03306351 Hola Francisco, veo que los MD están activados para que nos lo puedas enviar, pero si sigues teniendo incidencia para hacerlo te sugiero que nos contactes a través de nuestra página web en la sección de ayuda. Un saludo. https://t.co/klmMF0Q8Tn @juancarlosdima Hola Juan Carlos, si te parece envianos un MD con el número de pedido y así podremos verlo juntos. Un saludo. https://t.co/klmMF0Q8Tn @DesiderioRamir9 Hola Desiderio, cuando realizas un pedido se te envía una autorización de pago que luego se te es devuelta, si el pedido está cancelado, en 10 días laborables como mucho verás esta cantidad devuelta en tu cuenta. Un saludo. @Francis03306351 Hola Francisco, ¿ podrías intentarlo de nuevo ? Un saludo. https://t.co/klmMF0Q8Tn @Francis03306351 Hola Francisco, si quieres envianos un MD con el número de pedido y así poder echarle un vistacito. Saludos. @LGKING Hola, puedes enviarnos tu consulta a través de cualquiera de los siguientes medios: https://t.co/VpjKg9CnpP. Saludos. @CharlieLof Hola Carlos, te recomendamos que nos sigas a través de nuestra web y APP para mantenerte al tanto de todas nuestras novedades. Un saludo. @Nattysonice Hey Natalie! The blue one is sold out, but we have the same one in red here on our site. Check it!\n\nhttps://t.co/L6Z9wp3m5W @Gerbows Hola Dido, te dejamos por aquí los colores y modelos que tenemos disponibles por el momento: https://t.co/gw7AdVazzS\nSaludos @LGKING Hola, en ese  caso puedes intentarlo a través de nuestro servicio de atención al cliente en llamada o en chat. Te esperamos. Un saludo. @LGKING Hola,  ¿podrías enviarnos un MD  con el número de pedido y así poder ayudarte? Un saludo. @andrearamirezda Hola Andrea, si te parece envianos un MD con el número de pedido y le echamos un vistacito. Un saludo. @leoetorresg Hola Leandro, ¿ podrías enviarnos un MD con los números de pedido para comprobar el estado de los mismos? Como sabes también puedes devolverlo de forma gratuita y segura. Un saludo. @isis_moreno Hola Isis, ¿ podrías enviarnos un MD con el número de pedido para echarle un vistacito y así poder ayudarte porfi? Un saludo. @mattt_hlr Bonjour Matt-hlr ! Nous n'avons pas d'informations concernant les réassorts d'articles. Je t'invite à suivre les nouveautés sur le site https://t.co/Wilj3MgsMq et/ou l'app Nike ! =) @Chikenn750XX Bonjour Chikenn750XX ! Nous n'avons pas d'informations sur les réassorts d'articles ! N'hésite pas à suivre les nouveautés sur le site https://t.co/oJwjvMVRLS et sur l'application Nike ! @salim_rey31 Bonjour Salim_rey31 ! N'hésite pas à appeler au +33 (0) 170489073 du lundi au vendredi ou par chat pour pouvoir effectuer un échange d'article. Les échanges sont gratuits. @kanesha_missy We're so proud of you! 💪 @madonna1ab Thank YOU for all you do! ♥️ Stay safe and healthy! @Marvin_Grs77 Bonjour Marvin_Grs77 ! Pour le moment, nous n'avons pas de date de sortie. Je te conseille de suivre les informations sur le site https://t.co/XqENKE7bCj ou sur l'App Nike. =) @DRAQKERRR Bonjour DRAQKERR ! Pour ta commande, nous te conseillons de contacter le service client https://t.co/WP6bLcqIWx par téléphone au +33 (0) 170489073 ou par chat du lundi au samedi de 9 h à 18 h @aiisuca Hola aiisuca, para no perderte de ningún próximo lanzamiento, échale un ojo a nuestro calendario: https://t.co/Tw50IkNqHf. Por cierto, te sugerimos también descargarte la SNKRS App, es la mejor forma de mantenerte siempre al día. Saludos @offcolork Welcome to the club! We're happy to have you. 🏃‍♀️ @EricLetassey Bonjour Eric ! Avec l'étiquette de retour présent dans le colis, tu peux renvoyer la paire de Pegasus et être remboursé. Le remboursement se fait dans les 5 à 8 jours ouvres sur votre carte bleue ou 48 h avec paypal. @rxyski Bonjour rxyski ! Nous vous conseillons d'appeler votre banque pour régler le souci au plus vite. Si le problème persiste, n'hésitez pas à venir nous parler en DM. https://t.co/klmMF0Q8Tn @maurcd62 Bonjour maurcdd62 ! Nous n'avons pas d'informations concernant les réassorts d'articles. Nous te conseillons de suivre les articles sur le site https://t.co/bmOvJ81Lhh ou la Nike App pour suivre les restocks. @tolissotom Hey Tolissotom ! Magnifique chaussure ! Hate que tu les recoit pour nous en parler ! =) @100sanscentsang Bonjour 100sanscentsang ! N'hésite pas à venir nous voir en prive pour nous expliquer et pouvoir t'aider ! https://t.co/klmMF0Q8Tn @MastalerzSara Sounds like it's time for something new to keep the conversation going. 😉 https://t.co/VJVn6IB3q8 @Smithers216 You got the juice. 🍇 @MattMur79807862 Hi Matt, nous sommes contents qu'elles te conviennent parfaitement. Enjoy ! @RobinHoodTV Hi Robin ! Nous ne conseillons de prendre ta pointure habituelle, si toutefois nos échanges sont gratuits. @marianitaAa_o ¡Hola marianiwis! Estate muy atenta a nuestra página web para que no te pierdas ningún próximo lanzamiento.\nSaludos. @ms13_daniel ¡Hola Daniel! por el momento no enviamos a las Islas Canarias, te dejo el link donde puedes revisar las opciones de envío de https://t.co/tJ4q2xbIxE aquí: https://t.co/mrvMw5vltz\nSaludos. @JRuizz ¡Hola Julian! los pedidos en https://t.co/VVRUsfUMSZ no se pueden cancelar pasados los 15 minutos, en este caso, ponte en contacto con nosotros a través del 913753366 cuando tengas el número de seguimiento. Saludos @ALJMontenegro ¡Hola Alex! ¿En qué país quieres encontrar una tienda Nike? @aloha_caleb96 Open for a surprise ⬆️👀 @PhiPhiOhara The love is mutual 🌈 @J0bbzz Hey. Pour l'instant nous n'avons pas de date de sortie pour la Air Max 98 Tear Away. Afin de savoir quand cet article sera de nouveau disponible, nous t'invitons à rester à l'affût sur https://t.co/1fLewa4UfM et ta Nike App. @patgum10 Gear up for the grill. https://t.co/H0L29CsOc0 We will continue to stand up for equality and work to break down barriers for athletes* all over the world.\n \nFor more information: https://t.co/CQvZhwEYFT https://t.co/ekOaUM4qAA @Jumpman23 🤝 @adidas ❤️ Let’s all be part of the change.\n\n#UntilWeAllWin https://t.co/guhAG48Wbp @Case_YES_Bin Now that's a lot of running. Way to go! 🎉🙌 @Kenndtx We are releasing a BETRUE collection, Ken! Check out the details here: https://t.co/bvkmFTH6MZ @freenrambles Thanks for connecting! Go with the Structure or the Odyssey, they will have a firmer midsole on the arch of the foot and a lighter, softer foam on the outside which will be perfect for you. 👍 @gianinnabc Hola, encantados de ayudarte. ¿Podrías enviarnos un MD con tu correo electrónico y el número de pedido por favor?. Te esperamos. Saludos. https://t.co/klmMF0Q8Tn @leacbn Hey Lea. Nous sommes sincèrement désolés que ta commande rencontre du retard. Nous faisons en sorte que tu la reçoives au plus vite et nous te feront savoir par e-mail dès que ta commande est expédiée. @Edoggy23 We hope you get the flavor you're after! 😋 🤞 🍨 @PaulDStafford Lotta love in those shoes! Time for a fresh pair. 👟 \n\nhttps://t.co/U5cJfT6RvX No matter what we’re up against, we are never too far down to come back. #YouCantStopUs\n\nJoin Us | https://t.co/4PA8xvWFag https://t.co/VA30CC2ehg @ankur62988533 Thanks for being a part of the Nike family! 👊 @AOeves 25 years! Glad you're not tired of us yet! 🥂 @HawaiiWarrior87 Hey Delmar, the NRC app is partnered with Android watches that have wearOS. @OllieDingli Yes, once you start the run, you can tap on the three Metrics on the screen. They should stay with those metrics you've chosen for your future runs. 👍 @OllieDingli Hey Ollie, instead of scrolling on your watch to change the metrics, you can now tap on each individual metric to change it to what you'd like to see! @BubuSamy Hey Samy. Cet article est actuellement indisponible, car il est en rupture de stock. Tu peux trouver juste ici d'autres articles qui pourraient t'intéresser : https://t.co/Bc5gBrg3lJ @CesarAbal Hola César, te dejamos aquí el modelo para que puedas consultar la disponibilidad en nuestra web. Son las Nike SB Zoom Blazer Mid Edge, CI3833-401. Saludos @theafroreloaded We got you. 👀 Get the Sportswear City Ready jacket here: https://t.co/aDcEqTWZtv @yomma_s What're you waiting for then? 😏 https://t.co/r2l82mdL0X @CesarSD760 Hey Cesar — we don't have this blue colorway on our site but check out some other options you might dig!\n\nhttps://t.co/bAtGmnMOym @BeneathNo1 Rise and grind.🍴 Keep up the awesome work! 👊 @BeneathNo1 We got you! Running it back today? 🤔 @amanda_slayz Putting in the hard work in style. 😍 @ChristinaLivsy Way to go Christina! 🏃‍♀️ @Labopleur Hey, Manon. Peux-tu nous transmettre ton adresse e-mail et ton numéro de commande en DM via le lien suivant s'il te plaît ? https://t.co/klmMF0Q8Tn @balthazar62 Hey, en effet. Peux-tu nous transmettre ton adresse e-mail et ton numéro de commande en DM via le lien suivant s'il te plaît ? https://t.co/klmMF0Q8Tn @390manda__ Hey, Les délais de préparation et de livraison sont actuellement de 15 jours ouvrés (hors week-end et jours fériés) donc pas d'inquiétude à avoir. Si tu veux, nous pouvons vérifier pour toi. Pour ça, nous attendons ton numéro de commande et ton adresse email en DM s'il te plaît. https://t.co/klmMF0Q8Tn @Ellenfthc Hey there, no news on that style at this time. Stay tuned to https://t.co/yYv8xSbp4x for the latest. 👍 @Oliver__VK We got you! We update Nike By You materials daily, so feel free to check back each day between 4-5 PM for possible restocks. 👍 @shbcos No news right now, but stay tuned to https://t.co/yYv8xSbp4x for all the latest &amp; greatest styles! @HighKeyLee What a ride! Let's find you a new favorite: https://t.co/zdhy3xKeR5 @AkbarPathana No word on when that style is restocking. Check out the link below for all current styles avaliable! 👀 \nhttps://t.co/TdBgCW3Bh5 @jessismoree Hey there, we have a short amount of time to cancel an order once its been placed. You can cancel your order during that time through the Nike app. @El_Barto_38 Hey, Aïssou. Merci pour cette photo. Nous avons bien reçu tes messages en DM et avons pris en compte ta plainte. @ValooBerry Hey Valoo. En effet, nos lignes téléphoniques sont extrêmement occupées en ce moment. On t'invite donc à nous contacter par chat [Lundi au samedi - 9h à 18h] via ce lien : https://t.co/QD06zFTsLq @SYH509 Hey. En effet, nos lignes téléphoniques sont extrêmement occupées en ce moment. On t'invite donc à nous contacter par chat [Lundi au samedi - 9h à 18h] via ce lien : https://t.co/kXuhu6m7TW @strapondine Tu as juste à utiliser l'étiquette pré-payée de retour fourni dans ton colis et de retourner ta paire par la poste. Une fois ton retour reçu, on te remboursera l'intégralité de ta commande. @Barksdale_941 Hey. Viens en DM avec ton numéro de commande et ton adresse e-mail on va pouvoir t'aider. https://t.co/klmMF0Q8Tn @brxkengomez Great style! Those are the Nike Air Max 90s, check them out here: \nhttps://t.co/kjVauaoe3D @Portugator95 Hey. Le modèle n'est plus disponible, il fait partit d'anciennes collections Nike Mercurial. Vous pouvez voir nos nouveaux modèles juste ici : https://t.co/5iEfrfSHyo . @Alexis_Rookie Hey Alexis. Tu peux nous contacter  via notre service client par téléphone (+33170489073) ou par chat [Lundi au vendredi - 9h à 18h et Samedi - 9h à 18h].\nSinon tu peux venir en DM en nous communiquant ton numéro de commande et ton adresse e-mail. https://t.co/klmMF0Q8Tn @gbarrett123 Keep crushing those runs Gary! 💪 @hsshawnshyne Thank you for all that you do! The Air Zoom Pulse is not available to purchase, as we've donated our current inventory through Good360. Stay tuned to our site for future releases, here: https://t.co/ieDVjACnHF @jet78 Hey Janelle, we're happy to hear you love the app! If you have compatible devices, you can stream workouts to your TV. Also, you can join us on YouTube Saturday mornings for a workout — perfect for your laptop! 💪 \n\nFAQ: https://t.co/sZnGGMBpW7\nYouTube: https://t.co/0oCpcp3kOv @SeetheSun_ We got you! @prim_siripipat (Down the) Aisle Force 1s 😍 @tdnowling She might like the Odyssey React Shield 2, which has a weatherized outsole to keep spills out and React technology to cushion her feet during long hours: https://t.co/skYkLeUAH0 https://t.co/klmMF0Q8Tn @nycdoublebassis We searched high and low but couldn't find any available. Stay tuned to https://t.co/yYv8xSbp4x for size restocks. @Caleb_Mezzy Hey Caleb, she sounds incredible! The Air Zoom Pulse is not available to purchase, as we've donated all of our inventory through Good360. However, she can sign up for a 20% off discount as a medical professional: https://t.co/VUvGPWUiPS @tdnowling Hey Tim, we're certainly inspired by her! We're donating all of our supply of Zoom Pulses through our partners at Good360. We do have some other great options she would love and are offering a 20% discount to first responders!\n\nhttps://t.co/dfpaYrLEE7 @livinglife321 Hey Ash! We're partnering with Good360 for our donation efforts. They are a nonprofit that specializes in distributing product donations to organizations that help people facing disasters and other challenges. 👍 @vicentep_14 Agradecemos tu amabilidad, Vicente. Saludos. @vicentep_14 Hola Vicente, sentimos que no hayas podido comunicarte. Puedes intentar enviándonos un DM con tu número de pedido. Te esperamos. https://t.co/klmMF0Q8Tn @AldoRamirez_ Hola Aldo, envíanos la información por DM. Un saludo. https://t.co/klmMF0Q8Tn In recognition of frontline healthcare workers around the world, Nike will donate the Air Zoom Pulse and other product to healthcare athletes. @DaviidBITW Vaya, lamentamos lo que nos cuentas. David, te aconsejamos que te comuniques con nuestro servicio de Productos y Pedidos a través de este link: https://t.co/7tGpKEBDcQ. Un saludo. @vicentep_14 Lo mejor en este caso es que abras un chat con nosotros a través de este link https://t.co/ovKmGwCdEK. Un saludo. @vicentep_14 Hola Vicente, ¿podrías enviarlo nuevamente? https://t.co/klmMF17JKV @vicentep_14 Hola Vicente, aquí estamos. Envíanos tu número de pedido por DM. Un saludo. https://t.co/klmMF17JKV @f_rabade Vaya, lamentamos leer esto. ¿Podrías enviarnos un DM con el nombre de la tienda y la fecha de compra? Un saludo. https://t.co/klmMF0Q8Tn @vali_rz Hola Vale, envíanos tu número de pedido por MP. Un saludo. https://t.co/klmMF0Q8Tn @MoBirdsMoPrblms Hey Alexander, great question! The Epic React Flyknit 2 will have the similar Flyknit upper as well as a React foam sole which is similar to Lunarlon. Try them out worry free as a Nike Member with our no questions asked return policy. https://t.co/gR66oqIxcm @NicolaHowe13 Hey Nicola, looks like that style is sold out in the UK, but keep checking the link to see if they restock: https://t.co/7YJDTpmSKt @WrldTde Looks like we aren't producing the Elite Sequalizer Crew Socks at this time. Check out our other crew socks here: https://t.co/g5F3cDrhfe @Vik60421368 Our vote? Never. @KaileyTracy You got it! @KaileyTracy We're here to help! You can turn off notifications for NRC on your iPhone by going to Settings&gt; Notifications&gt; NRC&gt; turn off Allow. 👍 @jackwanstall Welcome back, Jack. What's the goal for next month? @Jawjadawg13 Jeff, we're glad you're loving NTC! Keep up the hard work!💪 @15_caracteresss Hey. Nous ne communiquons pas en avance sur les remises en stock ou les sorties. Le meilleur moyen d'être au courant est de mettre ce produit dans tes favoris avec ton compte Nike : https://t.co/GoE4D4U0U1 @LaDollceVita Hey. Notre service client est actif par téléphone (+33(0)170489073) ou par chat [Lundi au samedi - 9h à 18h]. @unravelledmind_ No word on a restock at this time. We recommend staying tuned to https://t.co/yYv8xSbp4x for the latest. @renz_0311 Welcome to the fam! Be sure to check out his 'Max out HIT' it's a great full body strength workout. 💪 @_Luvlybrielle Great shoe choice, Vicki! 🔥 Stay tuned to https://t.co/YAyy8ze38c for all the latest colors and ones to come! @LordKiante Tech fleece is the best! You have great style! 🙌 @FlyyestCoopEva Not gonna lie, that like made our day 🥰 @kianamoods Zoom\nFreak\n(Real) 1s ☝️ @freshdipped1 We can't wait to see you rock these! 👀 @showmerob 14 years? Time flies when you're running fast! Only 320 miles left to Volt, let's get it! 🏃‍♂️ @mostnotables Okay, we see y'all. 💪 @mostnotables Welcome to the club! What was the first workout? @fmlurn That isn't a style that we produced. You can shop all of our available Air Force 1 models here: https://t.co/clhRguRBhn @kevxcal TBH, same. Welcome to the club. @amit_mavar Sorry for any confusion, Amit. The styles are already discounted. There is no promo code for this sale. @msantucci12 We're unable to authenticate products via the internet or photos. We recommend purchasing directly from authorized Nike retailers, our site, or official Nike Store locations to ensure you receive a genuine Nike product. @ogepercy You don't even need us, great choice! Keep crushing it. 👊 @ogepercy We see those miles adding up, Oge. 👀 You've gotta try out the Infinity Run. Let us know what you think: https://t.co/jgKfucdED0 @shivpagnepapi Hey there! We actually do have a discount for first responders. Check out more info on our site: \n\nhttps://t.co/Bjh1mFjPV0 @Forreee_1 Our bad, Forrest. You can still cop them when they drop on SNKRS. Get notified here: https://t.co/BP2jkE5XRS @LenesLife16 Hey there! Yes, we offer a 20% discount for eligible medical professionals and first responders in the US.\n\nhttps://t.co/4KwvP355tm @serosanguineous Hey Marcus! Yes, we offer a 20% discount for eligible medical professionals and first responders in the US.\n\nhttps://t.co/0G0jfSPv5H Welcome to the family, @sabrina_i20 #justdoit https://t.co/P6Wru0sjca @vmatai Hey Dr. Matai, thank you for everything you and your colleagues are doing! We've currently increased our first responder and medical professional discount to 20% off. To learn more and verify your eligibility, head to our site here: https://t.co/82Qpyv3KWq @AliDignum Hey Ali! These are a custom Airmax 90. Design your pair on our site and flex on all of your friends. 🔥💪 \n\nhttps://t.co/NJre72Is7l @thejamsta They're custom! We made a pair for ya, but they're sold out for today. Check back later tonight to grab your pair. 💪 \n\nhttps://t.co/B3JsPMS1Tf @GMartinez1392 Think it's safe to say that it's time for a new pair. 🤔 https://t.co/u7Zv8PLu9J @p0sitiviti De kortingscode APRIL30 is inderdaad verlopen, echter adviseren we je de nieuwsbrief of Nike app goed in de gaten te houden voor nieuwe promoties. Ben je al NikePlus member? Hiermee ben je direct op de hoogte van onze actuele acties. @appletechnikbl Hi!\nEs freut uns zu hören, dass du deine Bestellung bekommen hast! Wenn es noch Probleme gibt mit der Bestellung,  dann melde dich gerne nochmal bei uns im Kundenservice.\nFrohe Ostern und Liebe Grüße\nDein Nike Team @ItsJoeSports Your new favorite gear? 😉 @Alex__452 We are continuing to pay employees impacted by the temporary closure of our stores. @appletechnikbl Gerne schauen wir uns deine Bestellung einmal an. Kontaktiere uns dafür doch einmal über unseren Kundendienst! Du findest uns über \"Kontakt\" auf unserer Webseite. Wir freuen uns darauf dir weiterhelfen zu können! \nSportlichen Grüße\nDein Nike-Team @breeaaa__ Say less. Use code 'LOGIN25' at checkout. 🤩 https://t.co/FH93cuLeit @appletechnikbl Ja tatsächlich wird es leider aufgrund der aktuellen Situation zu Verzögerungen kommen. Es tut mir leid für die verlängerte Wartezeit. Du kannst uns gerne die Bestellnummer nennen und wir teilen Dir den aktuellen Status mit. Sportliche Grüße - Dein Nike Team https://t.co/klmMF0Q8Tn @soft_twilight Felici di rispondere alla tua domanda. Ti consigliamo di ignorare tutte le comunicazioni rilasciate da pagine non ufficiali come quella in questione. Abbiamo gia' provveduto a segnalare questa pagina al nostro dipartimento, ti ringraziamo per la segnalazione. A presto. @Adrien_CSR Way to get after it, Adrien! See you next Saturday? 💪 @yourstrulydc1 Looking fresh! 😍 @Paladin4Justice We are continuing to pay employees impacted by this temporary closure. To learn more about what Nike is doing, head to our site. https://t.co/JxupAuEcX2 @harryzhang You're not the only one! 🙋‍♂️💨 \"The Story of Air Max: 90 to 2090\" is a film that tells the story of the shoes’ rule-breaking ethos and universal impact on sneaker culture. \n\nWatch now: https://t.co/RaLx2K6jq7 #AirMaxDay https://t.co/dQaU061ilM @BonganiSarah Head to our site to shop availability in your region! @My92Fiv3 Happy early Air Max Day, Issa. 🎉 @ChazFeder Hey Chaz, we will continue to pay employees impacted by this temporary closure. @CoachSteve These look like a perfect match for NTC Premium! Let us know your favorite workout. 💪 https://t.co/EzPoT8WtBU @bintakai Hey Leslie, that's our current plan. For any changes or updates, keep an eye out to our social channels and https://t.co/yYv8xSbp4x. @WesleyWChow Not currently! @Jeevan_Design Hey Jeevan, all Nike purchases made after February 14, 2020, have an extended 60-day return policy. Stay up to date on our policy here: https://t.co/YR5XuCzgpl @JLothian Hey there! Those look like the Flex RN 2017. We don't have this specific style anymore, but we do have a newer similar shoe we think you'll like. Check 'em out:\n\nhttps://t.co/R0mpR61yqJ @LeanneParkin1 No word on a Nike By You version. Stay locked to our site for any updates! @LeanneParkin1 Hey Leanne! These look like a custom AF1 Shadow. Check out our available colors on our site!\n\nhttps://t.co/sslPDkoCSd @TlGERbI00D Good looks! That's the Adapt BB 2.0. We actually have a few sizes left on our site. 👀 \n\nhttps://t.co/nKEb6UvfYY Now more than ever, we are one team. #playinside #playfortheworld https://t.co/LRLhL4FwkG @elaawitanxx We've got just the thing, Ela. Save 25% with code 'NIKE25'.\nhttps://t.co/7YE6Ez20ua @FitFlyFellow It's the little things. Bring it. 💪 @ReyReynaRey It just got even better. NTC Premium is now free! Update your App to unlock all the benefits. 🙌 @tha_mza Update your NTC App for a surprise. 💪 @lazlothebuzz We do. 👀 https://t.co/rd2QfqwgoS @scottlederer Hey Scott, we have 25% off now! Shop here: https://t.co/qkFrjssi1W @stephyyflowers_ No gym needed. Way to get after it, Stephanie! 💪 @flaizeroner Hola Alan, lamentamos lo ocurrido. Tenemos que comentarte que en este caso la recomendación es acudir a un médico especialista puesto que ellos son los que pueden orientar/ayudar en este tipo de incidencias. Un saludo y que nada te detenga 👍. @_MissElizabeth_ It's go time! ⏰ With love, Your Nike Family https://t.co/BgXNwItRRU @SaintTeg Appreciate the shout-out. We're glad Stevie could help you get what you were after! 💖 @andybalquin Great work on getting after your Personal Best and 6-week Streak in one day! @TheAdamMerrill Hey Adam, it's back! 🔥 \n\nhttps://t.co/AaTAb2xBoo @soleguru Ready and waiting. 👀 \n\nhttps://t.co/TPRbODyj8g @sean_es_mi You can always try them out for 30 days and return them for a full refund no-questions-asked if you're a NikePlus member! 👀 \n\nhttps://t.co/cJFsQNJ0op @hawt_choklat Hey Jahmal! These have a daily material limit; check back every afternoon for your chance to cop your creation. 🔥 @jaykobcarvalho Hey Jake! If you prefer a compression-like fit, we'd probably go with a medium. But just know you can try them out for 30 days and return them for a full refund if you don't love the fit. 💪 @HarrisonCao1 Hey Harrison, only select colorways are available for the current promo. Check out one of our favorites that's eligible here: https://t.co/LzD4fAHaKl @Roberto93487633 Siamo qui per te, Roberto. In merito alla tua richiesta ti suggeriamo di contattare il nostro servizio clienti al numero 0238591453, dalle 9:00 alle 18:00, dal Lunedì al Venerdì, o via email tramite il seguente link: https://t.co/XMzQ6ZCFJt] \nA presto. One day, together, we will make this our every day. https://t.co/jpTVQi2LKP @AyItsRK 😅 Let's try this again.\n\nhttps://t.co/Ma6TrJ8KUp @chasityscooper This half has nothing on you! See you at the finish line. 💪🚀 @AyItsRK We'll just leave these here.\n\nhttps://t.co/idr9lF7W7R @gee_0211 We have just the shoe! 😍 https://t.co/wKKT68FeST @SimoneCorradi2 Siamo qui per te Simone. Al momento non è stata annunciata una data di lancio per questi prodotti. Per essere informato al meglio ti suggeriamo di scaricare le nostre app, NIKE app e SNEAKRS app, così riceverai notifiche quando nuovi prodotti saranno disponibili per l’acquisto. @iTweetBanter Happy birthday! We wanted to make sure you're able to celebrate in style. 🥳 🎂 @gabsouzamorim Hey Gabriel! Dropping this month. Sign up to be notified: \n\nhttps://t.co/0B4fWf5OXM @FindTheSneaks Hey there! This is an older version of the Challenger short. We have a newer pair on our site now. 🔥 \n\nhttps://t.co/PvGBHyhzCj @SquattingBears Those aren't a style we produced, but if you're looking for a similar fit and style, check these out:\n\nhttps://t.co/7UAoniiRl5 @kinleygene The stage is set for a comeback! You got this! https://t.co/0BbS6HdmOV @CesarT162 There's nothing like a fresh pair of air. https://t.co/9p49LviOKE Farewell to one of the greatest competitors in the history of the sport. @MariaSharapova https://t.co/6wRpBaB7gx @janiah_edwards We have exactly what you're looking for, Janiah! 😍 https://t.co/1lZPbkvRgy @DraggingAsphalt @nikebaseball Hey James, we dropped some styles this morning. 👀 \n\nhttps://t.co/OgqT5DUsyn Mamba Forever.\n\n(sound on) https://t.co/B2LUIcpRCc @JFM2 9️⃣  1️⃣ 0️⃣  1️⃣ 0️⃣  9️⃣  9️⃣ @StaurosBellagio Hey Stauros, that style released back in 2017 and isn't available anymore. We have a newer style you may like, though!\n\nhttps://t.co/jp2b3OrIfv @burneraccounthi How 'bout the whole fit?\n\nTee: https://t.co/Ngi1AvOta2\n\nShorts: https://t.co/75cKlguvoH @errolpostale We know somewhere!\n\nhttps://t.co/qPbf2ZsAP3 @Robert11453775 No exact date to share. Stay tuned! 👀 @Desertfury90 Welcome to the club! 👊 @RSimoneLoos You'll be breaking records in no time! Keep us updated on your progress. @EckersenEric You're gonna be 𝙘𝙤𝙢𝙛𝙮 comfy! Enjoy the vacay 😎. @demare_banks Head to the link above, we have your size in stock. 🙌 @demare_banks Hey Demare, we no longer make that specific style. With that said, you can't go wrong with the classic Tech Fleece! https://t.co/TIw0Mm8Dkc @youarevalid2 Hey Izzy, we have just the shoe! https://t.co/5UuLDCQMn1 @VanessaAstros Hey Vanessa, that exact style is only available in select regions. With that said, we have the perfect alternative! 🧘‍♀️ https://t.co/kiAznQDET9 @KingCuevas Get ready. 👀 https://t.co/t6c1uD5jSc @m0mlyn 😍🏃‍♀️ @lizette1077 We already do! 🙌 https://t.co/gpAyfO7joN @jmtomichek We have just the shoe, Jessica! The Epic Phantom React Flyknit are lace free; yet provide a snug, sock-like feel. Order them without worry, as a NikePlus member, with free shipping and returns within 30-days of receiving them. 🙌 https://t.co/LKdmBTeCXA @Krystal__Meth We'll just leave this here: https://t.co/OT2IcsJetY @KellyPeranio The freshest kid on the block. Let the adventures begin! 🗺️ @shaville It looks like it's been quite the ride! Definitely time for an upgrade, Scott. https://t.co/T7lk6E4e9a @themummyride Definitely! Keep an eye on https://t.co/HiEG4844Np as summer gets closer. 🛹 @djpremis Good question. That is a part of the Skateboarding collection. Learn more about it here: https://t.co/GDlAIJJUG6 Pictured: 32 reasons to believe anything is possible. #Nike2020 https://t.co/YYHL42pKpH @hotbunz816 Hey Venzie, we can confirm we no longer sell this colorway of the AJ1 Mids. We have these Retro High OGs is a size 6. Check them out here. ⬇️ \n\nhttps://t.co/wqlRTWFRjj NEXT% technology enables athletes to shatter personal boundaries and break records.\n\nNike's newest race-day shoe is designed to improve cushioning and running economy, the crosspoint between sports science and purposeful design. Nike takes a bold step to reimagine solutions for critical environmental problems.\n\nTransforming scrap material from factory floors, the Nike Space Hippie Footwear Collection has earned the brand's lowest carbon print score to date. The Future of Sport is here. #Nike2020 https://t.co/4XVQczylci @MaepaMc Welcome to the club! Good work! @BORuizTweets Hey Daniel, you can redeem up to 10 gift cards per https://t.co/yYv8xSbp4x purchase. Check out our terms here: https://t.co/qptCIzC3HW @ElyseChengery You've got some great taste! Those are 🔥 🔥 @StuartBuckley Hey Stuart -- check out our locator to find the nearest store participating in Reuse-A-Shoe!\n\nhttps://t.co/6zfDwEFeLe @GionCarlo888 That's not what we want! Do you mind sending over a DM with when and where you bought these, and your NikePlus email? https://t.co/klmMF0Q8Tn @DiegoD6195 These are the ACG Moc 3.0. Check them out here. ⬇️ \n\nhttps://t.co/r8YP7gMPKh @AE9941 What a great way to start the week! Thanks for sharing and thanks for being a part of the Nike family. @HenRoc_ No updates to share at this time regarding no name jerseys. Stay tuned to the app. @Cp_747 Thanks for sending over this feedback. We will pass this along to our team. @DreStur1987 Sorry, we have no promos to give at this time. @LLCoolZaye We love it Zaye! Happy Anniversary, and thanks for being a part of the Nike family. @tonyhudginsdc Hi Tony, what size are you after? @Jlhoppe18 No updates to share on the Air Trainer 3 at this time. Stay tuned to SNKRS. ⬇️ \n\nhttps://t.co/qHTCT1XENR @LThomas28 You are amazing Liz! Keep it up. Let us know when you hit that 200! 💪 @Ben_Soup Way to go Ben! Way to get after the new year. Thanks for sharing 💪 @WheeldonCraig Hey Craig! Yes they will work great for grass, and artificial surfaces. @theanonymouscof We do not have a comprehensive list of authorized retailers, but if you would like to send over a specific store we are happy to check for you. Check out our Saudi Arabia site here. ⬇️ \n\nhttps://t.co/IxPxnWTrN0 @theanonymouscof Both of these websites look legit to us. The best way to ensure your Nike items are authentic, is by purchasing directly though us or an authorized retailer. @okaleenuh Hi Ally, this jacket is a player exclusive, and is not available to the public. @ssc2186 Hi Sarah, we'd be happy to help you find something. Can you tell us some more about what you are looking for, and what size? https://t.co/klmMF0Q8Tn @GlennFyvie That's not what we want to hear! Can you tell us some more about where and when you bought them? https://t.co/klmMF0Q8Tn @MtsBaruck Hola, encantados. Aunque nos gustaría agradecer tu interés en nuestra marca tenemos que comentarte que actualmente es Nike quién, a través de un equipo en activo, busca a los atletas/equipos para realizar los exponsors. Un saludo. @schmee_ivee Absolutely. 🔥 @80eddiep Thanks for sharing Eddie! Love the Adrian and Julia on the heels. @brinaldi209 No word on when the Hyper Grapes will be available in men's sizes. Stay tuned to the upcoming tab in SNKRS for now.\n\nhttps://t.co/AxmPcdbTG6 @JamesyJ2 After some digging, we can confirm we have no molded 13s at this time. Check out all of our Jordan cleats here. ⬇️ \n\nhttps://t.co/ajM9ewk1Lk @cooltonm Thank you! We appreciate you Colton! Thanks for being a part of the Nike family. @dsellick No updates to share at this time. Check the upcoming tab in SNKRS. ⬇️ 👀 \n\nhttps://t.co/mBLy63Y7IW @seanpwick Hey Sean, they're great for any distance run and should last you up to 500 miles. Get your pair here: https://t.co/XZYfMKhQjt @JPriest337 No word on a restock at this time. @BurkhartAmy Hey Amy no word on when our Javelin Spikes will be up. Send us a DM, and we can point you in the direction of one of our authorized retailers that currently has them. https://t.co/klmMF0Q8Tn @BopsDLC We are sorry to hear that happened! Do you sending over a DM with when and where the coat was purchased? If it was purchased through us, do you mind sending over your NikePlus email? @sunoshit Thanks for sending over this feedback! We will pass it along.  No word on if there will be a re-release. @freestateron Great work Ryan! Keep it up! Any big races coming up? @sid4j That's not what we want Siddarth! Do you mind sending us a DM with when and where these were purchased? Will you also send along your NikePlus email? @laurelsudeep Thanks for sending over this feedback. We will pass it along to our Product team. @henrikhogstrom2 Hey Henrik, check these out and let us know what you think!\n\nhttps://t.co/00vsyxZQna\n\nhttps://t.co/L3wBsJEyLX\n\nhttps://t.co/4xOzqoMM1Z\n\nhttps://t.co/Ltw0RHtyeg @sctr77 That's not what we want to hear! Can you tell us some more in a DM? When and where was the jacket purchased? @jennwith2n_s Great work Jenn! Excited to see what you can do this month! 👍 @pointlessdrew Sorry Eddie, no updates to share at this time. Keep an eye on the app and website. 👀 @prefactor Hey Greg! Thanks for sending over the feedback. Can you tell us where these shoes were purchased? @Confuscion That shoe is no longer available on our site. We recommend checking out our FlyEase shoe's, as they sound perfect for your nephew! Check them out here: https://t.co/hwFVpwdT9D @TheOGSophiaB Not to worry, you can't go wrong with the Pegasus 36. 🙌 https://t.co/gAEIMRE8V0 @TheOGSophiaB Easy. https://t.co/8Gcm7xp1xc @LoboDwayne 1 down, 11 to go. Keep up the great work! 💪 @ssjkay Let's go then. 👀\n\nhttps://t.co/ulwGHiz4nX \n\nhttps://t.co/a9LrxFM0yA @JoeyCastro_671 Love it Joey! Is there an event you are training for? @kimbobaggins88 That's big time Kim! Thanks for sharing. Sounds like you are going to crush that 10K in May! Don't let up now, just do it 😎 💪 @yourcatuniverse Hey, no word on if we will bring back the Free RNs, but if you liked the feel of the Free RNs, we think you might love one of these. Let us know what you think!\n\nPegasus\nhttps://t.co/GmRQtNwMiA\n\nOdyssey React\nhttps://t.co/hc96jXY4FG\n\nFlex TR 9\nhttps://t.co/2wdJJtdiyG @dbuck_inc Darion your baby boy is adorable! We hire our models through modeling agencies, so we recommend trying to find a local modeling agency near you.  Fingers crossed for you guys! @7011patriots Love it! Thanks for sharing, and thanks for being a part of the Nike family. @WildFaithFul Best of luck in Indian wells Alan! Let us know how you do. Just do it. @AndreC_97 Siamo qui per te. Al momento non è ancora stata annunciata una data di lancio, per essere informato al meglio ti suggeriamo di scaricare la nostra NIKE app, così riceverai notifiche push quando i nuovi prodotti da calcio saranno disponibile per l’acquisto. @Broonland You can do it Raphael! Let us know when you get it! @juliakuijpers We can confirm that this is not a real account of ours. Thank you for bringing this to our attention. @coconutkallan Got you, Kallan!\n\nhttps://t.co/aYoHztvW6p Mamba Forever. https://t.co/wIchSUwFM2 @inluvwitdayoyo First day in the books. ✅ 📚 @swag_junior Wow, that's quite the week! Since you're looking, we do have the perfect shoes for the grill. 🤷‍♂️ https://t.co/77bLGAdWdC @antwerp_runner Welcome to a lifetime of bragging rights! 💪 @DaRealGladine We love it! What's the go to outfit? 🏋️‍♀️ @kennethkyrell We think they're the best. Get yours now.😉 https://t.co/ns7OvAgbDc @MrsHolmes32 Here's to keeping her legacy alive. Keep inspiring those girls to reach their crazy dreams! ⛹️‍♀️ @stefiedrew 💪 💪 @shebmiller Hey, we have a promo code on sale items right now. Enter ALLYOU at checkout and enjoy 20% off clearance items. (Some exclusions apply)\n\nhttps://t.co/UZdAw2FaMV @DARYtheKING We appreciate your interest! We proactively reach out to potential athletes to sponsor and don't accept direct requests. Although we are unable to help, we wish you the best of luck in the future! @iamUFCpd Love it! Looks like a great morning for a run. Keep it up! @Ragnarhusky Great work! Keep it up. @aziractive There's no plan for a release in Canada at this time. Keep an eye out on our site for upcoming releases. https://t.co/JpaDH5M323 @Shaz_iii_daa But you can. 🙌 Get an extra 20% off with code JAN20 now. https://t.co/6rthT2OgZy @JJARBS83 Hey Justin, guess what's back? 👀 \n\nhttps://t.co/Ic2AFX3Y9X @LeBronRingJames Hey there! We directly reach out to people we wish to sponsor. 👍 Nike Foundation and @ObamaFoundation have teamed up to build a new home court in #Chicago.\n\nThe recreation facility at the Obama Presidential Center will empower young people and build community through sports. #JustDoIt https://t.co/gxoVACHU5L https://t.co/6xBAbpnFj1 @RMarcelloJr Burning the pavement up. 🏃‍♀️ 🔥 @CoachHolmes_J Hey Jordan check these out, and let us know what you think. ⬇️ \n\nNike Pro\nhttps://t.co/HbLk4Hk1yX\n\nCrew Nike Sportswear Club\nhttps://t.co/trRKOSvE9U\n\nCollege Dri-FIT Spotlight (Oregon)\nhttps://t.co/oVfzky3rsM\n\nMen's Sweater College Coach (Oregon)\nhttps://t.co/R6n9UhmkL9 @annaeveryday 🎵 Everybody knows the name: Nike Internationalist. 🍻\n\nhttps://t.co/U9EwMQVkmM @gatorcoach8 Hey Ryan, those are player exclusive gloves made specifically for the Florda baseball team. Check out the Mike Trout batting gloves here. ⬇️ \n\nhttps://t.co/ZCAJEDgjn5 @KennectedArtWrx We think your dad is ready. https://t.co/MwRvF0D7nA @USA_Paralympian Hey Erik, no date to share at this time. We'd suggest keeping an eye on our News page for updates! https://t.co/t7FFpjM1PD @monio9 👀 \n\nhttps://t.co/VVcY8tqxEM @monio9 We know plenty. 🤷‍♀️ Try them out worry free as a NikePlus member with our no questions asked, and no shipping costs 30-day return policy. https://t.co/5ySTw3ASyH @souliergui Ready to take on the New Year! 🎉 What's the goal for 2020? @SusanneShartner Hi Susanne, no news to share about the Zoom Pulse at this time. Stay tuned to our feeds and https://t.co/yYv8xSbp4x in your area for any updates! @dommyt_1618 We love 'em too! @ChezLou812 Anytime! 👌 @ChezLou812 Hi Cheryl -- you'll both be happy to know we still make the Pegasus! He also has 30 days to test it out and he's able to return them for a full refund if not satisfied. Check 'em out:\n\nhttps://t.co/01XJ4Llu9C @linzieballard Listen to your ❤️! https://t.co/eqr4an9fBT @lalita8221 You've got good style! We don't have any leather hats at the moment, but check these out for that retro look.  ⬇️ \n\nhttps://t.co/bUixdyrIOj\n\nhttps://t.co/SbHyWPCytO @chrisponder74 Way to get out there in winter weather! New year, new shoes? @robertgormley82 The Infinity Run was available to select members via early access today. Keep an eye out for them to be on the app and our site later this month. 👀 @mh_bowers Hey Mary, we do have some sizes and colors still available! With that said, there's no word on other sizes restocking at this time. Check out whats available here: https://t.co/lpjsQaN53O @georgeowusu2 Stay tuned to your email inbox for updates on your order. If you don't see an update by the end of the week give us a call. Tel: 800.806.6453 (4am-11pm PT, every day) @Chelpac33 Outfit game strong. Good luck in the half-marathon! Let us know how it goes. 🏃‍♀️ 💨 @2009diglennzo Those are the Jordan 4 Retro 'Black/Red' (308497-060). This was a popular style, and have since sold out. Shop all of our AJ4 colorways available here: https://t.co/weIeZ68CO6 @rella2016 Hey Rella! This is the Air Max 270 React. This specific colorway is sold out, but check out another great one on our site:\n\nhttps://t.co/aT8nararte @mltnurmouth That's not a colorway we've produced of the Air Max Plus. You can shop an available style here: https://t.co/WOTE1GfIco @JGJMU20 Hey Jonathan, no word to share about a restock of the Zoom Pulse on our site or in Nike stores. Stay tuned for any updates! https://t.co/yD9dXwOvzO @MauriziozB Ciao, lieti di rispondere, Maurizio. T'invitiamo a contattare la nostra assistenza al numero 02-38591453 munito di numero d'ordine ricevuto alla conferma e ricevuta del ritiro da parte di SDA. @RicksonBovolin Lookin' sharp. 😎 Just a kid from Akron, building a legacy that extends far beyond the basketball court. #JustDoIt https://t.co/kTtmFQGDdi @dowereallylive Nothing to share about the Zoom Pulse becoming available in your area. Keep an eye on https://t.co/yYv8xRTNFX for any potential news! @sahanaj Spinning to the finish line like... https://t.co/ibsQq52s7q @Keystone80435 Shop all the gear now! https://t.co/jLwbdlJjdk @seguraerika Hola Erika, encantados. Al tratarse de un modelo de campañas anteriores ya no se encuentra disponible, de todos modos te dejamos aquí un link con los modelos con tecnología Zoom disponibles. Te esperamos.\nhttps://t.co/XH4es2Jl5c @beccuuhh_ Hi Becca, nothing to share about our authorized retailers carrying the Zoom Pulse. Keep it 🔒 to https://t.co/yYv8xSbp4x for any restock updates! @cNeezy814 They released in unisex sizing and there are still some sizes left. Head to our site to check them out: https://t.co/4UbzVz7Bj6 @welcometobigbro Hey, no word on a restock date, but keep it locked to https://t.co/yYv8xSbp4x for any possible news! @frannrueda !!!!!!! Tiempazo Fran 3´45´´👊👊👊!!!!!!! Y el domingo a volar por esa Málaga bonita 😉👍. Mucha suerte!! @Alfonsiawarrior We hear you, life happens! Re-doing the past week of your training plan isn't currently a feature though. We know you'll crush this week! 💪 @arielle_ship They say stepping in 💩 is good luck. Guess that 🌶️ luck came earlier. 😎 @LRobert420 Hey Robert, there's no plan to restock at this time. Keep it locked to https://t.co/yYv8xSbp4x for updates. @BaseballMurse7 They're dropping on 12.13! Stay locked to our site to grab your pair. 👀 \n\nhttps://t.co/QEuAsFkzVD @itszayyy You'll have your chance to get them on 12.13 at 10 a.m. EST! Get ready to cop on our site. 👨‍⚕️ https://t.co/3CxWYbfi8O @Ctmcgove We've got an update for you, Collin! The Zoom Pulse will be available on 12.13 at 10 a.m. EST. 👨‍⚕️ \n\nGet ready to purchase here: https://t.co/2UPBphHqOe @SamanthDoherty Dreams of fresh Air. 🐶 @KeniaFlo ⬇️ 👀 \nhttps://t.co/1OYSVwpjzm @ChrisAtkins23 Update: the Zoom Pulse shoe will drop 12/13 at 10am ET on the Nike app and website.  ⬇️ \n\nhttps://t.co/WgoFAtPuXE @KeniaFlo Update: the Zoom Pulse shoe will drop 12/13 at 10am ET on the Nike app and website. @JanetMMasters Hey Janet, they're dropping on our site on 12.13. Stay tuned! 👀 \n\nhttps://t.co/inM2u3c8M8 @KeniaFlo Sorry for the confusion. The Doernbecher Zoom Pulses released on the 7th.  The Zoom Pulses are still releasing in a few days from now.  Check out the current selection of the Doernbecher Zoom Pulses here. ⬇️ \n\nhttps://t.co/VlWre8cCJk Launching February 1, 2020, the Nike Victory Swim Collection brings performance innovation to modest swimwear. https://t.co/SjoahQA8Rz @inkedupdrummer Hey Travis, no plans to restock those colorways. Stay locked to our site for a wider release of the Zoom Pulse coming soon! \n\nhttps://t.co/KSIH0fng9T @ChrisAtkins23 Sorry for the confusion. The Doernbecher Zoom Pulses released on the 7th.  The Zoom Pulses are still releasing in a few days from now.  Check out the current selection of the Doernbecher Zoom Pulses here. ⬇️ \n\nhttps://t.co/k3BCKt4SD1 @ashfife8 Hi Ashley, we are sorry, we searched all of our authorized retailers, and we weren't able to find any pairs of this shoe in your daughter's size.  Check out the new Kyrie 6 here, it is also customizable so your daughter can create her own. ⬇️ \n\nhttps://t.co/ZzGQ7kq8hx @OldCriedPants Hey there, coming soon! Sign up to notified when they drop on our site. 🔥 \n\nhttps://t.co/ky7G2w5NMg @sdav08 Hey Steve! Two colorways created with the Doernbecher Freestyle Program released on our site yesterday in limited quantities and have since sold out. A wider release of the shoe is coming to our site later this month; sign up to be notified!\n\nhttps://t.co/xUEVPpSKeS @JessKou We got you! Check out the current selection below. ⬇️ \n\nhttps://t.co/aGp06Cyot2 @yaujess Boo! https://t.co/tqKkJuKMyc @smashley2495 Our Doernbecher collection dropped on our site today and still has some sizes available. Other colorways are scheduled to release later this month. Head to our site to view the collection! https://t.co/1IodXZy05x @mallon_samantha Our Doernbecher collection dropped on our site today and still has some sizes available. Other colorways are scheduled to release later this month. Head to our site to view the collection! https://t.co/YJr9ixPEO8 @amyheybrock They're scheduled to be available later this month. Keep it locked to our site for updates. @SamanthaBilsky6 Our Doernbecher collection dropped on our site today and still has some sizes available. Other colorways are scheduled to release later this month. Head to our site to view the collection! https://t.co/c3ZN0qsuVN @cjamesr62 Our Doernbecher collection dropped on our site and still has some sizes available, while other colorways are releasing later this month. Head to our site to view the collection! https://t.co/nzyBzQ4Fb0 @kingsleyking29 The Doernbecher collection still has some sizes available while other colorways are releasing later this month. Head to our site to see if your size is still available! https://t.co/GgevaFN43l @Kopite1908 The Doernbecher collection still has some sizes available while other colorways are releasing later this month. Head to our site to see if your size is still available! https://t.co/DpuBdMJDNK @thejojophoto There's still some sizes available in our Doernbecher collection that launched today! Check them out here: https://t.co/yGXOTSMBRX @wesleywhamond Cozy season is in full effect. 🔥 ☁️ @angel_alvarez23 No set launch for the entire collection, however, there are 6 colorways of the Zoom Pulse launching today on https://t.co/a8F24puLBS at 8am. As a part of this partnership, all profits will be donated to Doernbecher Hospital. Peek here for more info! 👨‍⚕️\n\nhttps://t.co/TRMlBAQAah @JoyceTivis You are inspiring us Joyce! Best of luck on your surgery. You have our support. @IndoChimps That's not what we want to hear, can you DM us your order number and NikePlus email? @imani_westcoast Hey there! At this time, we don't have a service to donate footwear. We would recommend going to local donation centers in your area. We wish you and your charity the best of luck and admire you supporting your community! @idgafath No word on a restock right now, but we've got some customization options coming soon! Check 'em out: https://t.co/mZI42ZxxYN @JoeyCastro_671 No excuses, only results. Keep stacking up those miles. 💪 @WashingtonDonny Nothing to share currently, Donny. Stay tuned! @David55780246 Working on figuring out which shoes those are.  In the meantime, what size are you and what did you like about these? @Leticia_S_Marin Of course 😎 👍 @OhMyGourde That's not what we like to hear. Can you tell us more about what happened? @_daytoy All black tho? 👀 https://t.co/o0jecgw1nH RT @trvisXX: CACTUS JACK COURT COMING SOON !!\nFROM ME AND @NIKE FOR THE KIDS AND\nTHE CITY !!! ALL FOR HOUSTON #ALLFOR1 https://t.co/1PA7Hhg… @giannafreni Hey Gianna, there's no word on an online restock at this time. With that said, it looks like Nike Lynnfield may have one available in your size. We recommend giving them a call to confirm availability. 781.334.2341 @tapi_b We recommend these SFB 2 Boots! They're a highly durable boot with an internal rock-shield that prevents punctures. Check em' out below and let us know your thoughts. 👇 \n\nhttps://t.co/dNnQaQ9sLP @srbpower Hey Dan! Those are the AF1 LV8 'Day of the Dead' (CT1138-100). They were a popular style when they launched back in October, and are no longer available for purchase in your area. You can find all of our Air Force 1 styles on our site here: https://t.co/osmiUrksPY @DiaRuShHam Being that the shoes were purchased at Champs you will need to reach out to them for your best return policy options. @dramatizei Anytime 😎 🤜 🤛 @DiaRuShHam That's not what we want to hear. Can you tell us some more about what activities you were doing in your shoes, and where you purchased them? @pateman_batrick Of course! 💪 @pateman_batrick Apologies for the confusion, let's have you give us a call here for more info: +44 (0) 2076604453 (8:00–20:00 Monday–Friday and 8:00–17:00 Saturday) @pateman_batrick Hi, to clarify are you trying to purchase a single shoe? Not a pair of shoes? @LaloChacon Bravo Lalo!!! Nos alegra verte siempre sumando km!! Que nada te detenga 👊😉. @ThelmzN No date to share yet! Coming soon. 👀 \n\nhttps://t.co/vMY5hpuc1R @BelichicksHood We found their long-lost twin! Let us know what you think. https://t.co/rcoyw5vPPv @mmRiaaa3 Say no more! We got you 💁: https://t.co/LIUEzikTUh @RichardKing3170 Keep an eye out on our site, so you can grab them! https://t.co/qeWgql0Tgj @Maverick2405 Beautiful 😍 now what other swag do you need to wear with those? ⬇️ \n\nhttps://t.co/dKVBIfDNXf @berrydelicious Anytime Joci 💪 @mckenna__yob Hi Mckenna, we outsource all of our models from modeling agencies.  If someone is interested in doing modeling for us, we suggest they get in contact with a local modeling agency and go from there. @abbieeh87 That's not what we want to hear.  When and where did you purchase the shoes? Can you please send us a picture of the shoes? @ShelGillespie Thanks for the shout out Michelle, always here to help! @kaysay11b Hey Casey, here is our full Nike FlyEase collection! Let us know if this is what you were looking for. 👍\n\nhttps://t.co/u28tX3QWS0 @Phuzakie Currently, that hoodie is only available as a team exclusive. However, here's a similar style to keep you geared for the rest of the season! 🏈 \n\nhttps://t.co/0Ly9oakqu4 @SGhorafi Those are the Off-White x Air Force 1s, originally released in 2017, they are no longer available. Be sure to check out the SNEAKRS app so you never miss out on a launch like these. 👇 \n\nhttps://t.co/bAtS6LxtG6 @JayRimmer10 Hey Jay, the site is experiencing a lot of traffic currently because of the Barry Sanders Air Zoom Jet release.  Our team is working on it and it should be back to normal very soon. @Rodrymcf Whoops thank you, we'll get that passed along to the appropriate team. @shaudxoxo 👀\n\nhttps://t.co/q4p6wUPB0q What carries you can change the game. Who carries you can change the world. #JustDoIt https://t.co/1vuruYb0hj @AJHYPENY Can't go wrong with copping both colorways 💪 @LuDaGreat Thoughts on these 97s? 👀\n\nhttps://t.co/cOvc7Jhach @lilly40294912 That's not what we like to see. Can you let us know where you purchased the shoes from, so we can better discuss possible options for you? @AmandaKeaneTV Hi, Amanda. That's not what we like to hear. DM us where and when you purchased those shoes, and we'll look at your options. If you bought them online, DM us the order number. https://t.co/klmMF0Q8Tn @stephenbrownnnn No news on that re-stock but keep it locked here for the latest releases. \nhttps://t.co/BABPzVc8HZ @stephenbrownnnn Hey, Stephen. We found that those joggers are out of stock, but we found a similar pair for you. Let us know what you think of the Nike Phenom Pants.\nhttps://t.co/eC1yHh0Y2e @Hannah______x Hey Hannah, being a NikePlus member is free. Learn all you need to know on our site and welcome to the family! https://t.co/TewWQ5slny @larryportaro Champions aren't born, they're made. Your journey is proof of this. Let's go for another 3000 miles. 💪 https://t.co/Ei0B7X08jz @chapshots Path of greatness ahead and with a nice view to boot. https://t.co/IWxbA9b4bN @Blessing_TSG We simply provide the tools. The hard work and dedication is all you. Yes...you! https://t.co/eAkQfRZ8qn @HighOctane_Buzz Winter might not be so cold after all. 🔥 @tink_melanin It's on our site! Be sure to share a photo when you cop. 😍 https://t.co/0ahSSLSuyP @naji_aldajani Starting off those FriYAY vibes right. Let's keep it going. https://t.co/czAu7x1FTn @lebolger Four weeks in a row and still going strong. Dare to go for a fifth? https://t.co/3I7l4bJqKq @gbarrett123 No excuses on the path to greatness. 🚀 @Nrozco That fit tho? Sheesh. 🔥 @Joaopedrostan1 It's the purrfect size. 🐱 @vieramirez Victoria, ¿puedes visualizar la carrera en tu actividad del Apple Watch? Un saludo https://t.co/klmMF0Q8Tn @comeonnowhoney Hey Bonnie, they'll be available for $120 USD. Keep it locked to our site for availability and in the meantime, learn more about the shoes here: https://t.co/Kc2kyyoJES @DomanickD The Air Zoom Pulse will be available in December! Read more on our site here: https://t.co/om3uRRgm1v @afarina6 Sounds like the Element 3.0 running top is what you need! https://t.co/N3bODBaYzi @afarina6 Hey Anthony, that looks like an older version of our AeroLayer Running Jacket. Check out a newer one on our site here! https://t.co/ZmIG3lenVd @Sarj007 It's like you never stopped. 💪 @corinpoppet They'll be $120 USD. Learn more about the shoes on our site. 🩺 https://t.co/dP3IFCgK1V @KeenanHaugen They'll be unisex! Be sure to share a pic when you cop your pair in December. Read more here: https://t.co/6wSrTuxAB1 @erecher Hey Eric, stay tuned to https://t.co/yYv8xSbp4x for all upcoming details regarding the Air Zoom Pulse! In the meantime, you can read more about it here: https://t.co/OfOb1D1IJM @_stephencurrie It's the real deal, Stephen. Don't sweat it, you'll have another chance to cop 12.14 at 7a ET. https://t.co/gD9NTALDLq @KSweat6 Those released back in 2017 and aren't on our site anymore, but we've got plenty to keep you dry this winter. ❄️ \n\nhttps://t.co/RRVw26JHGO @astak9 Dit is natuurlijk niet de bedoeling. Hiervoor adviseren wij je rechtstreeks contact op te nemen via de volgende pagina, zodat we je direct verder kunnen assisteren | https://t.co/GCUzEssUSS of op het volgende telefoonnummer: +31207219453 @caseymaeknox Hey Casey, we have some that you may like! Keep it locked to our site as new styles may drop. 🌡️ https://t.co/jcQqlWaXQn @HB_FNBR Let's see 'em take these! https://t.co/fcl03l6twv @vikram94shekhar Let's get it, Vikram! It's never easy, but it's always worth it! https://t.co/WRFULCzt0C @slimxronald 👀\nhttps://t.co/42jDLuXDBi @lau_mcmuffin Hola, ¿podrías enviar un privado especificando tu correo electrónico registrado con nosotros?Quedamos a la espera. Un saludo. https://t.co/klmMF0Q8Tn @johnmlpr30 It may not be called that, but we all know who the Monarch is for. 👨 https://t.co/39GnY0PmB6 @carolaprato Hola Carolina. Para poder revisar tu caso, ¿puedes facilitarnos, mediante un mensaje privado, tu correo electrónico registrado? Te esperamos. https://t.co/klmMF0Q8Tn Winners compete for themselves, heroes do it for much more. #justdoit https://t.co/i1imhOxzgG @lrocks09 Hey Lorna, it reopens 11.14. Let us know what you cop when you go! 🥳 @Bito_Roberto Killing it with on the 3rd time. Are we going for number four? 💪 @LCoelho9 Welcome back, let's get it! 💪 @TnT_Craderrr The Nike SB Dunk Lo \"Night of Mischief\" is exclusively available at local skate shops. Check out our skate shop locator here: https://t.co/fyDf0tdpbs @andyacr The picture is plenty clear for us, Andy. 👀 \n\nhttps://t.co/bgOt0mXquw @Bodnax The Nike SB Dunk Lo \"Night of Mischief\" is exclusively available at local skate shops. Check out our skate shop locator here: https://t.co/6AEQpfGTLd @GageElijah3 Hey Gage, sorry to hear your shoes didn't come as expected. Know that any purchase from us can be returned within 30 days for a full refund. DM us your order number and NikePlus email and we can get started on the process for you. @shanejurgo We've got you covered, Shane. 🙌 https://t.co/LyHke5XHqA @monster_queen16 Those are the NSW Woven Shorts (AR2382). We weren't able to track down that specific colorway, but we do have a few others on our site here: https://t.co/SqCxCfsOko @aedelano The bounce is back! Cop Shox here: https://t.co/wYJtKUkfTp @SpoiledRSbaby Those look like our Nike Free Run+ 3, style code 510643-702. They were released in 2012 and are no longer available on our site. You can check out the new Free Rn here: https://t.co/XRXiHbVQ77 @RiosStepahanie Hi Stepahanie, it looks like the Huarache Run Ultra (819151-011) is no longer available for purchase. Have you checked out the Air Huarache? It has a similar look and feel as the Ultra, and it's available in your size! Check it out: https://t.co/YGDk5WT2as @JJ__757 They're currently set to drop on 10.25. You'll be able to cop here. 💀⬇️ https://t.co/SCSim5Mol2 @EdeX57222676 Let's pull in our friends @nikestore to take a look. 👍 @paulex78 Air 💨 + Force 🖐️ = Fun 😃 @michuabs Our friends over at @nikestore can help you with this. 👍 @Shan_Jones_ We have plenty of non-pink colored shoes available. Go to the link and sort by your favorite color on the left to find em': https://t.co/4btxzHqmY7 @antdwg1967 🧢 ✔️\n👕✔️\n👖✔️\n👟✔️ @DeNovo09 Keep on, keepin on! 💪 @markischarles Adding a personal logo isn't an option at this time, however, you can add text and choose your own unique colors with Nike By You here: https://t.co/TKttykbeMl @markischarles You can never go wrong with the Pegasus 36. It's comfortable, has perforations for cooling and provides a smooth and responsive ride. 🙌https://t.co/DnFZvUJT4G @Strech_1986 Well done, Rick! 10 next week? 👀 @cecilia_jessyka Nothing beats the classics. 😍 @back_up10 Legend from the turf to the street. Welcome to the club! 👌 @CM0042 Look no further. 👊 | https://t.co/IyH3ioOEU7 @bradwipert Hey Brad, no word at this time about those becoming available for purchase. We'd suggest keeping an eye on our site for any updates! | https://t.co/eB2SbgUaC9 @Dylaaan_D Throwback, and it's not even Thursday. ✊\n\nWe passed your suggestion along to our team. @mics346 Rep your city, no matter where you are. 😎 🔥 @Yes_iHoop14 No better way to start your special day than with some frosty new kicks. 😎 Have a good birthday, Kimmy. @wperezm Hola, encantados. Te vamos a dejar un link desde el que te recomendamos contactarnos y de este modo podemos revisar contigo que ha podido ocurrir. Te esperamos. \nhttps://t.co/sfc3L7XsEp @freyanch Time to lace up and make some heads turn. 🔥 🌶️ @Kym_Nichole If it was easy, everybody would do it. Keep pushin' the pace. 👊 Leave them chasing. Again.\n⠀\nLawrence Cherono sprints to the finish in a tight competition on the streets of Chicago. Finishing with a time of 2:05:45, Lawrence is once again second to none. #justdoit #chicagomarathon https://t.co/0wl0GfE0qw @AbbeWright 🐋🐋🐋 @2Kallday13 Why not create your own? https://t.co/f7N5xFjun4 If it hasn’t been done before, it’s yours to claim.\n\nBrigid Kosgei becomes the fastest woman in history to run 26.2 miles with a time of 2:14:04. Congrats on your World Record and second consecutive victory at the Bank of America Chicago Marathon. #justdoit #chicagomarathon https://t.co/7wQYJvCRWx @ilykathyxo Look no further, Katherine. 😏 https://t.co/3CSrj9S6k8 “I run to prove to any human in this universe that there are no limitations.” @EliudKipchoge \n\nA crazy dream come true — Eliud Kipchoge becomes the world’s first to run a marathon in under two hours. #justdoit https://t.co/12mVz1wbpd @Outsideacircus Gone, but never forgotten! Find out more about our Nike Grind program here: https://t.co/WqZKKO8DKY\n\nIf you're looking to upgrade, check out our Pegasus 36 here: https://t.co/nOkRNuE3gA @Acee626 The W of all W's! Congrats 👶. @lopsster Breaking records? No problem. https://t.co/4pJCMGh6sx @shellcain3 We've got you covered, Shelley! Check out our selection of USWNT 4 Star Jerseys ⬇️. If you don't see the size you're looking for, stay tuned for a possible restock.\n\nMen's: https://t.co/RdKAX6IUBP\nWomen's: https://t.co/ddpfsF5baM @drimanphd Hey Iman, let's get you suited up! We have the Air Satin Jacket in Echo Pink available here: https://t.co/UzXfyDLLIL\n\nWe also have the Air Legging in a few other colorways, check em' out here: https://t.co/ZyqTu511vz @garymheffernan Nothing to share as of now, but keep your eyes on our NikeNews page for any updates: https://t.co/kSzJjQdYtf @TomZajaczkowski Your best bet is to work back with the original retailer. If they aren't able to help, our team is ready to help keep your season going at +44 (0) 2076604453 (8:00 - 20:00 Mon - Fri, 8:00 - 17:00 Sat). @SarahBuice Sounds like it's time for a new pair. 🤙 https://t.co/VMdEXtT3YU @Mr_Mouzaoui From start to finish, we'll be along for every step of the way! 🌲👻 @amoreSTEPH While we don't have a cleaning service, check out our cleaning instructions to keep em' fresh and clean. | https://t.co/jhw4cS71Tk @chapshots Serving up some KMs with a view on the side! 🏃‍♂️💨 @JoseEnriqueMP ScAIRy stuff. ☠️ @CervanteSergio It's always better running with friends! 🐶🐶 @SebShawMusic Totally fine by us! @leesmileyman We 👀 you stepping up your game! Way to get after it. 💪 @sharlaforreal Hey Sharla, we have Master Trainers from across the globe. Head on over to the NTC app to learn more: https://t.co/Qxu6kHXYob @RICKMORRIS3 😸 @Bood_FM Great minds think alike. Couple goals. 👟 🔥 @Pdao8 You got this in the 🎒. Let us know how the progress goes, Peter. 💪 @inasuc The motor on those motorcycles doesn't compare to the ones on your feet. Keep burning that rubber. 💪 https://t.co/fl4dWitOeV @omtcrake This much 🔥 should come with a warning: 'Might cause momentary blindness'. 😎 @cynthiaxsarkis Which one can you use to hang around, exercise, sleep and most importantly, is more comfortable? 😉 https://t.co/FgDKOnS1om @ShowtimeShann 👊 @ChadRuffinMD Those are spicy. Be careful not to burn the hardwood floor. 🌶️ 🔥 @arielle_ship We'll see you on the pitch.💙😍 @AE9941 Breaking waves and strong runs. Looks like there's a new Poseidon crashing the water.  🌊 🔱 @GiantSoundLLC Glad to hear you like'em. Keep tearing it up and remember, the skills all you. 💪 😎 @joevankas Getting stronger every week. Nicely done! https://t.co/w3mW3Vvqse @TasMelas That colorway of the Zoom Freak 1 will release at a later date, Tas. Keep an eye out here for the latest updates: https://t.co/8im4emzlG8 @ASassyWomanMEd No better feeling. 💁‍♀️ @kinleygene Setbacks make for the greatest comebacks. Let's get it! 🙌 @DedrickWelch For some it's exercise, for you it's a lifestyle! https://t.co/rIFVoNTp6T @a_aron1100 Bet. @Marnell_good No word on that colorway dropping. We can't guarantee you will posterize anyone, but the Shox BB4 is back in the original Metallic Silver colorway.\n\nhttps://t.co/P4yQgvAVae @D_advantage Wednesday outfit's on point, Sam.  😎 @CashNastyGaming No problem, Cash. Yeet! @desireetornell En este caso te recomendamos escribirnos de vuelta al mismo email y explicarnos cual ha sido la respuesta que la empresa de reparto te dijo y de este modo podemos revisar el caso contigo. Te esperamos. @warrenjwric Way to persevere and push through, James! Good luck with the training. 👍 @CT_fit Now that's what we call a 'treat yo' self' day. 😉 @krististrang The Force is Female. 💪 @homoopinionated You ask, we deliver. Check out those pink Flex Stride 5 lined running shorts below.\n\nhttps://t.co/J9fr8Y24Ql @LadyLondon82 Nothing like an accountability partner. 🤷‍♀️ @Phxrxoh No better time to grab 'em than when they're on sale. 🙌 https://t.co/i6rGc9w1Ah @andyacr That colorway isn't currently available on our site. Keep it locked to the link provided previously for updates on new styles. @andyacr You have a good eye! Get a similar colorway here: https://t.co/3VjLHYy0as @andyacr Hey Andy, the top look's pretty similar to the NikeCourt Challenger top. Get it here: https://t.co/7XTARlly09 @BigTanelly Let's get it Nelly! You crushed that 100th run in style! https://t.co/ST4fPuKsQv @Mr_Miller1 Happy birthday, Kaidyn! Always looking fresh. 😎 @Dfly1990 You cop? @Dfly1990 Right here. https://t.co/FnvT56WHdH @Kassa2x They're still here + on sale. 🙌 https://t.co/3Nfu3R3U92 @vkrysh12 5k tomorrow? 👊 @BlackkingV Smash is an understatement!\n\nHere's a visual representation of your next 5k result. https://t.co/RdJo6mM4vu @rotimi_dada We 👀 you, Rotimi. Way to crush that run! https://t.co/YbZRJXFjF3 @jaklynelisabeth Oh, they work. 🤹‍♀️ Try 'em worry free as a NikePlus member — you have 30 days to return them if we're wrong. https://t.co/FAjAC2zmkv @laurmileys Of course we can... once you purchase them: https://t.co/sv3lNa2lMR @keatonguess Taking the Joyride's to new heights! What's next? 🚀🌑 @SharmaIsland Have your pick, Avinash. 😏 https://t.co/jzMTd6c7Rr @ricardorod5 Una vez borradas de tu historial, tus carreras son irrecuperables. De igual forma vamos a revisar en nuestro sistema e intentar ayudarte. ¿Puedes, por favor, facilitarnos a través de mensaje privado, tu correo electrónico registrado con nosotros? Te esperamos. https://t.co/klmMF17JKV @AaronLutz08 6000 miles and your birthday? We have a lot to celebrate! 🏃‍♂️🎂 @Angelus13AOV Be careful not to leave any burn tracks when walking with that 🔥 😎. @renada_l We're not sure that is does. 😁 @SunilSharmaUK Good tunes to go with that winners' attitude. Keep on crushing those runs. https://t.co/8YOlunvHmv @win_44 5008 miles of sweat, hard work and dedication. Ready to go for another 5000 miles? 💪 https://t.co/f9g0EPut2J @run_lela Happy Birthday Lela! Way to start off your birthday strong! https://t.co/JIh2zQyjz0 @Kasaskeris Shoot your shot! ⛹️‍♀️ \nhttps://t.co/TsGb0OO6DV @Kasaskeris Your canvas awaits. 🎨 \nhttps://t.co/ffjEtFan6p “Your dream starts as a kid. You get older and your aspirations grow, because you believe you can do it.” -@RafaelNadal \n⠀\nRafa wins his 19th major. One shy of tying the all-time record. #justdoit https://t.co/j2f5FDLH4X @joevankas People were eating your dust for brunch today! Get it! https://t.co/viKBRsqxFH @Madeeha_Syed How could you pass it up? 💜 https://t.co/HHo0mmVq2R @amyellemily You're not the only one, Amy. Shop the collection here. 🙌 https://t.co/YnKE8fKwDL @MelissaBuntcake Look no further. | https://t.co/NVhaf643Ke Call her dreams crazy, but history will forever call her champion.\n\nCongrats @Bandreescu_ on your first major title. #justdoit https://t.co/xYNJxQr7Ag @TeamRW_ Freakishly good. See for yourself: https://t.co/FJyn9P6h3N @blucorsa Imagine how they feel on the go. 🏃‍♂️🔮 @JimHoward34 We can see why!🔥🎨 You've got some grails in the background too.👀 @joy_saragosa Welcome to the force!👊🎉😍 “It’s been an honor to be a part of such a great company for the last 18 years. And to know that a building with my name will reside on campus — it’s truly an honor, and I feel truly special.” - @KingJames @Markito_Suave No better time than now. 🤷‍♂️ https://t.co/KU3ZFrLvYC @justrayven Here are the options we currently have, Rae: https://t.co/4ZrJ9Q3jZU @Libbyj2006 Yes indeed, Libby! Please call 800.344.6453 (7a–4p PT, M-F) for more info on our One Shoe Bank program. @KenyattaRooks Hey Kenyatta, it may be sold out, but you can get notified of new drops here. | https://t.co/0c6m1a2ICP @gina_parcesepe 7 years? We couldn't tell!😉 Here's to another 7!🙌 @geminikk Flying through air. ✅\nWalking on Air. ✅ @ClonyDungyXL1 Here to help. Select teams were designed for the Pegasus 36. Shop them here: https://t.co/zq8oWoQAYg @Zuziliciouscake Sweet trainers. 😎\n\nHappy birthday, Frank! @Caitlyn_Brown1 Ask and you shall receive. Do these fit your style?\n\nHat: https://t.co/U8uVKDCaEm\n\nSlides: https://t.co/FenXMJ0GgK @clarry_1 The ball is in your court now. 🏀 https://t.co/Dwthv6vkOb @_BTanner_ Way to go, Ben! What goals are you chasing down next month? 🏅🏃‍♂️ @xxcharlyy We're sold out of the HyperAdapt 1.0, but our next step towards the future is coming real soon. \n\nMeet the Nike Adapt Huarache. https://t.co/3k7gt2A57e @iRUNfarr Anywhere from 300-500 miles, Troy. Let us know how they felt after the first test drive! https://t.co/upHYAmYZVF @bbournival Fresh air is always needed, Brad! @hotscarvey45 Hey Scott, time to feel young again. https://t.co/VEuNMYKFoz @bigblac85 First of many. Welcome to the club, John. 🏕️ @batebr01 You owned that run. Keep going, Bryan! 👊 @actionjaxon666 Hey Shaun, the Adapt BB's released earlier this year. There is no news on a restock at this time, so keep it locked to our site for future updates. @Nakanari It's up now! 🌵 https://t.co/3VEHMNb6My @Selu16GBT Huau, 4´33´´tiempazo José Luis!! No dejes de enseñarnos tu progresión y a por el resto de la semana!!!😉👊 @ChineduOgu Still a good boy. 🐶 @alyssajoye We'll take on the first day together.🍎 Let the adventure begin! 🦄 @Caits_take Hey Caitlin — we know how hard goodbyes are, but let's get you in a pair that you'll love just as much for years to come.\n\nhttps://t.co/oSXKs3R5ow @IRIS18KGOLD We're sorry to hear about your experience. Please give our corporate number a call tomorrow. Tel: 800.344.6453 (7am-4pm PT, M-F) @vanuaryear The bag isn't big enough for a basketball but is perfect for the other essentials. 🙌 https://t.co/eLa1IQHf5y @HopeOrtego Easy flex. 🔥 @kamaumos30 We see why. Keep getting that 🔥, Kam. 👍 @cleeut We'll see you out there one day, Chris. 🏃‍♂️ @Jack03Capu Welcome to the family. 🙌 @VarmaKarma10S Never stop chasing those crazy dreams. 🌠 “I want to make sure that they’re growing up in a world better than the one we are currently living in.” - @KobeBryant \nJoin us at: https://t.co/IgoKWjV5h7 #justdoit #madetoplay https://t.co/aIpSFPAcEs @MarkKLamont Hey Mark, thanks for bringing this to our attention. The prices on our site are current, so we will be sure to alert the appropriate team. @Ant1sdope Welcome to the club! 🏕️ https://t.co/B5jtW6RQKH @franki8701 We're happy to hear your interest for the Nike Adventure Club! At this time, it's only available in the U.S., but we will let our team know there is an interest for availability in other regions. @JadaGomez Can confirm. @JadaGomez Almost forgot the most important part. 😅🔥 https://t.co/r6nVs2Myd3 @HernanSiano Hola Hernan, en este caso @BentonKorth1 We've retired some of our social accounts, so we can better focus on serving customers. For help with all things Nike, be sure to follow @teamnike and hit us up there, or reach out to the store directly for whatever you might need. @JadaGomez Servin' up the heat here. 🎾 https://t.co/QrYUHa4iBi @RoyJonesy Oh geez-louise! Welcome to the club little dude. 🌎 @Dnt_Trip_Crip We're extremely sorry to see that. We recommend only cleaning your shoes by hand, and suggest avoiding using harsh materials. If you need to clean your shoes, warm water and a small amount of material friendly soap should do the trick. @8inarow2togo Let him know that his pals here at Nike have his back. The Air Max design on the tongue is intended to look that way. The \"r\" &amp; \"m\" are connected. More images can be seen below. https://t.co/z3fH30aoQC @geisharu Hola, encantados. ¿Nos podrías decir en qué país te gustaría realizar la compra y revisamos opciones? Un saludo. @JavierCaireta Vaya Javier, lamentamos ver eso. En este caso tienes que volver a la tienda original donde realizaste la compra, en caso que ellos no puedan ayudar solo comentanos. Un saludo. @Rsaint03 We just provided the tools. The work and dedication was all you. https://t.co/T3FPTjEIpO @Billyxswfc Fine. 🍪🍪 @Billyxswfc That's some serious air. 💨 \nHere's your prize. 🍪 @BarneyGumbo Try flipping it, Barney. @amirraphael7 🤝 @amirraphael7 The classics, you say?\n\n⚪👈 or 👉⚫\n\nhttps://t.co/g6xvdmIQWN @TazThornton Hey, Taz. We appreciate the love. Enjoy the Metcons. 👟 @scottschwef Every stride gets you closer to your goal! 🏃‍♂️💨 @AyeTeeMack We got just the shoe for you. 😍 https://t.co/IMh7TzExls @JWLewinstein That won't be a problem with our new sneaker club! Sign up now. 🥳 https://t.co/60N0mMLIGD @RyleyKushing We feel the same way about you! Congrats on hitting 1000+ milestones! 🙌 @naji_aldajani Way to crush that 10K! https://t.co/PzT3MEJg2c @seguraerika Erika, si quieres, puedes enviarnos un mensaje privado y así te ayudamos. https://t.co/klmMF0Q8Tn @BryanStrasberg Show up and put up! Keep grinding, Bryan! 👊 @fork_knife @NikeNYC 👀 🤸‍♀️ 🎢 @LxrdInAGen We were afraid that he'd try to steal our formula. @iRUNfarr Hey Troy, while we don't have that specific style available anymore, we think you'll like the Flex Experience RN 8. Check it out on our site here: https://t.co/RjoG3EtF6i @jimmy415sfc We've retired some of our social accounts, so we can better focus on serving customers. For help with all things Nike, be sure to follow @teamnike and hit us up there for whatever you might need. @aaronclarkcodes Thanks for the heads up, Aaron. We'll pass this info to our team. @jay_brzy Hey Canis, doesn't look like we have this exact one, but don't let that spoil your birthday.\n\nhttps://t.co/NKp8sUqACA @bamardis That Tiger Woods \"Frank\" hat is finally in stock, Andrew.\n\nhttps://t.co/AxUbu8YMqX @timothyrood We didn't forget about ya. 🐯🧢\n\nhttps://t.co/tolZl5Yyv6 @13AHill Need granted? 🐯🧢\n\nhttps://t.co/zz4Y3UmNlP @ATXSunDevil We got you, Seth. The Frank hat just stocked for NikePlus members below.\n\nhttps://t.co/6cfCPOCNNV @shaneodeezy An update on that merch. 🐯🧢\n\nhttps://t.co/u9ie1eECvl @ImDaSh_t Dropped 'em. 🐯🧢\n\nhttps://t.co/juit4Yu6HK @nicolecbo You got it. 🐯🧢\n\nhttps://t.co/ksAcqfEPui @TJSarrell Since you asked nicely. 🐯🧢\n\nhttps://t.co/8A2qrMf0fC @TJThiel For sale. 🐯🧢\n\nhttps://t.co/HopQ5AgIBO @TCRBrad For the rest of us. 🐯🧢\n\nhttps://t.co/RFpfAdqW3B @himynameisbrew We heard you loud and clear. 🐯🧢\n\nhttps://t.co/WD97fwDdBq @Ego_Icarus Hola Julian, encantados de ayudarte. ¿Podrías enviar un mensaje privado especificando tu correo electrónico registrado con nosotros?. Comprobaremos todo en nuestro sistema y ayudaremos en todo lo posible. Te esperamos https://t.co/klmMF0Q8Tn @kenmorepaladino 👀 \n\nhttps://t.co/InzsvhFMqB @abjectboy Rain or no rain, all we see is greatness! 🏃💨 @blacknoy_ https://t.co/Yqhzla6Ek5 @Lexeye Woo! 🧽 @CVegas23 Hey Cee, the Shox BB4 have been delayed with no word on a new release date. Keep it locked to https://t.co/yYv8xSbp4x for updates. @AE9941 The competition is no match for your consistency. Way to get after it! 🏃💨 @yoAloisius Can't have him stealing our secrets. 🤫 @DefVelle Pushing through isn't easy, but rewarding yourself is. 🙌 https://t.co/5OAvoIoyBF @AboyRafael Bravísimo Rafael, tiempazo Nike!! ¿Buscamos bajar de 6,01 a 5,59 en la siguiente salida? 👊😉. @jacepohl Help is here. To kick things off, could you let us know where you're located and which size you're after? @SpartyBlood We know you want one too. https://t.co/kUHLrd4sT2 @ShAnNoN0211 Apologies for any confusion, but that is not affiliated with Nike. @siyendwandwe1 Indeed, that is our official website. Shop our entire lineup of NFL jerseys below.\nhttps://t.co/KQzXQRsAMD @SAkqj Send us a pic when you cross the finish line. 🏁 \n\nhttps://t.co/dsAWNDeqy9 @lildonjai Apologies for any confusion, but that promotion is not affiliated with Nike. @blackdollincc1 That promotion is not affiliated with Nike. Apologies for any confusion.", "bag_of_tweets": ["@SaneleRingane Thanks for reaching out, Sanele! It looks like you restricted who can reply to your tweets, so @NikeService is unable to respond. Let's have you give them a follow, tag them in your next tweet, or send them a DM. They'll be able to assist you further!", "@bishnoikrishan Hey, Krishan! Let's have you follow and reach out to @ NikeService, as they'll be able to assist you. It looks like you restricted who can reply to your tweets, so they're unable to respond. Feel free to tag them in your next tweet or send them a DM. 👍", "@kinleygene Keep showing us what you’re made of, Andrea. Those legs are made for running! 🏃‍♀️💨", "@brithotwife Hey, if you're looking to get this addressed you can direct message ourselves with order details or you can chat or call us on: +442076604453, to talk you through the process. 🤔", "To every mother, everywhere: you are the toughest athlete. https://t.co/9qa88DlkAZ", "@thesundancesyd Happy Birthday, Sydney! Can't wait to run with you. 🎉", "(5/5) Nike, Inc. invested $89.9 million in community impact in fiscal year 2020, and targets an increase to an industry leading 2% investment of prior year pre-tax income to drive community impact the next five years.\n\n#NikeImpactReport https://t.co/DrAErF2mdg https://t.co/N0VgcYGhii", "(4/5) By 2025, Nike, Inc. targets 70% absolute reduction of greenhouse gas emissions in owned or operated facilities and 10x the amount of finished product waste refurbished, recycled or donated.\n\n#NikeImpactReport https://t.co/jmSVHaBIgU https://t.co/iWLl2prNfl", "(3/5) By 2025, Nike, Inc. targets $125 million investment leveling the playing field and a $10 million investment earmarked for Historically Black Colleges and Universities, and Hispanic-Serving Institutions. \n\n#NikeImpactReport https://t.co/6p8I7yZNJ8", "(2/5) Nike, Inc. targets 50% representation of women in global corporate workforce and 50% girl participation in Made to Play community programs by 2025. \n\n#NikeImpactReport https://t.co/BAXTuxD541 https://t.co/bZH4PSnfIP", "(1/5) Today, we are proud to unveil the #NikeImpactReport and 2025 Targets. In the report you will find that we are currently using 100% renewable energy in the US and Canada in our owned or operated facilities. \n\nLearn more at https://t.co/S0QlzY2AMA", "@EMTballers Snuggle buddies are good for the sole. ❤️", "@Charloadr Salut ! Contents de voir que tu sois prêt, cependant, nous n'acceptons pas encore les demandes de sponsor, nous choisissons nos partenaires. Mais ne perd pas espoir, on t'invite à bien rester visible sur les réseaux sociaux, et on te remarquera peut-être un jour 😀 !", "Black women are rarely recognized for the hard work they put in. It’s not just magic, they are the real thing. \n\nJoin us in celebrating their hard work and help level the playing field. #WePlayReal \n\n🎙:@domfishback https://t.co/X7RJvzfBlZ", "@citgooooo Happy to help, Caleb. Can you DM us your Nike Member email address and also let us know which product you're looking to buy? https://t.co/klmMF0Q8Tn", "@MattyBP7 Hi Harland, sorry to hear that. You can direct message us with the codes details to have a look. Sounds like you might mean promotion. Let us know? 💭", "@Its_D_100 Hey, sorry about the issue with adding to cart. We have captured the feedback and passed it along to get addressed. You can call us on: +442076604453, to help place order if needed.", "@CArunagiri Hi Chithra, sorry to hear that. You can call us on: +442076604452, to talk you through the trouble shooting, and get you back on track. 👂", "@KALISFINEST23 Hey Lamar, we can see that you restricted who can reply to this tweet. That doesn't appear to be one of our order numbers. If you placed the order directly through us, send your Nike Member email over to @ NikeService via DM and they'll be able to assist you further.", "@AE9941 Got the Run Club going up on a Tuesday! ✌️", "@mxlczk Hey @mxlczk, nous allons regarder ça ensemble. 👍 Peux-tu venir en DM nous communiquer ton numéro de commande ainsi que le nom, le prénom et l'adresse e-mail liés à la commande ? 😉 https://t.co/klmMF0Q8Tn", "@adamlnz Hi Adam, eligibility for the code would mean having been logged into APP/NRC/NTC no less than 10 days before. If you are app- eligible but not opted in, you still get promo. You can call us on: +442076604453, to talk you through the process and attempt to place. 👌", "@neruaelle Give the phone what it wants. 🙏", "@dmmaher1317 Now those are some dope kicks! Check out a pair we customized for you. 👇 🔥 \n\nhttps://t.co/kpge6Z73Wp", "@blackjack4494 Hi, we can assist you with returning. Returns can be done within 60 days of arrival. Let us know. 🤔", "@JStephs77 We love it! Give him a big high five for us! 🖐️", "@ElGrandeAbdul Hey @ElGrandeAbdul, nous gardons le suspens sur les sorties et les réapprovisionnements à venir 😉. Mais nous t'invitons à garder un œil sur notre site et nos actualités pour ne rien manquer !", "@SandileVezi8 Get after it, Sandile. 💪", "@stevenharageib Early bird gets the worm! We see you crushing it out there, Steven! 💪", "\"One of the greatest things a person can do is inspire others.”\n\nFrom a quiet winner to a vocal champion, the effects of @naomiosaka's transformation can be felt far beyond the tennis court.\n\nCongrats on major title number 4 to the one raising more than her game. https://t.co/2AZMA6fCMW", "Our hearts are with our Asian community. We stand united with our partners to create a more inclusive future.\n\nLearn more: https://t.co/HDGa5BCi2M #StopAsianHate https://t.co/He9UDp0pCY", "@mollrob Hi Moll, sorry to hear that, for security cannot be done over chat, we can help to place over the phone. Here's the number: +442076604453. 📞", "@ALaurirob Look like the 👑 by shopping below.\nhttps://t.co/BFhd6s8ZUd", "@LiamSmith_515 @liamsmith_515 Try clearing your browser's cache and cookies and let us know if that does the trick.", "@LiamSmith_515 @liamsmith_515 We'll take this one. We don't have any info on that at this time. Keep an eye on our feed for updates.  Test response", "@SEASportDiaries @SwingmanBrand Taking 𝘴𝘪𝘨𝘯𝘢𝘵𝘶𝘳𝘦 𝘴𝘯𝘦𝘢𝘬𝘦𝘳 to a whole 'nother level.", "@LiamSmith_515 @liamsmith_515 Try clearing your browser's cache and cookies and let us know if that does the trick.", "@Mwaka_Coco Salut @Mwaka_Coco ! Nous ne communiquons malheureusement pas sur nos futurs approvisionnements. Nous te conseillons donc de garder un œil sur notre site ou de visiter ceux de nos revendeurs autorisés 👍 !", "@augustinesims15 When do these beauties make their big debut? 😍", "@JMHorcher24 Put him in, Coach! ⚾", "@xbabyazul That's odd. Firstly let's have you follow/reach out to @NikeService. They'll be able to assist you. We're seeing you restricted who can reply to your tweets, so they're unable to respond. Let's have you tag them in your next tweet or send them a DM. 👍", "@lovedgoIden Is this the info that you're after... 👀 https://t.co/M2K0nnUB21", "@XxYoungxLeeXx We're loving the new T-shirts, Lee! It's only a crazy dream until you do it. 🙌", "@Lauren_OReilly Hey, Lauren! We don't have any restock info to share, but feel free to DM @NikeService with your size + location, and we'll see what we can find.", "@adele_delbert Hi, apologies about this! Please send us a DM with more details 🙂", "@thebighomieKT Good question! We are working with our athletes and allies to honor MLK day and BHM on-court but will not sell BHM product in 2021. We’ll focus on doing more externally and doing better internally to generate change and create platforms for athletes* to raise their voices.", "@Physio_HJWright Hey Hannah, sorry to hear of the trouble! Could you please DM our friends at NikeService, your Nike Member email and the information you need corrected? They'll be able to assist.", "@sasha_amberxox When do these beauties make their debut? 😍💛", "@Ant_Judge Lace up those trainers, Anthony. We're getting after it today, rain or shine!", "@SurajSodha Hi Suraj, thanks for the heads up. We'll pass along the feedback. It's not that price. 💶", "@xonukababy You can't go wrong with the Sage Low. 🤷‍♀️ https://t.co/djqQMn2XUE", "@sadhotgirI Hi, Can't confirm this yet but keep an eye on the website! 🙂", "@TVTalkerGuy Hi, can't confirm this at the moment. Stay on the look out 🙂", "@Andrey79111630 Send us a picture in the new shirt once it arrives. 😁", "@BAHdeDAH Great question! Those are the 5 states that already have girls Flag Football programs. The voting is to help identify states that don’t have programs underway.", "@winkywink84 Hey there! We are working with our athletes and allies to honor MLK day and BHM on-court but will not sell BHM product in 2021. We’ll focus on doing more externally and doing better internally to generate change and create platforms for athletes* to raise their voices.", "@tunaeP_ Sorry to see that happen. Unfortunately, we do not have replacement/spare lacelocks for that style. If you purchased it on our site, send over your order numbre and we'll explore your options.", "@passion4spas Hi David, you can put Chelsea into search bar on our site. Megastore may also be a good choice, once open. 👌", "@Kieraan93 Hi Kieran, there's no guarantee of restocking as we capture feedback on needed sizes and colours. We're always looking to push forward with new products/materials, normally restocking is within 2-3 weeks. Keep an eye on our site. 👀 🤞", "@Laurence_Kbl Salut @Laurence_Kbl, nous sommes désolés si les Flyknit Chukka ne sont plus disponibles actuellement. Nous gardons le suspens sur les sorties et réapprovisionnements à venir. 😉 Mais nous t'invitons à garder un œil sur notre site et nos actualités pour ne rien manquer ! 🧐", "@ap_bonner You can find all our career postings on our website here: https://t.co/SODFUskdDB", "@ap_bonner Hey, April. We are partnering with our athletes and allies to honor MLK day and BHM on-court but will not sell BHM product in 2021. We’ll focus on doing more externally and doing better internally to generate change and create platforms for athletes* to raise their voices.", "@Project_Man4ger Hey there. Please reach out to our @NikeService handle for further assistance.", "@Big_Dave81 Hey, Dave. We are partnering with our athletes and allies to honor MLK day and BHM on-court but will not sell BHM product in 2021. We’ll focus on doing more externally and doing better internally to generate change and create platforms for athletes* to raise their voices.", "@DavidW3344 Hi David, sorry about this. try closing the app and reopening or try ordering on the website. Contact us if problems persist.", "@Chaitanya99995 Apologies for the confusion. We recommend contacting our team via live chat or email with the link above.", "@jakescherrer That just means you've got style, Jake! 😉 If that's her reaction now, we can't wait to see her face when she sees you in these...... https://t.co/7zAaIpCn5n", "@Chaitanya99995 Hey! You'll need to reach out to our team in your region to get this sorted.\n\nhttps://t.co/wGncrZH1Io", "@jstnthmsn Hi JT, You can chat or call us on: +442076604453 to help look for products, or just capture your feedback. Let us know. 👂 🤔", "@CestTjrMalek Salut @CestTjrMalek, merci pour l'intérêt que tu nous portes. Nous approchons nous-mêmes les agences de mannequinat lorsque nous recherchons des modèles. Pour tenter ta chance, il te faut donc transmettre ton book à une agence puis peut-être seras-tu sélectionné. 😉", "@sausages1974 Hi Henry, appreciate the offer. Hold onto that heat 🔥, real passion piece.", "@bk_lr390 Hey @bk_lr390, n'attends plus ! 😉", "@Jay_Perkins Hi Jay, good choice 😀. Products can go down or up in price, you need to get it when you see it. Currently, there's only student discount on our site.", "@keil144 So sorry to hear that! Did you buy these in store or online? 🙂 If online, you can DM us your order number and we can help you from there 👍", "@10goal14 Hey @10goal14, nous sommes navrés si la paire que tu souhaitais n'est plus disponible. Nous gardons le suspens concernant les sorties à venir et te conseillons de garder un œil sur les Air Jordan 1 dans l'application Nike afin de t'assurer de ne rien louper ! 😉", "@librebenou Hey @librebenou, nous sommes désolés d'apprendre les 5 jours de retard de livraison. Peux-tu venir en DM nous communiquer ton numéro de commande accompagné de ton nom, ton prénom et ton adresse e-mail ? On va regarder ensemble ce qui a pu se passer lors de ta livraison. 😉 https://t.co/klmMF0Q8Tn", "@Feinte_D Hey @Feinte_D, nous sommes désolés d'apprendre que tu rencontres des soucis pour commander sur notre site et notre application. Peux-tu venir en DM nous informer de ce qu'il se passe ? On va regarder ça ensemble. 😉 https://t.co/klmMF0Q8Tn", "@GoodLifeBoss We define this as \"crushing it.\" 🏃‍♂️💨", "@PenBotter We love to see those wins. 🙌 Make sure you show us the fit with the first photoshoot! 📸", "@MarionFlx Hey @MarionFlx, nous sommes désolés que la livraison ne se soit passée comme prévu et qu'il y ait eu autant de retard. Peux-tu venir en DM nous communiquer ton nom, ton prénom et ton adresse e-mail ? Nous allons voir où en est ton remboursement 😉. https://t.co/klmMF0Q8Tn", "@martysneakrs Hey @martysneakrs, nous sommes désolés d'apprendre l'état dans lequel ton colis est arrivé. Il y a dû y avoir un problème de livraison. Peux-tu venir en DM nous communiquer ton numéro de commande ainsi que ton nom, ton prénom et ton adresse e-mail? On va regarder ça ensemble. 😉 https://t.co/klmMF0Q8Tn", "@armellekb Salut Armelle ! Nous sommes désolés de voir que 2 commandes se soient annulées. As-tu contacté notre service client afin qu'un agent regarde la raison de cette annulation ? Si non, viens en DM avec le numéro de commande, ton nom, prénom et e-mail, nous allons regarder cela 😉 ! https://t.co/klmMF0Q8Tn", "@SFribbens Hi Sarah, our team @NikeService can help you out. We're seeing you restricted who can reply to your tweets, so they're unable to respond. Let's have you tag them in your next tweet or send them a DM. 👍", "@FreireManuel_ Hey @FreireManuel_! On est navrés de voir que ta commande soit en retard ! Viens en DM avec le numéro de ta commande, ton nom, prénom et adresse e-mail, nous allons regarder ou se trouve ta commande 👍 ! https://t.co/klmMF0Q8Tn", "@victoriachris_ Hi Victoria, happy to hear you got the heat you ordered 🔥, let us know if you need something else. 👍", "@J60931656 Hi J, great choice cannot find that specific jacket  but here's a link to the jackets we do have in blue: https://t.co/oqMA2ioCvA. 👀", "@davevsworld Hi Davey, Trouble shooting would be different device/browser or clearing cookie/cache. You can chat or call us on: +442076604453, to talk you through the process or attempt to assist with placing. 👌", "@EmmiMaryann Hi Maryann, You can chat or call us on: +442076604453, to talk you through the processes and further assist, if you need help. 👍 Let us know.", "@maximebesse Hey Maxime, viens en DM en expliquant le problème que tu rencontres. S'il est relatif à une de tes commandes, partage nous aussi le numéro de celle-ci, ton nom, prénom ainsi que ton adresse e-mail, nous allons regarder ça avec toi 👍 ! https://t.co/klmMF0Q8Tn", "@Bala47858991 Hey, Bala. Please DM us @NikeService with your Nike Member email, and we'll look into this further.", "@tomamrn Hi, apologies about this. Send us a DM with more details on order and we will look into this for you 🙂", "@Adzmillions Hi, sorry to hear this. are you still having difficulties using the app?", "@YNNCH Hey @YNNCH, nous sommes désolés d'apprendre les déchirures sur tes Pegasus Turbo 2, peux-tu venir en DM nous communiquer ton numéro de commande, ton nom et ton prénom ainsi que ton adresse e-mail? On va regarder tout ça ensemble 😉 https://t.co/klmMF0Q8Tn", "@awthentik Tomorrow's the big day. What's the final design looking like? 👀", "@shuusaku82 Hey @shuusaku82 ! Nous ne communiquons pas sur les dates de sorties de nos articles. On te conseille de garder un oeil sur l'application SNKRS 👍!", "@MikeSpadafino We're glad you reached out, Mike! For privacy reasons, please delete your original tweet and meet us in the DMs below. Pass along your Nike Member email and this screenshot as well. We'll assist you here! 👇 https://t.co/klmMF0Q8Tn", "@SIOBHAN75 Hello, Siobhan! Our team wasn't able to track down your order via the order number you attached? For privacy reasons, let's have you delete you original message and meet us in the DMs below. Please pass along your Nike Member email as well. We'll assist you there! 👇 https://t.co/klmMF0Q8Tn", "@SayenDz13 Hey @SayenDz13 , malheureusement on ne peut pas recontacter les agents mais ce n'est pas grave. Viens en DM avec le numéro de la commande, ton e-mail et une confirmation de ton nom prénom, on va voir ce qu'on peut faire pour toi ! 👍 😀", "@ZauceGod Hey @ZauceGod, viens en DM avec le numéro de ta commande, ton nom, prénom et e-mail si tu as acheté ta paire sur notre site ou avec ton ticket de caisse si tu les as achetées en magasin, on va regarder ce que l'on peut faire pour toi ! https://t.co/klmMF0Q8Tn", "@dylan_vmt Salut @dylan_vmt ! Tout d'abord toutes nos félicitations pour ton titre de champion de France sur 100m ! Nous te remercions pour l'intérêt que tu nous portes, et nous pouvons seulement te conseiller de rester actif sur les réseaux sociaux, on te sélectionnera peut-être un jour !", "@angellee_vcn Hey @angellee_vcn ! Les appels à notre service client sont gratuits 💥! Tu trouveras le numéro de support en fonction de ta demande en suivant ce lien : https://t.co/MRhKSFm6y4. 😀", "@BaldwinPainting Hey, Jeff. We're sorry that happened. Please DM our NikeStore Twitter page with where you purchased your pair. We'll take a look into your options.", "@mrnastygrenades No news to share at this time, please keep it locked to https://t.co/yYv8xSbp4x and SNKRS for all the latest info and release news! ⬇️ \nhttps://t.co/N3VEl14qSp", "Knowing what to do is one thing, knowing why you do it is everything. What’s your why?\n\nJoin us for guidance to reach your goals: https://t.co/htrnwt6ryz https://t.co/kh33Pzgzl0", "@AlbertoRomeroBe ¡Hola, Alberto! Será un gusto ayudarte. Por favor contáctanos a través de este enlace: https://t.co/KFISeava1Z así revisamos las posibilidades de cambio existentes. Cualquier otra cosa, no dudes en avisarnos. ¡Felices fiestas!", "@MasumJamil Hi Jamil, please reference; 22731240. You can chat or call us on: +442076604453, to talk you through the process and the ongoing refund.", "@Littlesassou Salut @Littlesassou, nous sommes désolés que l'article ne te convienne pas. Pour ce qui est des retours en boutiques Nike nous t'invitons à contacter le magasin en question car il peut y avoir des politiques de retour différentes entre chaque magasin. 😉", "@dimehh213 Salut @dimehh213, nous travaillons tous les jours sur les sorties et les réapprovisionnements de nos produits et nous t'invitons à garder un œil sur notre site et nos actualités pour ne rien manquer et trouver ton bonheur ! 🧐", "@AlexisPrimetime Hey @AlexisPrimetime, nous sommes désolés pour toi mais ne perd pas espoir, nous avons hâte de voir ta réaction quand tu gagneras ! 💥", "@gaellesds Hey @gaellesds, on va regarder ça ensemble 😉. Peux-tu venir en DM nous communiquer ton nom, ton prénom ainsi que ton numéro de commande et ton adresse e-mail s'il te plaît ? https://t.co/klmMF0Q8Tn", "@allersalam Hey @allersalam, on aime beaucoup cette collection mais nous gardons le suspens sur les prochaines sorties 🤐. Reste attentif pour ne rien manquer 😉!", "@kantguardme Right back at ya, friend. ❤️", "@Gaipadinspi3 Hey @Gaipadinspi3 ! Ça dépend des magasins, nous te conseillons de les appeler avant 📱 car ils ne sont pas obligés d'accepter un retour d'article acheté sur notre site 👍 !", "@thaaiislvs Salut @thaaiislvs ! Nous sommes navrés du défaut de tes Mid 77'. Viens en DM avec ton numéro de commande, e-mail, nom et prénom si tu les as acheté sur notre site ou avec le ticket de caisse si tu les as acheté en magasin, nous allons voir ce que nous pouvons faire pour toi 😉 ! https://t.co/klmMF0Q8Tn", "@MarckFfrela ¡Hola! Vamos a revisar el estado de tu reembolso ya mismo. Por favor, envíanos tu e-mail y número de pedido por MD. ¡Gracias! https://t.co/klmMF0Q8Tn", "@di2pra Hey @di2pra, nous sommes navrés de voir que tu n'aies toujours pas reçu ta commande. Quand as-tu retourné ton colis retour ? Viens en DM avec le numéro de celle-ci, ton adresse e-mail et ton nom prénom, nous allons regardez cela pour toi 😀 ! https://t.co/klmMF0Q8Tn", "@Gaipadinspi3 Hey, on est navré d'entendre que ta livraison ne se soit pas passée comme prévue. Viens en DM avec le numéro de la commande, ton e-mail et une confirmation de ton nom prénom, on va voir ce qu'on peut faire pour toi ! 😀", "@AdhamAqil4 We are not able to verify authenticity through this channel. The best way to ensure that you're buying genuine products, is to order directly from https://t.co/yYv8xSbp4x, or from any of our authorized retailers to guarantee you're getting authentic Nike product.", "@ThoCros Hey @ThoCros  , nous sommes désolés d'entendre le problème que tu rencontres et de ton expérience avec notre équipe. Voici un lien où tu peux trouver des informations utiles pour tes Nike Adapt : https://t.co/Pu62We8YaU 😀", "@snake7613 Hey, on est navré d'entendre que ta livraison ne se soit pas passée comme prévu. Viens en DM avec le numéro de la commande, ton e-mail et une confirmation de ton nom prénom, on va voir ce qu'on peut faire pour toi ! 😀", "@LKiz23 Hi Ikxxiii, thank you very much for your interest in our products. However, I hope you understand that Nike does not currently accept requests for donations. Let us know if you need something else. 👌", "@lye4 Hey, on est navré d'entendre que ta livraison ne se soit pas passée comme prévu. Viens en DM avec le numéro de la commande, ton e-mail et une confirmation de ton nom prénom, on va voir ce qu'on peut faire pour toi ! 😀", "@SimplyKelsss Hi, Size 6 was the first to go. Really popular. 😀", "@erikhughes20 It's all downhill from here. 💪", "@lilashee1 We love your passion and completely understand where you are coming from. Our best recommendation to increase your chances for future drops is to stay active on our apps, engage through social media, and be sure to have your profile fully up to date. We're rooting for you! 🙏", "@xcen_a So are we. ❤️", "@ZZFrero Hey @ZZFrero , on est navré que ta paire de chaussures ne te convienne pas. Viens en DM avec ta preuve d'achat, ton email et une confirmation de ton nom prenom, on va voir ce qu'on peut faire pour toi ! 😀", "@lae_kl Hey @lae_kl c'est un très bon retour, nous le prenons en compte et qui sait, nous sortirons peut-être bientôt cette ligne de vêtement \"Tall\" pour femme ! 😀", "@NotoriousMarco Hi Marco, here's the information on release through SNKRS APP for Italy Air Jordan 1 Dark Mocha €159.99 Available on 19/12 at 8:00 am. Here's a link to our page: https://t.co/tfkFcha2Si. 👍", "@la_bim Salut ! Nous ne communiquons pas sur les réapprovisionnements de nos produits, nous gardons le suspens ! On t'invite à regarder notre site de temps en temps ou nos revendeurs officiels 👍 !", "@jillrooney15 We'll get this sorted for you, Jill. Please delete the message with your order number to protect your privacy. Head over to @NikeService, and send us a DM with your email and order number.", "@r_royalty 💪 💪 💪", "@r_royalty They're back. Act quickly:\n\nhttps://t.co/rHM2jX0OJa", "@jillrooney15 We're sorry to hear this, Jill. We suggest contacting the courier and requesting another attempt at delivering your partial. In the meantime, please contact our team by phone at your earliest convenience, and we'll assist you there! 👇 \nhttps://t.co/Kd9Z2poBVd", "@NmkEnV Hey @NmkEnV, merci beaucoup de l'intérêt que tu nous portes 👍 ! Cependant, pour le moment, nous approchons nous-mêmes les partenaires qui nous intéressent. Nous te souhaitons plein de réussite 😉 .", "@jillrooney15 Not to worry, Jill -- we're here to help! Meet our Nike Service team in the DMs with your Nike Member email and order confirmation number. We'll assist you there! 👇", "@KateAmeliaReed Hi, very sorry to hear this. Did you purchase this online? Send us more details via DM if you can", "@Tanguy6Tricoire Hey @Tanguy6Tricoire, nous sommes désolés si tu rencontres des soucis pour appliquer ton code promo étudiant. N'hésite pas à lire les conditions générales https://t.co/Nqj3zDovR2 et à revenir vers nous en DM en nous communiquant ton adresse e-mail si ça ne fonctionne pas. 😉 https://t.co/klmMF0Q8Tn", "@Jerry_K 100 completed workouts?! 🤯 You're crushing it, Jerry! 💪", "@KingJames 🙌🔥👑", "@Floregereau @Floregereau Ce sont les paires SNKRS qui choisissent leurs propriétaires 😜 Bonne chance à toi ! ⚡", "@kiki_limited @kiki_limited Il y a plus de 160 gammes de paire de chaussure disponibles en 36 sur le site, n'hésite pas à fouiller  --&gt; https://t.co/sWqkOMqkNQ. On prend note de ton retour d'information sur la collab 😉.", "@Hopelessisfun Joyeux anniverssaire @Hopelessisfun 🎉 ! Peux-tu venir en DM nous communiquer ton adresse e-mail? On va voir ce qu'on peut faire pour le code birthday 😉. https://t.co/klmMF0Q8Tn", "@Anasse_drs Hey @Anasse_drs, tu as raison... tes nouveaux gants sont trop gang ⚡ !", "@Floregereau Salut Flo, nous sommes ravis que les prochaines Sacai VaporWaffle te plaisent 👍 ! Rendez-vous Jeudi à 9h00 💥 !", "@marandeloo Salut @marandeloo, on garde le suspens sur les sorties et les réapprovisionnements à venir mais nous t'invitons à garder un oeil sur notre site et nos actualités pour ne rien manquer 😉 !", "@carbone23yt Hey @carbone23yt, rendez-vous le 19 Décembre ! Bonne chance à toi 😉 !", "@kiki_limited Salut @kiki_limited, nous comprenons ta demande, nos paires pour hommes vont de la taille 35.5 à 52.5 👍. Cela dépends des produits et des stocks disponibles, on espère que tu trouveras ton bonheur !", "@fiftee943 Hey @fiftee943, nous sommes désolés que ton survêtement ne sois plus disponible en L. Malheureusement, nous ne communiquons pas sur les sorties et les réapprovisionnements à venir mais nous t'invitons à garder un oeil sur notre site et nos actualités pour ne rien manquer 😉 !", "@yasbylkaa Hey @yasbylkaa, nous sommes désolés mais la pointure 39.5 n'est pas disponible. Nous t'invitons à essayer en 40 et si la chaussure ne te vas pas, tu pourras toujours faire un retour et être remboursé 😉.", "@Bent_Elbow We're checking our list. 🔍", "@adamwelch84 Hi, send us a DM with this issue please 🙁", "@JenLikesUK She's rocking the Air Tech Challenge 2! Did we do that? 🤓", "@kingchenks Hi, we're sorry to see that you are experiencing a problem with your order. Send us a private message with the order number, your email, your name and surname and describe the problem, we will look into it with you! 🙂", "@rbn_gmzz What matters is that you got out there and ran today. Way to work! 💪", "@soriba_svn Salut @soriba_svn, nous sommes désolés que tu aies des problèmes sur le site, peux-tu venir en DM nous expliquer en détails les soucis que tu rencontres ? On va gérer ça ensemble 😉 https://t.co/klmMF0Q8Tn", "@moonalysun Salut @moonalysun, nous sommes désolés d'apprendre l'annulation de ta paire de Nike Blazer Mid '77 en 38.5, peux-tu venir en DM et nous indiquer ton numéro de commande, ton adresse e-mail, ton nom et ton prénom? On va regarder tout ça ensemble 😉 ! https://t.co/klmMF0Q8Tn", "@abs_olute1 Hi, you can direct message us with the order number, also can you please verify the full name on the order, and the email address please to get this addressed.", "@Batesyk7 Hi Jonathan, we try to stop that very same issue with raffles and draws. We are more than happy to capture your feedback.", "@bootylisab Hi Lisa, keep up the great work. 🏃‍♀️", "@MrsCheeks91 Hi Corina, You can chat or call us on: +442076604453, to talk you through the process, and see what was organized, when you contacted us.", "@itskatherine888 Hi Katherine, there's no guarantee of the restocking of the shoes. We take all feedback to help with products moving. So keep an eye our site. 👀", "@MsB1983 Happy Birthday, Fallon! 🎉 It's what we do, don't mention it. 😉", "@ninacharissexo Getting stronger never goes out of style. Here's to many more years! https://t.co/QSPDgaBqgd", "@jxavss We will have a global launch for the NOCTA collection on December 18. Visit https://t.co/cWSv8Q2eh2 more. 👊", "@Mr_Satter Hi, Sorry to hear that, we can assist with stock on the product. You can direct message us the orders details to look, can we please have the order number, also can you please verify the full name on the order, and the email address please.", "@hervertsillo We'll do our best. To start, where are you located and what size are you after?", "@AdamKelly283 Hi Adam, you can direct message us to try to assist further, for the query on parcel.", "@Grumpy_Noo Hey @Grumpy_Noo , as-tu bien reçu l'e-mail t'annonçant ta réduction ? Viens en DM en nous donnant ton adresse e-mail, ton nom, prénom et ta date de naissance on va regarder ça ensemble ! 😉", "@RemiLthl Salut Rémi ! Nous sommes ravis que tu sois satisfait de nos délais de livraison ⚡ ! On te souhaite une bonne journée !", "@AnaisGlb Hey @AnaisGlb, un grand merci de toute l'équipe pour ton commentaire 💕, nos agents font leur maximum pour vous aider ! 👍", "@OVANASIL ¡Hola de nuevo! ¡Puedes borrar el email con tu correo electrónico y mandármelo por privado? Saludos.", "@OVANASIL ¡Hola Silvia! ¿me puedes mandar un DM con tu dirección de correo electrónico? Así podemos ver tu pedido y tramitar lo oportuno. Saludos.", "@AlbeerBeto ¡Hola Alberto! ¿me puedes  pasar por DM tu correo electrónico y ver qué es lo que pasa con tu pedido?\nSaludos", "@JackieAbiKhalil Hey Jackie! First, we recommend deleting the message with your order number as it is linked to private information. Can you send us a DM over at @NikeService with your Nike Member email and that order number? We'll meet you there!", "@tom333x2 Hey @tom333x2, nous sommes navrés pour toi, mais le rayon est bien de 10KM ! Nous prenons cependant ton retour en compte, et qui sait, nous étendrons peut-être le rayon !", "@andrewsneill Hi Andrew, seems to be a communication error. Trouble shooting would be different device/browser or clearing cookie/cache. Let us know if this persists.", "@HelloHi12538623 Hey @HelloHi12538623, au moment où tu passes commande, une demande d'autorisation de prélèvement est faite auprès de ta banque, et le montant est mis de côté. Il est ensuite prélevé à l'expédition de ta commande. Vérifies tes comptes, la 1ère demande devrait disparaître !", "@adamwelch84 Ok. 👌", "@adamwelch84 Hi Adam, be ready to take any organized call.", "@linglingmany Hey @linglingmany, viens en DM avec le numéro de ta commande, ton adresse e-mail et ton nom et prénom, nous allons regarder ça ensemble ! https://t.co/klmMF0Q8Tn", "@HribanV Nous ne pourrons malheureusement rien faire pour toi sur ce site, de plus, Stock X n'est pas un revendeur officiel.", "@HribanV Salut @HribanV, ta commande a en effet été remboursée car le transporteur n'a pas réussi à la livrer. Nous sommes navrés et nous comprenons ta déception, nous ne pouvons cependant pas livrer ta commande à nouveau.", "@izaigs Hi Izabela, JD is authorized retailer. We cannot see their systems so you would need to contact the company of transaction, to get an update. 👍", "@nikki_barrs Hey Nikki, so sorry to hear this. While we don't have an email to share, please contact our team using the link below, and we'll do our best to help.\n\n https://t.co/IbBglcEsSc", "@flashLight_rv Hi, you can direct message us with order details. Can we please have the order number, also can you please verify the full name on the order, and the email address please.", "@MKY3737 Hi Mikey, you can chat or call us on: +442076604453, to look into the claim for yourself. Please let us know. 👌", "@Johann_Onyszko Hey @Johann_Onyszko, si tu n'as pas reçu d'e-mail de confirmation, c'est que nous n'avons pas pu vérifier tes informations avec ta banque lorsque nous avons demandé l'autorisation de prélèvement. N'hésite pas à vérifier tes informations de facturation !", "@seagullswim Hi,\n\nVery sorry about this. please send us a DM with the order number, your name and email address.\nThank you", "@Liv_maeXX Hello, Olivia! 👋 How can we help you today?", "@maccaboy657 ☕🤩", "@NancyHayward10 The purrfect pair. 🐱", "@Empiretiling Hi, Apologies for the inconvenience. Please send us a DM with your email address and name.", "@Condorito_AR Buenos días, ¿nos puedes enviar un mensaje privado con tu dirección de correo y número de pedido? Así podemos localizar tu pedido. Saludos", "@juanton316 If it's meant to be, it will always find a way. 🔮", "@ayam_yow_fazer Hey @ayam_yow_fazer, nous ne livrons pas encore aux Antilles, mais nous t'invitons à faire un tour sur les sites de nos revendeurs officiels !", "@JayBeackz We hope so 🤞, we always gather the feedback to help towards colours and sizes materials, to help to improve products and services.", "@Gpasdefollower Salut @Gpasdefollower, nous sommes navrés de voir le problème que tu rencontres sur ton application. Essaie de commander depuis un ordinateur, cela devrait fonctionner. Sinon, n'hésite pas à contacter notre service client en suivant ce lien https://t.co/vZDAw3uWNm.", "@XavierLafeuille Hey @XavierLafeuille, les chaussures personnalisées sont en effet exclues de la promotion anniversaire.", "@mona_rahimpour Hope it's as crisp as our latest kicks. 😉", "@TheFourDragons 😍😍", "@bootylisab Whatever it takes. Blue isn't ready. 💪", "@Justin32294 Let's take a closer look, Justin. Please DM us at @NikeService with your email and what you're attempting to purchase, and we'll go from there.", "@lukasdebret1 Salut @lukasdebret1, nous te remercions pour l'intérêt que tu portes à notre marque, et nous t'invitons à rester actif sur les réseaux sociaux afin que nous te remarquions car nous n'acceptons pas encore les demandes de sponsorisation. Bonne chance !", "@Dimkun12 Salut @Dimkun12, envoie ton numéro de commande, adresse e-mail et nom prénom en DM pour qu'on regarde cela ensemble. https://t.co/klmMF0Q8Tn", "@Mil0uzz Hey @Mil0uzz, nous ne donnons pas d'information sur nos réapprovisionnements, mais garde un œil sur notre site voir si les Blazer Low reviennent en personnalisables ! 📱", "@christinaHRltd Happy birthday, Christina! 🎉 No better way to kick off your birthday than by putting some kilometres on those beauties.", "@Ismaeel_AJ Hi Ismaeel, you can direct message us with order number, also can you please verify the full name on the order, and the email address please, for security.", "@whotfdis2 Hi, we'll take your feedback and pass that along, as it helps us move forward as a company. 👍", "@_xDGee You can contact us on direct message, chat or call: +44207 660 4453. So we can discuss the issue with the cancellations.", "@Yassine_mrg Hey @Yassine_mrg, viens en DM en envoyant le numéro de ta commande, ainsi que ton adresse e-mail, ton nom et ton prénom, nous allons regarder ça ensemble. https://t.co/klmMF0Q8Tn", "@Letervis Dans ce cas, contacte notre service client en suivant ce lien : https://t.co/xZHtEnRWDz.", "@bulla_scrunchie We understand that you're still awaiting update from the team who are dealing with it, from official Gift card issuer. Let us know what they say, via direct message.", "@talibhane Hey @talibhane, fais bien opposition auprès de ta banque, afin qu'elle puisse te rembourser de ces sommes, et ensuite contacte notre service client afin que nous puissions t'aider : https://t.co/gPwcOW0jje.", "@tentete1234 弊社カスタマーサービスまで状況をお知らせ頂けないでしょうか。ご利用環境等詳細をお伺いし引き続きサポートします。こちらのページをご活用いただけますとと幸いです:https://t.co/c5hTusUsMw", "@bulla_scrunchie Hi, sorry you feel that way. We can see they're trying to assist, and have asked you to reach out to the original supplier of Gift Card for assistance if possible. Please let us know if you have already done so. call or chat on: tel:+442076604453.", "@WesVernon No pain no gain, right?", "@She_Hate_Me23 Hey Sha! Pass us a DM at @NikeService with info on where and when you purchased your shoes. We'll be happy to help there.", "@dwkern01 We'll do our best to help, David! Please DM us over at @nikestore with where you're located and what specific size you're after.", "@Luis_EnriqueRdz Hola Luis Enrique, te recomeindo que hagas la compra por PC para que no pierdas más artículos, no sé que pudo pasar con la App pero para las próximas ocasiones que tengas el mismo problema te recomiendo que hagas la compra por PC. Saludos", "@earom05 ¡Hola Eduardo! ¿nos puedes enviar un mensaje privado con tu correo electrónico y tu número de pedido? Así podremos ver qué es lo que te pasa. Saludos", "@Tricepsgod Hey @Tricepsgod nous n'avons malheureusement pas de flocages officiels pour les maillots de la Norvège.", "@100drineLP Pas de soucis, il faut que tu nous suives pour pouvoir nous écrire en DM.", "@100drineLP Hey @100drineLP, nous sommes désolés de lire le problème que tu rencontres avec tes Jordan. Viens en DM avec ton adresse e-mail et la preuve d'achat de ta paire, nous allons voir cela ensemble. https://t.co/klmMF0Q8Tn", "@Mamgory Voici le lien pour nous DM. https://t.co/klmMF0Q8Tn", "@Mamgory Salut @Mamgory, viens en DM avec ton adresse e-mail et une capture écran du message d'erreur s'il te plaît.", "@mirsah Hey @mirsah, peux-tu nous envoyer une capture écran du message d'erreur ainsi que ton adresse e-mail en DM ? https://t.co/klmMF0Q8Tn", "@No_Lasagna Salut @No_Lasagna, peux-tu nous envoyer une capture écran du message d'erreur en DM ainsi que ton adresse e-mail ? https://t.co/klmMF0Q8Tn", "@sabthecool Salut @sabthecool, viens en DM avec ton adresse e-mail et une capture écran du problème s'il te plaît. https://t.co/klmMF0Q8Tn", "@IziSilver Voilà le lien pour le DM. https://t.co/klmMF0Q8Tn", "@IziSilver Hey @IziSilver, tu peux venir en DM avec ton adresse e-mail s'il te plaît ?", "@whyimsodumb Hey @whyimsodumb, peux-tu venir en DM et nous donner ton adresse e-mail ? https://t.co/klmMF0Q8Tn", "@cjayamsterdam We can confirm that the Air Max game has no age restrictions. ⛲", "@XavierEN2 En ese caso tendrás que seguir nuestra página. Saludos", "@Official_Bailin Hello! We're sorry to hear your experiencing issues on https://t.co/yYv8xSbp4x. We've responded to your DM request, and we'll continue the conversation there! 👍", "@https_phora Hi,\n\nPlease call in, and we can help troubleshoot +442076604453", "@CClemzz Hey @CClemzz, ne t'inquiète pas, nous allons regarder ça ensemble. Envoie nous en DM le numéro de ta commande, l'adresse e-mail et ton nom, nous allons voir ou en est ta commande. https://t.co/klmMF0Q8Tn", "@XavierEN2 ¡Hola! ¿me puedes enviar por DM tu dirección de correo electrónico?\nSaludos", "@lisainog Preseason is starting early. 👀", "@Guazu91 ¡Hola Guadalupe! ¿me puedes enviar un DM con tu correo electrónico? \nSaludos", "@M2Dynamics Hey there. Please DM @NikeService and let us know where you purchased your pair specifically. If they're from https://t.co/yYv8xSbp4x, include the order number and your Nike Member email. We'll meet you there to see what options are available for you.", "@Cyrillecaron Hey @Cyrillecaron, nous sommes navrés de voir le défaut sur ta paire. Ne t'inquiète pas, nous allons trouver une solution pour toi. Viens en DM avec le nom du magasin où tu as acheté ton article. https://t.co/klmMF0Q8Tn", "@KilluaMx Follow Nike afin de pouvoir nous écrire en DM. https://t.co/klmMF0Q8Tn", "@KilluaMx Hey @KilluaMx, pas de soucis, rejoins-nous en DM avec le numéro de ta commande et ton adresse e-mail, nous allons regarder ça pour toi. https://t.co/klmMF0Q8Tn", "@toroz_13 @SneakerAdmirals @SneakerNews @kicksonfire Shout out to YOU for your sacrifice on the frontlines! 🙌", "@Lamesuka Tendrías que enviarlo por DM :)", "@Lamesuka ¡Hola Luis! ¿me puedes psaar tu correo electrónico y tu número de pedido por privado? , así vemos lo que pasa con tu pedido.\nSaludos", "@juanzavala91 ¡Hola Juan! Para nada es normal que te haya pasado eso, te paso el contacto de Atención al Consumidor de Mexico para que soluciones el incidente. Aquí tienes:  https://t.co/ai6PJ9r34d\nSaludos", "@Manini_amnh Hey @Manini_amnh, pas de soucis, peux-tu nous envoyer le numéro de ta commande ainsi que ton adresse e-mail en DM ? Nous allons regarder ça ensemble. https://t.co/klmMF17JKV", "@soyarturogg ¡Hola Mayel! ¿desde qué dispositivo estás intentando hacer la compra?\nSaludos", ".@mathewfras has done it again. And again. And again. And again. 5x CrossFit Games champion. Undisputed 🐐. #YouCantStopUs #HWPO https://t.co/PP5a0VCHHl", "You don't need to be a star to have a voice. #YouCantStopOurVoice\n\nLearn more: https://t.co/skpLvbw81r https://t.co/ougrmgjnm1", "@lgjujuco Salut Justine, nous apprécions ton envie de faire partie de l'univers Nike, mais nous n'acceptons pas les demandes de sponsorisation. Nous te conseillons de rester active sur les réseaux sociaux, et qui sait, nous te sélectionnerons peut-être un jour.", "@andrewoski Buenos días! ¿me puedes facilitar tu correo electrónico y tu número de pedido por mensaje privado?\nSaludos", "@knxwledgepxwer Champ-pa with the mentality. 🏆🏆🏆🏆🏆", "@juan_ozuna Don't make us wait too long! 🔥", "@DanHelesfay 😍 😍 😍", "@js_rodriguez_ Hola Don Viejo, si quieres puedes enviarnos un MD con el número de pedido y lo miramos. Un saludo.", "@MandFullard Sorry to hear this, Amanda! Feel free to DM @teamnike info on when and where this pair was purchased from, and we'll take a look at your options. 📩", "@DaMediaGuy Hey there! Apologies for the confusion. The Día de Muertos collection will be dropping at a later date. We recommend staying tuned to the SNKRS app and https://t.co/QeFYQHpO76. Sorry for the inconvenience.", "@GraftMusic Got it. While we don't have any 720s in Grey to share currently, keep it locked here for any updates: https://t.co/bRAiIWIsXQ", "@nhpaulao So sorry for your loss, Paula. But, we're glad you were able to overcome and turn the negative into a positive! 👏", "@GraftMusic Hey, here's a link to the available 720's on https://t.co/Q5h4vQiSJ5: https://t.co/6vzZNO8UdY.", "@ReissBeckford Hi Reiss, We proactively seek athletes to wear the Swoosh and represent the Nike brand. While we appreciate your love of sport and interest in Nike, we don't accept unsolicited sponsorship requests.", "RT @NikeLA: In a year unlike anything, this win means everything. #YouCantStopLA\n\n@KingJames @AntDavis23 @Lakers https://t.co/5y2EVJAmok", "🏆 🏆 🏆 🏆 🏆\n🏆 🏆 🏆 🏆 🏆\n🏆 🏆 🏆 🏆 🏆\n🏆 🏆 🏆 🏆 🏆\nAnd not stopping now.  \n \n@RafaelNadal makes it 20 Major titles. #YouCantStopUs https://t.co/G1pstyWsXo", "@orbazz Hey there, those are the Air Force 1 Low. You're in luck because that style is currently available from our friends at Foot Locker! 👇🍀 \n\nhttps://t.co/m35OUL7CGZ", "@turtlepace5 We 🧡 this.", "@EVLASH20 Those 26 years flew by. We missed you!", "@James882James Hi James,\n\nThats great to hear!\nThere is no knowledge from our end on any general 30% discount. Might have been a special promotion at that outlet. Happy days  😎", "@pascujmr En su defecto si no tienes ticket de compra nos podrías aportar captura de la transacción de pago. Puedes contactarnos a través de nuestra sección de ayuda; https://t.co/KaAfi5DiUe. Saludos.", "@Vale28512059 Hola Vale, si te parece envíanos un MD con el número de pedido y lo miramos. Te esperamos. Saludos.", "@pascujmr te comento, sin el ticket de compra no podríamos hacer nada ya que nuestro departamento de calidad tendría que hacer un estudio del defecto.", "@pascujmr ¡Gracias! para poder atenderte con ese  defecto en nuestro artículo, tendrás que darme tu número de pedido y pais en el que has hecho la compra. Saludos", "@loretov_18 Hola Loreto. Si quieres puedes enviarnos un MD con el número de pedido y le echamos un vistazo. Tamgbién puedes contactarnos a través de nuestra sección de ayuda: https://t.co/W5E9iEg8si. Saludos.", "@CA2WTT ¡Hola @CA2WTT! ¿Me puedes enviar tu número de pedido o correo lectrónico para poder ayudarte? Saludos", "@_matiasmella ¡Hola! ¿nos puedes enviar un DM con tu número de pedido? ¡estaremos encantados de ayudarte! Saludos", "@pascujmr ¡Hola! ¿nos puedes enviar un DM?,¡ estaremos encantados de ayudarte! Saludos", "@Ricardo09237664 ¡Hola! ¿me puedes enviar un DM con lo que te pasa en ese pedido? Estaremos encantados de ayudarte. Saludos", "An unfamiliar course. An isolated stadium. A challenging training season. Through it all, Brigid Kosgei kept going.\nBecause greatness is unstoppable. 👟 🥇 https://t.co/BPdniN6CK8", "@c_bangs 💪❤️", "@itsgabecamacho We're just returning the favor, Gabriel. 🤝", "@cooka1219 We love to hear it! Make sure you keep your eyes peeled for your ballot. 👏", "@thawoo1031 That's odd! Feel free to DM @teamnike your Nike Member email so that we can take a closer look. 📩", "@thawoo1031 Hey Pat, you'll want to visit the page linked below. Be sure to sign in to your Nike Member profile so that you're all set and ready to go for the next 🔥 drop.\n\nSNKRS desktop: https://t.co/YFy06RfrHI", "@cdgehring This drop is 🔥.", "@ismarygarcia1 ¿me puedes envia tu número de pedido por un mensaje privado?", "@willyrodrigz ¿qué modelo es? ¿has actualizado app o caché y cookies?", "@KaviarKicks Love the passion! Unfortunately, we don't have information to provide on the midsole materials, and we don't have plans to sell accessories. Let us know if you need any help tracking down some Air Max 1s!", "@Hillt1 Congrats on crushing your first marathon, Terry! 🏅 Cheers to many more kilometres in your Infinity Runs!", "@JunicMe Let's get you back in the game! Pass us the following via DM and we'll take a closer look:\n\n- Nike Member email\n- Device + OS\n- Version of the NTC app https://t.co/klmMF0Q8Tn", "@SushilM17566647 That's no good, Sushil. Mind letting us know when and where you purchased these? Meet us in the DM and we'll look at your options. ⬇️ https://t.co/klmMF0Q8Tn", "@schopp_case We're digging how these kicks turned out! 🔥🙌", "@jocy_fredes Hola Joy, encantados de ayudarte. Sí por favor, ¿puedes mandarnos tu número de pedido y el correo electrónico que usaste para hacer la comra?. Te esperamos https://t.co/klmMF0Q8Tn", "@macaren21783218 Hola Macarena. ¿Podrías mandarnos un DM indicando el correo electrónico con el que hiciste la compra y tu número de pedido para echarle un vistazo?. Saludos. https://t.co/klmMF0Q8Tn", "@mariotouc Hola Mario, ¿podrías mandarnos un DM indicando el correo electrónico con el que hiciste la compra y tu número de pedido para echarle un vistazo?. Saludos. https://t.co/klmMF0Q8Tn", "@JacobBrough3 Let's figure this out, Jacob. Did you manually enter or edit the run? Was Power Saving mode enabled? DM your answers to @teamnike, along with your Nike Member email and some screenshots of what you're seeing.", "@realrentvp Hola Renato, para poder ayudarte mejor ¿podrías mandarnos un DM indicando el correo electrónico con el que hiciste la compra y tu número de pedido para echarle un vistazo?. Saludos. https://t.co/klmMF0Q8Tn", "@evelynh39155657 Hola Evelyn, vamos a averiguar qué ha pasado. ¿Podrías mandarnos un DM indicando el correo electrónico con el que hiciste la compra y tu número de pedido para echarle un vistazo?. Saludos. https://t.co/klmMF0Q8Tn", "@angelmrn701 Hola Ángel ¿Podrías mandarnos un DM indicando el correo electrónico con el que hiciste la compra y tu número de pedido para echarle un vistazo?. Saludos. https://t.co/klmMF0Q8Tn", "@ricardo10064781 Hola Ricardo, encantados de ayudar. ¿Podrías mandarnos un DM indicando el correo electrónico con el que hiciste la compra y tu número de pedido para echarle un vistazo?. Saludos. https://t.co/klmMF0Q8Tn", "@guidomark Hola Guido, vamos a averiguar qué ha pasado. ¿Podrías mandarnos un DM indicando el correo electrónico con el que hiciste la compra y tu número de pedido para echarle un vistazo?. Saludos. https://t.co/klmMF0Q8Tn", "@deepans2301 No word to share at the moment, Deepanshu. Please stay tuned to our site for any updates or availability info. We also recommend taking a peek at our University Red colourway available now via this link: https://t.co/0T0dg6qDur", "@StiveGodoy ¡A por los 5km! 🏃‍♂️ 🔥", "@l_pancho Hola Francisco, vamos a averiguar qué ha pasado. ¿Podrías mandarnos un DM indicando el correo electrónico con el que hiciste la compra y tu número de pedido para echarle un vistazo?. Saludos. https://t.co/klmMF0Q8Tn", "@MarcosMato22 ¡Sigue así, Marcos! 🏃 🏃‍♂️", "@Tatanisky Hola Tatán, encantados de ayudar. ¿Podrías mandarnos un DM indicando el correo electrónico con el que hiciste la compra y tu número de pedido para echarle un vistazo?. Saludos. https://t.co/klmMF0Q8Tn", "@debhevia Hola, ¿podrías mandarnos un DM indicando el correo electrónico con el que hiciste la compra y tu número de pedido para echarle un vistazo?. Saludos. https://t.co/klmMF0Q8Tn", "@lunchboxdad Now she's set up for success. Can't wait to see what you cook up next, Dad! 🙌", "@iamjodeane We love the drive, Jodeane! 💪", "@NossonWeissman Happy to look into this with you, Nosson! Feel free to DM @teamnike your Nike Member email and some screenshots of what you're seeing. 📩", "@PalavecinoAyala Hola Maximiliano, vamos a averiguar qué ha pasado. ¿Podrías mandarnos un DM indicando el correo electrónico con el que hiciste la compra y tu número de pedido para echarle un vistazo?. Saludos. https://t.co/klmMF0Q8Tn", "@l_reeyes Hola. Estamos optimizando algunas secciones para ofreceros la mejor experiencia de compra posible. ¡Muchas gracias por tu feedback! Sigue atenta a nuestra web para no perderte ningún cambio y recuerda que puedes visitarnos en tu tienda oficial más cercana. Te esperamos.", "@beto720423 Hola Beto, encantados de leerte. Estamos evaluando la selección de productos y categorías ofrecidas de acuerdo con vuestras preferencias. Ten por seguro que tomamos nota de tu interés. Mientras tanto, puedes visitarnos en tu tienda oficial más cercana. ¡Te esperamos!", "@IanParry_ That's not what we like to see. Meet us in the DM with the following and we'll take a look:\n\n- Nike Member email\n- Device type + OS\n- Version of the Adapt app", "@itskartikjoshi We've got your back, Kartik! 💪", "@wullzdee Sorry to hear about your experience, Wullie. Please DM us @TeamNike with your Nike Member email, and we'll do our best to help.", "@pris_ayala13 Hola Pris, vamos a averiguar qué ha pasado. ¿Podrías mandarnos un DM indicando el correo electrónico con el que hiciste la compra y tu número de pedido para echarle un vistazo?. Saludos. https://t.co/klmMF0Q8Tn", "@nicolasagm206 Hola Nicolás, vamos a averiguar qué ha pasado. ¿Podrías mandarnos un DM indicando el correo electrónico con el que hiciste la compra y tu número de pedido para echarle un vistazo?. Saludos. https://t.co/klmMF0Q8Tn", "@rorrocampos Hola, vamos a averiguar qué ha pasado. ¿Podrías mandarnos un DM indicando el correo electrónico con el que hiciste la compra y tu número de pedido para echarle un vistazo?. Saludos. https://t.co/klmMF0Q8Tn", "@MauricioPlace13 Hola Mauricio, sentimos mucho lo ocurrido. ¿Podrías mandarnos un DM indicando el correo electrónico con el que hiciste la compra y tu número de pedido para echarle un vistazo?. Saludos. https://t.co/klmMF0Q8Tn", "@carlosadan011 Hola Carlos, vamos a averiguar qué ha pasado. ¿Podrías mandarnos un DM indicando el correo electrónico con el que hiciste la compra y tu número de pedido para echarle un vistazo?. Saludos. https://t.co/klmMF0Q8Tn", "@BarbaraSawalha Hola Bárbara,  ¿podrías enviarnos un DM con el correo electrónico con el que hiciste la compra y tu número de pedido para echarle un vistazo?. Saludos. https://t.co/klmMF0Q8Tn", "@Ivancmpj Hola Iván, échale un vistazo a tu tienda oficial más cercana. ¡Te esperamos!", "@Solosu7 Hola, vamos a averiguar qué ha pasado. ¿Podrías enviarnos un DM con el correo electrónico con el que hiciste la compra y tu número de pedido para echarle un vistazo?. Saludos. https://t.co/klmMF0Q8Tn", "@iamsaratomovic Welcome to the club! We can't wait to see your progress. 💪", "@rebegg95 Hola Rebeca, medio número más debería de ser suficiente pero si no lo fuera no te preocupes porque los cambios y devoluciones son gratuitos 📏 https://t.co/klmMF0Q8Tn", "@Greicy12518 ¡Genial Greicy, ahora a darlo todo!🏃‍♀️", "@profedafne Hola Dafne, para poder ayudarte mejor, ¿podrías enviarnos un DM con los datos del pedido y le echamos un ojo? https://t.co/klmMF0Q8Tn", "@kim_lotus Hey, Kim! We recommend reaching out to your local Nike stores for more information.", "@EmerickCarter Hey Emerick , nous sommes désolés pour tes Hyper Adapt. Nous t’invitons à venir en message privé avec ton numéro de commande ou ton adresse e-mail afin que l'on puisse regarder cela ensemble.", "@LeBelhandisme Hey @LeBelhandisme , nous allons t’aider ne t’inquiète pas. Nous t’invitons à venir en message privé avec ton numéro de commande ou plus d’informations sur ta situation et nous pourrons regarder ce qu’il se passe ensemble.", "@BigNorm72 We specialize in that lighter than air feeling.😉☁️", "@MatttttJohnson They grow up so fast.🥺", "@haley_weininger 😍😍😍", "@RBainesy Pumped to see you found your perfect pair! Cheers to many more kilometres together 👟", "@smoove02 We got you covered! Check out our cleaning guide here: https://t.co/GtnFq8a3ia", "@Victori68766884 Hola Victoria, lamentamos mucho el retraso, te hemos enviado un e-mail, favor de revisar bandeja principal y de correo no deseado. Saludos.", "@Damochi We love to see you set goals for yourself, Dee! Keep us updated as you take on this fitness journey with your new running and training shoes. 👊", "@Marco_Malavasi Score! What's the first thing you're doing in your new trainers?", "When one of us wins, we both win. You can't stop sisters. #YouCantStopUs\n\nJoin Us | https://t.co/1m48qkTOkV https://t.co/kdttLvN60s", "https://t.co/dbx5DP5MYB", "@claudialever Hey Claudia, some products are excluded from that promo. Feel free to DM @teamnike your Nike Member email and a screenshot of what you have in your bag. You can also view the exclusions list here: https://t.co/he2XqTQWr6", "RT @nikebasketball: Never fear failure.\n\nWhat can you do today to be better than yesterday?\n\nLearn more about Kobe’s Fearlessness: https://…", "RT @nikebasketball: Be honest with yourself. Your team. The world.\n\nWhat can you do today to be better than yesterday?\n\n#MambaMentality \n\nL…", "RT @nikebasketball: Focus on your goal and how to get there.\n\nWhat can you do today to be better than yesterday?\n\n#MambaMentality\n\nLearn mo…", "RT @nikebasketball: To kick off Mamba Week, we asked our athletes to tell us how Kobe’s passion inspired them to be better. #MambaMentality…", "RT @nikebasketball: Kobe taught us to be better. A better scorer, better mentor, better father, better champion. Today, on his birthday, we…", "@mar_smello No time like the present. 🏃‍♀️", "@keharker They never left. 😎 https://t.co/1Y0eDqXsMY", "@AdrianHuertaPhD @USCRossier @USCPullias Fight on! ✌️", "@Chad_2Cool You were saying? \n\nhttps://t.co/NxirsP9Cph", "@chotsky7 Post your pair on IG using #SNKRSKickCheck for a chance to be featured next!", "@gbucarey Hola Gonzalo, te recomendamos revisar bandeja principal y de spam del e-mail que proporcionaste. Si no, puedes contactarnos directamente a través de nuestro centro de atención telefónica, encontrarás más información en la sección de ayuda. Saludos.", "@Tomtrooper4 Hey @Tomtrooper4. La promotion anniversaire est un tirage au sort parmi tous les Membres Nike nés le même mois que toi. Un e-mail est envoyé afin d'informer les personnes sélectionnées. On espère que tu seras plus chanceux l'année prochaine.", "@CAvilaH7 Hola, de ser así te recomendamos te comuniques a nuestro centro de atención telefónica, que estaremos encantados de ayudarte. Encontrarás nuestras diversas vías de contacto en la sección de ayuda. Saludos.", "@Carol_HzR Hola Carol, ¿has revisado bandeja principal y de spam del correo que proporcionaste? te sugerimos echarle un ojo ya que deberías de tenerlo si el pedido se realizó correctamente. Un saludo.", "@eddie_rockss Hola Eduardo, lo más recomendable es devolver el producto que tienes utilizando la etiqueta que incluimos en tu paquete y realizar un pedido nuevo con la talla que deseas. Saludos.", "@batlly_25 Hola Bárbara, vemos que ya te has comunicado a nuestro centro de atención telefónica, podrás rastrear tu paquete con el número de seguimiento que te hemos proporcionado, que disfrutes mucho de tu compra. Un gran saludo.", "@juanluisggarcia Hola Juan, lamentamos mucho lo ocurrido, la verdad es que no es nada normal que pasen estas cosas ¿podrías enviarnos un privado con tu e-mail registrado? así podemos echarle un vistazo. Saludos https://t.co/klmMF0Q8Tn", "@Bichitabuena Hola Lucía, el tiempo que tarde en reflejarse dependerá de tu método de pago y de tu entidad bancaria, considera que si pagaste con tarjeta el reembolso deberá reflejarse en un plazo aproximado de 9 días, a partir de que se haya procesado. Saludos.", "@mitzyGa19978935 Hola Mitzy, en este caso te sugerimos te comuniques directamente a nuestro centro de atención telefónica, encontrarás nuestras diversas vías de contacto en la sección de ayuda. Saludos.", "@jchm_mx Hola, para cambios de talla lo más recomendable es realizar un pedido nuevo con el producto que deseas y devolver el que ya tienes utilizando la etiqueta que incluimos en tu paquete. Saludos.", "@saranthula Hola Sarah, los pedidos Nike pueden llegar en paquetes separados, por lo que te sugerimos estar al pendiente de tu e-mail donde te estaremos enviando actualizaciones sobre el envío. Saludos.", "@Elabogadoebrio Hola Alex, a todas las compras Nike que se hayan realizado después del 14 de febrero de 2020 se les aplicará una política de devoluciones ampliada de 60 días (hay algunas excepciones). Saludos.", "@HernanTmara Hola Rommy, ¿ podrías enviarnos un MD indicándonos el email que usaste para hacer el pedido ? Saludos. https://t.co/klmMF0Q8Tn", "@SeguradoPablo Hola Pablo, hemos procedido a realizarte la devolución de tu pedido, en los próximos días laborables verás de vuelta la cantidad reflejada en tu tarjeta. Saludos. https://t.co/klmMF0Q8Tn", "@SeguradoPablo Hola Pablo, si te parece envíanos un MD con el número de pedido y lo miramos. Un saludo. https://t.co/klmMF0Q8Tn", "@amadopedrero Hola Amado, te dejo por aquí el link que espero te sirva de interés: https://t.co/ZdDWYoSAGC. Saludos.", "@WaBiiiiZ Hey @WaBiiiiZ, pas de disponibilité en ce moment pour cette paire d'Air Max 1. Restes connecté sur nos nouveautés et notre SNKRS app 🙂.", "@TexazMane Light work. 😤", "@DreKingston The 🍒 on top to any fit 💯", "@KGOLO_KAY Those Air Force 1 Mid Utility shoes dropped early last year and are sold out. The classic black AF1 Mid is available though. Have a look: https://t.co/XjQBnCoNrV", "@Rodack_p Hola C.Rodrigo,  según el sistema tu pedido está en tránsito. Si quieres también puedes contactarnos a través del siguiente link: https://t.co/FlfpmB3yWc. Saludos.", "@NadineSnchezLa1 Hola Nadine, te recomendamos contactarnos a través del siguiente link: https://t.co/SyXgFBWqgz. Te esperamos. Saludos.", "Nothing can stop what we can do together. You can’t stop sport. Because #YouCantStopUs.\n\nJoin Us | https://t.co/fQUWzDVH3q https://t.co/YAig7FIL6G", "@cotita_beans Hola Cotita, te recomendamos seguirnos a través de nuestra APP y web donde irán saliendo todas las novedades. Saludos.", "@Richardeko Hola R Dave, si quieres puedes mandarnos un MD con el número de pedido y lo miramos. Te esperamos. Saludos.", "@cotita_beans Hola Cotita, ¿ has probado a enviarnos un email ? Si quieres también puedes indicarnos el número de modelo y lo miramos. Saludos.", "@Carolin54415718 Hola Carolina, te recomendamos contactar con nuestro servicio de ayuda a través del siguiente link: https://t.co/fPeJtb3bXS. Te esperamos. Saludos.", "@ManatiVazquez Hola Cristina, si quieres puedes mandarnos un MD con el número de pedido y lo miramos. Un saludo.", "@Rodack_p Hola C.Rodrigo, ¿ nos podrías enviar un MD con el número de pedido y así le echamos un vistacito ? Te esperamos. Un saludo.", "@atcheeylaurenn Trails beware. Speed is coming! 🔥", "@BasinStRecords When you hit it let us know. We can't wait to hear about it!", "@BasinStRecords Congrats! Here's to 3000 more. 🎉", "@piscean219 😍 😍 😍", "@neondunker Hola Antonio, lamentamos mucho el retraso en tu entrega ¿podrías contactarnos a través de nuestro centro de atención telefónica?, te dejamos por aquí el dato: https://t.co/pYAKnhyWl8\nSaludos.", "@alioli03 Hola Alioli, te recomendamos seguirnos por nuestra web y APP donde iremos anunciando todas nuestras novedades. Saludos.", "@Rico_MarLou Hola Marlou, si te parece envianos un MD con el número de pedido y así poder ver el seguimiento del mismo. Un saludo.", "@CARLOXYZ2 Hola Carlos, si quieres envianos un MD con la dirección de email que usaste para hacer el pedido y así echarle un vistacito. Te esperamos. Saludos. https://t.co/klmMF0Q8Tn", "@rubanal En este caso te sugerimos intentarlo nuevamente o si no puedes contactarnos directamente a través de nuestro centro de atención a clientes que estaremos encantados de ayudarte: https://t.co/7XFscqTndX\nSaludos. https://t.co/klmMF0Q8Tn", "@rubanal Hola Rubén, ¿ Podrías intentarlo ahora de nuevo porfi? Te esperamos. Un saludo. https://t.co/klmMF0Q8Tn", "@alioli03 Hola, ¿podrías intentarlo ahora de nuevo porfi? Te esperamos. Un saludo. https://t.co/klmMF0Q8Tn", "@rubanal Hola Rubén, si quieres puedes enviarnos un MD con el número de pedido y lo miramos. Un saludo.", "@alioli03 Hola, ¿nos puedes enviar un privado con tu número de pedido y correo electrónico? Que lo revisamos enseguida. Saludos.", "@Bhaloy Calvin, this is vAIRy cute!😍", "@Francis03306351 Hola Francisco, veo que los MD están activados para que nos lo puedas enviar, pero si sigues teniendo incidencia para hacerlo te sugiero que nos contactes a través de nuestra página web en la sección de ayuda. Un saludo. https://t.co/klmMF0Q8Tn", "@juancarlosdima Hola Juan Carlos, si te parece envianos un MD con el número de pedido y así podremos verlo juntos. Un saludo. https://t.co/klmMF0Q8Tn", "@DesiderioRamir9 Hola Desiderio, cuando realizas un pedido se te envía una autorización de pago que luego se te es devuelta, si el pedido está cancelado, en 10 días laborables como mucho verás esta cantidad devuelta en tu cuenta. Un saludo.", "@Francis03306351 Hola Francisco, ¿ podrías intentarlo de nuevo ? Un saludo. https://t.co/klmMF0Q8Tn", "@Francis03306351 Hola Francisco, si quieres envianos un MD con el número de pedido y así poder echarle un vistacito. Saludos.", "@LGKING Hola, puedes enviarnos tu consulta a través de cualquiera de los siguientes medios: https://t.co/VpjKg9CnpP. Saludos.", "@CharlieLof Hola Carlos, te recomendamos que nos sigas a través de nuestra web y APP para mantenerte al tanto de todas nuestras novedades. Un saludo.", "@Nattysonice Hey Natalie! The blue one is sold out, but we have the same one in red here on our site. Check it!\n\nhttps://t.co/L6Z9wp3m5W", "@Gerbows Hola Dido, te dejamos por aquí los colores y modelos que tenemos disponibles por el momento: https://t.co/gw7AdVazzS\nSaludos", "@LGKING Hola, en ese  caso puedes intentarlo a través de nuestro servicio de atención al cliente en llamada o en chat. Te esperamos. Un saludo.", "@LGKING Hola,  ¿podrías enviarnos un MD  con el número de pedido y así poder ayudarte? Un saludo.", "@andrearamirezda Hola Andrea, si te parece envianos un MD con el número de pedido y le echamos un vistacito. Un saludo.", "@leoetorresg Hola Leandro, ¿ podrías enviarnos un MD con los números de pedido para comprobar el estado de los mismos? Como sabes también puedes devolverlo de forma gratuita y segura. Un saludo.", "@isis_moreno Hola Isis, ¿ podrías enviarnos un MD con el número de pedido para echarle un vistacito y así poder ayudarte porfi? Un saludo.", "@mattt_hlr Bonjour Matt-hlr ! Nous n'avons pas d'informations concernant les réassorts d'articles. Je t'invite à suivre les nouveautés sur le site https://t.co/Wilj3MgsMq et/ou l'app Nike ! =)", "@Chikenn750XX Bonjour Chikenn750XX ! Nous n'avons pas d'informations sur les réassorts d'articles ! N'hésite pas à suivre les nouveautés sur le site https://t.co/oJwjvMVRLS et sur l'application Nike !", "@salim_rey31 Bonjour Salim_rey31 ! N'hésite pas à appeler au +33 (0) 170489073 du lundi au vendredi ou par chat pour pouvoir effectuer un échange d'article. Les échanges sont gratuits.", "@kanesha_missy We're so proud of you! 💪", "@madonna1ab Thank YOU for all you do! ♥️ Stay safe and healthy!", "@Marvin_Grs77 Bonjour Marvin_Grs77 ! Pour le moment, nous n'avons pas de date de sortie. Je te conseille de suivre les informations sur le site https://t.co/XqENKE7bCj ou sur l'App Nike. =)", "@DRAQKERRR Bonjour DRAQKERR ! Pour ta commande, nous te conseillons de contacter le service client https://t.co/WP6bLcqIWx par téléphone au +33 (0) 170489073 ou par chat du lundi au samedi de 9 h à 18 h", "@aiisuca Hola aiisuca, para no perderte de ningún próximo lanzamiento, échale un ojo a nuestro calendario: https://t.co/Tw50IkNqHf. Por cierto, te sugerimos también descargarte la SNKRS App, es la mejor forma de mantenerte siempre al día. Saludos", "@offcolork Welcome to the club! We're happy to have you. 🏃‍♀️", "@EricLetassey Bonjour Eric ! Avec l'étiquette de retour présent dans le colis, tu peux renvoyer la paire de Pegasus et être remboursé. Le remboursement se fait dans les 5 à 8 jours ouvres sur votre carte bleue ou 48 h avec paypal.", "@rxyski Bonjour rxyski ! Nous vous conseillons d'appeler votre banque pour régler le souci au plus vite. Si le problème persiste, n'hésitez pas à venir nous parler en DM. https://t.co/klmMF0Q8Tn", "@maurcd62 Bonjour maurcdd62 ! Nous n'avons pas d'informations concernant les réassorts d'articles. Nous te conseillons de suivre les articles sur le site https://t.co/bmOvJ81Lhh ou la Nike App pour suivre les restocks.", "@tolissotom Hey Tolissotom ! Magnifique chaussure ! Hate que tu les recoit pour nous en parler ! =)", "@100sanscentsang Bonjour 100sanscentsang ! N'hésite pas à venir nous voir en prive pour nous expliquer et pouvoir t'aider ! https://t.co/klmMF0Q8Tn", "@MastalerzSara Sounds like it's time for something new to keep the conversation going. 😉 https://t.co/VJVn6IB3q8", "@Smithers216 You got the juice. 🍇", "@MattMur79807862 Hi Matt, nous sommes contents qu'elles te conviennent parfaitement. Enjoy !", "@RobinHoodTV Hi Robin ! Nous ne conseillons de prendre ta pointure habituelle, si toutefois nos échanges sont gratuits.", "@marianitaAa_o ¡Hola marianiwis! Estate muy atenta a nuestra página web para que no te pierdas ningún próximo lanzamiento.\nSaludos.", "@ms13_daniel ¡Hola Daniel! por el momento no enviamos a las Islas Canarias, te dejo el link donde puedes revisar las opciones de envío de https://t.co/tJ4q2xbIxE aquí: https://t.co/mrvMw5vltz\nSaludos.", "@JRuizz ¡Hola Julian! los pedidos en https://t.co/VVRUsfUMSZ no se pueden cancelar pasados los 15 minutos, en este caso, ponte en contacto con nosotros a través del 913753366 cuando tengas el número de seguimiento. Saludos", "@ALJMontenegro ¡Hola Alex! ¿En qué país quieres encontrar una tienda Nike?", "@aloha_caleb96 Open for a surprise ⬆️👀", "@PhiPhiOhara The love is mutual 🌈", "@J0bbzz Hey. Pour l'instant nous n'avons pas de date de sortie pour la Air Max 98 Tear Away. Afin de savoir quand cet article sera de nouveau disponible, nous t'invitons à rester à l'affût sur https://t.co/1fLewa4UfM et ta Nike App.", "@patgum10 Gear up for the grill. https://t.co/H0L29CsOc0", "We will continue to stand up for equality and work to break down barriers for athletes* all over the world.\n \nFor more information: https://t.co/CQvZhwEYFT https://t.co/ekOaUM4qAA", "@Jumpman23 🤝", "@adidas ❤️", "Let’s all be part of the change.\n\n#UntilWeAllWin https://t.co/guhAG48Wbp", "@Case_YES_Bin Now that's a lot of running. Way to go! 🎉🙌", "@Kenndtx We are releasing a BETRUE collection, Ken! Check out the details here: https://t.co/bvkmFTH6MZ", "@freenrambles Thanks for connecting! Go with the Structure or the Odyssey, they will have a firmer midsole on the arch of the foot and a lighter, softer foam on the outside which will be perfect for you. 👍", "@gianinnabc Hola, encantados de ayudarte. ¿Podrías enviarnos un MD con tu correo electrónico y el número de pedido por favor?. Te esperamos. Saludos. https://t.co/klmMF0Q8Tn", "@leacbn Hey Lea. Nous sommes sincèrement désolés que ta commande rencontre du retard. Nous faisons en sorte que tu la reçoives au plus vite et nous te feront savoir par e-mail dès que ta commande est expédiée.", "@Edoggy23 We hope you get the flavor you're after! 😋 🤞 🍨", "@PaulDStafford Lotta love in those shoes! Time for a fresh pair. 👟 \n\nhttps://t.co/U5cJfT6RvX", "No matter what we’re up against, we are never too far down to come back. #YouCantStopUs\n\nJoin Us | https://t.co/4PA8xvWFag https://t.co/VA30CC2ehg", "@ankur62988533 Thanks for being a part of the Nike family! 👊", "@AOeves 25 years! Glad you're not tired of us yet! 🥂", "@HawaiiWarrior87 Hey Delmar, the NRC app is partnered with Android watches that have wearOS.", "@OllieDingli Yes, once you start the run, you can tap on the three Metrics on the screen. They should stay with those metrics you've chosen for your future runs. 👍", "@OllieDingli Hey Ollie, instead of scrolling on your watch to change the metrics, you can now tap on each individual metric to change it to what you'd like to see!", "@BubuSamy Hey Samy. Cet article est actuellement indisponible, car il est en rupture de stock. Tu peux trouver juste ici d'autres articles qui pourraient t'intéresser : https://t.co/Bc5gBrg3lJ", "@CesarAbal Hola César, te dejamos aquí el modelo para que puedas consultar la disponibilidad en nuestra web. Son las Nike SB Zoom Blazer Mid Edge, CI3833-401. Saludos", "@theafroreloaded We got you. 👀 Get the Sportswear City Ready jacket here: https://t.co/aDcEqTWZtv", "@yomma_s What're you waiting for then? 😏 https://t.co/r2l82mdL0X", "@CesarSD760 Hey Cesar — we don't have this blue colorway on our site but check out some other options you might dig!\n\nhttps://t.co/bAtGmnMOym", "@BeneathNo1 Rise and grind.🍴 Keep up the awesome work! 👊", "@BeneathNo1 We got you! Running it back today? 🤔", "@amanda_slayz Putting in the hard work in style. 😍", "@ChristinaLivsy Way to go Christina! 🏃‍♀️", "@Labopleur Hey, Manon. Peux-tu nous transmettre ton adresse e-mail et ton numéro de commande en DM via le lien suivant s'il te plaît ? https://t.co/klmMF0Q8Tn", "@balthazar62 Hey, en effet. Peux-tu nous transmettre ton adresse e-mail et ton numéro de commande en DM via le lien suivant s'il te plaît ? https://t.co/klmMF0Q8Tn", "@390manda__ Hey, Les délais de préparation et de livraison sont actuellement de 15 jours ouvrés (hors week-end et jours fériés) donc pas d'inquiétude à avoir. Si tu veux, nous pouvons vérifier pour toi. Pour ça, nous attendons ton numéro de commande et ton adresse email en DM s'il te plaît. https://t.co/klmMF0Q8Tn", "@Ellenfthc Hey there, no news on that style at this time. Stay tuned to https://t.co/yYv8xSbp4x for the latest. 👍", "@Oliver__VK We got you! We update Nike By You materials daily, so feel free to check back each day between 4-5 PM for possible restocks. 👍", "@shbcos No news right now, but stay tuned to https://t.co/yYv8xSbp4x for all the latest &amp; greatest styles!", "@HighKeyLee What a ride! Let's find you a new favorite: https://t.co/zdhy3xKeR5", "@AkbarPathana No word on when that style is restocking. Check out the link below for all current styles avaliable! 👀 \nhttps://t.co/TdBgCW3Bh5", "@jessismoree Hey there, we have a short amount of time to cancel an order once its been placed. You can cancel your order during that time through the Nike app.", "@El_Barto_38 Hey, Aïssou. Merci pour cette photo. Nous avons bien reçu tes messages en DM et avons pris en compte ta plainte.", "@ValooBerry Hey Valoo. En effet, nos lignes téléphoniques sont extrêmement occupées en ce moment. On t'invite donc à nous contacter par chat [Lundi au samedi - 9h à 18h] via ce lien : https://t.co/QD06zFTsLq", "@SYH509 Hey. En effet, nos lignes téléphoniques sont extrêmement occupées en ce moment. On t'invite donc à nous contacter par chat [Lundi au samedi - 9h à 18h] via ce lien : https://t.co/kXuhu6m7TW", "@strapondine Tu as juste à utiliser l'étiquette pré-payée de retour fourni dans ton colis et de retourner ta paire par la poste. Une fois ton retour reçu, on te remboursera l'intégralité de ta commande.", "@Barksdale_941 Hey. Viens en DM avec ton numéro de commande et ton adresse e-mail on va pouvoir t'aider. https://t.co/klmMF0Q8Tn", "@brxkengomez Great style! Those are the Nike Air Max 90s, check them out here: \nhttps://t.co/kjVauaoe3D", "@Portugator95 Hey. Le modèle n'est plus disponible, il fait partit d'anciennes collections Nike Mercurial. Vous pouvez voir nos nouveaux modèles juste ici : https://t.co/5iEfrfSHyo .", "@Alexis_Rookie Hey Alexis. Tu peux nous contacter  via notre service client par téléphone (+33170489073) ou par chat [Lundi au vendredi - 9h à 18h et Samedi - 9h à 18h].\nSinon tu peux venir en DM en nous communiquant ton numéro de commande et ton adresse e-mail. https://t.co/klmMF0Q8Tn", "@gbarrett123 Keep crushing those runs Gary! 💪", "@hsshawnshyne Thank you for all that you do! The Air Zoom Pulse is not available to purchase, as we've donated our current inventory through Good360. Stay tuned to our site for future releases, here: https://t.co/ieDVjACnHF", "@jet78 Hey Janelle, we're happy to hear you love the app! If you have compatible devices, you can stream workouts to your TV. Also, you can join us on YouTube Saturday mornings for a workout — perfect for your laptop! 💪 \n\nFAQ: https://t.co/sZnGGMBpW7\nYouTube: https://t.co/0oCpcp3kOv", "@SeetheSun_ We got you!", "@prim_siripipat (Down the) Aisle Force 1s 😍", "@tdnowling She might like the Odyssey React Shield 2, which has a weatherized outsole to keep spills out and React technology to cushion her feet during long hours: https://t.co/skYkLeUAH0 https://t.co/klmMF0Q8Tn", "@nycdoublebassis We searched high and low but couldn't find any available. Stay tuned to https://t.co/yYv8xSbp4x for size restocks.", "@Caleb_Mezzy Hey Caleb, she sounds incredible! The Air Zoom Pulse is not available to purchase, as we've donated all of our inventory through Good360. However, she can sign up for a 20% off discount as a medical professional: https://t.co/VUvGPWUiPS", "@tdnowling Hey Tim, we're certainly inspired by her! We're donating all of our supply of Zoom Pulses through our partners at Good360. We do have some other great options she would love and are offering a 20% discount to first responders!\n\nhttps://t.co/dfpaYrLEE7", "@livinglife321 Hey Ash! We're partnering with Good360 for our donation efforts. They are a nonprofit that specializes in distributing product donations to organizations that help people facing disasters and other challenges. 👍", "@vicentep_14 Agradecemos tu amabilidad, Vicente. Saludos.", "@vicentep_14 Hola Vicente, sentimos que no hayas podido comunicarte. Puedes intentar enviándonos un DM con tu número de pedido. Te esperamos. https://t.co/klmMF0Q8Tn", "@AldoRamirez_ Hola Aldo, envíanos la información por DM. Un saludo. https://t.co/klmMF0Q8Tn", "In recognition of frontline healthcare workers around the world, Nike will donate the Air Zoom Pulse and other product to healthcare athletes.", "@DaviidBITW Vaya, lamentamos lo que nos cuentas. David, te aconsejamos que te comuniques con nuestro servicio de Productos y Pedidos a través de este link: https://t.co/7tGpKEBDcQ. Un saludo.", "@vicentep_14 Lo mejor en este caso es que abras un chat con nosotros a través de este link https://t.co/ovKmGwCdEK. Un saludo.", "@vicentep_14 Hola Vicente, ¿podrías enviarlo nuevamente? https://t.co/klmMF17JKV", "@vicentep_14 Hola Vicente, aquí estamos. Envíanos tu número de pedido por DM. Un saludo. https://t.co/klmMF17JKV", "@f_rabade Vaya, lamentamos leer esto. ¿Podrías enviarnos un DM con el nombre de la tienda y la fecha de compra? Un saludo. https://t.co/klmMF0Q8Tn", "@vali_rz Hola Vale, envíanos tu número de pedido por MP. Un saludo. https://t.co/klmMF0Q8Tn", "@MoBirdsMoPrblms Hey Alexander, great question! The Epic React Flyknit 2 will have the similar Flyknit upper as well as a React foam sole which is similar to Lunarlon. Try them out worry free as a Nike Member with our no questions asked return policy. https://t.co/gR66oqIxcm", "@NicolaHowe13 Hey Nicola, looks like that style is sold out in the UK, but keep checking the link to see if they restock: https://t.co/7YJDTpmSKt", "@WrldTde Looks like we aren't producing the Elite Sequalizer Crew Socks at this time. Check out our other crew socks here: https://t.co/g5F3cDrhfe", "@Vik60421368 Our vote? Never.", "@KaileyTracy You got it!", "@KaileyTracy We're here to help! You can turn off notifications for NRC on your iPhone by going to Settings&gt; Notifications&gt; NRC&gt; turn off Allow. 👍", "@jackwanstall Welcome back, Jack. What's the goal for next month?", "@Jawjadawg13 Jeff, we're glad you're loving NTC! Keep up the hard work!💪", "@15_caracteresss Hey. Nous ne communiquons pas en avance sur les remises en stock ou les sorties. Le meilleur moyen d'être au courant est de mettre ce produit dans tes favoris avec ton compte Nike : https://t.co/GoE4D4U0U1", "@LaDollceVita Hey. Notre service client est actif par téléphone (+33(0)170489073) ou par chat [Lundi au samedi - 9h à 18h].", "@unravelledmind_ No word on a restock at this time. We recommend staying tuned to https://t.co/yYv8xSbp4x for the latest.", "@renz_0311 Welcome to the fam! Be sure to check out his 'Max out HIT' it's a great full body strength workout. 💪", "@_Luvlybrielle Great shoe choice, Vicki! 🔥 Stay tuned to https://t.co/YAyy8ze38c for all the latest colors and ones to come!", "@LordKiante Tech fleece is the best! You have great style! 🙌", "@FlyyestCoopEva Not gonna lie, that like made our day 🥰", "@kianamoods Zoom\nFreak\n(Real) 1s ☝️", "@freshdipped1 We can't wait to see you rock these! 👀", "@showmerob 14 years? Time flies when you're running fast! Only 320 miles left to Volt, let's get it! 🏃‍♂️", "@mostnotables Okay, we see y'all. 💪", "@mostnotables Welcome to the club! What was the first workout?", "@fmlurn That isn't a style that we produced. You can shop all of our available Air Force 1 models here: https://t.co/clhRguRBhn", "@kevxcal TBH, same. Welcome to the club.", "@amit_mavar Sorry for any confusion, Amit. The styles are already discounted. There is no promo code for this sale.", "@msantucci12 We're unable to authenticate products via the internet or photos. We recommend purchasing directly from authorized Nike retailers, our site, or official Nike Store locations to ensure you receive a genuine Nike product.", "@ogepercy You don't even need us, great choice! Keep crushing it. 👊", "@ogepercy We see those miles adding up, Oge. 👀 You've gotta try out the Infinity Run. Let us know what you think: https://t.co/jgKfucdED0", "@shivpagnepapi Hey there! We actually do have a discount for first responders. Check out more info on our site: \n\nhttps://t.co/Bjh1mFjPV0", "@Forreee_1 Our bad, Forrest. You can still cop them when they drop on SNKRS. Get notified here: https://t.co/BP2jkE5XRS", "@LenesLife16 Hey there! Yes, we offer a 20% discount for eligible medical professionals and first responders in the US.\n\nhttps://t.co/4KwvP355tm", "@serosanguineous Hey Marcus! Yes, we offer a 20% discount for eligible medical professionals and first responders in the US.\n\nhttps://t.co/0G0jfSPv5H", "Welcome to the family, @sabrina_i20 #justdoit https://t.co/P6Wru0sjca", "@vmatai Hey Dr. Matai, thank you for everything you and your colleagues are doing! We've currently increased our first responder and medical professional discount to 20% off. To learn more and verify your eligibility, head to our site here: https://t.co/82Qpyv3KWq", "@AliDignum Hey Ali! These are a custom Airmax 90. Design your pair on our site and flex on all of your friends. 🔥💪 \n\nhttps://t.co/NJre72Is7l", "@thejamsta They're custom! We made a pair for ya, but they're sold out for today. Check back later tonight to grab your pair. 💪 \n\nhttps://t.co/B3JsPMS1Tf", "@GMartinez1392 Think it's safe to say that it's time for a new pair. 🤔 https://t.co/u7Zv8PLu9J", "@p0sitiviti De kortingscode APRIL30 is inderdaad verlopen, echter adviseren we je de nieuwsbrief of Nike app goed in de gaten te houden voor nieuwe promoties. Ben je al NikePlus member? Hiermee ben je direct op de hoogte van onze actuele acties.", "@appletechnikbl Hi!\nEs freut uns zu hören, dass du deine Bestellung bekommen hast! Wenn es noch Probleme gibt mit der Bestellung,  dann melde dich gerne nochmal bei uns im Kundenservice.\nFrohe Ostern und Liebe Grüße\nDein Nike Team", "@ItsJoeSports Your new favorite gear? 😉", "@Alex__452 We are continuing to pay employees impacted by the temporary closure of our stores.", "@appletechnikbl Gerne schauen wir uns deine Bestellung einmal an. Kontaktiere uns dafür doch einmal über unseren Kundendienst! Du findest uns über \"Kontakt\" auf unserer Webseite. Wir freuen uns darauf dir weiterhelfen zu können! \nSportlichen Grüße\nDein Nike-Team", "@breeaaa__ Say less. Use code 'LOGIN25' at checkout. 🤩 https://t.co/FH93cuLeit", "@appletechnikbl Ja tatsächlich wird es leider aufgrund der aktuellen Situation zu Verzögerungen kommen. Es tut mir leid für die verlängerte Wartezeit. Du kannst uns gerne die Bestellnummer nennen und wir teilen Dir den aktuellen Status mit. Sportliche Grüße - Dein Nike Team https://t.co/klmMF0Q8Tn", "@soft_twilight Felici di rispondere alla tua domanda. Ti consigliamo di ignorare tutte le comunicazioni rilasciate da pagine non ufficiali come quella in questione. Abbiamo gia' provveduto a segnalare questa pagina al nostro dipartimento, ti ringraziamo per la segnalazione. A presto.", "@Adrien_CSR Way to get after it, Adrien! See you next Saturday? 💪", "@yourstrulydc1 Looking fresh! 😍", "@Paladin4Justice We are continuing to pay employees impacted by this temporary closure. To learn more about what Nike is doing, head to our site. https://t.co/JxupAuEcX2", "@harryzhang You're not the only one! 🙋‍♂️💨", "\"The Story of Air Max: 90 to 2090\" is a film that tells the story of the shoes’ rule-breaking ethos and universal impact on sneaker culture. \n\nWatch now: https://t.co/RaLx2K6jq7 #AirMaxDay https://t.co/dQaU061ilM", "@BonganiSarah Head to our site to shop availability in your region!", "@My92Fiv3 Happy early Air Max Day, Issa. 🎉", "@ChazFeder Hey Chaz, we will continue to pay employees impacted by this temporary closure.", "@CoachSteve These look like a perfect match for NTC Premium! Let us know your favorite workout. 💪 https://t.co/EzPoT8WtBU", "@bintakai Hey Leslie, that's our current plan. For any changes or updates, keep an eye out to our social channels and https://t.co/yYv8xSbp4x.", "@WesleyWChow Not currently!", "@Jeevan_Design Hey Jeevan, all Nike purchases made after February 14, 2020, have an extended 60-day return policy. Stay up to date on our policy here: https://t.co/YR5XuCzgpl", "@JLothian Hey there! Those look like the Flex RN 2017. We don't have this specific style anymore, but we do have a newer similar shoe we think you'll like. Check 'em out:\n\nhttps://t.co/R0mpR61yqJ", "@LeanneParkin1 No word on a Nike By You version. Stay locked to our site for any updates!", "@LeanneParkin1 Hey Leanne! These look like a custom AF1 Shadow. Check out our available colors on our site!\n\nhttps://t.co/sslPDkoCSd", "@TlGERbI00D Good looks! That's the Adapt BB 2.0. We actually have a few sizes left on our site. 👀 \n\nhttps://t.co/nKEb6UvfYY", "Now more than ever, we are one team. #playinside #playfortheworld https://t.co/LRLhL4FwkG", "@elaawitanxx We've got just the thing, Ela. Save 25% with code 'NIKE25'.\nhttps://t.co/7YE6Ez20ua", "@FitFlyFellow It's the little things. Bring it. 💪", "@ReyReynaRey It just got even better. NTC Premium is now free! Update your App to unlock all the benefits. 🙌", "@tha_mza Update your NTC App for a surprise. 💪", "@lazlothebuzz We do. 👀 https://t.co/rd2QfqwgoS", "@scottlederer Hey Scott, we have 25% off now! Shop here: https://t.co/qkFrjssi1W", "@stephyyflowers_ No gym needed. Way to get after it, Stephanie! 💪", "@flaizeroner Hola Alan, lamentamos lo ocurrido. Tenemos que comentarte que en este caso la recomendación es acudir a un médico especialista puesto que ellos son los que pueden orientar/ayudar en este tipo de incidencias. Un saludo y que nada te detenga 👍.", "@_MissElizabeth_ It's go time! ⏰", "With love, Your Nike Family https://t.co/BgXNwItRRU", "@SaintTeg Appreciate the shout-out. We're glad Stevie could help you get what you were after! 💖", "@andybalquin Great work on getting after your Personal Best and 6-week Streak in one day!", "@TheAdamMerrill Hey Adam, it's back! 🔥 \n\nhttps://t.co/AaTAb2xBoo", "@soleguru Ready and waiting. 👀 \n\nhttps://t.co/TPRbODyj8g", "@sean_es_mi You can always try them out for 30 days and return them for a full refund no-questions-asked if you're a NikePlus member! 👀 \n\nhttps://t.co/cJFsQNJ0op", "@hawt_choklat Hey Jahmal! These have a daily material limit; check back every afternoon for your chance to cop your creation. 🔥", "@jaykobcarvalho Hey Jake! If you prefer a compression-like fit, we'd probably go with a medium. But just know you can try them out for 30 days and return them for a full refund if you don't love the fit. 💪", "@HarrisonCao1 Hey Harrison, only select colorways are available for the current promo. Check out one of our favorites that's eligible here: https://t.co/LzD4fAHaKl", "@Roberto93487633 Siamo qui per te, Roberto. In merito alla tua richiesta ti suggeriamo di contattare il nostro servizio clienti al numero 0238591453, dalle 9:00 alle 18:00, dal Lunedì al Venerdì, o via email tramite il seguente link: https://t.co/XMzQ6ZCFJt] \nA presto.", "One day, together, we will make this our every day. https://t.co/jpTVQi2LKP", "@AyItsRK 😅 Let's try this again.\n\nhttps://t.co/Ma6TrJ8KUp", "@chasityscooper This half has nothing on you! See you at the finish line. 💪🚀", "@AyItsRK We'll just leave these here.\n\nhttps://t.co/idr9lF7W7R", "@gee_0211 We have just the shoe! 😍 https://t.co/wKKT68FeST", "@SimoneCorradi2 Siamo qui per te Simone. Al momento non è stata annunciata una data di lancio per questi prodotti. Per essere informato al meglio ti suggeriamo di scaricare le nostre app, NIKE app e SNEAKRS app, così riceverai notifiche quando nuovi prodotti saranno disponibili per l’acquisto.", "@iTweetBanter Happy birthday! We wanted to make sure you're able to celebrate in style. 🥳 🎂", "@gabsouzamorim Hey Gabriel! Dropping this month. Sign up to be notified: \n\nhttps://t.co/0B4fWf5OXM", "@FindTheSneaks Hey there! This is an older version of the Challenger short. We have a newer pair on our site now. 🔥 \n\nhttps://t.co/PvGBHyhzCj", "@SquattingBears Those aren't a style we produced, but if you're looking for a similar fit and style, check these out:\n\nhttps://t.co/7UAoniiRl5", "@kinleygene The stage is set for a comeback! You got this! https://t.co/0BbS6HdmOV", "@CesarT162 There's nothing like a fresh pair of air. https://t.co/9p49LviOKE", "Farewell to one of the greatest competitors in the history of the sport. @MariaSharapova https://t.co/6wRpBaB7gx", "@janiah_edwards We have exactly what you're looking for, Janiah! 😍 https://t.co/1lZPbkvRgy", "@DraggingAsphalt @nikebaseball Hey James, we dropped some styles this morning. 👀 \n\nhttps://t.co/OgqT5DUsyn", "Mamba Forever.\n\n(sound on) https://t.co/B2LUIcpRCc", "@JFM2 9️⃣  1️⃣ 0️⃣  1️⃣ 0️⃣  9️⃣  9️⃣", "@StaurosBellagio Hey Stauros, that style released back in 2017 and isn't available anymore. We have a newer style you may like, though!\n\nhttps://t.co/jp2b3OrIfv", "@burneraccounthi How 'bout the whole fit?\n\nTee: https://t.co/Ngi1AvOta2\n\nShorts: https://t.co/75cKlguvoH", "@errolpostale We know somewhere!\n\nhttps://t.co/qPbf2ZsAP3", "@Robert11453775 No exact date to share. Stay tuned! 👀", "@Desertfury90 Welcome to the club! 👊", "@RSimoneLoos You'll be breaking records in no time! Keep us updated on your progress.", "@EckersenEric You're gonna be 𝙘𝙤𝙢𝙛𝙮 comfy! Enjoy the vacay 😎.", "@demare_banks Head to the link above, we have your size in stock. 🙌", "@demare_banks Hey Demare, we no longer make that specific style. With that said, you can't go wrong with the classic Tech Fleece! https://t.co/TIw0Mm8Dkc", "@youarevalid2 Hey Izzy, we have just the shoe! https://t.co/5UuLDCQMn1", "@VanessaAstros Hey Vanessa, that exact style is only available in select regions. With that said, we have the perfect alternative! 🧘‍♀️ https://t.co/kiAznQDET9", "@KingCuevas Get ready. 👀 https://t.co/t6c1uD5jSc", "@m0mlyn 😍🏃‍♀️", "@lizette1077 We already do! 🙌 https://t.co/gpAyfO7joN", "@jmtomichek We have just the shoe, Jessica! The Epic Phantom React Flyknit are lace free; yet provide a snug, sock-like feel. Order them without worry, as a NikePlus member, with free shipping and returns within 30-days of receiving them. 🙌 https://t.co/LKdmBTeCXA", "@Krystal__Meth We'll just leave this here: https://t.co/OT2IcsJetY", "@KellyPeranio The freshest kid on the block. Let the adventures begin! 🗺️", "@shaville It looks like it's been quite the ride! Definitely time for an upgrade, Scott. https://t.co/T7lk6E4e9a", "@themummyride Definitely! Keep an eye on https://t.co/HiEG4844Np as summer gets closer. 🛹", "@djpremis Good question. That is a part of the Skateboarding collection. Learn more about it here: https://t.co/GDlAIJJUG6", "Pictured: 32 reasons to believe anything is possible. #Nike2020 https://t.co/YYHL42pKpH", "@hotbunz816 Hey Venzie, we can confirm we no longer sell this colorway of the AJ1 Mids. We have these Retro High OGs is a size 6. Check them out here. ⬇️ \n\nhttps://t.co/wqlRTWFRjj", "NEXT% technology enables athletes to shatter personal boundaries and break records.\n\nNike's newest race-day shoe is designed to improve cushioning and running economy, the crosspoint between sports science and purposeful design.", "Nike takes a bold step to reimagine solutions for critical environmental problems.\n\nTransforming scrap material from factory floors, the Nike Space Hippie Footwear Collection has earned the brand's lowest carbon print score to date.", "The Future of Sport is here. #Nike2020 https://t.co/4XVQczylci", "@MaepaMc Welcome to the club! Good work!", "@BORuizTweets Hey Daniel, you can redeem up to 10 gift cards per https://t.co/yYv8xSbp4x purchase. Check out our terms here: https://t.co/qptCIzC3HW", "@ElyseChengery You've got some great taste! Those are 🔥 🔥", "@StuartBuckley Hey Stuart -- check out our locator to find the nearest store participating in Reuse-A-Shoe!\n\nhttps://t.co/6zfDwEFeLe", "@GionCarlo888 That's not what we want! Do you mind sending over a DM with when and where you bought these, and your NikePlus email? https://t.co/klmMF0Q8Tn", "@DiegoD6195 These are the ACG Moc 3.0. Check them out here. ⬇️ \n\nhttps://t.co/r8YP7gMPKh", "@AE9941 What a great way to start the week! Thanks for sharing and thanks for being a part of the Nike family.", "@HenRoc_ No updates to share at this time regarding no name jerseys. Stay tuned to the app.", "@Cp_747 Thanks for sending over this feedback. We will pass this along to our team.", "@DreStur1987 Sorry, we have no promos to give at this time.", "@LLCoolZaye We love it Zaye! Happy Anniversary, and thanks for being a part of the Nike family.", "@tonyhudginsdc Hi Tony, what size are you after?", "@Jlhoppe18 No updates to share on the Air Trainer 3 at this time. Stay tuned to SNKRS. ⬇️ \n\nhttps://t.co/qHTCT1XENR", "@LThomas28 You are amazing Liz! Keep it up. Let us know when you hit that 200! 💪", "@Ben_Soup Way to go Ben! Way to get after the new year. Thanks for sharing 💪", "@WheeldonCraig Hey Craig! Yes they will work great for grass, and artificial surfaces.", "@theanonymouscof We do not have a comprehensive list of authorized retailers, but if you would like to send over a specific store we are happy to check for you. Check out our Saudi Arabia site here. ⬇️ \n\nhttps://t.co/IxPxnWTrN0", "@theanonymouscof Both of these websites look legit to us. The best way to ensure your Nike items are authentic, is by purchasing directly though us or an authorized retailer.", "@okaleenuh Hi Ally, this jacket is a player exclusive, and is not available to the public.", "@ssc2186 Hi Sarah, we'd be happy to help you find something. Can you tell us some more about what you are looking for, and what size? https://t.co/klmMF0Q8Tn", "@GlennFyvie That's not what we want to hear! Can you tell us some more about where and when you bought them? https://t.co/klmMF0Q8Tn", "@MtsBaruck Hola, encantados. Aunque nos gustaría agradecer tu interés en nuestra marca tenemos que comentarte que actualmente es Nike quién, a través de un equipo en activo, busca a los atletas/equipos para realizar los exponsors. Un saludo.", "@schmee_ivee Absolutely. 🔥", "@80eddiep Thanks for sharing Eddie! Love the Adrian and Julia on the heels.", "@brinaldi209 No word on when the Hyper Grapes will be available in men's sizes. Stay tuned to the upcoming tab in SNKRS for now.\n\nhttps://t.co/AxmPcdbTG6", "@JamesyJ2 After some digging, we can confirm we have no molded 13s at this time. Check out all of our Jordan cleats here. ⬇️ \n\nhttps://t.co/ajM9ewk1Lk", "@cooltonm Thank you! We appreciate you Colton! Thanks for being a part of the Nike family.", "@dsellick No updates to share at this time. Check the upcoming tab in SNKRS. ⬇️ 👀 \n\nhttps://t.co/mBLy63Y7IW", "@seanpwick Hey Sean, they're great for any distance run and should last you up to 500 miles. Get your pair here: https://t.co/XZYfMKhQjt", "@JPriest337 No word on a restock at this time.", "@BurkhartAmy Hey Amy no word on when our Javelin Spikes will be up. Send us a DM, and we can point you in the direction of one of our authorized retailers that currently has them. https://t.co/klmMF0Q8Tn", "@BopsDLC We are sorry to hear that happened! Do you sending over a DM with when and where the coat was purchased? If it was purchased through us, do you mind sending over your NikePlus email?", "@sunoshit Thanks for sending over this feedback! We will pass it along.  No word on if there will be a re-release.", "@freestateron Great work Ryan! Keep it up! Any big races coming up?", "@sid4j That's not what we want Siddarth! Do you mind sending us a DM with when and where these were purchased? Will you also send along your NikePlus email?", "@laurelsudeep Thanks for sending over this feedback. We will pass it along to our Product team.", "@henrikhogstrom2 Hey Henrik, check these out and let us know what you think!\n\nhttps://t.co/00vsyxZQna\n\nhttps://t.co/L3wBsJEyLX\n\nhttps://t.co/4xOzqoMM1Z\n\nhttps://t.co/Ltw0RHtyeg", "@sctr77 That's not what we want to hear! Can you tell us some more in a DM? When and where was the jacket purchased?", "@jennwith2n_s Great work Jenn! Excited to see what you can do this month! 👍", "@pointlessdrew Sorry Eddie, no updates to share at this time. Keep an eye on the app and website. 👀", "@prefactor Hey Greg! Thanks for sending over the feedback. Can you tell us where these shoes were purchased?", "@Confuscion That shoe is no longer available on our site. We recommend checking out our FlyEase shoe's, as they sound perfect for your nephew! Check them out here: https://t.co/hwFVpwdT9D", "@TheOGSophiaB Not to worry, you can't go wrong with the Pegasus 36. 🙌 https://t.co/gAEIMRE8V0", "@TheOGSophiaB Easy. https://t.co/8Gcm7xp1xc", "@LoboDwayne 1 down, 11 to go. Keep up the great work! 💪", "@ssjkay Let's go then. 👀\n\nhttps://t.co/ulwGHiz4nX \n\nhttps://t.co/a9LrxFM0yA", "@JoeyCastro_671 Love it Joey! Is there an event you are training for?", "@kimbobaggins88 That's big time Kim! Thanks for sharing. Sounds like you are going to crush that 10K in May! Don't let up now, just do it 😎 💪", "@yourcatuniverse Hey, no word on if we will bring back the Free RNs, but if you liked the feel of the Free RNs, we think you might love one of these. Let us know what you think!\n\nPegasus\nhttps://t.co/GmRQtNwMiA\n\nOdyssey React\nhttps://t.co/hc96jXY4FG\n\nFlex TR 9\nhttps://t.co/2wdJJtdiyG", "@dbuck_inc Darion your baby boy is adorable! We hire our models through modeling agencies, so we recommend trying to find a local modeling agency near you.  Fingers crossed for you guys!", "@7011patriots Love it! Thanks for sharing, and thanks for being a part of the Nike family.", "@WildFaithFul Best of luck in Indian wells Alan! Let us know how you do. Just do it.", "@AndreC_97 Siamo qui per te. Al momento non è ancora stata annunciata una data di lancio, per essere informato al meglio ti suggeriamo di scaricare la nostra NIKE app, così riceverai notifiche push quando i nuovi prodotti da calcio saranno disponibile per l’acquisto.", "@Broonland You can do it Raphael! Let us know when you get it!", "@juliakuijpers We can confirm that this is not a real account of ours. Thank you for bringing this to our attention.", "@coconutkallan Got you, Kallan!\n\nhttps://t.co/aYoHztvW6p", "Mamba Forever. https://t.co/wIchSUwFM2", "@inluvwitdayoyo First day in the books. ✅ 📚", "@swag_junior Wow, that's quite the week! Since you're looking, we do have the perfect shoes for the grill. 🤷‍♂️ https://t.co/77bLGAdWdC", "@antwerp_runner Welcome to a lifetime of bragging rights! 💪", "@DaRealGladine We love it! What's the go to outfit? 🏋️‍♀️", "@kennethkyrell We think they're the best. Get yours now.😉 https://t.co/ns7OvAgbDc", "@MrsHolmes32 Here's to keeping her legacy alive. Keep inspiring those girls to reach their crazy dreams! ⛹️‍♀️", "@stefiedrew 💪 💪", "@shebmiller Hey, we have a promo code on sale items right now. Enter ALLYOU at checkout and enjoy 20% off clearance items. (Some exclusions apply)\n\nhttps://t.co/UZdAw2FaMV", "@DARYtheKING We appreciate your interest! We proactively reach out to potential athletes to sponsor and don't accept direct requests. Although we are unable to help, we wish you the best of luck in the future!", "@iamUFCpd Love it! Looks like a great morning for a run. Keep it up!", "@Ragnarhusky Great work! Keep it up.", "@aziractive There's no plan for a release in Canada at this time. Keep an eye out on our site for upcoming releases. https://t.co/JpaDH5M323", "@Shaz_iii_daa But you can. 🙌 Get an extra 20% off with code JAN20 now. https://t.co/6rthT2OgZy", "@JJARBS83 Hey Justin, guess what's back? 👀 \n\nhttps://t.co/Ic2AFX3Y9X", "@LeBronRingJames Hey there! We directly reach out to people we wish to sponsor. 👍", "Nike Foundation and @ObamaFoundation have teamed up to build a new home court in #Chicago.\n\nThe recreation facility at the Obama Presidential Center will empower young people and build community through sports. #JustDoIt https://t.co/gxoVACHU5L https://t.co/6xBAbpnFj1", "@RMarcelloJr Burning the pavement up. 🏃‍♀️ 🔥", "@CoachHolmes_J Hey Jordan check these out, and let us know what you think. ⬇️ \n\nNike Pro\nhttps://t.co/HbLk4Hk1yX\n\nCrew Nike Sportswear Club\nhttps://t.co/trRKOSvE9U\n\nCollege Dri-FIT Spotlight (Oregon)\nhttps://t.co/oVfzky3rsM\n\nMen's Sweater College Coach (Oregon)\nhttps://t.co/R6n9UhmkL9", "@annaeveryday 🎵 Everybody knows the name: Nike Internationalist. 🍻\n\nhttps://t.co/U9EwMQVkmM", "@gatorcoach8 Hey Ryan, those are player exclusive gloves made specifically for the Florda baseball team. Check out the Mike Trout batting gloves here. ⬇️ \n\nhttps://t.co/ZCAJEDgjn5", "@KennectedArtWrx We think your dad is ready. https://t.co/MwRvF0D7nA", "@USA_Paralympian Hey Erik, no date to share at this time. We'd suggest keeping an eye on our News page for updates! https://t.co/t7FFpjM1PD", "@monio9 👀 \n\nhttps://t.co/VVcY8tqxEM", "@monio9 We know plenty. 🤷‍♀️ Try them out worry free as a NikePlus member with our no questions asked, and no shipping costs 30-day return policy. https://t.co/5ySTw3ASyH", "@souliergui Ready to take on the New Year! 🎉 What's the goal for 2020?", "@SusanneShartner Hi Susanne, no news to share about the Zoom Pulse at this time. Stay tuned to our feeds and https://t.co/yYv8xSbp4x in your area for any updates!", "@dommyt_1618 We love 'em too!", "@ChezLou812 Anytime! 👌", "@ChezLou812 Hi Cheryl -- you'll both be happy to know we still make the Pegasus! He also has 30 days to test it out and he's able to return them for a full refund if not satisfied. Check 'em out:\n\nhttps://t.co/01XJ4Llu9C", "@linzieballard Listen to your ❤️! https://t.co/eqr4an9fBT", "@lalita8221 You've got good style! We don't have any leather hats at the moment, but check these out for that retro look.  ⬇️ \n\nhttps://t.co/bUixdyrIOj\n\nhttps://t.co/SbHyWPCytO", "@chrisponder74 Way to get out there in winter weather! New year, new shoes?", "@robertgormley82 The Infinity Run was available to select members via early access today. Keep an eye out for them to be on the app and our site later this month. 👀", "@mh_bowers Hey Mary, we do have some sizes and colors still available! With that said, there's no word on other sizes restocking at this time. Check out whats available here: https://t.co/lpjsQaN53O", "@georgeowusu2 Stay tuned to your email inbox for updates on your order. If you don't see an update by the end of the week give us a call. Tel: 800.806.6453 (4am-11pm PT, every day)", "@Chelpac33 Outfit game strong. Good luck in the half-marathon! Let us know how it goes. 🏃‍♀️ 💨", "@2009diglennzo Those are the Jordan 4 Retro 'Black/Red' (308497-060). This was a popular style, and have since sold out. Shop all of our AJ4 colorways available here: https://t.co/weIeZ68CO6", "@rella2016 Hey Rella! This is the Air Max 270 React. This specific colorway is sold out, but check out another great one on our site:\n\nhttps://t.co/aT8nararte", "@mltnurmouth That's not a colorway we've produced of the Air Max Plus. You can shop an available style here: https://t.co/WOTE1GfIco", "@JGJMU20 Hey Jonathan, no word to share about a restock of the Zoom Pulse on our site or in Nike stores. Stay tuned for any updates! https://t.co/yD9dXwOvzO", "@MauriziozB Ciao, lieti di rispondere, Maurizio. T'invitiamo a contattare la nostra assistenza al numero 02-38591453 munito di numero d'ordine ricevuto alla conferma e ricevuta del ritiro da parte di SDA.", "@RicksonBovolin Lookin' sharp. 😎", "Just a kid from Akron, building a legacy that extends far beyond the basketball court. #JustDoIt https://t.co/kTtmFQGDdi", "@dowereallylive Nothing to share about the Zoom Pulse becoming available in your area. Keep an eye on https://t.co/yYv8xRTNFX for any potential news!", "@sahanaj Spinning to the finish line like... https://t.co/ibsQq52s7q", "@Keystone80435 Shop all the gear now! https://t.co/jLwbdlJjdk", "@seguraerika Hola Erika, encantados. Al tratarse de un modelo de campañas anteriores ya no se encuentra disponible, de todos modos te dejamos aquí un link con los modelos con tecnología Zoom disponibles. Te esperamos.\nhttps://t.co/XH4es2Jl5c", "@beccuuhh_ Hi Becca, nothing to share about our authorized retailers carrying the Zoom Pulse. Keep it 🔒 to https://t.co/yYv8xSbp4x for any restock updates!", "@cNeezy814 They released in unisex sizing and there are still some sizes left. Head to our site to check them out: https://t.co/4UbzVz7Bj6", "@welcometobigbro Hey, no word on a restock date, but keep it locked to https://t.co/yYv8xSbp4x for any possible news!", "@frannrueda !!!!!!! Tiempazo Fran 3´45´´👊👊👊!!!!!!! Y el domingo a volar por esa Málaga bonita 😉👍. Mucha suerte!!", "@Alfonsiawarrior We hear you, life happens! Re-doing the past week of your training plan isn't currently a feature though. We know you'll crush this week! 💪", "@arielle_ship They say stepping in 💩 is good luck. Guess that 🌶️ luck came earlier. 😎", "@LRobert420 Hey Robert, there's no plan to restock at this time. Keep it locked to https://t.co/yYv8xSbp4x for updates.", "@BaseballMurse7 They're dropping on 12.13! Stay locked to our site to grab your pair. 👀 \n\nhttps://t.co/QEuAsFkzVD", "@itszayyy You'll have your chance to get them on 12.13 at 10 a.m. EST! Get ready to cop on our site. 👨‍⚕️ https://t.co/3CxWYbfi8O", "@Ctmcgove We've got an update for you, Collin! The Zoom Pulse will be available on 12.13 at 10 a.m. EST. 👨‍⚕️ \n\nGet ready to purchase here: https://t.co/2UPBphHqOe", "@SamanthDoherty Dreams of fresh Air. 🐶", "@KeniaFlo ⬇️ 👀 \nhttps://t.co/1OYSVwpjzm", "@ChrisAtkins23 Update: the Zoom Pulse shoe will drop 12/13 at 10am ET on the Nike app and website.  ⬇️ \n\nhttps://t.co/WgoFAtPuXE", "@KeniaFlo Update: the Zoom Pulse shoe will drop 12/13 at 10am ET on the Nike app and website.", "@JanetMMasters Hey Janet, they're dropping on our site on 12.13. Stay tuned! 👀 \n\nhttps://t.co/inM2u3c8M8", "@KeniaFlo Sorry for the confusion. The Doernbecher Zoom Pulses released on the 7th.  The Zoom Pulses are still releasing in a few days from now.  Check out the current selection of the Doernbecher Zoom Pulses here. ⬇️ \n\nhttps://t.co/VlWre8cCJk", "Launching February 1, 2020, the Nike Victory Swim Collection brings performance innovation to modest swimwear. https://t.co/SjoahQA8Rz", "@inkedupdrummer Hey Travis, no plans to restock those colorways. Stay locked to our site for a wider release of the Zoom Pulse coming soon! \n\nhttps://t.co/KSIH0fng9T", "@ChrisAtkins23 Sorry for the confusion. The Doernbecher Zoom Pulses released on the 7th.  The Zoom Pulses are still releasing in a few days from now.  Check out the current selection of the Doernbecher Zoom Pulses here. ⬇️ \n\nhttps://t.co/k3BCKt4SD1", "@ashfife8 Hi Ashley, we are sorry, we searched all of our authorized retailers, and we weren't able to find any pairs of this shoe in your daughter's size.  Check out the new Kyrie 6 here, it is also customizable so your daughter can create her own. ⬇️ \n\nhttps://t.co/ZzGQ7kq8hx", "@OldCriedPants Hey there, coming soon! Sign up to notified when they drop on our site. 🔥 \n\nhttps://t.co/ky7G2w5NMg", "@sdav08 Hey Steve! Two colorways created with the Doernbecher Freestyle Program released on our site yesterday in limited quantities and have since sold out. A wider release of the shoe is coming to our site later this month; sign up to be notified!\n\nhttps://t.co/xUEVPpSKeS", "@JessKou We got you! Check out the current selection below. ⬇️ \n\nhttps://t.co/aGp06Cyot2", "@yaujess Boo! https://t.co/tqKkJuKMyc", "@smashley2495 Our Doernbecher collection dropped on our site today and still has some sizes available. Other colorways are scheduled to release later this month. Head to our site to view the collection! https://t.co/1IodXZy05x", "@mallon_samantha Our Doernbecher collection dropped on our site today and still has some sizes available. Other colorways are scheduled to release later this month. Head to our site to view the collection! https://t.co/YJr9ixPEO8", "@amyheybrock They're scheduled to be available later this month. Keep it locked to our site for updates.", "@SamanthaBilsky6 Our Doernbecher collection dropped on our site today and still has some sizes available. Other colorways are scheduled to release later this month. Head to our site to view the collection! https://t.co/c3ZN0qsuVN", "@cjamesr62 Our Doernbecher collection dropped on our site and still has some sizes available, while other colorways are releasing later this month. Head to our site to view the collection! https://t.co/nzyBzQ4Fb0", "@kingsleyking29 The Doernbecher collection still has some sizes available while other colorways are releasing later this month. Head to our site to see if your size is still available! https://t.co/GgevaFN43l", "@Kopite1908 The Doernbecher collection still has some sizes available while other colorways are releasing later this month. Head to our site to see if your size is still available! https://t.co/DpuBdMJDNK", "@thejojophoto There's still some sizes available in our Doernbecher collection that launched today! Check them out here: https://t.co/yGXOTSMBRX", "@wesleywhamond Cozy season is in full effect. 🔥 ☁️", "@angel_alvarez23 No set launch for the entire collection, however, there are 6 colorways of the Zoom Pulse launching today on https://t.co/a8F24puLBS at 8am. As a part of this partnership, all profits will be donated to Doernbecher Hospital. Peek here for more info! 👨‍⚕️\n\nhttps://t.co/TRMlBAQAah", "@JoyceTivis You are inspiring us Joyce! Best of luck on your surgery. You have our support.", "@IndoChimps That's not what we want to hear, can you DM us your order number and NikePlus email?", "@imani_westcoast Hey there! At this time, we don't have a service to donate footwear. We would recommend going to local donation centers in your area. We wish you and your charity the best of luck and admire you supporting your community!", "@idgafath No word on a restock right now, but we've got some customization options coming soon! Check 'em out: https://t.co/mZI42ZxxYN", "@JoeyCastro_671 No excuses, only results. Keep stacking up those miles. 💪", "@WashingtonDonny Nothing to share currently, Donny. Stay tuned!", "@David55780246 Working on figuring out which shoes those are.  In the meantime, what size are you and what did you like about these?", "@Leticia_S_Marin Of course 😎 👍", "@OhMyGourde That's not what we like to hear. Can you tell us more about what happened?", "@_daytoy All black tho? 👀 https://t.co/o0jecgw1nH", "RT @trvisXX: CACTUS JACK COURT COMING SOON !!\nFROM ME AND @NIKE FOR THE KIDS AND\nTHE CITY !!! ALL FOR HOUSTON #ALLFOR1 https://t.co/1PA7Hhg…", "@giannafreni Hey Gianna, there's no word on an online restock at this time. With that said, it looks like Nike Lynnfield may have one available in your size. We recommend giving them a call to confirm availability. 781.334.2341", "@tapi_b We recommend these SFB 2 Boots! They're a highly durable boot with an internal rock-shield that prevents punctures. Check em' out below and let us know your thoughts. 👇 \n\nhttps://t.co/dNnQaQ9sLP", "@srbpower Hey Dan! Those are the AF1 LV8 'Day of the Dead' (CT1138-100). They were a popular style when they launched back in October, and are no longer available for purchase in your area. You can find all of our Air Force 1 styles on our site here: https://t.co/osmiUrksPY", "@DiaRuShHam Being that the shoes were purchased at Champs you will need to reach out to them for your best return policy options.", "@dramatizei Anytime 😎 🤜 🤛", "@DiaRuShHam That's not what we want to hear. Can you tell us some more about what activities you were doing in your shoes, and where you purchased them?", "@pateman_batrick Of course! 💪", "@pateman_batrick Apologies for the confusion, let's have you give us a call here for more info: +44 (0) 2076604453 (8:00–20:00 Monday–Friday and 8:00–17:00 Saturday)", "@pateman_batrick Hi, to clarify are you trying to purchase a single shoe? Not a pair of shoes?", "@LaloChacon Bravo Lalo!!! Nos alegra verte siempre sumando km!! Que nada te detenga 👊😉.", "@ThelmzN No date to share yet! Coming soon. 👀 \n\nhttps://t.co/vMY5hpuc1R", "@BelichicksHood We found their long-lost twin! Let us know what you think. https://t.co/rcoyw5vPPv", "@mmRiaaa3 Say no more! We got you 💁: https://t.co/LIUEzikTUh", "@RichardKing3170 Keep an eye out on our site, so you can grab them! https://t.co/qeWgql0Tgj", "@Maverick2405 Beautiful 😍 now what other swag do you need to wear with those? ⬇️ \n\nhttps://t.co/dKVBIfDNXf", "@berrydelicious Anytime Joci 💪", "@mckenna__yob Hi Mckenna, we outsource all of our models from modeling agencies.  If someone is interested in doing modeling for us, we suggest they get in contact with a local modeling agency and go from there.", "@abbieeh87 That's not what we want to hear.  When and where did you purchase the shoes? Can you please send us a picture of the shoes?", "@ShelGillespie Thanks for the shout out Michelle, always here to help!", "@kaysay11b Hey Casey, here is our full Nike FlyEase collection! Let us know if this is what you were looking for. 👍\n\nhttps://t.co/u28tX3QWS0", "@Phuzakie Currently, that hoodie is only available as a team exclusive. However, here's a similar style to keep you geared for the rest of the season! 🏈 \n\nhttps://t.co/0Ly9oakqu4", "@SGhorafi Those are the Off-White x Air Force 1s, originally released in 2017, they are no longer available. Be sure to check out the SNEAKRS app so you never miss out on a launch like these. 👇 \n\nhttps://t.co/bAtS6LxtG6", "@JayRimmer10 Hey Jay, the site is experiencing a lot of traffic currently because of the Barry Sanders Air Zoom Jet release.  Our team is working on it and it should be back to normal very soon.", "@Rodrymcf Whoops thank you, we'll get that passed along to the appropriate team.", "@shaudxoxo 👀\n\nhttps://t.co/q4p6wUPB0q", "What carries you can change the game. Who carries you can change the world. #JustDoIt https://t.co/1vuruYb0hj", "@AJHYPENY Can't go wrong with copping both colorways 💪", "@LuDaGreat Thoughts on these 97s? 👀\n\nhttps://t.co/cOvc7Jhach", "@lilly40294912 That's not what we like to see. Can you let us know where you purchased the shoes from, so we can better discuss possible options for you?", "@AmandaKeaneTV Hi, Amanda. That's not what we like to hear. DM us where and when you purchased those shoes, and we'll look at your options. If you bought them online, DM us the order number. https://t.co/klmMF0Q8Tn", "@stephenbrownnnn No news on that re-stock but keep it locked here for the latest releases. \nhttps://t.co/BABPzVc8HZ", "@stephenbrownnnn Hey, Stephen. We found that those joggers are out of stock, but we found a similar pair for you. Let us know what you think of the Nike Phenom Pants.\nhttps://t.co/eC1yHh0Y2e", "@Hannah______x Hey Hannah, being a NikePlus member is free. Learn all you need to know on our site and welcome to the family! https://t.co/TewWQ5slny", "@larryportaro Champions aren't born, they're made. Your journey is proof of this. Let's go for another 3000 miles. 💪 https://t.co/Ei0B7X08jz", "@chapshots Path of greatness ahead and with a nice view to boot. https://t.co/IWxbA9b4bN", "@Blessing_TSG We simply provide the tools. The hard work and dedication is all you. Yes...you! https://t.co/eAkQfRZ8qn", "@HighOctane_Buzz Winter might not be so cold after all. 🔥", "@tink_melanin It's on our site! Be sure to share a photo when you cop. 😍 https://t.co/0ahSSLSuyP", "@naji_aldajani Starting off those FriYAY vibes right. Let's keep it going. https://t.co/czAu7x1FTn", "@lebolger Four weeks in a row and still going strong. Dare to go for a fifth? https://t.co/3I7l4bJqKq", "@gbarrett123 No excuses on the path to greatness. 🚀", "@Nrozco That fit tho? Sheesh. 🔥", "@Joaopedrostan1 It's the purrfect size. 🐱", "@vieramirez Victoria, ¿puedes visualizar la carrera en tu actividad del Apple Watch? Un saludo https://t.co/klmMF0Q8Tn", "@comeonnowhoney Hey Bonnie, they'll be available for $120 USD. Keep it locked to our site for availability and in the meantime, learn more about the shoes here: https://t.co/Kc2kyyoJES", "@DomanickD The Air Zoom Pulse will be available in December! Read more on our site here: https://t.co/om3uRRgm1v", "@afarina6 Sounds like the Element 3.0 running top is what you need! https://t.co/N3bODBaYzi", "@afarina6 Hey Anthony, that looks like an older version of our AeroLayer Running Jacket. Check out a newer one on our site here! https://t.co/ZmIG3lenVd", "@Sarj007 It's like you never stopped. 💪", "@corinpoppet They'll be $120 USD. Learn more about the shoes on our site. 🩺 https://t.co/dP3IFCgK1V", "@KeenanHaugen They'll be unisex! Be sure to share a pic when you cop your pair in December. Read more here: https://t.co/6wSrTuxAB1", "@erecher Hey Eric, stay tuned to https://t.co/yYv8xSbp4x for all upcoming details regarding the Air Zoom Pulse! In the meantime, you can read more about it here: https://t.co/OfOb1D1IJM", "@_stephencurrie It's the real deal, Stephen. Don't sweat it, you'll have another chance to cop 12.14 at 7a ET. https://t.co/gD9NTALDLq", "@KSweat6 Those released back in 2017 and aren't on our site anymore, but we've got plenty to keep you dry this winter. ❄️ \n\nhttps://t.co/RRVw26JHGO", "@astak9 Dit is natuurlijk niet de bedoeling. Hiervoor adviseren wij je rechtstreeks contact op te nemen via de volgende pagina, zodat we je direct verder kunnen assisteren | https://t.co/GCUzEssUSS of op het volgende telefoonnummer: +31207219453", "@caseymaeknox Hey Casey, we have some that you may like! Keep it locked to our site as new styles may drop. 🌡️ https://t.co/jcQqlWaXQn", "@HB_FNBR Let's see 'em take these! https://t.co/fcl03l6twv", "@vikram94shekhar Let's get it, Vikram! It's never easy, but it's always worth it! https://t.co/WRFULCzt0C", "@slimxronald 👀\nhttps://t.co/42jDLuXDBi", "@lau_mcmuffin Hola, ¿podrías enviar un privado especificando tu correo electrónico registrado con nosotros?Quedamos a la espera. Un saludo. https://t.co/klmMF0Q8Tn", "@johnmlpr30 It may not be called that, but we all know who the Monarch is for. 👨 https://t.co/39GnY0PmB6", "@carolaprato Hola Carolina. Para poder revisar tu caso, ¿puedes facilitarnos, mediante un mensaje privado, tu correo electrónico registrado? Te esperamos. https://t.co/klmMF0Q8Tn", "Winners compete for themselves, heroes do it for much more. #justdoit https://t.co/i1imhOxzgG", "@lrocks09 Hey Lorna, it reopens 11.14. Let us know what you cop when you go! 🥳", "@Bito_Roberto Killing it with on the 3rd time. Are we going for number four? 💪", "@LCoelho9 Welcome back, let's get it! 💪", "@TnT_Craderrr The Nike SB Dunk Lo \"Night of Mischief\" is exclusively available at local skate shops. Check out our skate shop locator here: https://t.co/fyDf0tdpbs", "@andyacr The picture is plenty clear for us, Andy. 👀 \n\nhttps://t.co/bgOt0mXquw", "@Bodnax The Nike SB Dunk Lo \"Night of Mischief\" is exclusively available at local skate shops. Check out our skate shop locator here: https://t.co/6AEQpfGTLd", "@GageElijah3 Hey Gage, sorry to hear your shoes didn't come as expected. Know that any purchase from us can be returned within 30 days for a full refund. DM us your order number and NikePlus email and we can get started on the process for you.", "@shanejurgo We've got you covered, Shane. 🙌 https://t.co/LyHke5XHqA", "@monster_queen16 Those are the NSW Woven Shorts (AR2382). We weren't able to track down that specific colorway, but we do have a few others on our site here: https://t.co/SqCxCfsOko", "@aedelano The bounce is back! Cop Shox here: https://t.co/wYJtKUkfTp", "@SpoiledRSbaby Those look like our Nike Free Run+ 3, style code 510643-702. They were released in 2012 and are no longer available on our site. You can check out the new Free Rn here: https://t.co/XRXiHbVQ77", "@RiosStepahanie Hi Stepahanie, it looks like the Huarache Run Ultra (819151-011) is no longer available for purchase. Have you checked out the Air Huarache? It has a similar look and feel as the Ultra, and it's available in your size! Check it out: https://t.co/YGDk5WT2as", "@JJ__757 They're currently set to drop on 10.25. You'll be able to cop here. 💀⬇️ https://t.co/SCSim5Mol2", "@EdeX57222676 Let's pull in our friends @nikestore to take a look. 👍", "@paulex78 Air 💨 + Force 🖐️ = Fun 😃", "@michuabs Our friends over at @nikestore can help you with this. 👍", "@Shan_Jones_ We have plenty of non-pink colored shoes available. Go to the link and sort by your favorite color on the left to find em': https://t.co/4btxzHqmY7", "@antdwg1967 🧢 ✔️\n👕✔️\n👖✔️\n👟✔️", "@DeNovo09 Keep on, keepin on! 💪", "@markischarles Adding a personal logo isn't an option at this time, however, you can add text and choose your own unique colors with Nike By You here: https://t.co/TKttykbeMl", "@markischarles You can never go wrong with the Pegasus 36. It's comfortable, has perforations for cooling and provides a smooth and responsive ride. 🙌https://t.co/DnFZvUJT4G", "@Strech_1986 Well done, Rick! 10 next week? 👀", "@cecilia_jessyka Nothing beats the classics. 😍", "@back_up10 Legend from the turf to the street. Welcome to the club! 👌", "@CM0042 Look no further. 👊 | https://t.co/IyH3ioOEU7", "@bradwipert Hey Brad, no word at this time about those becoming available for purchase. We'd suggest keeping an eye on our site for any updates! | https://t.co/eB2SbgUaC9", "@Dylaaan_D Throwback, and it's not even Thursday. ✊\n\nWe passed your suggestion along to our team.", "@mics346 Rep your city, no matter where you are. 😎 🔥", "@Yes_iHoop14 No better way to start your special day than with some frosty new kicks. 😎 Have a good birthday, Kimmy.", "@wperezm Hola, encantados. Te vamos a dejar un link desde el que te recomendamos contactarnos y de este modo podemos revisar contigo que ha podido ocurrir. Te esperamos. \nhttps://t.co/sfc3L7XsEp", "@freyanch Time to lace up and make some heads turn. 🔥 🌶️", "@Kym_Nichole If it was easy, everybody would do it. Keep pushin' the pace. 👊", "Leave them chasing. Again.\n⠀\nLawrence Cherono sprints to the finish in a tight competition on the streets of Chicago. Finishing with a time of 2:05:45, Lawrence is once again second to none. #justdoit #chicagomarathon https://t.co/0wl0GfE0qw", "@AbbeWright 🐋🐋🐋", "@2Kallday13 Why not create your own? https://t.co/f7N5xFjun4", "If it hasn’t been done before, it’s yours to claim.\n\nBrigid Kosgei becomes the fastest woman in history to run 26.2 miles with a time of 2:14:04. Congrats on your World Record and second consecutive victory at the Bank of America Chicago Marathon. #justdoit #chicagomarathon https://t.co/7wQYJvCRWx", "@ilykathyxo Look no further, Katherine. 😏 https://t.co/3CSrj9S6k8", "“I run to prove to any human in this universe that there are no limitations.” @EliudKipchoge \n\nA crazy dream come true — Eliud Kipchoge becomes the world’s first to run a marathon in under two hours. #justdoit https://t.co/12mVz1wbpd", "@Outsideacircus Gone, but never forgotten! Find out more about our Nike Grind program here: https://t.co/WqZKKO8DKY\n\nIf you're looking to upgrade, check out our Pegasus 36 here: https://t.co/nOkRNuE3gA", "@Acee626 The W of all W's! Congrats 👶.", "@lopsster Breaking records? No problem. https://t.co/4pJCMGh6sx", "@shellcain3 We've got you covered, Shelley! Check out our selection of USWNT 4 Star Jerseys ⬇️. If you don't see the size you're looking for, stay tuned for a possible restock.\n\nMen's: https://t.co/RdKAX6IUBP\nWomen's: https://t.co/ddpfsF5baM", "@drimanphd Hey Iman, let's get you suited up! We have the Air Satin Jacket in Echo Pink available here: https://t.co/UzXfyDLLIL\n\nWe also have the Air Legging in a few other colorways, check em' out here: https://t.co/ZyqTu511vz", "@garymheffernan Nothing to share as of now, but keep your eyes on our NikeNews page for any updates: https://t.co/kSzJjQdYtf", "@TomZajaczkowski Your best bet is to work back with the original retailer. If they aren't able to help, our team is ready to help keep your season going at +44 (0) 2076604453 (8:00 - 20:00 Mon - Fri, 8:00 - 17:00 Sat).", "@SarahBuice Sounds like it's time for a new pair. 🤙 https://t.co/VMdEXtT3YU", "@Mr_Mouzaoui From start to finish, we'll be along for every step of the way! 🌲👻", "@amoreSTEPH While we don't have a cleaning service, check out our cleaning instructions to keep em' fresh and clean. | https://t.co/jhw4cS71Tk", "@chapshots Serving up some KMs with a view on the side! 🏃‍♂️💨", "@JoseEnriqueMP ScAIRy stuff. ☠️", "@CervanteSergio It's always better running with friends! 🐶🐶", "@SebShawMusic Totally fine by us!", "@leesmileyman We 👀 you stepping up your game! Way to get after it. 💪", "@sharlaforreal Hey Sharla, we have Master Trainers from across the globe. Head on over to the NTC app to learn more: https://t.co/Qxu6kHXYob", "@RICKMORRIS3 😸", "@Bood_FM Great minds think alike. Couple goals. 👟 🔥", "@Pdao8 You got this in the 🎒. Let us know how the progress goes, Peter. 💪", "@inasuc The motor on those motorcycles doesn't compare to the ones on your feet. Keep burning that rubber. 💪 https://t.co/fl4dWitOeV", "@omtcrake This much 🔥 should come with a warning: 'Might cause momentary blindness'. 😎", "@cynthiaxsarkis Which one can you use to hang around, exercise, sleep and most importantly, is more comfortable? 😉 https://t.co/FgDKOnS1om", "@ShowtimeShann 👊", "@ChadRuffinMD Those are spicy. Be careful not to burn the hardwood floor. 🌶️ 🔥", "@arielle_ship We'll see you on the pitch.💙😍", "@AE9941 Breaking waves and strong runs. Looks like there's a new Poseidon crashing the water.  🌊 🔱", "@GiantSoundLLC Glad to hear you like'em. Keep tearing it up and remember, the skills all you. 💪 😎", "@joevankas Getting stronger every week. Nicely done! https://t.co/w3mW3Vvqse", "@TasMelas That colorway of the Zoom Freak 1 will release at a later date, Tas. Keep an eye out here for the latest updates: https://t.co/8im4emzlG8", "@ASassyWomanMEd No better feeling. 💁‍♀️", "@kinleygene Setbacks make for the greatest comebacks. Let's get it! 🙌", "@DedrickWelch For some it's exercise, for you it's a lifestyle! https://t.co/rIFVoNTp6T", "@a_aron1100 Bet.", "@Marnell_good No word on that colorway dropping. We can't guarantee you will posterize anyone, but the Shox BB4 is back in the original Metallic Silver colorway.\n\nhttps://t.co/P4yQgvAVae", "@D_advantage Wednesday outfit's on point, Sam.  😎", "@CashNastyGaming No problem, Cash. Yeet!", "@desireetornell En este caso te recomendamos escribirnos de vuelta al mismo email y explicarnos cual ha sido la respuesta que la empresa de reparto te dijo y de este modo podemos revisar el caso contigo. Te esperamos.", "@warrenjwric Way to persevere and push through, James! Good luck with the training. 👍", "@CT_fit Now that's what we call a 'treat yo' self' day. 😉", "@krististrang The Force is Female. 💪", "@homoopinionated You ask, we deliver. Check out those pink Flex Stride 5 lined running shorts below.\n\nhttps://t.co/J9fr8Y24Ql", "@LadyLondon82 Nothing like an accountability partner. 🤷‍♀️", "@Phxrxoh No better time to grab 'em than when they're on sale. 🙌 https://t.co/i6rGc9w1Ah", "@andyacr That colorway isn't currently available on our site. Keep it locked to the link provided previously for updates on new styles.", "@andyacr You have a good eye! Get a similar colorway here: https://t.co/3VjLHYy0as", "@andyacr Hey Andy, the top look's pretty similar to the NikeCourt Challenger top. Get it here: https://t.co/7XTARlly09", "@BigTanelly Let's get it Nelly! You crushed that 100th run in style! https://t.co/ST4fPuKsQv", "@Mr_Miller1 Happy birthday, Kaidyn! Always looking fresh. 😎", "@Dfly1990 You cop?", "@Dfly1990 Right here. https://t.co/FnvT56WHdH", "@Kassa2x They're still here + on sale. 🙌 https://t.co/3Nfu3R3U92", "@vkrysh12 5k tomorrow? 👊", "@BlackkingV Smash is an understatement!\n\nHere's a visual representation of your next 5k result. https://t.co/RdJo6mM4vu", "@rotimi_dada We 👀 you, Rotimi. Way to crush that run! https://t.co/YbZRJXFjF3", "@jaklynelisabeth Oh, they work. 🤹‍♀️ Try 'em worry free as a NikePlus member — you have 30 days to return them if we're wrong. https://t.co/FAjAC2zmkv", "@laurmileys Of course we can... once you purchase them: https://t.co/sv3lNa2lMR", "@keatonguess Taking the Joyride's to new heights! What's next? 🚀🌑", "@SharmaIsland Have your pick, Avinash. 😏 https://t.co/jzMTd6c7Rr", "@ricardorod5 Una vez borradas de tu historial, tus carreras son irrecuperables. De igual forma vamos a revisar en nuestro sistema e intentar ayudarte. ¿Puedes, por favor, facilitarnos a través de mensaje privado, tu correo electrónico registrado con nosotros? Te esperamos. https://t.co/klmMF17JKV", "@AaronLutz08 6000 miles and your birthday? We have a lot to celebrate! 🏃‍♂️🎂", "@Angelus13AOV Be careful not to leave any burn tracks when walking with that 🔥 😎.", "@renada_l We're not sure that is does. 😁", "@SunilSharmaUK Good tunes to go with that winners' attitude. Keep on crushing those runs. https://t.co/8YOlunvHmv", "@win_44 5008 miles of sweat, hard work and dedication. Ready to go for another 5000 miles? 💪 https://t.co/f9g0EPut2J", "@run_lela Happy Birthday Lela! Way to start off your birthday strong! https://t.co/JIh2zQyjz0", "@Kasaskeris Shoot your shot! ⛹️‍♀️ \nhttps://t.co/TsGb0OO6DV", "@Kasaskeris Your canvas awaits. 🎨 \nhttps://t.co/ffjEtFan6p", "“Your dream starts as a kid. You get older and your aspirations grow, because you believe you can do it.” -@RafaelNadal \n⠀\nRafa wins his 19th major. One shy of tying the all-time record. #justdoit https://t.co/j2f5FDLH4X", "@joevankas People were eating your dust for brunch today! Get it! https://t.co/viKBRsqxFH", "@Madeeha_Syed How could you pass it up? 💜 https://t.co/HHo0mmVq2R", "@amyellemily You're not the only one, Amy. Shop the collection here. 🙌 https://t.co/YnKE8fKwDL", "@MelissaBuntcake Look no further. | https://t.co/NVhaf643Ke", "Call her dreams crazy, but history will forever call her champion.\n\nCongrats @Bandreescu_ on your first major title. #justdoit https://t.co/xYNJxQr7Ag", "@TeamRW_ Freakishly good. See for yourself: https://t.co/FJyn9P6h3N", "@blucorsa Imagine how they feel on the go. 🏃‍♂️🔮", "@JimHoward34 We can see why!🔥🎨 You've got some grails in the background too.👀", "@joy_saragosa Welcome to the force!👊🎉😍", "“It’s been an honor to be a part of such a great company for the last 18 years. And to know that a building with my name will reside on campus — it’s truly an honor, and I feel truly special.” - @KingJames", "@Markito_Suave No better time than now. 🤷‍♂️ https://t.co/KU3ZFrLvYC", "@justrayven Here are the options we currently have, Rae: https://t.co/4ZrJ9Q3jZU", "@Libbyj2006 Yes indeed, Libby! Please call 800.344.6453 (7a–4p PT, M-F) for more info on our One Shoe Bank program.", "@KenyattaRooks Hey Kenyatta, it may be sold out, but you can get notified of new drops here. | https://t.co/0c6m1a2ICP", "@gina_parcesepe 7 years? We couldn't tell!😉 Here's to another 7!🙌", "@geminikk Flying through air. ✅\nWalking on Air. ✅", "@ClonyDungyXL1 Here to help. Select teams were designed for the Pegasus 36. Shop them here: https://t.co/zq8oWoQAYg", "@Zuziliciouscake Sweet trainers. 😎\n\nHappy birthday, Frank!", "@Caitlyn_Brown1 Ask and you shall receive. Do these fit your style?\n\nHat: https://t.co/U8uVKDCaEm\n\nSlides: https://t.co/FenXMJ0GgK", "@clarry_1 The ball is in your court now. 🏀 https://t.co/Dwthv6vkOb", "@_BTanner_ Way to go, Ben! What goals are you chasing down next month? 🏅🏃‍♂️", "@xxcharlyy We're sold out of the HyperAdapt 1.0, but our next step towards the future is coming real soon. \n\nMeet the Nike Adapt Huarache. https://t.co/3k7gt2A57e", "@iRUNfarr Anywhere from 300-500 miles, Troy. Let us know how they felt after the first test drive! https://t.co/upHYAmYZVF", "@bbournival Fresh air is always needed, Brad!", "@hotscarvey45 Hey Scott, time to feel young again. https://t.co/VEuNMYKFoz", "@bigblac85 First of many. Welcome to the club, John. 🏕️", "@batebr01 You owned that run. Keep going, Bryan! 👊", "@actionjaxon666 Hey Shaun, the Adapt BB's released earlier this year. There is no news on a restock at this time, so keep it locked to our site for future updates.", "@Nakanari It's up now! 🌵 https://t.co/3VEHMNb6My", "@Selu16GBT Huau, 4´33´´tiempazo José Luis!! No dejes de enseñarnos tu progresión y a por el resto de la semana!!!😉👊", "@ChineduOgu Still a good boy. 🐶", "@alyssajoye We'll take on the first day together.🍎 Let the adventure begin! 🦄", "@Caits_take Hey Caitlin — we know how hard goodbyes are, but let's get you in a pair that you'll love just as much for years to come.\n\nhttps://t.co/oSXKs3R5ow", "@IRIS18KGOLD We're sorry to hear about your experience. Please give our corporate number a call tomorrow. Tel: 800.344.6453 (7am-4pm PT, M-F)", "@vanuaryear The bag isn't big enough for a basketball but is perfect for the other essentials. 🙌 https://t.co/eLa1IQHf5y", "@HopeOrtego Easy flex. 🔥", "@kamaumos30 We see why. Keep getting that 🔥, Kam. 👍", "@cleeut We'll see you out there one day, Chris. 🏃‍♂️", "@Jack03Capu Welcome to the family. 🙌", "@VarmaKarma10S Never stop chasing those crazy dreams. 🌠", "“I want to make sure that they’re growing up in a world better than the one we are currently living in.” - @KobeBryant \nJoin us at: https://t.co/IgoKWjV5h7 #justdoit #madetoplay https://t.co/aIpSFPAcEs", "@MarkKLamont Hey Mark, thanks for bringing this to our attention. The prices on our site are current, so we will be sure to alert the appropriate team.", "@Ant1sdope Welcome to the club! 🏕️ https://t.co/B5jtW6RQKH", "@franki8701 We're happy to hear your interest for the Nike Adventure Club! At this time, it's only available in the U.S., but we will let our team know there is an interest for availability in other regions.", "@JadaGomez Can confirm.", "@JadaGomez Almost forgot the most important part. 😅🔥 https://t.co/r6nVs2Myd3", "@HernanSiano Hola Hernan, en este caso", "@BentonKorth1 We've retired some of our social accounts, so we can better focus on serving customers. For help with all things Nike, be sure to follow @teamnike and hit us up there, or reach out to the store directly for whatever you might need.", "@JadaGomez Servin' up the heat here. 🎾 https://t.co/QrYUHa4iBi", "@RoyJonesy Oh geez-louise! Welcome to the club little dude. 🌎", "@Dnt_Trip_Crip We're extremely sorry to see that. We recommend only cleaning your shoes by hand, and suggest avoiding using harsh materials. If you need to clean your shoes, warm water and a small amount of material friendly soap should do the trick.", "@8inarow2togo Let him know that his pals here at Nike have his back. The Air Max design on the tongue is intended to look that way. The \"r\" &amp; \"m\" are connected. More images can be seen below. https://t.co/z3fH30aoQC", "@geisharu Hola, encantados. ¿Nos podrías decir en qué país te gustaría realizar la compra y revisamos opciones? Un saludo.", "@JavierCaireta Vaya Javier, lamentamos ver eso. En este caso tienes que volver a la tienda original donde realizaste la compra, en caso que ellos no puedan ayudar solo comentanos. Un saludo.", "@Rsaint03 We just provided the tools. The work and dedication was all you. https://t.co/T3FPTjEIpO", "@Billyxswfc Fine. 🍪🍪", "@Billyxswfc That's some serious air. 💨 \nHere's your prize. 🍪", "@BarneyGumbo Try flipping it, Barney.", "@amirraphael7 🤝", "@amirraphael7 The classics, you say?\n\n⚪👈 or 👉⚫\n\nhttps://t.co/g6xvdmIQWN", "@TazThornton Hey, Taz. We appreciate the love. Enjoy the Metcons. 👟", "@scottschwef Every stride gets you closer to your goal! 🏃‍♂️💨", "@AyeTeeMack We got just the shoe for you. 😍 https://t.co/IMh7TzExls", "@JWLewinstein That won't be a problem with our new sneaker club! Sign up now. 🥳 https://t.co/60N0mMLIGD", "@RyleyKushing We feel the same way about you! Congrats on hitting 1000+ milestones! 🙌", "@naji_aldajani Way to crush that 10K! https://t.co/PzT3MEJg2c", "@seguraerika Erika, si quieres, puedes enviarnos un mensaje privado y así te ayudamos. https://t.co/klmMF0Q8Tn", "@BryanStrasberg Show up and put up! Keep grinding, Bryan! 👊", "@fork_knife @NikeNYC 👀 🤸‍♀️ 🎢", "@LxrdInAGen We were afraid that he'd try to steal our formula.", "@iRUNfarr Hey Troy, while we don't have that specific style available anymore, we think you'll like the Flex Experience RN 8. Check it out on our site here: https://t.co/RjoG3EtF6i", "@jimmy415sfc We've retired some of our social accounts, so we can better focus on serving customers. For help with all things Nike, be sure to follow @teamnike and hit us up there for whatever you might need.", "@aaronclarkcodes Thanks for the heads up, Aaron. We'll pass this info to our team.", "@jay_brzy Hey Canis, doesn't look like we have this exact one, but don't let that spoil your birthday.\n\nhttps://t.co/NKp8sUqACA", "@bamardis That Tiger Woods \"Frank\" hat is finally in stock, Andrew.\n\nhttps://t.co/AxUbu8YMqX", "@timothyrood We didn't forget about ya. 🐯🧢\n\nhttps://t.co/tolZl5Yyv6", "@13AHill Need granted? 🐯🧢\n\nhttps://t.co/zz4Y3UmNlP", "@ATXSunDevil We got you, Seth. The Frank hat just stocked for NikePlus members below.\n\nhttps://t.co/6cfCPOCNNV", "@shaneodeezy An update on that merch. 🐯🧢\n\nhttps://t.co/u9ie1eECvl", "@ImDaSh_t Dropped 'em. 🐯🧢\n\nhttps://t.co/juit4Yu6HK", "@nicolecbo You got it. 🐯🧢\n\nhttps://t.co/ksAcqfEPui", "@TJSarrell Since you asked nicely. 🐯🧢\n\nhttps://t.co/8A2qrMf0fC", "@TJThiel For sale. 🐯🧢\n\nhttps://t.co/HopQ5AgIBO", "@TCRBrad For the rest of us. 🐯🧢\n\nhttps://t.co/RFpfAdqW3B", "@himynameisbrew We heard you loud and clear. 🐯🧢\n\nhttps://t.co/WD97fwDdBq", "@Ego_Icarus Hola Julian, encantados de ayudarte. ¿Podrías enviar un mensaje privado especificando tu correo electrónico registrado con nosotros?. Comprobaremos todo en nuestro sistema y ayudaremos en todo lo posible. Te esperamos https://t.co/klmMF0Q8Tn", "@kenmorepaladino 👀 \n\nhttps://t.co/InzsvhFMqB", "@abjectboy Rain or no rain, all we see is greatness! 🏃💨", "@blacknoy_ https://t.co/Yqhzla6Ek5", "@Lexeye Woo! 🧽", "@CVegas23 Hey Cee, the Shox BB4 have been delayed with no word on a new release date. Keep it locked to https://t.co/yYv8xSbp4x for updates.", "@AE9941 The competition is no match for your consistency. Way to get after it! 🏃💨", "@yoAloisius Can't have him stealing our secrets. 🤫", "@DefVelle Pushing through isn't easy, but rewarding yourself is. 🙌 https://t.co/5OAvoIoyBF", "@AboyRafael Bravísimo Rafael, tiempazo Nike!! ¿Buscamos bajar de 6,01 a 5,59 en la siguiente salida? 👊😉.", "@jacepohl Help is here. To kick things off, could you let us know where you're located and which size you're after?", "@SpartyBlood We know you want one too. https://t.co/kUHLrd4sT2", "@ShAnNoN0211 Apologies for any confusion, but that is not affiliated with Nike.", "@siyendwandwe1 Indeed, that is our official website. Shop our entire lineup of NFL jerseys below.\nhttps://t.co/KQzXQRsAMD", "@SAkqj Send us a pic when you cross the finish line. 🏁 \n\nhttps://t.co/dsAWNDeqy9", "@lildonjai Apologies for any confusion, but that promotion is not affiliated with Nike.", "@blackdollincc1 That promotion is not affiliated with Nike. Apologies for any confusion."]}